{
    "PageTitle": "origin",
    "FuncDef": "This command configures a match criteria for theoriginattribute. Originally, theoriginattribute was applicable only to BGP as a mandatory well-known BGP attribute.",
    "CLIs": [
        "origin { igp | egp | incomplete | any | aaa | dynamic | static | bonding }",
        "no origin"
    ],
    "ParentView": [
        "config>router>policy-options>policy-statement>entry>from"
    ],
    "ParaDef": [
        {
            "Parameters": "igp",
            "Info": "Configures matching path information originating within the local AS."
        },
        {
            "Parameters": "egp",
            "Info": "Configures matching path information originating in another AS."
        },
        {
            "Parameters": "incomplete",
            "Info": "Configures matching path information learned by another method."
        },
        {
            "Parameters": "any",
            "Info": "Specifies to ignore this criteria."
        },
        {
            "Parameters": "aaa",
            "Info": "Specifies to use the subscriber host address originated from AAA. Values-IPv4 - subscriber-management  /32 host routes that are originated from the RADIUS framed-ip-address VSA other than 255.255.255.254. The 255.255.255.254 returned by the RADIUS indicates that the BNG (NAS) should assign an IP address from its own pool.."
        },
        {
            "Parameters": "dynamic",
            "Info": "Specifies to use the subscriber host address originated from DHCP, DHCPv6, or the local address server. Values-IPv4 - subscriber-management /32 host routes that originate from the DHCP server (local or remote) or RADIUS framed-ip-address=255.255.255.254 (RFC 2865).."
        },
        {
            "Parameters": "static",
            "Info": "Specifies to use the subscriber host address originated from the local user database. Values-IPv4 - subscriber-management /32 host routes that are originated from the LUDB. This should also cover the RADIUS fallback category (RADIUS falls back to system defaults or to the LUDB).."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: no origin"
}