{
    "PageTitle": "add",
    "FuncDef": "This command is used to increase the measured rate of the policer or queue associated with the policy. The offered rate (capped by the administrative PIR configured on the queue or policer) is usually used unaltered by the parent virtual scheduler. The add command allows this measured rate to be increased by the specified amount or by a percentage of the administrative PIR. The resulting rate will not exceed the administrative PIR.",
    "CLIs": [
        "add percent <percentage> [ min-only ] [ active-min-only ]",
        "add rate <rate> [ min-only ] [ active-min-only ]",
        "no add"
    ],
    "ParentView": [
        "config>qos>adv-config-policy>child-control>offered-measurement"
    ],
    "ParaDef": [
        {
            "Parameters": "percent-of-admin-pir",
            "Info": "When the percent qualifier is used, this parameter specifies the percentage of the child s administrative PIR that should be added to the child s offered rate. The new offered rate result is capped by the child s PIR. If a value of 0 or 0.00 is used, the system interprets this equivalent to no add. Values-1.00 to 100.00."
        },
        {
            "Parameters": "rate-in-kilobits-per-second",
            "Info": "When the rate qualifier is used, this parameter specifies an explicit rate, in kb/s, that should be added to the child s offered rate. The new offered rate result is capped by the child s PIR. If a rate increase of 0 is specified, the system interprets this equivalent to no add. Values-0 to 100,000,000."
        },
        {
            "Parameters": "min-only",
            "Info": "This optional parameter is used to reinterpret the increase as a minimum offered rate. When this option is enabled, the system uses the specified increase as a minimum offered rate even for inactive queues or policers associated with the policy."
        },
        {
            "Parameters": "active-min-only",
            "Info": "When this optional parameter is specified, the respective rate or percentage is treated as the minimum offered rate for a queue only when the queue has an actual non-zero offered rate. This is intended to limit the artificial increase in offered rate to queues that are currently active. When a queue s measured offered rate drops to zero, the system stops enforcing the minimum value."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}