{
    "PageTitle": "clock source cesacr synchronization",
    "FuncDef": "The clock source cesacr synchronization command configures clock source synchronization for the CES ACR clock recovery domain.\nThe undo clock source cesacr synchronization command deletes configured clock source synchronization from the CES ACR clock recovery domain.\nBy default, no clock source synchronization is configured for the CES ACR clock recovery domain.",
    "CLIs": [
        "clock source cesacr slot <slotid> card <cardid> recovery-domain <domain-value> synchronization enable",
        "undo clock source cesacr slot <slotid> card <cardid> recovery-domain <domain-value> synchronization enable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "card cardid",
            "Info": "Subcard ID.\nThe value is an integer ranging from 0 to 4294967295."
        },
        {
            "Parameters": "recovery-domain domain-value",
            "Info": "Number of the clock recovery domain from which a clock source is extracted.\nThe value is an integer ranging from 1 to 8.\nThe value ranges from 1 to 4 of the 16 E1 subcard.The value of the former 16 interfaces of the 32 E1 subcard ranges from 1 to 4, and of the latter 16 interfaces ranges from 5 to 8."
        },
        {
            "Parameters": "enable",
            "Info": "Enable ptp function.\n-"
        },
        {
            "Parameters": "slot slotid",
            "Info": "Slot ID of a board.\nThe value is a string of 1 to 16, not case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] controller e1 1/0/0",
            "[*HUAWEI] e1 2 set clock recovery-domain 1",
            "[~HUAWEI] commit",
            "[~HUAWEI] clock source cesacr slot 0 card 1 recovery-domain 1 synchronization enable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] controller cpos 1/0/0",
            "[*HUAWEI] clock recovery-domain 1",
            "[~HUAWEI] commit",
            "[~HUAWEI] clock source cesacr slot 1 card 1 recovery-domain 1 synchronization enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe clock source cesacr synchronization command configures the clock source of a CES ACR recovery domain to participate in system clock source selection.\nPrerequisites\nBefore configuring clock source synchronization for the CES ACR clock recovery domain, you must configure the clock recovery domain for an E1 or a CPOS interface, and specify the configured domain as the system reference clock source.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}