{
    "PageTitle": "clock source cesacr ssm",
    "FuncDef": "The clock source cesacr ssm command configures an SSM level for a CES ACR clock source.\nThe undo clock source cesacr ssm command restores the SSM level for a CES ACR source.\nBy default, the SSM level is not used for clock synchronization.",
    "CLIs": [
        "clock source cesacr slot <slotid> card <cardid> recovery-domain <domain-value> ssm { prc | ssua | ssub | sec | dnu | unk }",
        "undo clock source cesacr slot <slotid> card <cardid> recovery-domain <domain-value> ssm"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "card cardid",
            "Info": "Specifies a subcard ID.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "recovery-domain domain-value",
            "Info": "Specifies the number of the clock recovery domain from which a clock source is extracted.\nThe value is an integer ranging from 1 to 8.\nThe value ranges from 1 to 4 of the 16 E1 subcard.The value of the former 16 interfaces of the 32 E1 subcard ranges from 1 to 4, and of the latter 16 interfaces ranges from 5 to 8."
        },
        {
            "Parameters": "prc",
            "Info": "Indicates that the SSM level is PRC (G.811 clock signal).\n-"
        },
        {
            "Parameters": "ssua",
            "Info": "Indicates that the SSM level is SSUA (G.812 transit node clock signal).\n-"
        },
        {
            "Parameters": "ssub",
            "Info": "Indicates that the SSM level is SSUB (G.812 local node clock signal).\n-"
        },
        {
            "Parameters": "sec",
            "Info": "Indicates that the SSM level is SEC.\n-"
        },
        {
            "Parameters": "dnu",
            "Info": "Indicates that the SSM level is not used for clock synchronization.\n-"
        },
        {
            "Parameters": "unk",
            "Info": "Indicates that the SSM level is unknown clock synchronization quality.\n-"
        },
        {
            "Parameters": "slot slotid",
            "Info": "Specify slot id.\nThe value is a string of 1 to 16, not case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] clock source cesacr slot 1 card 1 recovery-domain 2 ssm prc"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA synchronization status message (SSM) transmits the quality level of timing signals on a synchronous timing link. Node clocks on a synchronization network parse the SSM to obtain the quality level of an upstream clock.\nPriorities of SSM levels: prc > ssua > ssub > sec > dnu\nPrerequisites\nBefore configuring clock source attributes for the CES ACR clock recovery domain, you must configure the clock recovery domain for an E1 or a CPOS interface, and specify the configured domain as the system reference clock source.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}