{
    "PageTitle": "clock source cesacr priority",
    "FuncDef": "The clock source cesacr priority command configures a priority for a CES ACR clock source.\nThe undo clock source cesacr priority command deletes a priority for a CES ACR clock source.\nThe default priority of a clock source is 0. That is, this clock source does not participate in clock source selection.",
    "CLIs": [
        "clock source cesacr slot <slotid> card <cardid> recovery-domain <doamin-value> priority <priority-value>",
        "undo clock source cesacr slot <slotid> card <cardid> recovery-domain <doamin-value> priority"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "card cardid",
            "Info": "Specifies a subcard ID.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "recovery-domain doamin-value",
            "Info": "Specifies the number of the clock recovery domain from which a clock source is extracted.\nThe value is an integer ranging from 1 to 8.\nThe value ranges from 1 to 4 of the 16 E1 subcard.The value of the former 16 interfaces of the 32 E1 subcard ranges from 1 to 4, and of the latter 16 interfaces ranges from 5 to 8."
        },
        {
            "Parameters": "priority priority-value",
            "Info": "Priority of a clock source.\nThe value is an integer ranging from 1 to 255. A smaller value indicates a higher priority."
        },
        {
            "Parameters": "slot slotid",
            "Info": "Specify slot id.\nThe value is a string of 1 to 16, not case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] clock source cesacr slot 1 card 1 recovery-domain 2 priority 15"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe default priority of a clock source is 0. That is, this clock source does not participate in clock source selection. To enable this clock source to participate in clock source selection, configure a priority for this clock source.\nPrerequisites\nBefore configuring clock source attributes for the CES ACR clock recovery domain, you must configure the clock recovery domain for an E1 or a CPOS interface, and specify the configured domain as the system reference clock source. In addition, the CES ACR clock source can be locked.\nPrecautions\nThis command is supported only on the admin VS.\nIf SSM levels are not configured to participate in clock source selection, the NE40E selects a clock source based on the priorities of clock sources.\nIf SSM levels are configured to participate in clock source selection, the NE40E preferentially selects a clock source based on the SSM levels. If multiple clock sources have the same highest SSM level, the NE40E selects a clock source based on the priorities of these clock sources."
}