{
    "PageTitle": "clock source cesacr clock-id",
    "FuncDef": "The clock source cesacr clock-id command configures a clock ID for a CES ACR clock source.\nThe undo clock source cesacr clock-id command restores the clock ID for a CES ACR clock source.\nBy default, the clock ID is 0.",
    "CLIs": [
        "clock source cesacr slot <slotid> card <cardid> recovery-domain <domain-value> clock-id <clockid-value>",
        "undo clock source cesacr slot <slotid> card <cardid> recovery-domain <domain-value> clock-id"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "card cardid",
            "Info": "Specifies a subcard ID.\nThe value is an integer ranging from 0 to 4294967295."
        },
        {
            "Parameters": "recovery-domain domain-value",
            "Info": "Specifies the number of the clock recovery domain from which a clock source is extracted.\nThe value is an integer ranging from 1 to 8.\nThe value ranges from 1 to 4 of the 16 E1 subcard.The value of the former 16 interfaces of the 32 E1 subcard ranges from 1 to 4, and of the latter 16 interfaces ranges from 5 to 8."
        },
        {
            "Parameters": "clock-id clockid-value",
            "Info": "Clock ID of a clock source.\nThe value is an integer ranging from 1 to 15."
        },
        {
            "Parameters": "slot slotid",
            "Info": "Specify slot id.\nThe value is a string of 1 to 16, not case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] clock source cesacr slot 1 card 1 recovery-domain 2 clock-id 10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe default clock ID is 0. If you have enabled the extended SSM function for a clock source, this clock source cannot participate in clock source selection.\nTo enable clock IDs to participate in clock source selection, configure clock IDs for a clock sources. The participation of clock IDs prevents clock loops.\nPrerequisites\nBefore configuring clock source attributes for the CES ACR clock recovery domain, you must configure the clock recovery domain for an E1 or a CPOS interface, and specify the configured domain as the system reference clock source.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}