{
    "PageTitle": "display clock cesacr",
    "FuncDef": "The display clock cesacr command displays the attributes, status, and configurations of a CES ACR clock reference source.",
    "CLIs": [
        "display clock source cesacr slot <slotid> card <cardid> recovery-domain <domain-value>"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "card cardid",
            "Info": "Specifies a subcard ID.\nThe value is an integer ranging from 0 to 4294967295."
        },
        {
            "Parameters": "recovery-domain domain-value",
            "Info": "Specifies the number of the clock recovery domain from which a clock source is extracted.\nThe value is an integer ranging from 1 to 8.\nThe value ranges from 1 to 4 of the 16 E1 subcard.The value of the former 16 interfaces of the 32 E1 subcard ranges from 1 to 4, and of the latter 16 interfaces ranges from 5 to 8."
        },
        {
            "Parameters": "source",
            "Info": "Displays the attributes of all clock sources.\n-"
        },
        {
            "Parameters": "slot slotid",
            "Info": "Specify slot id.\nThe value is a string of 1 to 16, not case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display clock source cesacr slot 1 card 1 recovery-domain 2",
            "Pri(sys) :1                                               ",
            "  SSM Configure/learning :--/dnu                                                ",
            "  ClockId Configure/learning :0/0                                               ",
            "  State :abnormal                             ",
            "  Bundle:"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe attributes of a CES ACR clock reference source include the priority, SSM level, reference source status, and bundling group. To query attributes or configurations of a CES ACR clock reference clock, run the display clock cesacr command.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}