{
    "PageTitle": "display tunnel-policy",
    "FuncDef": "The display tunnel-policy command displays tunnel policy configurations. If tunnel-policy-name is specified, information about the specified tunnel policy is displayed. If tunnel-policy-name is not specified, information about all tunnel policies is displayed.",
    "CLIs": [
        "display tunnel-policy [ <tunnel-policy-name> ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "tunnel-policy-name",
            "Info": "Specifies the name of a tunnel policy. tunnel-policy-name is specified in the tunnel-policy command.\nThe value is a string of 1 to 39 case-sensitive characters, spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display tunnel-policy",
            "Total   tunnel policy num:              4   (IPv6:2)",
            "Sel-Seq tunnel policy num:              2   (IPv6:1)",
            "Binding tunnel policy num:              0   (IPv6:0)",
            "Invalid tunnel policy num:              2   (IPv6:1)",
            "Tunnel Policy Name                      Select-Seq                              Load balance No  Unmix",
            "-------------------------------------------------------------------------------------------------------",
            "tp3                                     SRV6TEPOLICY                                          3  Disable",
            "tp4                                     SRTEPOLICY LDP                                        3   Enable",
            "Invalid Tunnel Policy Name               Family",
            "-----------------------------------------------------------------------------------------",
            "tp3                                      IPv4            tp4                                      IPv6"
        ],
        [
            "<HUAWEI> display tunnel-policy",
            "Total   tunnel policy num:              2   ",
            "Sel-Seq tunnel policy num:              1   ",
            "Binding tunnel policy num:              0   ",
            "Invalid tunnel policy num:              1   ",
            "",
            "Tunnel Policy Name                      Select-Seq                              Load balance No  Unmix",
            "-------------------------------------------------------------------------------------------------------",
            "tp1                                     LDP SRTE                                              3  Disable",
            "",
            "Invalid Tunnel Policy Name               Family",
            "-----------------------------------------------------------------------------------------",
            "tp1                                      IPv6"
        ],
        [
            "<HUAWEI> display tunnel-policy",
            "Total   tunnel policy num:              2   (IPv6:1)",
            "Sel-Seq tunnel policy num:              2   (IPv6:1)",
            "Binding tunnel policy num:              0   (IPv6:0)",
            "Invalid tunnel policy num:              0   (IPv6:0)",
            "",
            "Tunnel Policy Name                      Select-Seq                              Load balance No  Unmix",
            "-------------------------------------------------------------------------------------------------------",
            "tp1                                     LDP SRTE                                              3  Disable",
            "tp1                                     SRV6TEPOLICY                                          1  Disable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, a VPN instance selects tunnels based on the default tunnel policy, that is, preferentially selecting LSPs without performing load balancing. If you do not want to use the default tunnel policy, run the tunnel-policy command to create a new one. After configuring a tunnel policy, you can run the display tunnel-policy command to confirm the configuration. Before applying a tunnel policy, you can run the display tunnel-policy command to view information about the specified tunnel policy.\nIf you already know the name of a tunnel policy, you can set the tunnel-policy-name parameter in the display tunnel-policy command to check information about the tunnel policy. If you do not set the tunnel-policy-name parameter, information about all tunnel policies is displayed.\nThe display tunnel-policy command displays the numbers of different types of tunnel policies. Tunnel policies are classified into the following types:\nTunnel type prioritizing policy: It specifies the sequence in which different types of tunnels are selected and the number of tunnels taking part in load balancing. The number of this type of tunnel policy is displayed in the Sel-Seq tunnel policy num field.Tunnel binding policy: It binds a tunnel to a destination address so that the VPN traffic bound for the destination address enters only the bound tunnel and QoS can be guaranteed for the VPN traffic. The number of this type of tunnel policy is displayed in the Binding tunnel policy num field."
}