{
    "PageTitle": "if-match ip-prefix (tunnel-selector view)",
    "FuncDef": "The if-match ip-prefix command configures a tunnel selector to use an IP prefix list as a route filtering rule.\nThe undo if-match ip-prefix command restores the default configuration.\nBy default, a tunnel selector does not use any IP prefix list as a route filtering rule.",
    "CLIs": [
        "if-match ip-prefix <ip-prefix-name>",
        "undo if-match ip-prefix <ip-prefix-name>"
    ],
    "ParentView": [
        "Tunnel-selector view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-prefix ip-prefix-name",
            "Info": "Specifies the name of an IP prefix list.\nThe name is a string of 1 to 169 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip ip-prefix p1 permit 1.1.1.1 24",
            "[*HUAWEI] tunnel-selector policy permit node 10",
            "[*HUAWEI-tunnel-selector] if-match ip-prefix p1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo enable a device to match routes against a specified IP prefix list and determine whether to permit or deny the routes based on matching results, run the if-match ip-prefix command to configure a tunnel selector to use the IP prefix list as a route filtering rule.\nThe if-match ip-prefix command must be used with the ip ip-prefix command. For example:\nIf the if-match ip-prefix aa command is configured but the ip ip-prefix aa command is not configured, all routes will be permitted.If the if-match ip-prefix aa and ip ip-prefix aa permit 1.1.1.1 32 commands are both configured, BGP routes with IP prefix 1.1.1.1/32 will be permitted.\n\nPrerequisites\nA tunnel selector has been configured using the tunnel-selector command.\nConfiguration Impact\nRoutes are filtered by IP prefix. Only routes matching the specified IP prefix list are permitted."
}