{
    "PageTitle": "if-match ip next-hop acl (tunnel-selector view)",
    "FuncDef": "The if-match ip next-hop acl command configures a rule for matching routes based on the next hop for a tunnel selector.\nThe undo if-match ip next-hop acl command deletes the setting.\nBy default, route filtering based on the next hop is not configured.",
    "CLIs": [
        "if-match ip next-hop acl { <aclNum> | <aclName> }",
        "undo if-match ip next-hop acl { <aclNum> | <aclName> }"
    ],
    "ParentView": [
        "Tunnel-selector view"
    ],
    "ParaDef": [
        {
            "Parameters": "acl aclNum",
            "Info": "Specifies the ACL number.\nThe value is an integer ranging from 2000 to 2999."
        },
        {
            "Parameters": "acl aclName",
            "Info": "Specifies the ACL name.\nThe value is a string of 1 to 64 case-sensitive characters without spaces. The value must start with a letter (a to z or A to Z, case sensitive)."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl 2000",
            "[*HUAWEI-acl4-basic-2000] quit",
            "[*HUAWEI] tunnel-selector abc permit node 10",
            "[*HUAWEI-tunnel-selector] if-match ip next-hop acl 2000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe if-match ip next-hop acl command can be run in the tunnel-selector view in the following scenarios:\nThe ASBR in inter-AS VPN Option B networking needs to apply a tunnel policy to VPNv4 routes. For example, the ASBR needs to have the VPNv4 routes recurse to MPLS TE tunnels.A PE in inter-AS VPN Option C networking needs to apply a tunnel policy to labeled BGP-IPv4 routes. For example, the PE needs to have the labeled BGP-IPv4 routes recurse to MPLS TE tunnels.\nThe if-match ip next-hop command is used to apply a tunnel policy to the VPNv4 or BGP-IPv4 labeled routes with a specified next hop, not all VPNv4 or BGP-IPv4 labeled routes.\nTo filter routes based on next hops, use either an ACL or IP prefix list using the if-match ip next-hop ip-prefix command.\n\nPrerequisites\nA tunnel selector has been created using the tunnel-selector command.\nAn ACL has been configured using the acl (basic ACL) command in the system view based on the next hops of routes.\nFollow-up Procedure\nRun the apply tunnel-policy command in the tunnel-selector view to apply a tunnel policy to the matched routes."
}