{
    "PageTitle": "if-match ipv6 next-hop prefix-list (Tunnel-selector view)",
    "FuncDef": "The if-match ipv6 next-hop prefix-list command configures a rule for matching routes based on the IPv6 next hop for a tunnel selector.\nThe undo if-match ipv6 next-hop prefix-list command deletes the setting.\nBy default, IPv6 route filtering based on the next hop is not configured.",
    "CLIs": [
        "if-match ipv6 next-hop prefix-list <ipv6-prefix-name>",
        "undo if-match ipv6 next-hop prefix-list <ipv6-prefix-name>"
    ],
    "ParentView": [
        "Tunnel-selector view"
    ],
    "ParaDef": [
        {
            "Parameters": "prefix-list ipv6-prefix-name",
            "Info": "Specifies the name of an IPv6 address prefix list.\nThe name is a string of 1 to 169 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip ipv6-prefix ipv6prefix permit ::0 32",
            "[*HUAWEI] tunnel-selector abc permit node 10",
            "[*HUAWEI-tunnel-selector] if-match ipv6 next-hop prefix-list ipv6prefix"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe if-match ipv6 next-hop prefix-list command can be run in the tunnel-selector view in the following scenarios:\nThe ASBR in inter-AS VPN Option B networking needs to apply a tunnel policy to VPNv6 routes. For example, the ASBR has the VPNv6 routes recurse to MPLS TE tunnels.A PE in inter-AS VPN Option C networking needs to apply a tunnel policy to labeled BGP-IPv6 routes. For example, the PE has the labeled BGP-IPv6 routes recurse to MPLS TE tunnels.\nThe if-match ip next-hop command is used to apply a tunnel policy to the VPNv6 or labeled BGP-IPv6 routes with a specified next hop, not all VPNv6 or labeled BGP-IPv6 routes.\n\nFollow-up Procedure\nRun the apply tunnel-policy command in the tunnel-selector view to apply a tunnel policy to the matched routes."
}