{
    "PageTitle": "if-match ip next-hop (tunnel-selector view)",
    "FuncDef": "The if-match ip next-hop command configures a rule for matching routes based on the next hop for a tunnel selector.\nThe undo if-match ip next-hop command deletes the setting.\nBy default, route filtering based on the next hop is not configured.",
    "CLIs": [
        "if-match ip next-hop ip-prefix <ip-prefix-name>",
        "undo if-match ip next-hop [ ip-prefix <ip-prefix-name> ]"
    ],
    "ParentView": [
        "Tunnel-selector view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-prefix ip-prefix-name",
            "Info": "Specifies the name of an IP address prefix list that is used for route filtering.\nThe name is a string of 1 to 169 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl 2000",
            "[*HUAWEI-acl4-basic-2000] quit",
            "[*HUAWEI] tunnel-selector abc permit node 10",
            "[*HUAWEI-tunnel-selector] if-match ip next-hop ip-prefix aa"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe if-match ip next-hop command can be run in the tunnel-selector view in the following scenarios:\nThe ASBR in inter-AS VPN Option B networking needs to apply a tunnel policy to VPNv4 routes. For example, the ASBR needs to have the VPNv4 routes recurse to MPLS TE tunnels.A PE in inter-AS VPN Option C networking needs to apply a tunnel policy to labeled BGP-IPv4 routes. For example, the PE needs to have the labeled BGP-IPv4 routes recurse to MPLS TE tunnels.\nThe if-match ip next-hop command is used to apply a tunnel policy to the VPNv4 or BGP-IPv4 labeled routes with a specified next hop, not all VPNv4 or BGP-IPv4 labeled routes.\nTo filter routes based on next hops, use either an ACL (using the if-match ip next-hop acl command) or IP prefix list.\n\nPrerequisites\nA tunnel selector has been created using the tunnel-selector command.\nAn IP prefix list has been configured using the ip ip-prefix command based on the next hops of routes.\nFollow-up Procedure\nRun the apply tunnel-policy command in the tunnel-selector view to apply a tunnel policy to the matched routes."
}