{
    "PageTitle": "tunnel-protocol",
    "FuncDef": "The tunnel-protocol command configures the tunnel mode on a tunnel interface.\nThe undo tunnel-protocol command restores the default setting.\nBy default, the initial tunnel mode none is used on a tunnel interface, indicating that no tunnel mode is configured. In practical applications, you must select another tunnel mode.",
    "CLIs": [
        "tunnel-protocol { mpls te | ipv6-ipv4 [ 6to4 | 6rd ] | gre [ ipv6 | p2mp ] | none | ipsec | ipv4-ipv6 }",
        "undo tunnel-protocol"
    ],
    "ParentView": [
        "Tunnel interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "mpls",
            "Info": "Indicates the CR-LSP mode.\n-"
        },
        {
            "Parameters": "te",
            "Info": "Indicates the CR-LSP mode.\n-"
        },
        {
            "Parameters": "ipv6-ipv4",
            "Info": "Indicates the IPv6 over IPv4 manual tunnel mode. An IPv6 over IPv4 manual tunnel offers the point-to-point service.\n-"
        },
        {
            "Parameters": "6to4",
            "Info": "Indicates the 6to4 tunnel mode. A 6to4 tunnel offers the point-to-multipoint service.\n-"
        },
        {
            "Parameters": "6rd",
            "Info": "Indicates the 6RD tunnel mode.\n-"
        },
        {
            "Parameters": "gre",
            "Info": "Indicates the GRE mode.\n-"
        },
        {
            "Parameters": "ipv6",
            "Info": "Indicates the IPv6 GRE mode.\n-"
        },
        {
            "Parameters": "p2mp",
            "Info": "Indicates the gre p2mp tunnel mode.\n-"
        },
        {
            "Parameters": "none",
            "Info": "Indicates that a tunnel interface is not configured with any tunnel mode. A tunnel in this mode is not operative. To use the tunnel interface, select another tunnel mode.\n-"
        },
        {
            "Parameters": "ipsec",
            "Info": "Configures IPsec as the encapsulation mode on the tunnel interface.\n-"
        },
        {
            "Parameters": "ipv4-ipv6",
            "Info": "Indicates the IPv4 over IPv6 manual tunnel mode.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] interface Tunnel 10",
            "[*HUAWEI-Tunnel10] tunnel-protocol mpls te"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Tunnel 10",
            "[*HUAWEI-Tunnel10] tunnel-protocol ipv6-ipv4"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Tunnel 10",
            "[*HUAWEI-Tunnel10] tunnel-protocol gre"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Tunnel 10",
            "[*HUAWEI-Tunnel10] tunnel-protocol ipv6-ipv4 6rd"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen configuring the GREIPv6 over IPv4, or CR-LSP tunnel, you need to create a tunnel interface, and then use the tunnel-protocol command to configure the tunnel mode on the tunnel interface.\nDetermine which tunnel mode to use based on the network topology and actual requirements:\nAn IPv6 over IPv4 manual tunnel is manually configured between the two border devices. The source and destination IPv4 addresses of the tunnel need to be statically specified. IPv6 over IPv4 manual tunnels can be used for communications between isolated IPv6 sites, or configured between a border device and a host. An IPv6 over IPv4 manual tunnel offers the point-to-point service.A 6to4 tunnel can connect multiple IPv6 isolated sites through an IPv4 network. Compared with an IPv6 over IPv4 manual tunnel, a 6to4 tunnel can be a point-to-multipoint connection, whereas an IPv6 over IPv4 manual tunnel is a P2P connection. Devices on both ends of a 6to4 tunnel are not configured in pairs.An IPv4 over IPv6 manual tunnel is a tunnel manually configured between two border routers. The source and destination IPv6 addresses of the tunnel need to be statically specified. A manual tunnel is used for communication between IPv4 networks and can also be configured between a border router and host. An IPv4 over IPv6 manual tunnel works in P2P mode.\n\nConfiguration Impact\nOnly one tunnel mode can be configured for a tunnel interface. If multiple tunnel modes are configured for a tunnel interface, the latest configuration takes effect.\nFollow-up Procedure\nAfter a tunnel mode is configured, set parameters for the tunnel. You need to run the source and destination commands to specify a source address and a destination address respectively for an IPv6 over IPv4 tunnel.\nPrecautions\nIn IPv6 over IPv4 manual tunnel mode, 6RD tunnel mode, and 6to4 tunnel mode, the VPN scenario is not supported."
}