{
    "PageTitle": "tunnel-policy",
    "FuncDef": "The tunnel-policy command creates a tunnel policy and displays the tunnel policy view.\nThe undo tunnel-policy command deletes the tunnel policy.\nBy default, no tunnel policy is configured. The tunnel management module searches for a tunnel based on the default tunnel policy. In the default tunnel policy, routes recurse only to LSPs without performing load balancing.",
    "CLIs": [
        "tunnel-policy <policy-name>",
        "undo tunnel-policy <policy-name>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "policy-name",
            "Info": "Specifies the name of a tunnel policy.\nThe value is a string of 1 to 39 case-sensitive characters, spaces not supported. The string can contain spaces if it is enclosed in double quotation marks (\")."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] tunnel-policy policy1",
            "[*HUAWEI-tunnel-policy-policy1]"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, a VPN instance selects tunnels based on the default tunnel policy, that is, preferentially selecting LSPs without performing load balancing. If you want to make a change, run the tunnel-policy command to create a tunnel policy.\nTwo types of tunnel policies are available:\nTunnel type prioritizing policy: This policy specifies the sequence in which different types of tunnels are selected and the number of tunnels participating in load balancing.Tunnel binding policy: This policy binds a specified tunnel to a destination IP address, so that the tunnel carries only VPN services destined for this IP address.\nIn practical applications, configure either of the tunnel policies as required.\n\nConfiguration Impact\nA tunnel policy can be configured as either the tunnel type prioritizing policy or tunnel binding policy.\nFollow-up Procedure\nRun either of the following commands to perform further configuration on the created tunnel policy:\nTo configure the tunnel policy as a tunnel type prioritizing policy, run the tunnel select-seq command.To configure the tunnel policy as a tunnel binding policy, run the tunnel binding command.\nThe system can select tunnels for a VPN instance based on a tunnel policy only after the tunnel policy is applied to the VPN instance. The mode in which a tunnel policy is applied to a VPN instance varies according to the VPN type.\n\nPrecautions\nAfter a tunnel policy is configured, you need to configure the details about the tunnel policy. If no details are configured for the tunnel policy, the default tunnel policy configurations are adopted. That is, tunnels are selected for a VPN in the sequence of conventional LSPs, CR-LSPs, and Local_IfNet tunnels, and load balancing will not be performed.\nDeleting or changing a tunnel policy in use may interrupt VPN services, because the VPN services may fail to recurse to a tunnel.\nWhen LDP LSPs functioning as public network tunnels balance traffic, LDP LSPs automatically recurse to load-balancing LDP LSPs if the number of load-balancing tunnels in a configured tunnel policy does not take effect."
}