{
    "PageTitle": "display macsec statistics interface",
    "FuncDef": "The display macsec statistics interface command displays statistics about data packets protected by MACsec.",
    "CLIs": [
        "display macsec statistics interface { <interface-name> | <interface-type> <interface-number> }"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "interface-name",
            "Info": "Specifies an interface name.\n-"
        },
        {
            "Parameters": "interface-type",
            "Info": "Specifies an interface type.\n-"
        },
        {
            "Parameters": "interface-number",
            "Info": "Specifies an interface number.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display macsec statistics interface gigabitethernet 1/0/0",
            "Interface GigabitEthernet 1/0/0:",
            " Input:",
            "   Valid packets        : 11",
            "   Protected bytes      : 0",
            "   Decrypted bytes      : 3410",
            "   Errors:",
            "    Late packets         : 0",
            "    NotValid packets     : 0",
            "    BadTag packets       : 0",
            "    NoUsingSA packets    : 0",
            " Output:",
            "   Protected packets    : 0",
            "   Protected bytes      : 0",
            "   Encrypted packets    : 128",
            "   Encrypted bytes      : 9026"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo check statistics about data packets protected by MACsec, run the display macsec statistics interface command.\nPrecautions\nInterface-based statistics items include Protected bytes, Decrypted bytes, BadTag packets, Protected bytes, and Encrypted bytes.\nSecurity channel-based statistics items include Valid packets, Late packets, NotValid packets, NoUsingSA packets, Protected packets, and Encrypted packets.\nIf CKN and CAK are configured on a main interface, both interface-based and security channel-based statistics are correctly displayed. If CKN and CAK are configured on a sub-interface, only security channel-based statistics are correctly displayed, and statistics of other types are displayed as 0s.If CKN and CAK are not configured on a main interface but configured on its sub-interface, you can also run this command on the main interface to query MACsec statistics. In the command output, only interface-based statistics are correctly displayed, and statistics of other types are displayed as 0s.\nThe interface statistics are displayed only on the main interface. The displayed information is the sum of the statistics on the main interface and its sub-interfaces. The displayed information on the security channel of the main interface is the sum of the statistics on the main interface and its sub-interfaces. The displayed information on the security channel of a sub-interface is the statistics on the local interface."
}