{
    "PageTitle": "macsec mode",
    "FuncDef": "The macsec mode command configures the MACsec encryption mode.\nThe undo macsec mode command restores the default MACsec encryption mode.\nBy default, the MACsec encryption mode is normal.",
    "CLIs": [
        "macsec mode { normal | integrity-only }",
        "undo macsec mode { normal | integrity-only }"
    ],
    "ParentView": [
        "100GE interface view",
        "10G LAN interface view",
        "25GE interface view",
        "40GE interface view",
        "50GE interface view",
        "FlexE interface view",
        "Sub-interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "normal",
            "Info": "Implements both integrity check and data encryption.\n-"
        },
        {
            "Parameters": "integrity-only",
            "Info": "Implements only integrity check but not data encryption.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] macsec mode integrity-only"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen data packets sent by an interface are encrypted using MACsec, you can configure an encryption mode for the interface.\nnormal: implements both integrity check and data encryption.integrity-only: implements only integrity check but not data encryption.\nData encryption and integrity check are as follows:\nData encryption: The sender encrypts the data and transmits the data in ciphertext on the LAN link. The receiver decrypts the received encrypted data and then performs other processing.Integrity check: The receiver checks the integrity of received data to determine whether the data is tampered with. The sender calculates the Integrity Check Value (ICV) based on the data packet and encryption algorithm and adds it to the tail of the packet. After receiving the packet, the receiver calculates the ICV based on the data packet excluding the ICV field and the same encryption algorithm, and compares the obtained ICV with the ICV in the packet. If they are the same, the packet is considered complete and passes the check. Otherwise, the packet is discarded."
}