{
    "PageTitle": "macsec dot1q-in-clear",
    "FuncDef": "The macsec dot1q-in-clear command enables the MACsec Dot1q VLAN tag in the clear function.\nThe undo macsec dot1q-in-clear command disables the MACsec Dot1q VLAN tag in the clear function.\nThe macsec qinq-in-clear command enables the MACsec QinQ VLAN tag in the clear function.\nThe undo macsec qinq-in-clear command disables the MACsec QinQ VLAN tag in the clear function.\nBy default, the MACsec VLAN tag in the clear function is not enabled.",
    "CLIs": [
        "macsec { dot1q-in-clear | qinq-in-clear }",
        "undo macsec { dot1q-in-clear | qinq-in-clear }"
    ],
    "ParentView": [
        "EVC view of a 10GE interface",
        "EVC view of an Ethernet interface",
        "EVC view of a GE interface",
        "Sub-interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "dot1q-in-clear",
            "Info": "Indicates dot1q VLAN tag in the clear.\n-"
        },
        {
            "Parameters": "qinq-in-clear",
            "Info": "Indicates QinQ VLAN tag in the clear.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0.1",
            "[~HUAWEI-GigabitEthernet1/0/0.1] vlan-type dot1q 10",
            "[*HUAWEI-GigabitEthernet1/0/0.1] macsec dot1q-in-clear"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe MACsec VLAN tag in the clear function allows MACsec not to encrypt VLAN tags. The hub site router uses a Layer 3 (IP) sub-interface of each VLAN that is associated with each remote site branch. The result is a highly flexible MACsec hub/spoke design that eliminates the older solutions that require a physical interface \"per remote site\" on the hub router. By default, MACsec encrypts VLAN tags in the original packets. To enable the MACsec VLAN tag in the clear function, run the macsec { dot1q-in-clear | qinq-in-clear } command.\nPrerequisites\nCKN and CAK have been configured using the mka cak-mode static ckn cak { simple | cipher } command."
}