{
    "PageTitle": "mka cak-mode static ckn",
    "FuncDef": "The mka cak-mode static ckn command configures the static CKN and CAK.\nThe undo mka cak-mode static ckn command deletes the configured static CKN and CAK.\nBy default, the static CKN and CAK are not configured.",
    "CLIs": [
        "mka cak-mode static ckn <ckn> cak { simple <cak-simple> | cipher <cak-cipher> }",
        "undo mka cak-mode static ckn [ ckn ] cak [ simple <cak-simple> | cipher ]"
    ],
    "ParentView": [
        "100GE interface view",
        "10G LAN interface view",
        "25GE interface view",
        "40GE interface view",
        "50GE interface view",
        "FlexE interface view",
        "Sub-interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "ckn ckn",
            "Info": "Specifies the name of a secure connectivity association key.\nThe value is a hexadecimal string that contains an even number of 2-64. It contains a combination of 0-9 and A-F and contains at least one digit and one letter. The letters are case insensitive."
        },
        {
            "Parameters": "simple cak-simple",
            "Info": "Specifies a secure connectivity association key in plaintext.\nIf you configure a simple password, it will be saved in the configuration file in simple text that has a high security risk. Therefore, configuring a ciphertext password is recommended.\nThe value is a string of 32 characters in hexadecimal notation. It contains a combination of 0-9 and A-F and contains at least one digit and one letter. The letters are case insensitive and must be different from ckn."
        },
        {
            "Parameters": "cipher cak-cipher",
            "Info": "Specifies a secure connectivity association key in ciphertext.\nThe value is a string of 32 characters in hexadecimal notation. It contains a combination of 0-9 and A-F and contains at least one digit and one letter. The letters are case insensitive and must be different from ckn."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] mka cak-mode static ckn 0123456789abcdef987654321fbcad9632587410abcdef7412589630fedabc53 cak cipher 9af0131568d4567cae202d34789ebcaf"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe key used by MACsec to encrypt and decrypt data packets is generated and distributed by the key server based on the encryption algorithm in the MKA protocol and the configured static CAK. Therefore, you need to configure the CKN and corresponding CAK on the interface."
}