{
    "PageTitle": "virtual-cluster-chassis locality",
    "FuncDef": "The virtual-cluster-chassis locality command enables trunk link localization in virtual cluster scenarios so that traffic from the network side is preferentially forwarded through a local trunk member interface.\nThe undo virtual-cluster-chassis locality command disables trunk link localization in virtual cluster scenarios so that traffic from the network side is load balanced among trunk links in the virtual cluster.\nBy default, trunk link localization is enabled in virtual cluster scenarios.",
    "CLIs": [
        "virtual-cluster-chassis locality",
        "undo virtual-cluster-chassis locality"
    ],
    "ParentView": [
        "Eth-Trunk interface view",
        "IP-Trunk interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Eth-Trunk 1",
            "[~HUAWEI-Eth-Trunk 1] virtual-cluster-chassis locality"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nDue to limited network construction costs and link deployment conditions, inter-chassis links in virtual cluster scenarios are used to protect against uplink and downlink faults. The bandwidth resources of the inter-chassis links are limited, and therefore unnecessary inter-chassis traffic must be reduced. In such a context, trunk link localization is introduced.\nWhen trunk link localization is enabled in virtual cluster scenarios and an inter-chassis trunk link exists between two devices, traffic from the network side is forwarded through a local trunk member interface in normal cases. The traffic is forwarded to the remote trunk member interface over the inter-chassis trunk link only when all local trunk member interfaces fail and a remote trunk member interface is available.\nPrerequisites\nVirtual cluster has been deployed, and trunk member interfaces have been created.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nThis command applies only to unicast scenarios."
}