{
    "PageTitle": "active port-hqos",
    "FuncDef": "The active port-hqos command activates the HQoS licenses.\nThe undo active port-hqos command deactivates the HQoS licenses.\nBy default, the HQoS licenses are not activated.",
    "CLIs": [
        "active port-hqos slot <slotid> card <cardid> port <port-list>",
        "undo active port-hqos slot <slotid> card <cardid> [ port <port-list> ]"
    ],
    "ParentView": [
        "License view"
    ],
    "ParaDef": [
        {
            "Parameters": "card cardid",
            "Info": "Specifies the ID.\nThe value is an integer that ranges from 0 to 4294967295."
        },
        {
            "Parameters": "port port-list",
            "Info": "Specifies a port list. The port lists can be separated using a comma (,) or hyphen (-).\nThe value is a string of 1 to 255 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "slot slotid",
            "Info": "Specifies the slot ID.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] license",
            "[*HUAWEI-license] active port-hqos slot 1 card 0 port 0-8"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, to activate the HQoS licenses, run the active port-hqos command. To deactivate the HQoS licenses, run the undo active port-hqos command. You can configure QoS profiles, user-queue only after activating HQoS licenses.\nThis command takes effect only for boards in CM mode.\nPrerequisites\nThe license file on the master main control board has been activated by running the license active command.Interface-specific scenario licenses have been activated.\nInterface-specific core&aggregation scenario licenses have been activated by running the active port-core-aggregation slot card port command.Interface-specific peering scenario licenses have been activated by running the active port-peering slot card port command.\n3.Interface-specific basic hardware licenses have been activated by running the active port-basic ommand."
}