{
    "PageTitle": "channel bandwidth quantity",
    "FuncDef": "The channel bandwidth quantity command configures the bandwidth granularity and quantity for a specific channel.\nThe undo qos channel-profile command cancels the configuration.\nBy default, the bandwidth granularity and quantity are not configured for a specific channel.",
    "CLIs": [
        "channel <channel-id> bandwidth <bandwidth-value> quantity <quantity-value>",
        "undo channel <channel-id> [ bandwidth <bandwidth-value> quantity <quantity-value> ]"
    ],
    "ParentView": [
        "Channel profile view"
    ],
    "ParaDef": [
        {
            "Parameters": "channel-id",
            "Info": "Channel ID.\nThe value is a string of 0 to 15 characters."
        },
        {
            "Parameters": "bandwidth-value",
            "Info": "Bandwidth granularity.\nThe value ranges from 1 to 100000, in kbit/s."
        },
        {
            "Parameters": "quantity-value",
            "Info": "Bandwidth quantity.\nThe value ranges from 1 to 16000."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] qos channel-profile a",
            "[~HUAWEI-channel-profile-a] channel 0 bandwidth 16 quantity 1024"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe bandwidth of user queues comprises a series of discrete bandwidths. You can configure the bandwidth granularity and quantity for each discrete bandwidth so that bandwidth can be reasonably allocated to services on the live network. To configure the bandwidth granularity and quantity in a channel profile and apply the channel profile to interfaces, run the channel bandwidth quantity command.\nPrerequisites\nThe qos channel-profile command has been run in the system view to create a channel profile.\nPrecautions\nA newly created profile in which the bandwidth granularity and quantity are configured for all channels can be applied.\nThe total number of the bandwidth quantity configured for different channels cannot be larger than 48000.\nThe value of must be the multiple of 8.\nAfter the profile is applied, the bandwidth granularity and quantity cannot be modified."
}