{
    "PageTitle": "flow-queue",
    "FuncDef": "The flow-queue command creates a flow queue profile.\nThe undo flow-queue command deletes a flow queue profile.\nBy default, no flow queue profile is created.",
    "CLIs": [
        "flow-queue <flow-queue-name>",
        "flow-queue <flow-queue-name> priority-mode",
        "flow-queue <flow-queue-name> 4cos-mode",
        "flow-queue <flow-queue-name> 8cos-enhance-mode",
        "undo flow-queue <flow-queue-name> [ priority-mode ]",
        "undo flow-queue <flow-queue-name>",
        "undo flow-queue <flow-queue-name> 4cos-mode",
        "undo flow-queue <flow-queue-name> 8cos-enhance-mode"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "flow-queue-name",
            "Info": "Specifies the name of a flow queue profile.\nThe value is a string of 1 to 31 characters."
        },
        {
            "Parameters": "priority-mode",
            "Info": "Indicates the priority mode.\n-"
        },
        {
            "Parameters": "4cos-mode",
            "Info": "Specifies 4cos mode.\nIn VS mode, this parameter is supported only by the admin VS.\n-"
        },
        {
            "Parameters": "8cos-enhance-mode",
            "Info": "Specifies 8cos enhance mode.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] flow-queue test 4cos-mode"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] flow-queue test"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] flow-queue test2 priority-mode"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] flow-queue test 8cos-enhance-mode"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA flow queue profile is used to configure scheduling parameters for eight priority queues. You can configure a scheduling mode (PQ/WFQ/LPQ), CIR, shaping value, and drop policy (WRED) for the eight queues, scheduling service traffic with different priorities.\nA flow queue profile in 4-CoS mode allows you to configure scheduling parameters for four flow queues. Compared with the 8-CoS mode, the 4-CoS mode supports more user queue resources in a BRAS scenario.\nA flow queue profile in priority mode allows you to flexibly specify different scheduling priorities for eight queues.\nA flow queue profile in enhanced 8-CoS mode supports scheduling parameters for eight queues and allows you to flexibly specify different scheduling priorities for the eight queues.\nConfiguration Impact\nIf the specified flow-queue-name does not exist, the system creates a new flow queue to bind the parameters of the eight flow queues in the profile.\nIf the flow-queue-name exists, the system enters the flow queue view and then you can modify the parameters of the flow queue.\nPrecautions\nA maximum of 2048 flow queue profiles can be created in the system. A flow queue profile referenced by a user queue cannot be deleted.\nA flow queue profile in 4-CoS mode does not support low-delay queues, packet loss rate simulation, or share shaping, and supports only BRAS services (except home user access).\nA maximum of 2048 flow queue profiles in 4-CoS mode can be created in the system. A flow queue profile referenced by a user queue cannot be deleted.\nWhen a flow queue profile in 4-CoS mode is created on a board that does not support the 4-CoS mode, the system automatically applies for flow queue resources in 8-CoS mode and uses the mapping configured in the flow queue profile in 4-CoS mode.\nOnly LPUI-52/LPUF-53/LPUI-242/LPUF-243/LPUI-242-CM/LPUI-242-G/LPUI-402/LPUI-402-CM/LPUF-483/LPUI-2T-L/LPUI-2T-CM/LPUF-1T2 boards support a flow queue profile in enhanced 8-CoS mode, which can be applied only to a QoS profile in enhanced 8-CoS mode."
}