{
    "PageTitle": "mode channel network-header-length adjustment enable",
    "FuncDef": "The mode channel network-header-length adjustment enable command configure the precision compensation function on channelized sub-interfaces.\nThe undo mode channel network-header-length adjustment enable command delete the precision compensation function on channelized sub-interfaces.\nBy default, the precision compensation function is not enabled on channelized sub-interfaces.",
    "CLIs": [
        "mode channel network-header-length <network-header-length-value> adjustment enable",
        "undo mode channel network-header-length <network-header-length-value> adjustment enable"
    ],
    "ParentView": [
        "100GE interface view",
        "10GE interface view",
        "25GE interface view",
        "40GE interface view",
        "50GE interface view",
        "50|100GE interface view",
        "Layer 2 GE interface view",
        "GE interface view",
        "GE electrical interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "network-header-length-value",
            "Info": "Specifies a precision compensation value.\nThe value is an integer ranging from 1 to 63, in bytes."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] mode channel network-header-length 30 adjustment enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe length of user packets varies according to the processing of the scheduling module, which affects the accuracy of traffic shaping. You can run the mode channel network-header-length adjustment enable command to adjust the precision compensation value. After this command is run on an interface, the device compensates the length of the packet of the channelized sub-interface on the interface, that is, the device compensates the length of the packet that passes through the channelized sub-interface.\nPrecautions\nThis command can be configured only on main interfaces that support channelized sub-interfaces.\nIf the qos default service-template command is run in the interface view to reference a service profile with a precision compensation value, and the mode channel network-header-length adjustment enable command is run to enable precision compensation for the interface with a specific precision compensation value, the precision compensation value configured in the mode channel network-header-length adjustment enable command takes precedence over the precision compensation value configured in the qos default service-template."
}