{
    "PageTitle": "priority cir-parent-priority",
    "FuncDef": "The priority cir-parent-priority command sets scheduling priorities for a user queue's parent scheduler with a specified priority in a user queue profile.\nThe undo priority cir-parent-priority command restores the default scheduling priorities for a user queue's parent scheduler with a specified priority in a user queue profile.\nBy default, the parent schedulers of the user queues with priorities 0 to 3 correspond to CIR priorities 0 to 3, and the corresponding PIR priorities are 3 in a user queue profile.",
    "CLIs": [
        "priority <priority> cir-parent-priority <cir-priority-value> pir-parent-priority <pir-priority-value>",
        "undo priority <priority> cir-parent-priority <cir-priority-value> pir-parent-priority <pir-priority-value>"
    ],
    "ParentView": [
        "User queue template"
    ],
    "ParaDef": [
        {
            "Parameters": "priority priority",
            "Info": "Specifies a priority for a user queue scheduler.\nThe value is an integer ranging from 0 to 3. A smaller value indicates a higher priority."
        },
        {
            "Parameters": "cir-parent-priority cir-priority-value",
            "Info": "Specifies a CIR traffic scheduling priority for the parent scheduler.\nThe value is an integer ranging from 0 to 3. A smaller value indicates a higher priority."
        },
        {
            "Parameters": "pir-parent-priority pir-priority-value",
            "Info": "Specifies a PIR traffic scheduling priority for the parent scheduler.\nThe value is an integer ranging from 0 to 3. A smaller value indicates a higher priority. A PIR traffic scheduling priority must be greater than or equal to a CIR traffic scheduling priority."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] user-queue test",
            "[*HUAWEI-user-queue-template-test] priority 0 cir-parent-priority 1 pir-parent-priority 2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA user queue profile is used to configure scheduling modes, priority, weights, shaping values, and precision compensation values for four user queue's parent schedulers, so that the user queue's parent schedulers can process traffic differently.\nTo set scheduling priorities for a user queue's parent scheduler with a specified priority, run the priority cir-parent-priority command."
}