{
    "PageTitle": "priority shaping",
    "FuncDef": "The priority shaping command sets shaping parameters for a GQ of a specific priority.\nThe undo priority shaping command cancels the configured shaping parameters and token bucket depth for a GQ of a specific priority.\nBy default, traffic shaping is not configured for a GQ.",
    "CLIs": [
        "[ priority <priority-value> ] shaping <shaping-value> [ pbs <pbs-value> ] outbound",
        "undo [ priority <priority-value> ] shaping outbound"
    ],
    "ParentView": [
        "Priority-mode GQ template view"
    ],
    "ParaDef": [
        {
            "Parameters": "priority-value",
            "Info": "Specifies the priority value. Rate limiting is implemented based on the priority value.\nThe value is an integer ranging from 0 to 2. The smaller the value, the higher the priority."
        },
        {
            "Parameters": "shaping-value",
            "Info": "Specifies the PIR value, which reflects the shaping bandwidth configured on an interface.\nThe value is an integer ranging from 66 to 4294967294, in kbit/s."
        },
        {
            "Parameters": "pbs pbs-value",
            "Info": "Specifies the volume of the allowed peak traffic on an interface after traffic shaping is configured on the interface. The value is equal to the PBS.\nThe value is an integer ranging from 64 to 2097152, in bytes."
        },
        {
            "Parameters": "outbound",
            "Info": "Indicates the scheduling parameters for outgoing packets.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] user-group-queue test priority-mode",
            "[*HUAWEI-user-group-queue-test] priority 2 shaping 600 pbs 10000 outbound"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo set shaping parameters for a GQ of a specific priority, run the priority shaping command.\nPrerequisites\nA priority-based GQ has been created by user-group-queue <group-name> priority-mode command."
}