{
    "PageTitle": "qos default service-template",
    "FuncDef": "The qos default service-template command applies a service profile to a channelized sub-interface.\nThe undo qos default service-template command removes a service profile from a channelized sub-interface.\nBy default, no service profile is applied to a channelized sub-interface.",
    "CLIs": [
        "qos default service-template <service-template-name> outbound",
        "undo qos default service-template [ <service-template-name> ] outbound"
    ],
    "ParentView": [
        "Sub-interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "service-template-name",
            "Info": "Specifies the name of a user-defined service profile.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "outbound",
            "Info": "Specifies the outbound direction of an interface.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] service-template test",
            "[*HUAWEI-service-template-test] quit",
            "[*HUAWEI] interface GigabitEthernet 1/0/0.1",
            "[*HUAWEI-GigabitEthernet1/0/0.1] vlan-type dot1q 1",
            "[*HUAWEI-GigabitEthernet1/0/0.1] mode channel enable",
            "[*HUAWEI-GigabitEthernet1/0/0.1] qos default service-template test outbound"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe length of a packet scheduled on the downstream TM is different from that of the packet sent to the link. To perform traffic shaping accurately, you must compensate the packet with a specific length. After running the command for compensating the packet length in the service profile, you can configure the qos default service-template command to apply the service profile to a channelized sub-interface. The precision adjustment function then can be implemented on the sub-interface.\nPrerequisites\nA service profile has been created.\nThe channelization function has been enabled using the mode channel enable command.\nPrecautions\nA channelized sub-interface supports only one service profile.\nTo apply a service profile associated with a slot ID to a physical interface, the slot ID associated with the service profile must be the same as the slot ID of the interface.\nEth-Trunk interfaces support only global service profiles."
}