{
    "PageTitle": "qos scheduling-mode",
    "FuncDef": "The qos scheduling-mode command specifies the scheduling mode of a board.\nBy default, the scheduling mode of a board is mode2",
    "CLIs": [
        "qos scheduling-mode { mode2 | mode3 } slot <slot-id>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "mode2",
            "Info": "Indicates scheduling mode 2.\n-"
        },
        {
            "Parameters": "mode3",
            "Info": "Indicates scheduling mode 3.\n-"
        },
        {
            "Parameters": "slot slot-id",
            "Info": "Specifies the slot number of an interface board.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] qos scheduling-mode mode3 slot 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nDifferent scheduling modes apply to different scenarios.\nIn scheduling mode 2, a resource pool can be specified for incoming or outgoing traffic.In scheduling mode 3, a resource pool can be specified for incoming or outgoing traffic. If the specified resource pool cannot provide sufficient resources, another resource pool is used. If the second resource pool cannot neither, no more resource pool is used.\n\nPrecautions\nWhen mode 3 is specified, resource pool sharing is supported only when SQID resources are insufficient. When bandwidth resources are insufficient, CAR is performed.\nWhen mode 3 is specified, if the SQs in two resource pools enter the same GQ, the GQ bandwidth is doubled and inter-user scheduling is inaccurate.\nAfter the bandwidth adjustment function is enabled, packet loss and slow increase occur when the bandwidth is increased. You are advised to disable the bandwidth adjustment function when mode 3 is used.\nAfter a switchover between modes, the new configuration takes effect only after the board is restarted.\nWhen GQ resources are requested on the L2TP LNS side, if mode 3 is specified, one GQ is allocated for upstream traffic, and another GQ is allocated for downstream traffic.\nThis command is supported only on the LPUI-51-L/LPUF-51/LPUF-101/LPUF-120/LPUF-240, but takes effect only on the LPUF-120/LPUF-240."
}