{
    "PageTitle": "qos deficit-unit",
    "FuncDef": "The qos deficit-unit command sets the module scheduling granularity.\nThe undo qos deficit-unit command cancels the configuration of module scheduling granularity.\nBy default,the chip scheduling granularity is not set.",
    "CLIs": [
        "qos deficit-unit { 1k | 2k }",
        "undo qos deficit-unit { 1k | 2k }"
    ],
    "ParentView": [
        "Eth-Trunk interface view",
        "GE interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "1k",
            "Info": "Sets the module scheduling granularity as 1k.\n-"
        },
        {
            "Parameters": "2k",
            "Info": "Sets the module scheduling granularity as 2k.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] qos deficit-unit 1k"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo set the module scheduling granularity to 1k or 2k bytes, run the qos deficit-unit command.\nPrecautions\nAfter this command is run on an empty trunk interface and a GE interface is added to a trunk interface, the undo qos deficit-unit command cannot be run on the trunk interface.\nAfter a GE interface is added to a trunk interface, this command cannot be configured on the GE interface.\nOnly the trunk interfaces that have no member interfaces support this command.\nAfter this command is configured on a GE interface, the GE interface cannot be added to any trunk interface.\nConfiguring scheduling granularity on an interface affects traffic forwarding on the interface for a short period of time.\nAdjusting the scheduling granularity of an interface affects the forwarding performance of the board. The performance deterioration ratio is related to the default scheduling granularity of the board. For example, if the default scheduling granularity of a board is 2K, the forwarding performance decreases by about 50% after the scheduling granularity is set to 1K. In addition, when the scheduling granularity is adjusted, traffic is interrupted for a short period of time.\nIf the qos-profile, user-queue, or bas command is configured on an interface, the qos deficit-unit command cannot be configured on the interface."
}