{
    "PageTitle": "qos queue-resource pool",
    "FuncDef": "The qos queue-resource pool command specifies a QoS resource pool for an interface.\nThe undo qos queue-resource pool command cancels the configuration.\nBy default, the ID of the resource pool for upstream traffic is 0, and the ID of the resource pool for downstream traffic is 1.",
    "CLIs": [
        "qos queue-resource pool <id> { inbound | outbound }",
        "undo qos queue-resource pool <id> { inbound | outbound }"
    ],
    "ParentView": [
        "Eth-Trunk interface view",
        "GE optical interface view",
        "GE electrical interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "id",
            "Info": "Specifies the index of a QoS resource pool.\nThe value is 0 or 1."
        },
        {
            "Parameters": "inbound",
            "Info": "Specifies the inbound direction of an interface.\n-"
        },
        {
            "Parameters": "outbound",
            "Info": "Specifies the outbound direction of an interface.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] qos queue-resource pool 1 inbound",
            "[*HUAWEI-GigabitEthernet1/0/0] qos queue-resource pool 0 outbound"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo enable upstream or downstream to fully use QoS resources, run the qos queue-resource pool command to enable an interface to specify different QoS resource pools for traffic.\nSQ resources on a single interface are not infinite and maybe insufficient on some interfaces. To enable incoming or outgoing traffic to fully use QoS resources, run the qos queue-resource pool command to allow the incoming or outgoing traffic on different interfaces to share an SQ resource pool.\nPrerequisites\nRun the command qos scheduling-mode mode2 to set the mode2 to be the scheduling mode before the command qos queue-resource pool is configured.\nPrecautions\nThis command is supported only on the admin VS.\nThe interface including its sub-interfaces is not allowed to house online users.\nThis command is only supported on the LPUI-21-L/LPUI-51-L/LPUF-51/LPUF-51-B/LPUI-51/LPUI-51-B/LPUI-51-S/LPUS-51/LPUF-101/LPUF-101-B/LPUI-101/LPUI-101-B/LPUS-101/LPUF-51-E/LPUI-51-E/LPUI-51-CM/LPUF-120/LPUF-120-B/LPUF-120-E/LPUI-102-E/LPUI-120/LPUI-120-B/LPUI-120-L/LPUI-52-E/LPUI-120-E/LPUI-120-CM/LPUF-240/LPUF-240-B/LPUF-240-E/LPUI-240/LPUI-240-B/LPUI-240-CM/LPUI-240-L boards."
}