{
    "PageTitle": "qos user-queue granularity",
    "FuncDef": "The qos user-queue granularity command configures the user-queue bandwidth granularity for users who go online from a specified domain.\nThe undo qos user-queue granularity command restores the default user-queue bandwidth granularity for users who go online from a specified domain.\nThe default mappings between bandwidth ranges and granularities are listed in the table in Usage Scenario.",
    "CLIs": [
        "qos user-queue granularity <granularity-value>",
        "undo qos user-queue granularity <granularity-value>"
    ],
    "ParentView": [
        "AAA domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "granularity-value",
            "Info": "Specifies a bandwidth granularity.\nThe value is an enumerated type and can be 1, 16, 32, 64, 128, 256, 512, or 1024, in kbit/s."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] domain test",
            "[~HUAWEI-aaa-domain-test] qos user-queue granularity 128"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo reduce user-queue bandwidth resource consumption on a device, default granularities are configured for different bandwidth ranges on the device, as shown in Table 1. For example, if the default granularity is 16 for the bandwidth range of 384-1024 kbit/s, traffic at the rate of 384-399 kbit/s must conform to 384 kbit/s, and traffic at the rate of 400-415 kbit/s must conform to 400 kbit/s.\nTo improve the rate limit precision, you can run the qos user-queue granularity command to configure the granularity for bandwidth ranges. The configured granularity takes effect as follows:\nIf the configured granularity is greater than the default granularity, the default granularity takes effect.If the configured granularity is smaller than the default granularity, the configured granularity takes effect.\nFor example, if the granularity is set to 64 using this command, the default granularity takes effect for the bandwidth of 0-4096, but the configured granularity 64 takes effect for the bandwidth of 4097-4294967295.\nTable1 Default mappings between bandwidth ranges and default granularities\n\nBandwidth Range (kbit/s)\n\nDefault Granularity (kbit/s)\n\n\n\n0-383\n\n1\n\n\n384-1024\n\n16\n\n\n1025-2048\n\n32\n\n\n2049-4096\n\n64\n\n\n4097-8192\n\n128\n\n\n8193-16384\n\n256\n\n\n16385-3276\n\n512\n\n\n32768-4294967295\n\n1024\n\n\n\n\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}