{
    "PageTitle": "qos tm-schedule traffic-statistics",
    "FuncDef": "The qos tm-schedule traffic-statistics command enables a device to collect packet statistics based on accuracy compensated lengths.\nThe undo qos tm-schedule traffic-statistics command disables a device from collecting packet statistics based on accuracy compensated lengths.\nBy default, a device is enabled to collect packet statistics based on accuracy compensated lengths.",
    "CLIs": [
        "qos tm-schedule traffic-statistics adjustment-packet slot <slot-id> card <card-id>",
        "undo qos tm-schedule traffic-statistics adjustment-packet slot <slot-id> card <card-id>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "card card-id",
            "Info": "Specifies a subcard ID.\nThe value is an integer ranging from 0 to 3."
        },
        {
            "Parameters": "adjustment-packet",
            "Info": "Based adjustment packet length for traffic statistics.\n-"
        },
        {
            "Parameters": "slot slot-id",
            "Info": "Specifies the slot ID of an interface board.\n-"
        },
        {
            "Parameters": "[undo]",
            "Info": "Cancel current configuration.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] qos tm-schedule traffic-statistics adjustment-packet slot 1 card 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOnly data in a packet is useful. Protocol encapsulation in the packet is link overload. Therefore, a device can be enabled to collect packet statistics based on accuracy compensated lengths, improving statistics accuracy. To enable this function, run the qos tm-schedule traffic-statistics command.\nFor the LPUF120-E/LPUF240-E, statistics are collected based on the packet length before precise compensation by default.\nThis function takes effect only in the per-packet accuracy compensation scenario, not in the fragment accuracy compensation scenario.\nIn VS mode, this command applies only to the admin VSand cannot be configured in other VSs. This command takes effect on all VSs."
}