{
    "PageTitle": "qos schedule-tree distribute-mode outbound",
    "FuncDef": "The qos schedule-tree distribute-mode outbound command configures weight-based bandwidth allocation for a trunk's member interfaces for HQoS scheduling.\nThe undo qos schedule-tree distribute-mode outbound command cancels weight-based bandwidth allocation for a trunk's member interfaces for HQoS scheduling.\nBy default, TM-based HQoS scheduling is implemented for traffic on a trunk interface.",
    "CLIs": [
        "qos schedule-tree distribute-mode outbound",
        "undo qos schedule-tree distribute-mode outbound"
    ],
    "ParentView": [
        "Layer 2 Eth-Trunk interface view",
        "Eth-Trunk interface view",
        "IP-Trunk interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface eth-trunk 1",
            "[~HUAWEI-Eth-Trunk1] qos schedule-tree distribute-mode outbound"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen traffic on a trunk interface is scheduled using HQoS based on the TM, if a trunk member interface is congested, traffic on other member interfaces is affected. To resolve this problem, run the qos schedule-tree distribute-mode outbound command to configure weight-based bandwidth allocation for a trunk's member interfaces for HQoS scheduling.\nPrecautions\nThis command is supported on the LPUF-480/LPUI-200/LPUF-200/LPUI-2T/LPUI-102-E/LPUI-120-E/LPUI-51-E/LPUI-52-E, the LPUF-240 equipped with a -E subcard, and the LPUF-102/LPUF-120/LPUF-120-B/LPUF-102-E/LPUF-120-E/LPUF-51-E equipped with a non-P51-E/non-P101-E subcard.\nIf member interfaces of a trunk interface reside on TM subcards of different types on the same board, this command cannot be configured on the trunk interface.\nThis command applies only to the Eth-Trunk that has no member interfaces. Interfaces can be added to the trunk interface only after this command is configured. The newly added member interfaces must reside on a board that supports this function. If this command has been configured and the Eth-Trunk has member interfaces, services will be interrupted during configuration rollback. After the configuration rollback is complete, services are automatically restored."
}