{
    "PageTitle": "qos rate-limit-mode",
    "FuncDef": "The qos rate-limit-mode command sets the mode of controlling upstream or downstream traffic of users in a domain.\nThe undo qos rate-limit-mode command restores the default configuration.\nBy default, if a QoS profile with both the car and user-queue configurations is applied to the AAA domain, the user-queue configuration takes effect on the outbound direction and the car configuration takes effect on the inbound direction.",
    "CLIs": [
        "qos rate-limit-mode { car | user-queue } { inbound | outbound }",
        "undo qos rate-limit-mode { inbound | outbound }"
    ],
    "ParentView": [
        "AAA domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "car",
            "Info": "Controls the traffic of common users according to the CAR parameters in the QoS profile.\n-"
        },
        {
            "Parameters": "user-queue",
            "Info": "Controls the traffic of common users according to the SQ parameters in the QoS profile.\n-"
        },
        {
            "Parameters": "inbound",
            "Info": "Controls the incoming traffic of users in a domain.\n-"
        },
        {
            "Parameters": "outbound",
            "Info": "Controls the outgoing traffic of users in a domain.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[*HUAWEI-aaa] domain huawei",
            "[*HUAWEI-aaa-domain-huawei] commit",
            "[~HUAWEI-aaa-domain-huawei] qos rate-limit-mode car inbound"
        ]
    ],
    "ExtraInfo": "When a QoS profile is applied in an AAA domain, if the QoS profile contains both the car and user-queue parameters, the system judges whether the qos rate-limit-mode command is configured in the domain.\nIf the qos rate-limit-mode car command is configured in the domain, the system performs traffic scheduling according to the CAR parameter in the QoS profile.If the qos rate-limit-mode user-queue command is configured in the domain, the system performs traffic scheduling according to the SQ parameter in the QoS profile.If qos rate-limit-mode is not configured, CAR parameters in the QoS profile are applied to upstream traffic by default.If qos rate-limit-mode is not configured, SQ parameters in the QoS profile are applied to downstream traffic by default."
}