{
    "PageTitle": "sub-port-queue outbound",
    "FuncDef": "The sub-port-queue outbound command applies a sub-interface queue profile to an interface.\nThe undo sub-port-queue outbound command deletes a sub-interface queue profile from an interface.\nBy default, no sub-interface queue profile is applied to an interface.",
    "CLIs": [
        "sub-port-queue <sub-port-queue-name> outbound [ group <group-name> ]",
        "undo sub-port-queue [ <sub-port-queue-name> ] outbound [ group <group-name> ]"
    ],
    "ParentView": [
        "Eth-Trunk sub-interface view",
        "Eth-Trunk interface view",
        "GE sub-interface view",
        "GE electrical interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "group group-name",
            "Info": "Specifies the name of a group to which scheduling queues are allocated.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "sub-port-queue sub-port-queue-name",
            "Info": "Specifies the name of a sub-interface queue.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] sub-port-queue aa",
            "[*HUAWEI-sub-port-queue-aa] commit",
            "[~HUAWEI-sub-port-queue-aa] quit",
            "[~HUAWEI] interface GigabitEthernet1/0/0.1",
            "[~HUAWEI-GigabitEthernet1/0/0.1] sub-port-queue aa outbound group g1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn HQoS, multiple user groups can access an interface or sub-interface. You can bind a sub-interface queue profile to the interface or sub-interface to allocate scheduling queues to these user groups.\nAs user services develop and user groups increase, the traffic rate of the upstream device may exceed the capability of the downstream device, causing bandwidth insufficiency and network congestion. To resolve this problem, apply a sub-interface queue profile created using the sub-port-queue command to modify the default sub-interface queue bandwidth for all user group queues.\nInter-sub-interface users with the same sub-interface queue profile name and group name share the same user scheduling queue.\nA group can be used for different sub-interface views, but not for sub-interfaces on different physical interfaces, to share a sub-interface queue."
}