{
    "PageTitle": "user-queue shaping bgp-local-ifnet-traffic outbound",
    "FuncDef": "The user-queue shaping bgp-local-ifnet-traffic outbound command enables the HQoS function for the traffic carried by a BGP local IFNET tunnel on an interface.\nThe undo user-queue shaping bgp-local-ifnet-traffic outbound command restores the default settings.\nBy default, the HQoS function is not enabled for the traffic carried by a BGP local IFNET tunnel on an interface.",
    "CLIs": [
        "user-queue shaping bgp-local-ifnet-traffic outbound",
        "undo user-queue shaping bgp-local-ifnet-traffic outbound"
    ],
    "ParentView": [
        "Eth-Trunk sub-interface view",
        "Eth-Trunk interface view",
        "GE sub-interface view",
        "IP-Trunk interface view",
        "MP-group interface view",
        "POS interface view",
        "XGE interface view",
        "FR interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0.1",
            "[~HUAWEI-GigabitEthernet1/0/0.1] user-queue shaping bgp-local-ifnet-traffic outbound"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter HQoS is configured on an interface, the applied SQ IDs are delivered to forwarding tables for rate limiting. The downstream boards equipped with non-eTM subcards need to traverse all service tokens on the interface to deliver the mappings between tokens and SQ IDs. Currently, only some service tokens are traversed by downstream boards, causing HQoS not to take effect for all traffic on the interface.\nAfter HQoS is configured on an outbound interface of a BGP local IFNET tunnel, if the outbound interface resides on a downstream board equipped with a non-eTM subcard, you need to run the user-queue shaping bgp-local-ifnet-traffic outbound command to allow HQoS to take effect.\nPrecautions\nIf the outbound interface is a high-speed interface, you need to additionally apply a QoS profile to the interface so that the HQoS function on the interfaces can take effect. This step is not required on a low-speed interface.\nIf both interface-based HQoS and L2VPN QoS are configured, only L2VPN QoS takes effect."
}