{
    "PageTitle": "user-queue (qos-profile-8cos-enhance-template)",
    "FuncDef": "The user-queue command binds a user queue profile, user group queue profile, or flow queue profile to a QoS profile in enhanced 8-CoS mode.\nThe undo user-queue command unbinds a user queue profile, user group queue profile, or flow queue profile from a QoS profile.\nBy default, no user queue profile, flow queue profile, or user group queue profile is bound to a QoS profile in enhanced 8-CoS mode.",
    "CLIs": [
        "user-queue <user-queue-name> [ flow-queue <flow-queue-name> ] [ user-group-queue <user-group-name> ] [ inbound | outbound ]",
        "undo user-queue <user-queue-name> [ flow-queue <flow-queue-name> ] [ user-group-queue <user-group-name> ] [ inbound | outbound ]"
    ],
    "ParentView": [
        "qos-profile-8cos-enhance-template"
    ],
    "ParaDef": [
        {
            "Parameters": "flow-queue flow-queue-name",
            "Info": "Specifies the name of a flow queue profile.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "user-group-queue user-group-name",
            "Info": "Specifies the name of a user group queue profile.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "inbound",
            "Info": "Binds a user queue profile to the inbound direction of a specified interface.\n-"
        },
        {
            "Parameters": "outbound",
            "Info": "Binds a user queue profile to the outbound direction of a specified interface.\n-"
        },
        {
            "Parameters": "user-queue user-queue-name",
            "Info": "Specifies the name of a user queue profile.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] flow-queue test",
            "[*HUAWEI-flow-queue-template-test] quit",
            "[*HUAWEI] user-group-queue test",
            "[*HUAWEI-user-group-queue-test] quit",
            "[*HUAWEI] user-queue test",
            "[*HUAWEI-user-queue-test] quit",
            "[*HUAWEI] qos-profile test 8cos-enhance-mode",
            "[*HUAWEI-qos-profile-test-8cos-enhance] user-queue test flow-queue test user-group-queue test"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn an HQoS application based on flow queues in enhanced 8-CoS mode, a QoS profile can be applied to an interface for QoS processing of service packets only after a flow queue, user queue, or user group queue in enhanced 8-CoS mode is bound to the QoS profile.\nIf inbound is specified, the QoS profile takes effect for incoming traffic.If outbound is specified, the QoS profile takes effect for outgoing traffic.If neither inbound nor outbound is specified, the QoS profile takes effect for both incoming and outgoing traffic.\n\nPrerequisites\nRun user-queue user-queue-name command, a user queue profile in enhanced 8-CoS mode has been created.Run user-group-queue group-name, a user group queue profile has been created.Run flow-queue flow-queue-name 8cos-enhance-mode, a flow queue profile in enhanced 8-CoS mode has been created.\nPrecautions\nWhen a flow queue profile is bound to a QoS profile in enhanced 8-queue mode, only the flow queue profile in enhanced 8-queue mode can be bound to the QoS profile."
}