{
    "PageTitle": "user-queue shaping ldp-traffic outbound",
    "FuncDef": "The user-queue shaping ldp-traffic outbound command enables HQoS to be effective for L3VPN, IP, VLL, VPLS and EVPN traffic on an interface.\nThe undo user-queue shaping ldp-traffic outbound command disables HQoS from being effective for L3VPN, IP, VLL, VPLS and EVPN traffic on an interface.\nBy default, the HQoS function does not take effect for L3VPN, IP, VLL, VPLS and EVPN traffic on an interface.",
    "CLIs": [
        "user-queue shaping ldp-traffic outbound",
        "undo user-queue shaping ldp-traffic outbound"
    ],
    "ParentView": [
        "Eth-Trunk sub-interface view",
        "Eth-Trunk interface view",
        "GE sub-interface view",
        "IP-Trunk interface view",
        "POS interface view",
        "Port extension Layer 2 interface view",
        "Port extension sub-interface view",
        "Port extension interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] user-queue shaping ldp-traffic outbound"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter HQoS is configured on an interface, the applied SQ IDs are delivered to forwarding tables for rate limiting. The downstream boards equipped with non-eTM subcards need to traverse all service tokens on the interface to deliver the mappings between tokens and SQ IDs. Currently, only some service tokens are traversed by downstream boards, causing HQoS not to take effect for all traffic on the interface.\nAfter HQoS is configured on an MPLS LDP public-network-side interface (not an MP-group or serial interface), if the outbound interface of traffic resides on a board equipped with a non-eTM subcard, this command is used to control whether HQoS takes effect for traffic.\nAfter the user-queue shaping ldp-traffic outbound command is configured, the HQoS function takes effect for the following traffic on the MPLS LDP network:\nIP OVER LDP LSPIP OVER BGP OVER LDP LSPL3VPN OVER LDP LSPL3VPN OVER BGP OVER LDP LSPVLL over LDP LSPVLL over BGP over LDP LSPVPLS over LDP LSPVPLS over BGP over LDP LSPEVPN over LDP LSP\nIf the user-queue shaping ldp-traffic outbound command is not configured, the HQoS function does not take effect for the following traffic on the MPLS LDP network:\nIP OVER LDP LSPIP OVER BGP OVER LDP LSPL3VPN OVER LDP LSPL3VPN OVER BGP OVER LDP LSPVLL over LDP LSPVLL over BGP over LDP LSPVPLS over LDP LSPVPLS over BGP over LDP LSPEVPN over LDP LSP"
}