{
    "PageTitle": "allocation",
    "FuncDef": "This command sizes the associated class-pool based on either the specifiedexplicit-percentpercent-of-parent-poolor based on the dynamic port bandwidth portioning mechanism. Setting an explicit percentage prevents the port-class pool from participating in the dynamic port level bandwidth based distribution of the mid-pool s size as the port bandwidth weight of the port-class pool becomes zero (0). Setting a port bandwidth weight causes the explicit percent value to become zero (0) disabling explicit sizing of the port-class pool.",
    "CLIs": [
        "allocation explicit-percent <percent-of-parent-pool>",
        "allocation port-bw-weight <pool-weight>",
        "no allocation"
    ],
    "ParentView": [
        "config>qos>hs-port-pool-policy>alt-port-class-pools>class-pool",
        "config>qos>hs-port-pool-policy>std-port-class-pools>class-pool"
    ],
    "ParaDef": [
        {
            "Parameters": "percent-of-parent-pool",
            "Info": "Specifies the percentage of parent pool being allocated. This parameter must be configured when specifying the explicit-percent. The percent-of-parent-pool value is expressed as a percentage with two decimal places (100th of a percent) that indicates that the port-class pool should be sized by applying the value to the parent mid-pool size. Specifying explicit-percent forces the port-bw-weight to a zero (0) value (disabled). Values-0.01 to 100.00."
        },
        {
            "Parameters": "pool-weight",
            "Info": "Specifies port bandwidth weight being allocated. The port-bw-weight and explicit-percent commands are mutually exclusive. The pool-weight parameter is required when specifying the port bandwidth weight and defines both that the port-class pool should be sized in the port bandwidth distribution of the mid-pool s size and what the distribution weight should be for the port-class pool compared to other port-class pools associated with the same mid-pool when competing for the port s distribution portion. Values-1 to 100."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: allocation 1"
}