{
    "PageTitle": "hs-scheduler-hierarchy",
    "FuncDef": "This command displays the egress HS scheduler hierarchy for the HS scheduler policy applied to the related port. The output includes the current maximum rate and each scheduling class rate on the port. The parameters allow for the current rates for the scheduling classes for all HS secondary shapers or a specific HS secondary shaper, or for the queue rates in a specified access or network queue group instance, SAP or subscriber to be included in the output.",
    "CLIs": [
        "hs-scheduler-hierarchy port <port-id> [ hs-secondary-shaper <shaper-name> ] [ interval <time-in-seconds> ]",
        "hs-scheduler-hierarchy port <port-id> [ interval <time-in-seconds> ] hs-secondary-shapers",
        "hs-scheduler-hierarchy port <port-id> [ interval <time-in-seconds> ] queue-group <queue-group-name> instance <instance-id> { access | network }",
        "hs-scheduler-hierarchy sap <sap-id> egress [ interval <time-in-seconds> ]",
        "hs-scheduler-hierarchy subscriber <sub-ident> egress [ interval <time-in-seconds> ]"
    ],
    "ParentView": [
        "show>qos"
    ],
    "ParaDef": [
        {
            "Parameters": "port-id",
            "Info": "Specifies the physical port ID in the slot/mda/port format."
        },
        {
            "Parameters": "shaper-name",
            "Info": "Displays information about the specified HS secondary name, up to 32 characters, and includes the scheduling class rates for the HS secondary shaper on the port."
        },
        {
            "Parameters": "time-in-seconds",
            "Info": "Displays the time interval used to calculate the rates, in seconds. Values-1 to 5."
        },
        {
            "Parameters": "hs-secondary-shapers",
            "Info": "Displays information about scheduling class rates for all HS secondary shapers on the port."
        },
        {
            "Parameters": "queue-group-name",
            "Info": "Displays information about the specified queue group name on the port, up to 32 characters."
        },
        {
            "Parameters": "instance-id",
            "Info": "Displays information about the specified queue group instance. Values-1 to 65535."
        },
        {
            "Parameters": "sap-id",
            "Info": "Displays information about the queue rates for the specified SAP, up to 64 characters, on the specified port."
        },
        {
            "Parameters": "sub-ident",
            "Info": "Displays information about the specified subscriber, up to 64 characters, on the specified port."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}