{
    "PageTitle": "queue",
    "FuncDef": "This command defines how the specified queue-id is attached to the scheduler. A queue may have one of four attachment states:",
    "CLIs": [
        "queue <queue-id> sched-class <class-id>",
        "queue <queue-id> unattached",
        "queue <queue-id> wrr-group <wrr-group-id>",
        "no queue <queue-id>"
    ],
    "ParentView": [
        "config>qos>hs-attachment-policy"
    ],
    "ParaDef": [
        {
            "Parameters": "queue-id",
            "Info": "Specifies the queue identifier for the HS attachment policy queue. This parameter is required when executing the command. Values-1 to 8."
        },
        {
            "Parameters": "sched-class",
            "Info": "Specifies a direct attachment between the queue-id and one of the six scheduling classes. A value of 1 through 6 must accompany the sched-class keyword representing the queue s attached scheduling class. The sched-class, group, and unattached keywords are mutually exclusive. One of the keywords must be specified when the queue attachment command is executed."
        },
        {
            "Parameters": "class-id",
            "Info": "Specifies the scheduling class that is associated with this queue-id. Values-1 to 6."
        },
        {
            "Parameters": "wrr-group",
            "Info": "Specifies the inclusion of the queue-id in either WRR group 1 or WRR group 2. A value of 1 or 2 must accompany the wrr-group keyword representing the queue s attached WRR group number. Queues placed in a WRR group must have contiguous queue IDs. The sched-class, group, and unattached keywords are mutually exclusive. One of the keywords must be specified when the queue attachment command is executed."
        },
        {
            "Parameters": "wrr-group-id",
            "Info": "Specifies the WRR group to which the queue-id is to be attached. Values-1, 2."
        },
        {
            "Parameters": "unattached",
            "Info": "Indicates that the queue-id is not attached to any scheduling class or WRR group. An unattached queue does not forward any packets. The sched-class, group, and unattached keywords are mutually exclusive. One of the keywords must be specified when the queue attachment command is executed."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: queue queue-id unattached"
}