{
    "PageTitle": "scheduling-class",
    "FuncDef": "This command configures the behavior of a specific scheduling class on all HSQ schedulers associated with the policy. Thescheduler-classcommand performs one of two operations: it configures a maximum rate for the scheduling class or places the scheduling class into the weighted scheduling group. The two operations are mutually exclusive.",
    "CLIs": [
        "scheduling-class <class-id> group <group-id> [ weight <weight-in-group> ]",
        "scheduling-class <class-id> rate <rate>",
        "no scheduling-class <class-id>"
    ],
    "ParentView": [
        "config>qos>hs-scheduler-policy"
    ],
    "ParaDef": [
        {
            "Parameters": "class-id",
            "Info": "Specifies the scheduling class for HS scheduler policy. The class-id value is a required parameter that specifies which scheduling class the scheduling-class command is acting upon. Values-1 to 6."
        },
        {
            "Parameters": "group-id",
            "Info": "Specifies the group this HS scheduler policy scheduling class belongs to. The group and the rate keywords are mutually exclusive when executing this command. A group ID value of 1 must follow the group keyword. The group keyword removes the class ID from its inherent strict scheduling level and places it into the specified group ID. The associated weight parameter is optional and is used to specify the weight of a class ID within the weighted scheduling class group. Specifying the group parameter while an override for the scheduling class exists for rate causes the scheduling-class command to fail. Values-1."
        },
        {
            "Parameters": "weight-in-group",
            "Info": "Specifies the weight the HS scheduler policy should apply to this scheduling class within the group in which it belongs. This keyword is optional and must follow the group parameter when specified. The weight-in-group parameter must follow the weight keyword and is used to specify the relative weight of the class-id to the other scheduling classes within the group. If the group is specified without the weight parameter, a default weight of 1 is used. Values-1 to 127."
        },
        {
            "Parameters": "rate",
            "Info": "Specifies the explicit maximum frame-based bandwidth limit, in megabits per second, for this HS scheduler policy scheduling class. The rate and group keywords are mutually exclusive. Either the rate or group keyword must be specified when executing this command. When specified, the rate keyword must be followed by either the keyword max or a rate specified in megabits per second. The specified rate can be overridden at the port Ethernet egress using the scheduler override functions. A newly-created HS scheduler policy defaults each scheduling class to have its rate set to max and the weighted scheduling class group has no members. Values-1 to 100000, max."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}