{
    "PageTitle": "wrr-group",
    "FuncDef": "This command defines how the specified group ID is attached to the scheduler. A WRR group may have one of two attachment states:",
    "CLIs": [
        "wrr-group <group-id> sched-class <class-id>",
        "wrr-group <group-id> unattached",
        "no wrr-group <group-id>"
    ],
    "ParentView": [
        "config>qos>hs-attachment-policy"
    ],
    "ParaDef": [
        {
            "Parameters": "group-id",
            "Info": "Specifies the WRR group identifier. The group-id parameter is required when executing the wrr-group attachment command. Values-1, 2."
        },
        {
            "Parameters": "sched-class",
            "Info": "Specifies a direct attachment between the WRR group and one of the six scheduling classes. The sched-class and unattached keywords are mutually exclusive. One of the keywords must be specified when the wrr-group attachment command is executed."
        },
        {
            "Parameters": "class-id",
            "Info": "Specifies the scheduling class associated with this WRR group. The sched-class keyword specifies the attachment between the group ID and one of the six scheduling classes. A value of 1 through 6 must accompany the sched-class keyword representing the WRR group s attached scheduling class. Only one queue or WRR group can be attached to a given scheduling class. If another queue or a WRR group is currently attached to the specified scheduling class, the wrr-group attachment command fails and the current attachment for the group-id is unchanged. Values-1 to 6."
        },
        {
            "Parameters": "unattached",
            "Info": "Indicates that the group ID is not attached to any scheduling class or WRR group. Queues that are members of the unattached WRR group do not forward any packets. The sched-class and unattached keywords are mutually exclusive. One of the keywords must be specified when the wrr-group attachment command is executed."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: wrr-group group-id unattached"
}