{
    "PageTitle": "smart-clock leap manual-mode",
    "FuncDef": "The smart-clock leap manual-mode enable command configures the multi-mode smart clock model on a GE optical interface to obtain leap seconds in manual mode. When the function to manually configure leap seconds is enabled, maintenance engineers need to manually configure leap second information. The multi-mode smart clock module uses leap seconds in the following priority: manually configuring leap second information > obtaining leap second information through satellite almanac > using the default value.\nThe undo smart-clock leap manual-mode enable command configures the multi-mode smart clock model on a GE optical interface to obtain leap second information in auto mode. The multi-mode smart clock module uses GPS or Beidou satellite almanac to obtain leap second information. The multi-mode smart clock module uses leap seconds in the following priority: obtaining leap second information through satellite almanac > manually configuring leap second information > using the default value. If the smart clock module works in GLONASS mode and the function to manually configure leap second information is disabled, the GPS time is invalid.\nBy default, the multi-mode smart clock module obtains leap second information in auto mode.",
    "CLIs": [
        "smart-clock leap manual-mode enable",
        "undo smart-clock leap manual-mode enable"
    ],
    "ParentView": [
        "GE optical interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "manual-mode",
            "Info": "To manually configure leap seconds.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] smart-clock leap manual-mode enable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] undo smart-clock leap manual-mode enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen the current mode of the multi-mode smart clock module is GLONASS or the current mode is GPS+GLONASS but the GPS experiences an abnormality in receiving satellite signals and the UTC time can be obtained only in GLONASS mode, the leap second information and GPS time cannot be obtained. To configure the multi-mode smart clock model on a GE optical interface to obtain leap seconds in manual mode, run the smart-clock leap manual-mode enable command.\nIn GPS, Beidou, and GPS+Beidou modes, the leap second can be obtained within 12.5 minutes using satellite almanac. To obtain the correct leap second value as soon as possible, configure the function to manually configure leap second information before the leap second value is obtained and then manually configure leap second information. This function can be disabled after the leap second information is obtained using satellite almanac.\nIn GLONASS mode, the leap second parameter needs to be manually configured. Otherwise, the time is invalid. In the first positioning in GPS+GLONASS mode, the time is considered accurate only when GPS participates in positioning.\nPrecautions\nThis command does not apply to the single-mode smart clock module."
}