{
    "PageTitle": "ip host",
    "FuncDef": "The ip host command configures the mappings between host names and IP addresses.\nThe undo ip host command deletes the mappings between host names and IP addresses.\nBy default, host names and IP addresses do not have mapping relationships.",
    "CLIs": [
        "ip host <host-name> <ip-address> [ vpn-instance <vpn-instance-name> ]",
        "undo ip host <host-name> [ <ip-address> ] [ vpn-instance <vpn-instance-name> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "host-name",
            "Info": "Specifies a host name.\nThe value is a string of 1 to 255 case-insensitive characters."
        },
        {
            "Parameters": "ip-address",
            "Info": "Specifies an IP address corresponding to a host name.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip host huawei 10.110.0.1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ipv4-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[*HUAWEI] ip host RTA 10.110.0.2 vpn-instance vpn1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf you want to use static DNS for domain name resolution, you must run the ip host command to configure the mappings between host names and IP addresses first.\nPrecautions\nWhen using the ip host command, note the following:\nA VS allows you to configure a maximum of 1024 static DNS entries using the ip host command.Each host name corresponds to only one IP address. If multiple IP addresses are assigned to a host, the latest configured IP address overrides the previous ones."
}