{
    "PageTitle": "dns server source-ip",
    "FuncDef": "The dns server source-ip command specifies an IP address of the DNS client as the source address for DNS communication.\nThe undo dns server source-ip command deletes the source address configured for DNS communication.\nBy default, no IP address is specified as the source address for DNS communication.",
    "CLIs": [
        "dns server source-ip <ipv4Addr>",
        "dns server source-ip vpn-instance <vpn-name> <ipv4Addr>",
        "undo dns server source-ip [ vpn-instance <vpn-name> ] [ <ipv4Addr> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv4Addr",
            "Info": "Specifies an IP address of the DNS client as the source address for DNS communication.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "vpn-instance vpn-name",
            "Info": "Specifies the VPN to be displayed.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dns server source-ip vpn-instance vpn1 10.110.2.1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dns server source-ip 10.110.2.1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf dynamic DNS is configured, you can run the dns server source-ip command to specify an IP address of the DNS client as the source address for DNS communication. This configuration ensures communication security. After an IP address of the DNS client is configured as the source address, the DNS server returns resolution results directly to that IP address. If you do not specify the source address, the source address carried in the DNS request varies according to the destination address.\nPrerequisites\nBefore the dns server source-ip command is run, perform the following operations:\nIn the system view, run the dns resolve command to enable dynamic DNS.In the system view, run the dns server command to configure a DNS server address.\n\nFollow-up Procedure\nAfter the dns server source-ip command is run, perform the following operations to implement dynamic DNS: run the dns domain command to configure the domain name suffix."
}