{
    "PageTitle": "dns server",
    "FuncDef": "The dns server command configures an IP address for a DNS server.\nThe undo dns server command deletes the IP address of a DNS server.\nBy default, DNS servers do not have IP addresses.",
    "CLIs": [
        "dns server <ip-address> [ vpn-instance <vpn-instance-name> ]",
        "undo dns server <ip-address> [ vpn-instance <vpn-instance-name> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address",
            "Info": "IP address of a DNS server.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies the VPN to be displayed.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dns server 172.16.1.1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ipv4-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[*HUAWEI] dns server 172.16.1.2 vpn-instance vpn1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf you want to obtain the IP addresses of destination hosts through their host names (for example, when you perform the ping or tracert operation), you need to run the dns resolve command to enable dynamic DNS. After dynamic DNS is enabled, you must run the dns server command to specify the IP addresses of the DNS servers, so as to obtain the mappings between the domain names and IP addresses of destination hosts.\nPrecautions\nWhen using the dns server command, note the following:\nIn dynamic DNS, the DNS client sends query packets to DNS servers in the configuration sequence of DNS servers. If a DNS client does not receive any response within 5 seconds after sending a DNS request, the DNS client re-sends the DNS request. If the DNS client does not receive any response for three consecutive attempts, the DNS client sends the DNS request to the next DNS server.The IP addresses of DNS servers cannot be multicast addresses."
}