{
    "PageTitle": "pic power-on-delay",
    "FuncDef": "The pic power-on-delay command enables a subcard to automatically power on and configures the delay time for the subcard to power on automatically.\nThe undo pic power-on-delay command disables a subcard from automatically powering on and deletes the delay time.\nThe board power-on-delay command enables a board to automatically power on and configures the delay time for the board to power on automatically.\nundo board power-on-delay command disables a board from automatically powering on and deletes the delay time.\nBy default, a subcard is disabled from powering on automatically. No delay time is configured for the subcard to power on automatically.",
    "CLIs": [
        "{ pic | board } power-on-delay <delay-time>",
        "undo { pic | board } power-on-delay"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "delay-time",
            "Info": "Specifies the delay time for a subcard or a board to power on automatically.\nThe value is an integer ranging from 1 to 65535, in minutes."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] pic power-on-delay 30",
            "Operation success!"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] board power-on-delay 30",
            "Operation success!"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a board or subcard is powered off permanently due to unstable power supply, an user has to remove and insert the board or subcard on site to power it on. To save the labor and enable a board or subcard to power on automatically, a user can run the pic board power-on-delay command and specify the parameter.\nFollow-up Procedure\nRun the display board power-on-delay command after a board is enabled to power on automatically. The command output displays the delay time for the board to power on automatically.\nRun the display pic power-on-delay command after a subcard is enabled to power on automatically. The command output displays the delay time for the subcard to power on automatically.\nRun the display pic power-on-delay command after a subcard is enabled to power on automatically. The command output displays the delay time for the subcard to power on automatically.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}