{
    "PageTitle": "board-channel-check",
    "FuncDef": "The board-channel-check command controls whether the master main control board monitors the registration of the slave main control board.",
    "CLIs": [
        "board-channel-check { enable | disable }"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "enable",
            "Info": "Enable.\n-"
        },
        {
            "Parameters": "disable",
            "Info": "Disable.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> board-channel-check disable",
            "Caution: Are you sure to do this operation?[Y/N]: y",
            "",
            "Info: Operate Success."
        ],
        [
            "<HUAWEI> board-channel-check enable",
            "Caution: Are you sure to do this operation?[Y/N]: y",
            "",
            "Info: Operate Success."
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a component on a slave main control board needs to be replaced, and only a spare part running an earlier version is available, the spare part needs to be upgraded. If the upgrade is performed by pressing Ctrl+B, the upgrade takes a long time because it involves BootLoad and BootROM upgrade, CF card formatting, and file copying. If the upgrade lasts 30 minutes or longer and slave main control board registration monitoring is enabled, the slave main control board is reset in no bootp mode by the master main control board. To control whether the master main control board monitors the registration of the slave main control board, run the board-channel-check { enable | disable } command.\nConfiguration Impact\nIf slave main control board registration monitoring is disabled, the master main control board does not reset the slave main control board if the slave main control board fails to register within 30 minutes.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nTo enable slave main control board registration monitoring, run the board-channel-check enable command or restart the device."
}