{
    "PageTitle": "clear alarm",
    "FuncDef": "The clear alarm hardware command clears a hardware alarm.\nThe clear alarm hardware history command clears historical hardware alarms.",
    "CLIs": [
        "clear alarm hardware all { send-trap | no-trap }",
        "clear alarm hardware slot <slot-id> { send-trap | no-trap }",
        "clear alarm hardware index <index-id> { send-trap | no-trap }",
        "clear alarm hardware history { all | slot <slot-id> }"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "send-trap",
            "Info": "Clears hardware alarms and sends traps to the NMS.\n-"
        },
        {
            "Parameters": "no-trap",
            "Info": "Clears hardware alarms and sends no traps to the NMS.\n-"
        },
        {
            "Parameters": "all",
            "Info": "Specifies that all the historical hardware alarms are cleared.\n-"
        },
        {
            "Parameters": "slot slot-id",
            "Info": "Specifies that the historical hardware alarms of the specified board are cleared.\nThe value is a string of 1 to 49 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "index index-id",
            "Info": "Clear alarm index.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> clear alarm hardware history slot 1",
            "Info: Succeed in deleting the current alarm!"
        ],
        [
            "<HUAWEI> clear alarm hardware all send-trap",
            "Confirm to delete. continue? [Y/N]:Y",
            "Info: Succeed in deleting the current alarm!"
        ],
        [
            "<HUAWEI> clear alarm hardware slot 1 send-trap",
            "Confirm to delete. continue? [Y/N]:Y",
            "Info: Succeed in deleting the current alarm!"
        ],
        [
            "<HUAWEI> clear alarm hardware index 16 send-trap",
            "Info: The following alarm will be cleared:",
            "\"Current license value is default, the reason is License is expired.(ChassisID=1)\"",
            "Confirm to delete. Continue? [Y/N]:Y",
            "Info: Succeed in deleting the current alarm."
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo display all hardware alarm indexes on a device, run the display alarm hardware command. Obtain a desired index and specify it in the clear alarm command to clear a specified hardware alarm.\nIndex-specific, slot ID-specific, or all alarms can be cleared. You can also allow the device to send traps to the NMS.\nIn VS mode, this command is supported only by the admin VS.\nTo clear the historical hardware alarms of a device, run the clear alarm hardware history command in the user view. By specifying different parameters, you can clear the historical hardware alarms of a specified board on a device or all the historical hardware alarms of the device in batches.\nPrecautions\nThe display alarm hardware history command displays all the historical hardware alarms of a device. You need to select the alarms to be cleared.\nIn VS mode, this command is supported only by the admin VS."
}