{
    "PageTitle": "slave switchover",
    "FuncDef": "The slave switchover command enables a forcible master/slave board switchover.",
    "CLIs": [
        "slave switchover"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] slave switchover enable",
            "[*HUAWEI] slave switchover",
            "Warning: Configuration is not Committed.After a switchover,the configuration not submitted will be lost.  ",
            "Warning: This operation will switch the slave board to the master board. Continue? [Y/N]:"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo improve device reliability, a pair of master and slave boards can be installed to work in 1+1 redundancy mode. If the master board fails, the device automatically performs a master/slave board switchover. If the master board works abnormally, for example high CPU usage and a master/slave board switchover is not automatically performed, run the slave switchover command to manually perform a master/slave board switchover.\nPrerequisites\nThe forcible master/slave board switchover function has been enabled using the slave switchover enable command.\nConfiguration Impact\nAfter the slave switchover command is run, the original master board resets and becomes a new slave board, and the original slave board becomes a new master board.\nFollow-up Procedure\nAfter the slave switchover command is run, the display switchover state command can be run to display the master/slave board status. The information helps verify that the master/slave board switchover is successfully performed.\nPrecautions\nBefore you run the slave switchover command, run the display switchover state command and verify that the master/slave board switchover are working properly.\nIn VS mode, this command is supported only by the admin VS.\nFor a virtual cluster, four optical fibers must be fully configured for the control plane. If optical fibers are not fully configured, a master/slave system switchover cannot be proactively initiated. If an abnormal board switchover occurs inside a chassis, the slave chassis may be disconnected according to the optical fiber connection status on the control channel."
}