{
    "PageTitle": "cmu-analog",
    "FuncDef": "The cmu-analog command configures analog parameters monitored by the environment monitoring unit.\nThe undo cmu-analog command cancels the configuration.\nBy default, no analog parameters monitored by the environment monitoring unit are configured.",
    "CLIs": [
        "cmu-analog <analog-id> type { current | voltage } [ object { temperature | humidity } ] name <name> work-low <work-low-value> work-high <work-high-value> wanted <wanted-value> low-alarm <low-alarm-value> high-alarm <high-alarm-value>",
        "undo cmu-analog <analog-id>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "analog-id",
            "Info": "Specifies the ID of the environment monitoring unit.\nThe value is an integer ranging from 0 to 1."
        },
        {
            "Parameters": "type",
            "Info": "Specifies a type.\n-"
        },
        {
            "Parameters": "current",
            "Info": "Specifies a current sensor.\n-"
        },
        {
            "Parameters": "voltage",
            "Info": "Specifies a voltage sensor.\n-"
        },
        {
            "Parameters": "object",
            "Info": "Specifies an object.\n-"
        },
        {
            "Parameters": "temperature",
            "Info": "Monitors the temperature. The options are as follows:\n0: -20 to -10 (degreeC).1: -10 to 0 (degreeC).2: 0 to 10 (degreeC).3: 10 to 20 (degreeC).4: 20 to 30 (degreeC).5: 30 to 40 (degreeC).6: 40 to 50 (degreeC).7: 50 to 60 (degreeC).8: 60 to 70 (degreeC).9: 70 to 80 (degreeC).10: 80 or above (degreeC).\n-"
        },
        {
            "Parameters": "humidity",
            "Info": "Monitors the humidity. The options are as follows:\n0: 0 to 10 (%RH).1: 10 to 20 (%RH).2: 20 to 30 (%RH).3: 30 to 40 (%RH).4: 40 to 50 (%RH).5: 50 to 60 (%RH).6: 60 to 70 (%RH).7: 70 to 80 (%RH).8: 80 to 90 (%RH).9: 90 to 100 (%RH).10: 100 (%RH).\n-"
        },
        {
            "Parameters": "name name",
            "Info": "Specifies the name of an analog sensor.\nThe value is a string ranging from 1 to 24."
        },
        {
            "Parameters": "work-low work-low-value",
            "Info": "Specifies the lowest threshold of an analog parameter.\nThe value is a string ranging from 1 to 9."
        },
        {
            "Parameters": "work-high work-high-value",
            "Info": "Specifies the highest threshold of an analog parameter.\nThe value is a string ranging from 1 to 9."
        },
        {
            "Parameters": "wanted wanted-value",
            "Info": "Specifies the ideal value of an analog parameter.\nThe value is a string ranging from 1 to 9."
        },
        {
            "Parameters": "low-alarm low-alarm-value",
            "Info": "Specifies the lowest threshold of the analog parameter, at which the environment monitoring unit generates an alarm.The value of low-alarm must be less than that of work-low.\nThe value is a string ranging from 1 to 9."
        },
        {
            "Parameters": "high-alarm high-alarm-value",
            "Info": "Specifies the highest threshold of the analog parameter, at which the environment monitoring unit generates an alarm.The value of high-alarm must be greater than that of work-high.\nThe value is a string ranging from 1 to 9."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] cmu-analog 0 type voltage object temperature name cc work-low 4 work-high 7 wanted 6 low-alarm 3 high-alarm 8"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] cmu-analog 0 type voltage name cc work-low 4 work-high 7 wanted 6 low-alarm 3 high-alarm 8",
            "Info: Object cannot be empty , please enter again."
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThis command is applicable only to the device equipped with the CMU module.\nThe router provides the environment monitoring function to monitor the environment change. In this case, the maintenance personnel do not need to implement on-site environment monitoring. When detecting the environment change, the router reports an alarm to the NMS. The maintenance personnel can then adjust environment parameters accordingly. This can effectively reduce the maintenance expenditure of the equipment room.\nWhen the temperature or humidity is monitored by the environment monitoring unit, types of the analog sensor and monitoring, highest and lowest acceptable analog, and highest and lowest threshold of the analog parameter at which an alarm is generated can be configured on the router. The relationship between values of the thresholds is as follows:\nlow-alarm-value < work-low-value < wanted-value < work-high-value < high-alarm-value\nConfiguration Impact\nEnvironment monitoring is an optional configuration and is not included in the basic configuration.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}