{
    "PageTitle": "cmu-switch",
    "FuncDef": "The cmu-switch command configures the ID, name, and alarm type for the switch parameter monitored by the environment monitoring unit.\nThe undo cmu-switch command cancels the configuration.\nThe cmu-switch reset fog command resets the fog sensor.\nBy default, no cmu-switch is configured.",
    "CLIs": [
        "cmu-switch reset fog",
        "cmu-switch <cmu-switch-id> name <cmu-switch-name> alarm-mode { 0 | 1 } [ <object> fog ]",
        "undo cmu-switch <cmu-switch-id>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "cmu-switch-id",
            "Info": "Cmu switch ID.\nThe value is an integer that ranges from 0 to 6.\n0: smoke sensor1: IN12: IN23: IN34: IN45: IN56: IN6"
        },
        {
            "Parameters": "name cmu-switch-name",
            "Info": "Specify cmu switch name.\nThe value is a string of 1 to 24 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "alarm-mode",
            "Info": "Specify cmu alarm-mode.\n-"
        },
        {
            "Parameters": "0",
            "Info": "Alarm when switch turn to 0.\n-"
        },
        {
            "Parameters": "1",
            "Info": "Alarm when switch turn to 1.\n-"
        },
        {
            "Parameters": "object",
            "Info": "The object monitored by this sensor.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] cmu-switch 3 name door alarm-mode 0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe device provides the environment monitoring function to monitor the environment change. In this case, the maintenance personnel do not need to implement on-site environment monitoring. When detecting the environment change, the device reports an alarm to the NMS. The maintenance personnel can thus adjust environment parameters accordingly. This can effectively reduce the maintenance expenditure of the equipment room.\nWhen the fog or entrance guard system needs to be monitored, the alarm type can be configured on the device. This enables the device to generate alarms when the switch ID becomes 0 or 1.\nIf a Huawei smoke sensor is used, run the cmu-switch 0 name door alarm-mode 0 object fog command, with alarm-mode being set to 0.\nConfiguration Impact\nEnvironment monitoring is an optional configuration and is not included in the basic configuration.\nPrecautions\nThis command is applicable only to the device equipped with the CMU module.\nIn VS mode, this command is supported only by the admin VS."
}