{
    "PageTitle": "cmu-relay",
    "FuncDef": "The cmu-relay command configures the ID and name for the external relay of a CMU. The external relay is used to control an external device.\nThe undo cmu-relay command deletes the configuration.\nBy default, no cmu-relay is configured.",
    "CLIs": [
        "cmu-relay <cmu-relay-id> name <cmu-relay-name> alarm-mode { open | close }",
        "undo cmu-relay <cmu-relay-id>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "cmu-relay-id",
            "Info": "Specifies the ID of the external relay of a CMU.\nThe value is 0 or 1.\n0: corresponds to RES1+ and RES1? on the panel.1: corresponds to RES2+ and RES2? on the panel."
        },
        {
            "Parameters": "name cmu-relay-name",
            "Info": "Specifies the name of the external relay of a CMU.\n-"
        },
        {
            "Parameters": "alarm-mode",
            "Info": "Specify cmu alarm-mode.\n-"
        },
        {
            "Parameters": "open",
            "Info": "Turns on an external device through an external relay.\n-"
        },
        {
            "Parameters": "close",
            "Info": "Turns off an external device through an external relay.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] cmu-relay 0 name switch alarm-mode open"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe device provides the environment monitoring function to monitor the environment change. In this case, the maintenance personnel do not need to implement on-site environment monitoring. When detecting the environment change, the device reports an alarm to the NMS. The maintenance personnel can then adjust environment parameters accordingly. This can effectively reduce the maintenance expenditure of the equipment room.\nThe external relay of a CMU can be configured to automatically control the monitored object. For example, configure the external relay of a CMU to turn on or off the air conditioner when the relay is in the on or off state.\nPrecautions\nThis command is applicable only to the device equipped with the CMU module.\nIn VS mode, this command is supported only by the admin VS."
}