{
    "PageTitle": "monitor process information",
    "FuncDef": "The monitor cpu-usage command dynamically monitors CPU usage and displays CPU usage on at a fixed place of the screen.\nThe monitor process information command dynamically monitors the usage of system process resources.",
    "CLIs": [
        "display cpu-usage [ slot <slotid> ]",
        "monitor cpu-usage [ slot <slotid> ] [ interval <intervalValue> ]",
        "monitor process information [ slot <slotid> ] [ interval <intervalValue> ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "slot slotid",
            "Info": "Displays the usage of process resources on a specified interface board.\n-"
        },
        {
            "Parameters": "interval intervalValue",
            "Info": "Specifies the interval at which information about the CPU usage is dynamically displayed.\nThe value is an integer ranging from 5 to 300, in seconds. The default value is 5."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> monitor process information slot 1 interval 25",
            "Last time(seconds): 125        Interval(seconds): 25        State: Thaw",
            "ProcessId    ProcessName                CpuUseRate    VmMemorySize(KB)    FDNum   ThreadNum   TimerNum",
            "6            CFG                                5%               5678        10          24         13",
            "10001        PROTO1                             1%               3456        37          17          1",
            "Freeze=f,    Thaw=t,    Quit=q"
        ],
        [
            "<HUAWEI> monitor cpu-usage",
            "Last time(seconds): 0        Interval(seconds): 5        State: Thaw",
            "Cpu utilization for five seconds: 34%; one minute: 28%;  five minutes: 28%.",
            "ProcessId    ProcessName                     UseRate    ProcessDescription",
            "2            SM                              2%         System Management               ",
            "3            CFG                             2%         Configuration Management        ",
            "0            OS                              2%         OS Kernel                       ",
            "1001         PROTO2                          2%         IP Stack",
            "Freeze=f,   Thaw=t,   Quit=q"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen a network configuration is changed (for example, system software of network devices is upgraded), you need to monitor CPU usage of the device in real time. At present, the dynamic CPU usage is displayed using the display cpu-usage command repeatedly, which is unable to display the real-time CPU usage and increases the maintenance workload. To reduce the maintenance workload and implement real-time CPU usage, you can run the monitor cpu-usage command.\nSystem process resources include CPU, memory, timer, handle, and thread resources. To monitor the usage of system process resources, run the monitor process information command.\nDuring the dynamic monitoring of information about the usage of system process resources, you can enter the following letters to adjust the display:\nF: Locks the function to dynamically display information, so that the usage of system process resources is no longer updated.T: Unlocks the function to dynamically display information, so that the usage of system process resources is automatically updated. By default, the function to dynamically display information about the usage of system process resources is unlocked.Q: Exits the process of dynamically displaying the usage of system process resources. You can also press Ctr+C to exit the process. If you do not exit the process, the usage of system process resources keeps being updated.\n\nImplementation Procedure\nDuring the dynamic display of CPU usage, you can enter the following characters to adjust the command output:\nf: Dynamic entries are locked and CPU usage is no longer updated.t: Dynamic entries are unlocked and CPU usage is updated dynamically. By default, CPU usage is updated dynamically.q: Quits the dynamic display of CPU usage. Alternatively, you can press Ctrl+C. If q is not entered, CPU usage is updated dynamically.\n\nPrecautions\nA user logging in to a device using the console interface cannot use the monitor cpu-usage command to dynamically display CPU usage.During the dynamic display of CPU usage, other commands cannot be run.Dynamic CPU usage is displayed at a fixed place on the screen, and historical information is displayed on the top of the screen.Due to deviations in the interval (at which CPU usage is collected) and the calculation (based on which CPU usage is obtained), and the cost of user task switching, the obtained CPU usage may differ from the actual value. A system task can have a maximum of 10 user tasks and the error of CPU usage of the user task is +-5%.The device to which you log in through the console port does not support the function to dynamically display the usage of system process resources.During the process of dynamically displaying the usage of system process resources, other commands cannot be executed.After the command is executed, information about the usage of system process resources is displayed in real time on the screen, with historical usage information being reserved.\nIn VS mode, this command is supported only by the admin VS."
}