{
    "PageTitle": "monitor process information slave",
    "FuncDef": "The monitor process information slave command dynamically monitors the usage of system process resources.",
    "CLIs": [
        "display cpu-usage slave",
        "monitor cpu-usage slave [ interval <intervalValue> ]",
        "monitor process information slave [ interval <intervalValue> ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "cpu-usage",
            "Info": "Displays CPU usage statistics.\n-"
        },
        {
            "Parameters": "interval intervalValue",
            "Info": "Specifies an interval at which the usage of system process resources is dynamically collected.\nThe value is an integer ranging from 5 to 300, in seconds. The default value is 5."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> monitor process information slave interval 25",
            "Last time(seconds): 125        Interval(seconds): 25        State: Thaw",
            "ProcessId    ProcessName                CpuUseRate    VmMemorySize(KB)    FDNum   ThreadNum   TimerNum",
            "6            CFG                                5%               5678        10          24         13",
            "10001        PROTO1                             1%               3456        37          17          1",
            "Freeze=f,    Thaw=t,    Quit=q"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nSystem process resources include CPU, memory, timer, handle, and thread resources. To monitor the usage of system process resources on slave board, run the monitor process information slave command.\nDuring the dynamic monitoring of information about the usage of system process resources, you can enter the following letters to adjust the display:\nF: Locks the function to dynamically display information, so that the usage of system process resources is no longer updated.T: Unlocks the function to dynamically display information, so that the usage of system process resources is automatically updated. By default, the function to dynamically display information about the usage of system process resources is unlocked.Q: Exits the process of dynamically displaying the usage of system process resources. You can also press Ctr+C to exit the process. If you do not exit the process, the usage of system process resources keeps being updated.\n\nPrecautions\nThe device to which you log in through the console port does not support the function to dynamically display the usage of system process resources.During the process of dynamically displaying the usage of system process resources, other commands cannot be executed.After the command is executed, information about the usage of system process resources is displayed in real time on the screen, with historical usage information being reserved.\n In VS mode, this command is supported only by the admin VS."
}