{
    "PageTitle": "display fan power",
    "FuncDef": "The display power command displays the status of a power module.\nThe display fan command displays fan status.",
    "CLIs": [
        "display power",
        "display { fan | power } ap-id <ap-id>",
        "display fan"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "ap-id ap-id",
            "Info": "Indicates the ID of the AP device.\nThe value is an integer ranging from 1024 to 8191."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display fan",
            "Slotid    : *                                                                ",
            "Present   : YES                                                                 ",
            "Registered: YES                                                                 ",
            "Status    : AUTO                                                                ",
            "FanSpeed  : [No.]Speed                                                          ",
            "  [1]30%   ",
            "  ..."
        ],
        [
            "<HUAWEI> display power",
            "No Present mode State    InputPower                                         Num ",
            "------------------------------------------------------------------------------- ",
            "*  Yes     DC   Normal   *66.67W                                            1",
            "..."
        ]
    ],
    "ExtraInfo": "Usage Scenario\nDuring routine maintenance, you can run the display power command to view the status of power modules.\nThe fan status information includes the slot ID, in-position and registration status, working status, rotation speed, and rotation mode of a fan module.\nDuring routine maintenance, if the temperature of the Router is not within a normal range, run the display fan command to check the fan status.\nFollow-up Procedure\nIf you find that a fan is defective after running the display fan command, you can perform the following operations:\nCheck that the fan module is properly installed. If necessary, remove and re-install the fan module to ensure that it is properly installed. Then, run the display fan command again to check the fan status.Check whether any fan has failed. If a fan has failed, replace it and install a new fan properly. Then, run the display fan command again to check the fan status.If the fault persists, contact Huawei technical support personnel.\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}