{
    "PageTitle": "display inventory",
    "FuncDef": "The display inventory board command displays existing board information, including the board name, E-label on the existing board, version type, version number, and slot ID.\nThe display inventory chassis command displays existing chassis information, including the chassis name, E-label on the backplane, PCB version number, and chassis number.",
    "CLIs": [
        "display inventory chassis",
        "display inventory board"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> display inventory chassis",
            "ShfName=<***>        ",
            "ShfeLabel=</$[ArchivesInfo Version] ",
            "/$ArchivesInfoVersion=3.0  ",
            "",
            "",
            "[Board Properties]",
            "BoardType=CR***KP08DC0                ",
            "BarCode=2102353CWC1098000***          ",
            "Item=02353***                        ",
            "Description=Assembling Components, ***    ",
            "Manufactured=2019-11-12                ",
            "VendorName=Huawei                    ",
            "IssueNumber=00                        ",
            "CLEICode=                             ",
            "BOM=                                ",
            "Model=                              ",
            "/$ElabelVersion=4.0                   ",
            "                                   ",
            ">                                  ",
            "ShfVer=<PCB Version>                 ",
            "ShfVerVal=<GPMAFB04 REV A>          ",
            "ShfLoc=<shelf=1>"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAn Installed Base Management System (IBMS) is a system that Huawei GTS AMS developed to manage inventory devices on a live network. With customer's approval, the IBMS periodically collects live network statistics and provides real-time and effective data. The display inventory board command displays existing board information, including the board name, E-label on the existing board, version type, version number, and slot ID.\nAn Installed Base Management System (IBMS) is a system that Huawei GTS AMS developed to manage inventory devices on a live network. With customer's approval, the IBMS periodically collects live network statistics and provides real-time and effective data. The display inventory chassis command displays existing chassis information, including the chassis name, E-label on the backplane, PCB version number, and chassis number.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}