{
    "PageTitle": "fan speed(System view)",
    "FuncDef": "The fan speed command configures a fan speed adjustment mode.\nBy default, fans work in automatic speed adjustment mode.",
    "CLIs": [
        "fan speed { auto | full }",
        "fan speed percent <value>",
        "fan speed minimum-percent <minimum-value>",
        "fan speed silent"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "auto",
            "Info": "Adjusts the fan speed automatically.\n-"
        },
        {
            "Parameters": "full",
            "Info": "Configures fans to work at a full speed.\n-"
        },
        {
            "Parameters": "percent value",
            "Info": "Percent.\nThe value is an integer that ranges from 30 to 100."
        },
        {
            "Parameters": "minimum-percent minimum-value",
            "Info": "Specifies the minimum percentage for fan speed adjustment.\nThe value is an integer that ranges from 30 to 100."
        },
        {
            "Parameters": "silent",
            "Info": "Adjusts the fan speed in silent mode.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] fan speed auto"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nYou can configure a desired fan speed adjustment mode based on the number of working boards on the device.\nauto: To meet heat dissipation requirements, the device automatically adjusts the fan speed based on the ambient temperature reported by the temperature sensor of the associated board.full: Fans work at the highest speed.silent: The fan speed is automatically adjusted. However, fans work with a small speed adjustment step to control the automatically adjusted fan speed, preventing the noise from being abruptly increased due to a great fan gear change.percent: Fans work at a specified percentage of the highest speed. You can configure a percentage based on the number of working boards on the device.minimum-percent: The device automatically adjusts the fan speed based on the ambient temperature reported by the temperature sensor of the associated board, provided that the fan speed is not lower than the configured minimum speed percentage.\n\nConfiguration Impact\nConfiguring fans to work at a full speed improves device heat dissipation but increases power consumption.\nIn VS mode, this command is supported only by the admin VS."
}