{
    "PageTitle": "forward-alarm board flow alarm",
    "FuncDef": "The forward-alarm slot board flow input bandwidth usage-rate alarm on off command sets the alarm reporting and alarm clearance thresholds for input traffic on a board.\nThe forward-alarm slot board flow output bandwidth usage-rate alarm on off command sets the alarm reporting and alarm clearance thresholds for output traffic on a board.\nThe undo forward-alarm slot board flow alarm command restores the default alarm reporting and alarm clearance thresholds for traffic on a board.\nBy default, the alarm threshold is 80, and the clear alarm threshold is 75.",
    "CLIs": [
        "forward-alarm slot <slot-id> board flow input bandwidth usage-rate alarm on <onRate> off <offRate>",
        "forward-alarm slot <slot-id> board flow output bandwidth usage-rate alarm on <onRate> off <offRate>",
        "undo forward-alarm slot <slot-id> board flow alarm"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "on onRate",
            "Info": "Specifies the alarm reporting threshold.\nThe value is an integer that ranges from 0 to 100."
        },
        {
            "Parameters": "off offRate",
            "Info": "Specifies the alarm clearance threshold.\nThe value is an integer that ranges from 0 to 99."
        },
        {
            "Parameters": "slot slot-id",
            "Info": "Specifies the slot ID of a board. The value range varies according to device hardware.\nThe value is a string of 1 to 15 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] forward-alarm slot 1 board flow input bandwidth usage-rate alarm on 90 off 80"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo set the alarm reporting and alarm clearance thresholds for traffic on a board, run the forward-alarm slot board flow usage-rate alarm on off command. To restore the default alarm reporting and alarm clearance thresholds for traffic on a board, run the undo forward-alarm slot board flow alarm command."
}