{
    "PageTitle": "loopback autoclear",
    "FuncDef": "The display loopback autoclear configuration command displays the loopback autoclear period.\nThe loopback autoclear command enables the system to automatically disable the interface loopback function.\nThe undo loopback autoclear command disables the system from automatically disabling the interface loopback function.\nBy default, the system cannot automatically disable the interface loopback function.",
    "CLIs": [
        "display loopback autoclear configuration",
        "loopback autoclear [ period <hold-time> ]",
        "undo loopback autoclear [ period ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "period hold-time",
            "Info": "Specifies the hold time of the interface loopback function.\nThe value is an integer ranging from 1 to 2880, in minutes. The default value is 5."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] loopback autoclear"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] loopback autoclear period 3"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] display loopback autoclear configuration",
            "Loopback autoclear: Enable",
            "Loopback autoclear period: 5 minutes"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo locate faults, you may perform a local or remote loopback for an interface. If you forget to disable the local or remote loopback function after fault location is complete, services will be affected. To solve this problem, run the loopback autoclear command to configure the hold time of the interface loopback function. After the configured hold time elapses, the local or remote loopback function will be automatically disabled.\nTo view the loopback autoclear period, run the display loopback autoclear configuration command.\nIn VS mode, this command is supported only by the admin VS.\nPrecautions\nThe hold time of the interface loopback function can be configured for physical interfaces.\nIn VS mode, this command is supported only by the admin VS."
}