{
    "PageTitle": "loopback autoclear period",
    "FuncDef": "The loopback autoclear period command sets the hold time for the automatic loopback clearance function.\nBy default, the hold time is not configured for the automatic loopback clearance function.",
    "CLIs": [
        "loopback { local | remote } autoclear period <hold-time>"
    ],
    "ParentView": [
        "CPOS interface view",
        "E1/CE1 interface view",
        "E1 interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "local",
            "Info": "Specifies local loopback.\nLocal loopback means that a packet from an interface is sent back to this interface inside the system.\n-"
        },
        {
            "Parameters": "remote",
            "Info": "Specifies remote loopback.\nRemote loopback means that the local interface sends a packet from the peer interface (remote end) back to the peer interface rather than forward the packet to the destination address.\n-"
        },
        {
            "Parameters": "period hold-time",
            "Info": "Set the interface loopback autoclear period.\nThe value is an integer ranging from 1 to 43200."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] controller e1 2/0/0",
            "[~HUAWEI-E1 2/0/0] loopback local"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo enable an interface to delete the loopback configuration after a specified period, run the loopback { local | remote } autoclear period command.\nIn remote loopback mode, the local interface sends testing packets to the peer. The local device computes communication quality parameters, such as the packet loss ratio of the current link, based on the number of sent packets and the number of received packets.\nConfiguration Impact\nLoopback causes service interruptions. Therefore, do not enable loopback on interfaces in normal situations.\nPrecautions\nWhen local loopback is enabled on an interface, the interface physically goes Up, but its link layer protocol goes Down.When an interface is physically Up and a serial interface channelized from the interface is encapsulated with PPP, the link layer protocol of the serial interface goes Down after remote loopback is enabled on the remote device."
}