{
    "PageTitle": "loopback",
    "FuncDef": "The loopback command enables loopback on an Ethernet interface.\nThe undo loopback command disables loopback.\nBy default, loopback is disabled on Ethernet interfaces.",
    "CLIs": [
        "loopback { local | remote }",
        "undo loopback"
    ],
    "ParentView": [
        "Layer 2 40GE interface view",
        "40GE interface view",
        "GE electrical interface view",
        "Layer 2 10GE interface view",
        "Layer 2 GE interface view",
        "Serial interface view",
        "CPOS interface view",
        "400GE interface view",
        "10GE interface view",
        "Layer 2 100GE interface view",
        "Layer 2 50|100GE interface view",
        "E1/CE1 interface view",
        "FlexE-100G interface view",
        "25GE-L2 view",
        "FlexE-50G interface view",
        "400GE-L2 view",
        "FlexE-50|100G interface view",
        "E1 interface view",
        "GE interface view",
        "Layer 2 50GE interface view",
        "100GE interface view",
        "50GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "local",
            "Info": "Specifies local loopback.\nLocal loopback means that a packet from an interface is sent back to this interface inside the system.\n-"
        },
        {
            "Parameters": "remote",
            "Info": "Specifies remote loopback.\nRemote loopback means that the local interface sends a packet from the peer interface (remote end) back to the peer interface rather than forward the packet to the destination address.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] loopback local"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf you want to locate a system fault, run the loopback local command to enable local loopback.If you want to locate a link fault or test the quality of a link, run the loopback remote command to enable remote loopback on a interface.\n\nConfiguration Impact\nIn normal situations, interfaces are not allowed to work in loopback mode; otherwise, traffic is looped, causing service interruption.\nPrecautions\nWhen local loopback is enabled on a interface, the interface physically goes Up, but its link layer protocol goes Down.\nWhen a interface is physically Up and a serial interface channelized from the interface is encapsulated with PPP, the link layer protocol of the serial interface goes Down after remote loopback is enabled on the remote device.\nIn VS mode, this command is supported only by the admin VS.\nIn the serial interface view,if the RS-485 mode is configured, the loopback remote command is not supported."
}