{
    "PageTitle": "power",
    "FuncDef": "The power on command powers on a specified board or a specified subcard.\nThe power off command powers off a specified board or a specified subcard.",
    "CLIs": [
        "power { on | off } slot <slot-id> [ card <card-id> ]"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "slot slot-id",
            "Info": "Specifies the slot ID of the board to be powered on or powered off.\nThe value is the slot number of the in-position board."
        },
        {
            "Parameters": "card card-id",
            "Info": "Specifies the ID of the subcard to be powered on or powered off.\nThe value is the ID of the in-position subcard."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> power off slot 1",
            "Warning:  This command may affect operation by wrong use, please carefully use it with HUAWEI engineer's direction. Are you sure to ",
            "do this operation? [Y/N]:y                                                                                                               ",
            "......                                                                                                                                   ",
            "Info: Operation succeeded."
        ]
    ],
    "ExtraInfo": "Usage Scenario\nDuring routine maintenance, if a board or a subcard needs to be removed for cleaning or for capacity expansion, you can run the power off command to power off the board or subcard before removing it.\nAfter a board or a subcard is inserted into a slot, you can run the power on command to power on the board or subcard.\nConfiguration Impact\nAfter running the power off command to power off a board or a subcard in a specified slot, the board or subcard fails to be registered. Before registering the board or subcard, you must run the power on command to power on the board or subcard.\nPrecautions\n1 In VS mode, this command is supported only by the admin VS.\n2 Integrated board of SRU cannot be power-cycled using the power [ on | off ] slot command.\n3 Master main control board cannot be power-cycled using the power [ on | off ] slot command.\n4 You must power on the main control board before powering on an interface board; otherwise, the interface board cannot be powered on.\n5 In the power off slot command, the slot-id or card-id parameter can only be the slot number of a board or the subcard number that has been properly registered.\n6 The slot ID of a CR5D00C2CF71, CR5D00E8GF73, or CR5D00E8GF72 subcard is displayed as 0 and 2 or 1 and 3. However, subcards in slots 2 and 3 cannot be powered on. If you attempt to power on a subcard in slot 2 or 3, the system prompts a message to instruct you to power on the subcard in slot 0 or 1 instead."
}