{
    "PageTitle": "power-supply mode",
    "FuncDef": "The power-supply mode command configures the power distribution mode for a device.\nThe undo power power-supply mode command deletes the power distribution mode for a device.\nThe standard power distribution mode is used by default.",
    "CLIs": [
        "power-supply mode assign input-power <input-power>",
        "power-supply mode standard [ temperature <temperature> ]",
        "undo power-supply mode"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "input-power input-power",
            "Info": "Specifies the onsite input power.\nFor partitioned power supply, the power value ranges from the value of the maximum area power multiplied the number of areas to the maximum power of the power supply, expressed in W.For flexible power supply, this parameter is not supported."
        },
        {
            "Parameters": "standard",
            "Info": "Indicates the standard power distribution mode.\nA device is by default working in standard power distribution mode."
        },
        {
            "Parameters": "temperature temperature",
            "Info": "Specifies the working temperature on a specific board.\nFor partitioned power supply, the value is 55degreeC(131degreeF).For flexible power supply, the value can be 40degreeC (104degreeF) or 55degreeC(131degreeF). The default value is 55degreeC (131degreeF).The X3/X3A, X8 and X16 device does not support flexible power supply mode.\nThe X8A and X16A device support flexible power supply mode."
        },
        {
            "Parameters": "assign",
            "Info": "Indicates the assigned power distribution mode.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] power-supply mode assign input-power 5000",
            "Warning: You have switched the power supply mode to assign. The input-power threshold is 5000 W. Continue? [Y/N]:y",
            "Set power supply mode successfully"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] power-supply mode standard temperature 55",
            "Set power supply mode successfully"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA device supports two power distribution modes, assigned and standard modes. The assigned mode allows you to set an input power value as needed. The standard mode provides only a fixed input power value, which cannot be modified.\nA device that uses the partitioned power supply supports both modes. In addition, the assigned mode allows you to set the input-power value for the device that uses the partitioned power supply based on the onsite input power. A device is by default working in standard power distribution mode.\nA device that supports flexible power distribution supports only the standard mode and does not allow users to set the input power value.\nWhen a device is configured to work in standard mode, you can specify the operating temperature. The default working temperature is 55degreeC. A device with partitioned power supply supports only the operating temperature of 55degreeC. A device with flexible power distribution supports the operating temperature of 40degreeC or 55degreeC.\nWhen the power supply is insufficient and the ambient temperature is lower than 40degreeC, you can set the operating temperature of the device to 40degreeC to support more working boards.\nPrecautions\nFor the power-supply mode command that is run for a device supporting flexible power distribution, the assign mode is not supported.\nWhen the working temperature changes from 40degreeC to 55degreeC, reserved board power consumption increases. In this case, run the display power-supply information command to check the power consumption of the device. If the power consumption is insufficient, board power supply may be abnormal.\nThis command is supported only on the admin VS."
}