{
    "PageTitle": "reboot (User view) (options)",
    "FuncDef": "The reboot command is used to reboot a device. Before the device reboots, you are prompted to save configurations.\nThe reboot fast command is used to fast reboot a device. Before the device reboots, you are not prompted to save configurations.",
    "CLIs": [
        "reboot { fast | save diagnostic-information }"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "fast",
            "Info": "Indicates that a device is fast rebooted. Before the device reboots, you are not prompted to save configurations.\n-"
        },
        {
            "Parameters": "save",
            "Info": "Indicates that information is saved before the Router is rebooted.\n-"
        },
        {
            "Parameters": "diagnostic-information",
            "Info": "Indicates that diagnostic information.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reboot fast",
            "reboot fast ",
            "MPU 17:",
            "Next startup system software: cfcard:/VxxxRxxxCxx.cc",
            "Next startup saved-configuration file: cfcard:/vrpcfg.zip",
            "Next startup paf file: default",
            "Next startup patch package: NULL",
            "",
            "The Other MPU is the same with MPU 17.",
            "",
            "System will reboot! Continue? [Y/N]:y"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe function of the reboot command is the same as powering off and on a device, but this command facilitates remote device maintenance.\nConfiguration Impact\nAfter the reboot or reboot save diagnostic-information command is run in traditional mode or a service LS in LS mode, the system displays a message asking you whether to save the configuration. If you choose to save the configuration, the current configuration is written into the configuration file to prevent configuration loss after the reboot. If you choose not to save the configuration, the device reboots using the configuration in the configuration file, leading to the loss of unsaved configuration.After the reboot fast command is run, the device reboots without prompting you to save the configuration. Therefore, the unsaved configuration will be lost.After the reboot save diagnostic-information command is run, if a diagnostic information file already exists, the system displays a message asking you whether to overwrite the file before the reboot. If you choose to overwrite the file, the system saves current diagnostic information to the root directory of the CF card and overwrites the original diagnostic information file. If you choose not to overwrite the file, the system does not collect diagnostic information. Diagnostic information does not affect device configuration.\n\nPrecautions\nConfirm the action before you use the reboot command, because this command may break down the network in a short period of time. In addition, before restarting a device, ensure that the configuration file of the device has been saved.\nAfter the reboot command is run, if you do not respond to the prompt of the system before the time expires, the user view will be displayed and the device will not be restarted.\nAfter the reboot command is run, press Ctrl+C to interrupt.\nIn VS mode, this command is supported only by the admin VS."
}