{
    "PageTitle": "schedule reboot",
    "FuncDef": "The schedule reboot command enables the scheduled restart of the Device, and sets the time at which the Device restarts or the time for the Device wait for a restart.\nThe undo schedule reboot command disables the schedule restart function.\nBy default, the scheduled rebooting function is disabled for the Device.",
    "CLIs": [
        "schedule reboot { at <time> [ <date> ] | delay <interval> [ force ] }",
        "undo schedule reboot"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "at",
            "Info": "Sets the time when the Device restarts.\n-"
        },
        {
            "Parameters": "time",
            "Info": "Sets the time when the Device restarts.\nhh:mm: hh indicates the hour ranging from 0 to 720. mm indicates the minute ranging from 0 to 59."
        },
        {
            "Parameters": "date",
            "Info": "Sets the date when the Device restarts.\n-"
        },
        {
            "Parameters": "delay",
            "Info": "Sets the time before the Device restarts.\n-"
        },
        {
            "Parameters": "interval",
            "Info": "Specifies the delay before the Device restarts.\nThere are two formats of interval:\nhh:mm: hh indicates the hour ranging from 0 to 720. mm indicates the minute ranging from 0 to 59.mm: indicates minute ranging from 0 to 43200.Currently, the supported string length varies from 1 to 6."
        },
        {
            "Parameters": "force",
            "Info": "Forces the timer to restart the Device.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> schedule reboot at 22:00",
            "Warning: Current configuration will be saved to the next startup saved-configuration file! Continue? [Y/N]:y                                                    ",
            "Now saving the current configuration......                                      ",
            "Save the configuration successfully.                                            ",
            "Info: Reboot system at 22:00:00 2012/12/17 UTC(in 13 hours and 46 minutes)      ",
            "confirm? [Y/N]:y"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the Device needs to be restarted but not urgently, run the schedule reboot command to set a time for the Device to restart.\nConfiguration Impact\nIf the schedule reboot at command is used to set a specific date parameter (yyyy/mm/dd) and the date is a future date, the Device restarts at the scheduled time and the error is within 1 minute.\nNote that the specified date cannot be 30 days later than the current date. In addition, after this command is used, the system prompts you to confirm the input information. The setting takes effect only after you enter \"Y\" or \"y\". If the related configuration exists, the latest configuration overrides the previous one.\nIf no specific date is set, the following situations occur:\nIf the scheduled time is later than the current time, the Device restarts at this time that day.If the scheduled time is earlier than the current time, the Device restarts at this time next day.\nAfter the schedule reboot command is used, the parameters set using the schedule reboot command become invalid when the clock datetime command is used to adjust the time of the system.\n\nPrecautions\nExercise caution when running this command. When the device restarts at the scheduled time, services are interrupted on the entire device.\nWhen the Device restarts, ensure that the configuration file on the Device is saved.\nIn VS mode, this command is supported only by the admin VS."
}