{
    "PageTitle": "set board-reset hardware-alarm",
    "FuncDef": "The set board-reset hardware-alarm error-code command configures alarm codes for automatic board reset.\nThe undo set board-reset hardware-alarm error-code command deletes alarm codes for automatic board reset.",
    "CLIs": [
        "set board-reset hardware-alarm error-code <error-code> [ slot <slot-id> ]",
        "undo set board-reset hardware-alarm { error-code <error-code> | all } [ slot <slot-id> ]"
    ],
    "ParentView": [
        "Fault management view"
    ],
    "ParaDef": [
        {
            "Parameters": "error-code error-code",
            "Info": "Specifies an alarm code.\nThe value is a hexadecimal integer ranging from 0x10000 to 0xffffffff."
        },
        {
            "Parameters": "slot slot-id",
            "Info": "Specifies the slot number of a board.\nThe value is the slot ID of an installed board."
        },
        {
            "Parameters": "all",
            "Info": "All error code.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] fm",
            "[~HUAWEI-fm] set board-reset hardware-alarm error-code 108D4",
            "Warning: After this command is set, if the alarm with this error code is generated,the board will reset. Continue? [Y/N]:y"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] fm",
            "[~HUAWEI-fm] set board-reset hardware-alarm error-code ffffffff",
            "Error:Not support this error code!"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter certain alarms are generated, the corresponding boards need to reset to restore services. You can run the set board-reset hardware-alarm error-code command to set alarm codes for automatic board reset. After an alarm with a specified alarm code is generated, the associated board resets automatically to restore services.\nConfiguration Impact\nIf this alarm is generated on a board, the board will be reset.If this alarm is generated on a subcard, the board where the subcard resides will be reset.If this command is generated on the master, a master/slave switchover occurs when the slave is installed; the master is not reset when no slave is installed.\n\nPrecautions\nA maximum of 20 alarm codes can be specified in this command.\nIn VS mode, this command is supported only by the admin VS."
}