{
    "PageTitle": "set card-fault process-mode isolate card",
    "FuncDef": "The set card-fault process-mode isolate card command enables the port isolation function for a specified subcard.\nThe undo set card-fault process-mode isolate card command disables the port isolation function for the specified subcard.\nBy default, if the global port isolation function is enabled and not shielded for a specified subcard, the port isolation function of the subcard is enabled. If the global port isolation function is not enabled, the port isolation function of the subcard is not enabled either.",
    "CLIs": [
        "set card-fault process-mode isolate card <card-id>",
        "undo set card-fault process-mode isolate card <card-id>"
    ],
    "ParentView": [
        "Slot view"
    ],
    "ParaDef": [
        {
            "Parameters": "card card-id",
            "Info": "Specifies the ID of the subcard supporting the port isolation function.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] slot 1",
            "[~HUAWEI-slot-1] set card-fault process-mode isolate card 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen detecting a hardware fault during subcard startup, the system prevents the subcard from registering and resets the subcard for automatic fault rectification. If you enable the port isolation function of a specified subcard by running the set card-fault process-mode isolate card command, the system isolates only the port corresponding to the faulty component and allows the subcard to directly register after the faulty port is isolated.\nPrerequisites\nYou can configure the port isolation function for a subcard only after running the shield card-fault process-mode global-config enable card command for the subcard.\nPrecautions\nThe set card-fault process-mode isolate card and undo shield card-fault process-mode global-config enable card commands are mutually exclusive. If the set card-fault process-mode isolate card command has been configured for a subcard, running the undo shield card-fault process-mode global-config enable card command for the subcard is not allowed.\nIn VS mode, this command is supported only by the admin VS."
}