{
    "PageTitle": "set tm statistics alarm-threshold",
    "FuncDef": "The set tm statistics alarm-threshold command enables the TM packet loss alarm function and configures an alarm threshold for packet loss on the TM board of a specified board.\nThe undo set tm statistics alarm-threshold command disables the TM packet loss alarm function.\nBy default, the TM packet loss alarm function is disabled.",
    "CLIs": [
        "set tm statistics alarm-threshold [ <entity-id> packets in <second> seconds ] [ slot <slot-id> ]",
        "undo set tm statistics alarm-threshold [ slot <slot-id> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "entity-id",
            "Info": "Specifies an alarm threshold for the number of lost packets.\nThe value is an integer ranging from 1 to 4294967295. The default value is 10000."
        },
        {
            "Parameters": "packets",
            "Info": "Packets.\n-"
        },
        {
            "Parameters": "in",
            "Info": "Time range.\n-"
        },
        {
            "Parameters": "second",
            "Info": "Specifies a detection period.\nThe value is an integer ranging from 5 to 3600, in seconds. The default value is 60."
        },
        {
            "Parameters": "slot slot-id",
            "Info": "Specifies a slot ID.\nThe value is a string of 1 to 20 characters.\nIf no slot ID is specified, the TM packet loss alarm function is enabled for all supported boards."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] set tm statistics alarm-threshold 5000 packets in 10 seconds slot 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the traffic of all ports on a board is less than 50% of the port bandwidth, enable the TM packet loss alarm function and adjust the alarm threshold as needed if you want to check whether packet loss occurs on the TM board during the forwarding process. A TM packet loss alarm is reported when the total number of lost packets on the TM board exceeds the configured threshold within a specified detection period.\nPrecautions\nThis function focuses on packet loss statistics only on the TM module of a board, regardless of packet loss causes.\nAfter an alarm is reported, if the number of lost packets keeps below the alarm threshold for 1 hour, the alarm is cleared.\nThis command takes effect only on the LPUI-240 series boards.\nIn VS mode, this command is supported only by the admin VS."
}