{
    "PageTitle": "set service-mode card-bandwidth-mode",
    "FuncDef": "The set service-mode card-bandwidth-mode command sets an interface bandwidth allocation mode.\nThe undo set service-mode card-bandwidth-mode command restores the default interface bandwidth allocation mode.\nBy default, the interface bandwidth allocation mode is pos-8x622M-mode.",
    "CLIs": [
        "set service-mode card-bandwidth-mode <bandmode-type> card <card-number>",
        "undo set service-mode card-bandwidth-mode card <card-number>",
        "undo set service-mode card-bandwidth-mode <bandmode-type> card <card-number>"
    ],
    "ParentView": [
        "Slot view"
    ],
    "ParaDef": [
        {
            "Parameters": "card card-number",
            "Info": "Specifies a subcard ID.\n-"
        },
        {
            "Parameters": "card-bandwidth-mode bandmode-type",
            "Info": "Specifies an interface bandwidth allocation mode.\nThe value is a string of characters. Available options are as follows:pos-8x622M-mode: 8 valid interfaces, with 622M bandwidth on each of the interfacespos-8x155M-mode: 8 valid interfaces, with 155M bandwidth on each of the interfacespos-4x2.5G-mode: 4 valid interfaces, with 2.5G bandwidth on each of the interfaces"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] slot 1",
            "[~HUAWEI-slot1] set service-mode card-bandwidth-mode pos-4x2.5G-mode card 2",
            "Warning: This command will change service-mode, causing service interruptions and configuration will be cleared. Please exercise caution when running this command. Continue? [Y/N]:"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nCR5D00E8GF72 subcard supports the following interface bandwidth allocation modes:\npos-8x622M-mode: 8 valid interfaces, with 622M bandwidth on each of the interfacespos-8x155M-mode: 8 valid interfaces, with 155M bandwidth on each of the interfacespos-4x2.5G-mode: 4 valid interfaces, with 2.5G bandwidth on each of the interfaces\nTo switch between these modes, run the set service-mode card-bandwidth-mode command.\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nSwitching the port bandwidth allocation mode will cause service interruptions and configuration deletion on non-auto-sensing ports. Therefore, exercise caution before switching the port bandwidth allocation mode."
}