{
    "PageTitle": "set service-mode forwarding-mode (system view)",
    "FuncDef": "The set service-mode forwarding-mode command allows you to set the forwarding mode of a device.\nBy default, the mode of a device is compatible.\nIf the first registered SFU is a 2T SFU, the device is auto-negotiated to work in enhanced mode, because 2T SFUs support only the enhanced mode.",
    "CLIs": [
        "set service-mode forwarding-mode { compatible | enhance }"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "compatible",
            "Info": "Compatible mode.\n-"
        },
        {
            "Parameters": "enhance",
            "Info": "Enhance mode.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] set service-mode forwarding-mode enhance",
            "Set forwarding-mode is success, please commit and reboot before other operations to avoid possible exception!",
            "[*HUAWEI] commit",
            "[~HUAWEI] quit",
            "<HUAWEI> save",
            "<HUAWEI> reboot"
        ]
    ],
    "ExtraInfo": "Device supports two forwarding mode: enhanced forwarding mode and compatible forwarding mode.\nThe enhanced forwarding mode applies to a scenario that requires high interface capacity. In this mode, you can insert only high-capacity boards, increasing the interface capacity of the entire device. When the system works in enhanced forwarding mode, the boards that do not support the enhanced forwarding mode are isolated and powered off.The compatible forwarding mode applies to a scenario that does not have requirements on the interface capacity of the device. In this mode, you can insert boards with multiple types of interface capacity. When the system works in compatible forwarding mode, the boards that do not support the compatible forwarding mode are isolated and powered off.To configure a required forwarding mode for a device, run the set service-mode forwarding-mode command"
}