{
    "PageTitle": "set energy-mode mode",
    "FuncDef": "The set energy-mode mode command configures an energy-saving mode for the Router.\nThe undo set energy-mode mode command restores the default configuration.\nBy default, the Router uses the basic energy-saving mode.",
    "CLIs": [
        "set energy-mode mode { basic | standard | deep | optimal }",
        "undo set energy-mode mode"
    ],
    "ParentView": [
        "System view",
        "Virtual access AP-ID view"
    ],
    "ParaDef": [
        {
            "Parameters": "basic",
            "Info": "Specifies the basic energy-saving mode.\n-"
        },
        {
            "Parameters": "standard",
            "Info": "Specifies the standard energy-saving mode.\n-"
        },
        {
            "Parameters": "deep",
            "Info": "Specifies the deep energy-saving mode.\n-"
        },
        {
            "Parameters": "optimal",
            "Info": "Specifies the optimal energy-saving mode.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] set energy-mode mode basic",
            "<HUAWEI> system-view",
            "[~HUAWEI] ap-id 1024",
            "[*HUAWEI-ap1024] set energy-mode mode basic"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAn energy-saving mode allows the router to disable some unused modules during the system running, reducing the router power consumption.\nEnergy-saving modes are as follows:\nStandard energy-saving mode: This mode allows the router to disable the default unused modules during the system running, without affecting the router running. This mode is applicable when the router is used as the network core device or when a large number of services are transmitted.Basic energy-saving mode: This mode allows the router to dynamically monitor each module's working status and disable or make unused modules hibernate.Deep energy-saving mode: When the basic energy-saving mode has been used, this mode allows the router to shut down or make unused components hibernate. In this mode, configurations of unused interfaces cannot be changed, and statistics collection status of unused interfaces cannot be checked. This mode applies only when the router's operating environment is stable and less burst traffic exists.\nIn deep energy-saving mode, packet loss occurs when a master/backup switchover is performed.\nOptimal energy-saving mode: This mode adds more dynamically monitoring feature. But it will affect the service performance since it reduces the device energy consumption.\n\nPrecautions\nIf the energy-saving mode has been enabled for the PM module using the set energy-saving pm enable command, the set energy-mode mode standard command cannot be configured. After the set energy-mode mode { deep | optimal } command is run when the energy-saving mode of the PM module is disabled, the energy-saving mode of the PM module is enabled automatically.\nIf the warm backup has been configured for SFUs using the set energy-saving sfu warm-backup enable command, the set energy-mode mode standard command cannot be configured.\nIn VS mode, this command is supported only by the admin VS."
}