{
    "PageTitle": "set cpu-reliability",
    "FuncDef": "The set cpu-reliability command specifies the level-1 alarm threshold, level-1 clear alarm threshold, level-2 alarm threshold, level-2 clear alarm threshold, and detection period of CPU overload.\nThe undo set cpu-reliability command restores the default configuration.\nBy default, the level-1 alarm threshold, level-1 clear alarm threshold, level-2 alarm threshold, level-2 clear alarm threshold, and detection period of CPU overload are 60, 50, 80, 70, and 60, respectively.",
    "CLIs": [
        "set cpu-reliability first-recover <first-recover-value> first-alarm <first-alarm-value> second-recover <second-recover-value> second-alarm <second-alarm-value> period <period-value> [ slave | slot <slot-id> ]",
        "undo set cpu-reliability [ slave | slot <slot-id> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "first-alarm first-alarm-value",
            "Info": "Specifies a level-1 alarm threshold.\nThe value is an integer ranging from 2 to 97. The default value is 60."
        },
        {
            "Parameters": "second-recover second-recover-value",
            "Info": "Specifies a level-2 clear alarm threshold.\nThe value is an integer ranging from 3 to 98. The default value is 70."
        },
        {
            "Parameters": "second-alarm second-alarm-value",
            "Info": "Specifies a level-2 alarm threshold.\nThe value is an integer ranging from 4 to 99. The default value is 80."
        },
        {
            "Parameters": "period period-value",
            "Info": "Specifies a detection period.\nThe value is an integer ranging from 30 to 3600, in seconds. The default value is 60."
        },
        {
            "Parameters": "slave",
            "Info": "Specifies the level-1 and level-2 alarm thresholds of CPU overload on the slave control board.\n-"
        },
        {
            "Parameters": "slot slot-id",
            "Info": "Specifies the level-1 and level-2 alarm thresholds of CPU overload on specified board.\n-"
        },
        {
            "Parameters": "first-recover first-recover-value",
            "Info": "Specifies a level-1 clear alarm threshold.\nThe value is an integer ranging from 1 to 96. The default value is 50."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] set cpu-reliability first-recover 10 first-alarm 30 second-recover 50 second-alarm 60 period 1000 slot 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure the level-1 alarm threshold, level-1 clear alarm threshold, level-2 alarm threshold, level-2 clear alarm threshold, and detection period of CPU overload, run the set cpu-reliability command based on deployed services.\nPrecautions\nThis command is supported only on the admin VS."
}