{
    "PageTitle": "set memory-usage threshold",
    "FuncDef": "The set memory-usage threshold command sets the overload threshold and alarm recovery threshold of memory usage.\nBy default, the overload threshold value of memory usage is 90, and the alarm recovery threshold of memory usage is 75.",
    "CLIs": [
        "set memory-usage threshold <threshold> [ restore <restore-threshold-value> ] [ slot <slot-id> ]",
        "undo set memory-usage threshold [ slot <slot-id> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "threshold threshold",
            "Info": "Specifies the overload threshold value of memory usage. Overload threshold value of memory usage = threshold-value/100.\nThe value is an integer ranging from 75 to 100."
        },
        {
            "Parameters": "restore restore-threshold-value",
            "Info": "Specifies the alarm recovery threshold of memory usage. Alarm recovery threshold of memory usage = restore-threshold-value/100.\nThe value is an integer ranging from 1 to threshold-value minus 3. The default value is recommended."
        },
        {
            "Parameters": "slot slot-id",
            "Info": "Specifies the slot ID of an interface board.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] set memory-usage threshold 80"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] set memory-usage threshold 80 slot 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA memory usage threshold is set, which helps monitor memory usage in time.\nConfiguration Impact\nWhen the memory usage reaches the overload threshold, the system triggers the SYSTEM_1.3.6.1.4.1.2011.5.25.129.2.6.1 hwStorageUtilizationRisingAlarm alarm.\nWhen the memory usage decreases to the non-overload threshold, the system triggers the SYSTEM_1.3.6.1.4.1.2011.5.25.129.2.6.2 hwStorageUtilizationResume alarm.\nPrecautions\nIf the overload threshold value of memory usage is set too small, the system will frequently trigger alarms. If the overload threshold value of memory usage is set too large, you cannot obtain information about high memory usage in time.\nIn a board replacement scenario, if the board types are different before and after the replacement, board configurations are re-reported after the replacement. As a result, original board configurations are lost, and the new board configurations are restored as default configurations.\nIn VS mode, this command is supported only by the admin VS."
}