{
    "PageTitle": "shield card-fault process-mode global-config enable card",
    "FuncDef": "The shield card-fault process-mode global-config enable card command prevents the set card-fault process-mode isolate and undo set card-fault process-mode isolate commands from taking effect on a specified subcard.\nThe undo shield card-fault process-mode global-config enable card command cancels the previous configuration.\nBy default, the port isolation function of a subcard inherits the configuration of the global port isolation function.",
    "CLIs": [
        "shield card-fault process-mode global-config enable card <card-id>",
        "undo shield card-fault process-mode global-config enable card <card-id>"
    ],
    "ParentView": [
        "Slot view"
    ],
    "ParaDef": [
        {
            "Parameters": "card card-id",
            "Info": "Specifies the ID of the subcard supporting the port isolation function.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] slot 1",
            "[~HUAWEI-slot-1] shield card-fault process-mode global-config enable card 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo prevent the set card-fault process-mode isolate and undo set card-fault process-mode isolate commands from taking effect on a specified subcard, run the shield card-fault process-mode global-config enable card command in the slot view.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nYou can configure the port isolation function for a subcard only after running the shield card-fault process-mode global-config enable card command for the subcard.If you run the undo shield card-fault process-mode global-config enable card command, the card-level port isolation function is disabled on the subcard. In this case, the effectiveness of the port isolation function on the subcard is the same as that of the global port isolation function.\n-\nThe undo shield card-fault process-mode global-config enable card and set card-fault process-mode isolate card commands are mutually exclusive. If the set card-fault process-mode isolate card command has been configured for a subcard, running the undo shield card-fault process-mode global-config enable card command for the subcard is not allowed."
}