{
    "PageTitle": "ipv6 route-static vpn-instance(vpn)",
    "FuncDef": "The ipv6 route-static vpn-instance command configures IPv6 static routes for an IPv6 address family-enabled VPN instance.\nThe undo ipv6 route-static vpn-instance command deletes the IPv6 static routes configured for an IPv6 address family-enabled VPN instance.\nBy default, no IPv6 static routes are configured for an IPv6 address family-enabled VPN instance.",
    "CLIs": [
        "ipv6 route-static vpn-instance <vpn-source-name> <dest-ipv6-address> <prefix-length> { vpn-instance <vpn-destination-name> <nexthop-ipv6-address> | <nexthop-ipv6-address> [ public ] } [ recursive-lookup host-route ] [ preference <preference> | tag <tag> ] * [ bfd enable | track { bfd-session <cfg-name> | nqa <admin-name> <test-name> } | permanent ] [ no-advertise | no-install ] [ inter-protocol-ecmp ] [ description <text> ]",
        "ipv6 route-static vpn-instance <vpn-source-name> <dest-ipv6-address> <prefix-length> { <interface-name> | <interface-type> <interface-number> } [ <nexthop-ipv6-address> ] [ preference <preference> | tag <tag> ] * [ bfd enable | track { bfd-session <cfg-name> | nqa <admin-name> <test-name> } | permanent ] [ no-advertise | no-install ] [ inter-protocol-ecmp ] [ description <text> ]",
        "ipv6 route-static vpn-instance <vpn-source-name> <dest-ipv6-address> <prefix-length> { vpn-instance <vpn-destination-name> <nexthop-ipv6-address> | <nexthop-ipv6-address> [ public ] } [ recursive-lookup host-route ] [ preference <preference> | tag <tag> ] * [ inherit-cost | permanent ] [ inter-protocol-ecmp ] [ description <text> ]",
        "ipv6 route-static vpn-instance <vpn-source-name> <dest-ipv6-address> <prefix-length> { vpn-instance <vpn-destination-name> | public } [ preference <preference> | tag <tag> ] [ no-advertise | no-install ] [ description <text> ]",
        "undo ipv6 route-static vpn-instance <vpn-source-name> <dest-ipv6-address> <prefix-length> [ { <interface-name> | <interface-type> <interface-number> } [ <nexthop-ipv6-address> ] | vpn-instance <vpn-destination-name> <nexthop-ipv6-address> | <nexthop-ipv6-address> [ public ] ]",
        "undo ipv6 route-static vpn-instance <vpn-source-name> <dest-ipv6-address> <prefix-length> { vpn-instance <vpn-destination-name> | public }"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-source-name",
            "Info": "Specifies the name of a source VPN instance. Each VPN instance has its own routing table. The configured static routes are added to the routing table of the specified VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "dest-ipv6-address",
            "Info": "Specifies a destination IPv6 address.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "prefix-length",
            "Info": "Specifies the length of an IPv6 prefix.\nIt is an integer ranging from 0 to 128."
        },
        {
            "Parameters": "vpn-instance vpn-destination-name",
            "Info": "Specifies the name of the destination VPN instance. If the name of the destination VPN instance is specified, a static route searches the destination VPN instance for an outbound interface based on the configured next hop address. If the nexthop-ipv6-address parameter is not configured, that is, the Next-Table function is configured. In this case, after receiving packets, the device searches the forwarding table of the source VPN instance for a forwarding entry with the destination VPN instance. Then, the device searches the forwarding table of the destination VPN instance for the corresponding forwarding entry.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "nexthop-ipv6-address",
            "Info": "Specifies the next hop IPv6 address of the device.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "public",
            "Info": "Indicates the public network address of a gateway. After a certain Router is configured in an IPv6 address family-enabled VPN instance, the next hop or the next hop gateway of the Router belongs to this IPv6 address family-enabled VPN instance and the public network. If the keyword public is specified in the command, the next hop is specified as a public network device.\n-"
        },
        {
            "Parameters": "recursive-lookup",
            "Info": "Recursive route lookup policy.\n-"
        },
        {
            "Parameters": "host-route",
            "Info": "Recurses the static route to a 128-bit host route.\n-"
        },
        {
            "Parameters": "preference preference",
            "Info": "Specifies the priority of a route.\nThe value is an integer ranging from 1 to 255. The default value is 60. The smaller the value, the higher the priority."
        },
        {
            "Parameters": "tag tag",
            "Info": "Specifies the tag attribute value of a static route. To implement different route management policies, you can configure different tag attribute values to classify static routes. For example, other protocols can import the static routes with specified tag attribute values based on a routing policy.\nThe value is an integer ranging from 1 to 4294967295. The default value is 0."
        },
        {
            "Parameters": "bfd",
            "Info": "Associates a dynamic BFD session with the static route to fast detect faults.\n-"
        },
        {
            "Parameters": "enable",
            "Info": "Associates a dynamic BFD session with the static route to fast detect faults.\n-"
        },
        {
            "Parameters": "track",
            "Info": "Specify a track object.\n-"
        },
        {
            "Parameters": "bfd-session cfg-name",
            "Info": "Associates a static BFD session with the static route to fast detect faults.\nThe undo ip route-static [ track bfd-session ] all command with track bfd-session cfg-name specified dissociates the static route from the current BFD session only without deleting the static route.\nThe value is a string of 1 to 64 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "nqa admin-name",
            "Info": "Associates the static route with an NQA test instance to fast detect faults so that the system determines whether to activate the static route based on the NQA link detection result to control route advertisement and guide remote traffic.\nCurrently, only ICMP NQA test instances can be bound to static routes to implement fast fault detection.\nThe value is a string of 1 to 32 case-sensitive characters."
        },
        {
            "Parameters": "test-name",
            "Info": "Associates the static route with an NQA test instance to fast detect faults so that the system determines whether to activate the static route based on the NQA link detection result to control route advertisement and guide remote traffic.\nCurrently, only ICMP NQA test instances can be bound to static routes to implement fast fault detection.\nThe value is a string of 1 to 32 case-sensitive characters."
        },
        {
            "Parameters": "permanent",
            "Info": "Configures permanent advertisement of the static route.\nIf service traffic needs to be forwarded along a specified path, regardless of the link status. you can specify permanent to configure permanent advertisement of static routes.\n-"
        },
        {
            "Parameters": "no-advertise",
            "Info": "Prevents static routes from being advertised.\nIn network maintenance scenarios, static routes are required to verify services. If you do not want these static routes to be imported by other protocols, specify no-advertise to prevent these static routes from being advertised.\nno-advertise takes effect only when it is configured for all the active static routes with the same destination address and mask.\nAfter this function is enabled, the static route can be imported to the BGP routing table but is not advertised to BGP peers.\n-"
        },
        {
            "Parameters": "no-install",
            "Info": "Prevents the static route from being delivered to the FIB.\n-"
        },
        {
            "Parameters": "inter-protocol-ecmp",
            "Info": "If a static route is the optimal or suboptimal route and the optimal and suboptimal routes share the same priority, the static route and the routes of dynamic routing protocols can participate in inter-protocol load balancing.\nIf inter-protocol load balancing among static routes and the routes of dynamic routing protocols is enabled for any static route in the routing table, the other static routes in the routing table that have the same prefix as that of this static route can also participate in inter-protocol load balancing with the routes of dynamic routing protocols.\nIntra-protocol and inter-process load balancing and inter-protocol load balancing are mutually exclusive. If you configure them both, the former takes effect.\nInter-protocol load balancing does not take effect in the following cases:\nAmong routes imported using the import-rib command and other routes.Among black-hole routes and non-black-hole routes.Among Vlink routes and non-Vlink routes.\n-"
        },
        {
            "Parameters": "description text",
            "Info": "Specifies the description of a static route.\nTo check the configured description, run the display this or display current-configuration command in the system view.\nThe description parameter cannot be followed by other parameters, such as bfd and preference. Otherwise, the configuration will be used only as the description. For example, if ipv6 route-static 2001:db8:1::1 128 NULL0 description aa preference 10 is run, aa preference 10 is used as the description.\nThe value is a string of 1 to 150 characters, spaces supported."
        },
        {
            "Parameters": "interface-type",
            "Info": "Specifies the type of an interface.\n-"
        },
        {
            "Parameters": "interface-number",
            "Info": "Specifies the number of an interface.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "dhcp",
            "Info": "Sets the IP address of a DHCP gateway as the next hop of the static route.\n-"
        },
        {
            "Parameters": "inherit-cost",
            "Info": "Enables a static route to inherit the cost of recursive routes.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ipv6-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv6] quit",
            "[*HUAWEI] ipv6 route-static vpn-instance vpn1 :: 0 2001:db8:1::1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure static routes for a simple IPv6 VPN, run the ipv6 route-static vpn-instance command.\nIf the destination address and mask of a static route are all 0s, the static route is a default route.\nPrerequisites\nA VPN instance has been created using the ip vpn-instance command.\nBFD has been enabled so that static routes can be associated with the BFD session.\nAn NQA test instance has been created so that static routes can be associated with the NQA test instance.\nConfiguration Impact\nA static route can be bound to only one BFD session. To bind a static route to another session, you need to unbind the static route from the current BFD session first.\nFollow-up Procedure\nIf a configured static route needs to be sent to the peer PE, import the static route into BGP running between the PEs.\nPrecautions\nIf a fault occurs on the network or the topology changes, static routes cannot automatically change. Therefore, exercise caution when configuring static routes.\nDuring the configuration of a static route for a VPN instance, nexthop-address can belong to a VPN instance or a public network. When the next hop address of the static route is a public network address, you need to specify public following nexthop-address.\nIf the outbound interface is a broadcast interface, you need to specify the next hop address.\nSuppose two static routes with the same destination IP address are both configured. One of the route has a next-hop IP address or outbound interface specified, and the Next-Table function is configured for the other static route, that is, only a VPN instance is specified for the route's next hop (with no outbound interface or next-hop IP address specified). In this case, if the two static routes have the same priority, the latter configured static route overwrites the previous one.\nFor static routes with the same prefix but different priorities, the following routes can be configured together:Static route with a specified next-hop IP address and static route with only a VPN instance specified for the route's next hop.Static route with a specified outbound interface and static route with only a VPN instance specified for the route's next hop.Multiple static routes with only VPN instances specified for their next hops.\n\nAfter the static route configuration is saved and the device is restarted in CFG mode, the configuration sequence in the configuration file may be different from that before the restart."
}