{
    "PageTitle": "ip route-static default-bfd",
    "FuncDef": "The ip route-static default-bfd command sets the global BFD parameters for a static route.\nThe undo ip route-static default-bfd command cancels the global BFD parameters of a static route.\nBy default, the minimum intervals at which BFD packets are received and sent is 10 ms, and the detection time multiplier is 3.",
    "CLIs": [
        "ip route-static default-bfd { min-rx-interval <min-rx-interval> | min-tx-interval <min-tx-interval> | detect-multiplier <multiplier> } *",
        "undo ip route-static default-bfd"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "min-rx-interval min-rx-interval",
            "Info": "Specifies the minimum interval at which BFD packets are received.\nThe value is an integer ranging from 3 to 20000, in milliseconds."
        },
        {
            "Parameters": "min-tx-interval min-tx-interval",
            "Info": "Specifies the minimum interval at which BFD packets are sent.\nThe value is an integer ranging from 3 to 20000, in milliseconds."
        },
        {
            "Parameters": "detect-multiplier multiplier",
            "Info": "Specifies the detection time multiplier.\nThe value is an integer ranging from 3 to 50."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip route-static default-bfd min-rx-interval 30"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo modify BFD parameters for static routes, run the ip route-static default-bfd command.\nConfiguration Impact\nIf BFD parameters are not configured for a static route, the default values set using the ip route-static default-bfd command are used.After the values of global BFD parameters are changed, you need to change the values of BFD parameters corresponding to all the static routes that use default values of BFD parameters.\n\nPrecautions\nAfter the values of global BFD parameters are changed, the values of BFD parameters corresponding to all the static routes that use default values of BFD parameters are changed."
}