{
    "PageTitle": "ipv6 route-static track bfd-session admindown invalid",
    "FuncDef": "The ipv6 route-static track bfd-session admindown invalid command prevents an IPv6 static route from being selected if the BFD session associated with it is in the AdminDown state.\nThe undo ipv6 route-static track bfd-session admindown invalid command restores the default configuration.\nBy default, an IPv6 static route can still be selected by the Router even though the BFD session associated with it is in the AdminDown state.",
    "CLIs": [
        "ipv6 route-static track bfd-session session-name <bfd-name> admindown invalid",
        "undo ipv6 route-static track bfd-session [ session-name <bfd-name> ] admindown invalid"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "session-name bfd-name",
            "Info": "Specifies a BFD session associated with an IPv6 static route.\nThe value is a string of 1 to 64 case-insensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bfd",
            "[*HUAWEI-bfd] quit",
            "[*HUAWEI] bfd bfda bind peer-ipv6 2001:db8:1::1",
            "[*HUAWEI-bfd-session-bfda] discriminator local 20",
            "[*HUAWEI-bfd-session-bfda] discriminator remote 10",
            "[*HUAWEI-bfd-session-bfda] commit",
            "[*HUAWEI-bfd-session-bfda] quit",
            "[*HUAWEI] ipv6 route-static track bfd-session session-name bfda admindown invalid"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, an IPv6 static route can still be selected by the Huawei devices even though the BFD session associated with it is in the AdminDown state, but not by non-Huawei devices. As a result, the Huawei devices cannot interwork with non-Huawei devices.\nTo address this problem, run the ipv6 route-static track bfd-session admindown invalid command to configure the Router not to select the IPv6 static route if the BFD session associated with it is in the AdminDown state.\nPrerequisites\nThe BFD session specified by bfd-name has been created.\nPrecautions\nThe undo ipv6 route-static track bfd-session admindown invalid command enables all IPv6 static routes to be selected by the Router even though the BFD sessions associated with them are in the AdminDown state."
}