{
    "PageTitle": "ipv6 route-static default-bfd",
    "FuncDef": "The ipv6 route-static default-bfd command configures global default BFD parameters for IPv6 static routes.\nThe undo ipv6 route-static default-bfd command cancels the global default BFD parameters configured for IPv6 static routes.\nBy default, the minimum interval at which BFD control packets are received and sent is 10 ms, and the detection time multiplier is 3.",
    "CLIs": [
        "ipv6 route-static default-bfd { min-rx-interval <min-rx-interval> | min-tx-interval <min-tx-interval> | detect-multiplier <multiplier> } *",
        "undo ipv6 route-static default-bfd"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "min-rx-interval min-rx-interval",
            "Info": "Specifies the minimum interval at which BFD control packets are received.\nThe value is an integer ranging from 3 to 20000, in milliseconds."
        },
        {
            "Parameters": "min-tx-interval min-tx-interval",
            "Info": "Specifies the minimum interval at which BFD control packets are sent.\nThe value is an integer ranging from 3 to 20000, in milliseconds."
        },
        {
            "Parameters": "detect-multiplier multiplier",
            "Info": "Specifies the detection time multiplier.\nThe value is an integer ranging from 3 to 50."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 route-static default-bfd min-rx-interval 30"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure global default BFD parameters for IPv6 static routes, run the ipv6 route-static default-bfd command.\nConfiguration Impact\ndetect-multiplier, min-rx-interval, and min-tx-interval are independent of each other. Specifically, if the ipv6 route-static bfd command is used to change only one of the three BFD parameters, the other two parameters continue to use their default values.\nPrecautions\nAfter the ipv6 route-static default-bfd command is run on a device, the global default BFD parameters of all IPv6 static routes bound to the BFD session on the device are modified."
}