{
    "PageTitle": "ipv6 route-static bfd",
    "FuncDef": "The ipv6 route-static bfd command sets BFD parameters for an IPv6 static route.\nThe undo ipv6 route-static bfd command deletes the BFD parameters set for an IPv6 static route.\nBy default, no BFD parameters are configured for an IPv6 static route.",
    "CLIs": [
        "ipv6 route-static bfd { <interface-name> | <interface-type> <interface-number> } <nexthop-address> [ local-address <ipv6-address> ] [ min-rx-interval <min-rx-interval> | min-tx-interval <min-tx-interval> | detect-multiplier <multiplier> ] *",
        "ipv6 route-static bfd [ vpn-instance <vpn-instance-name> ] <nexthop-address> local-address <ipv6-address> [ min-rx-interval <min-rx-interval> | min-tx-interval <min-tx-interval> | detect-multiplier <multiplier> ] *",
        "undo ipv6 route-static bfd { <interface-name> | <interface-type> <interface-number> } <nexthop-address>",
        "undo ipv6 route-static bfd [ vpn-instance <vpn-instance-name> ] <nexthop-address>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "interface-type",
            "Info": "Specifies the type of an interface.\n-"
        },
        {
            "Parameters": "interface-number",
            "Info": "Specifies the number of an interface.\n-"
        },
        {
            "Parameters": "nexthop-address",
            "Info": "Specifies a next hop IPv6 address.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "local-address ipv6-address",
            "Info": "Specifies the local IPv6 address.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "min-rx-interval min-rx-interval",
            "Info": "Specifies the minimum interval at which BFD control packets are received.\nThe value is an integer ranging from 3 to 20000, in milliseconds. The default value is 10."
        },
        {
            "Parameters": "min-tx-interval min-tx-interval",
            "Info": "Specifies the minimum interval at which BFD control packets are sent.\nThe value is an integer ranging from 3 to 20000, in milliseconds. The default value is 10."
        },
        {
            "Parameters": "detect-multiplier multiplier",
            "Info": "Specifies the detection time multiplier.\nThe value is an integer ranging from 3 to 50. The default value is 3."
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies the name of the VPN instance to which the next hop address belongs.\nThe value is a string of 1 to 31 case-sensitive characters, spaces and question marks are not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 route-static bfd 2001:db8:1::1 local-address 2001:db8:2::1 min-rx-interval 30"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo set BFD parameters for a single IPv6 static route, run the ipv6 route-static bfd command.\nImplementation Procedure\nWhen setting BFD parameters for an IPv6 static route in the system view, you need to specify the outbound interface or the next hop of the IPv6 static route.\nConfiguration Impact\nAfter BFD parameters are modified, the BFD parameters of all IPv6 static routes are updated.\nIf BFD parameters are configured, but the local-address ipv6-address parameter is not, BFD sessions may fail to be negotiated.\nIf the undo ipv6 route-static bfd command is run, the static route is unbound from all BFD sessions. Therefore, exercise caution when running the command.\nPrecautions\nWhen configuring BFD for a single IPv6 static route, check whether BFD parameters are set for the IPv6 static route.Search for BFD parameters of a single IPv6 unicast route based on the outbound interface, next hop address, or the IPv6 address family-enabled VPN instance to which the next hop address of the route belongs.If none of min-rx-interval, min-tx-interval, or detect-multiplier is specified, the global default values of BFD parameters are used.When you configure BFD parameters for a static VPN route, specifying a VPN instance and specifying an outbound interface are mutually exclusive. If an outbound interface is specified in this configuration, the VPN instance created on the next hop is used as the VPN instance bound to the outbound interface."
}