{
    "PageTitle": "ip route recursive-lookup bgp-vpnv4-route",
    "FuncDef": "The ip route recursive-lookup bgp-vpnv4-route enable command enables a static route to recurse to a cross route on the remote VPN.\nThe ip route recursive-lookup bgp-vpnv4-route disable command disables a static route from recursing to a cross route on the remote VPN.\nThe undo ip route recursive-lookup bgp-vpnv4-route disable command enables a static route to recurse to a cross route on the remote VPN.\nBy default, a static route can recurse to a cross route on the remote VPN.",
    "CLIs": [
        "ip route recursive-lookup bgp-vpnv4-route { enable | disable }",
        "undo ip route recursive-lookup bgp-vpnv4-route disable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] undo ip route recursive-lookup bgp-vpnv4-route disable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip route recursive-lookup bgp-vpnv4-route disable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA static route needs recursion if its next hop is indirect. To enable the static route to recurse to a cross route on the remote VPN, run the ip route recursive-lookup bgp-vpnv4-route enable command. If a static route recurses to a cross route on the remote VPN, the static route can inherit the label and tunnel ID of the cross route. Then, the device can forward data through the tunnel to which the static route recurses. For configurations details, see Configuration-BGP/MPLS IP VPN Configuration-Configuring Route Recursion to Remotely Leaked VPN Routes.\nPrecautions\nThe ip route recursive-lookup bgp-vpnv4-route enable command and undo ip route recursive-lookup bgp-vpnv4-route disable command have the same function and do not generate configuration information.\nThis command allows IPv4 static routes to recurse to VPN remote cross routes, not applicable to IPv6 static routes. To allow IPv6 static routes to recurse to VPN remote cross routes, run the ipv6 route recursive-lookup inherit-label-route enable command."
}