{
    "PageTitle": "route recursive-lookup tunnel",
    "FuncDef": "The route recursive-lookup tunnel command enables tunnel recursion.\nThe undo route recursive-lookup tunnel command restores the default configuration.\nBy default, tunnel recursion is disabled.",
    "CLIs": [
        "route recursive-lookup tunnel [ ip-prefix <ip-prefix-name> ] [ tunnel-policy <policy-name> ]",
        "undo route recursive-lookup tunnel"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-prefix ip-prefix-name",
            "Info": "Specifies the name of an IP prefix list.\nThe name is a string of 1 to 169 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "tunnel-policy policy-name",
            "Info": "Specifies the name of a tunnel policy.\nThe value is a string of 1 to 39 case-sensitive characters, spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip ip-prefix px1 permit 10.0.192.0 8 greater-equal 17 less-equal 18",
            "[*HUAWEI] tunnel-policy tp1",
            "[*HUAWEI-tunnel-policy-tp1] tunnel select-seq cr-lsp lsp load-balance-number 2",
            "[*HUAWEI-tunnel-policy-tp1] quit",
            "[*HUAWEI] route recursive-lookup tunnel ip-prefix px1 tunnel-policy tp1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, a IPv4 static route or an unlabeled BGP IPv4 public route can only recurse to an outbound interface or next hop but not to a tunnel. To allow such a route to preferentially recurse to a tunnel, run the\nroute recursive-lookup tunnel command. If no tunnel exists, the route can still recurse to an outbound interface or next hop.\nIf the tunnel-policy policy-name parameter is specified, a tunnel policy is used to recurse routes to a specific tunnel. For details about applying a tunnel policy, see Configuration > VPN > VPN Tunnel Management Configuration > Configuring and Applying a Tunnel Policy in the product documentation.If the tunnel-policy policy-name parameter is not specified, all the unlabeled public BGP routes and static routes are recursed to a tunnel in the following order of preference: LDP LSP > BGP LSP > static LSP > SR-MPLS BE LSP.If the ip-prefix ip-prefix-name parameter is specified, only the unlabeled public BGP routes or static routes that pass an IP prefix list can be recursed to a tunnel.\n\nPrecautions\nIf the route recursive-lookup tunnel command is run more than once, the latest configuration overrides the previous one.\nA static route preferentially recurses to an IP route. If a static route recurses to a BGP route, the static route no longer recurses to a tunnel. If a static route recurses to a direct route, the static route no longer recurses to a tunnel. If a static route recurses to a non-BGP and non-direct route, the static route finally recurses to a tunnel based on the tunnel policy. If the static route recurses to a network segment, not to a host route, the network segment address is used to subscribe to a tunnel. Therefore, a non-BGP and non-direct route to the next hop of a static route must exist so that the static route recurses to a tunnel (public network tunnel). If a BGP LSP tunnel exists in the tunnel iteration result, the BGP LSP tunnel is discarded. If other types of tunnels are included in the iteration result, select other types of tunnels. Otherwise, select the IP iteration result."
}