{
    "PageTitle": "display segment-routing local-block",
    "FuncDef": "The display segment-routing local-block command displays the available range of segment routing local block (SRLB).",
    "CLIs": [
        "display segment-routing local-block <rangecount>"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "rangecount",
            "Info": "Specifies the SRLB range.\nThe value is an integer ranges from 2 to 65535."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display segment-routing local-block 5000",
            "           Segment Routing Local Block Information",
            "      -------------------------------------------------",
            "    ",
            "  Begin Value         End Value           Range       ",
            "-------------------------------------------------------------",
            "  48120               152770              104651              ",
            "  156502              212657              56156               ",
            "  212979              321535              108557              ",
            "  524288              1048575             524288"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe display segment-routing local-block command is used to view the available range of SRLB. The result of the segment range is greater than or equal to rangecount, including: minimum SID value, maximum SID value, and total number of SID available. Currently, up to 10 available dynamic segment ranges are displayed. If the query result does not meet the requirements, you can re-query by adjusting the rangecount parameter.\nPrecautions\nAfter the local-block ignore-conflict command is run to configure a Segment Routing Local Block (SRLB), the available SRLB displayed in the display segment-routing local-block command output may be different from the configured SRLB. This is a result of a label conflict, in which the specified label range contains labels in use. Due to the ignore-conflict specification, the local-block command configuration is forcibly delivered; however, labels in the specified range are not reserved locally. As a result, the available SRLB displayed in the command output is incorrect. To resolve this issue, restart the device and then run the display segment-routing local-block command again."
}