{
    "PageTitle": "mpls te path verification enable (MPLS view)",
    "FuncDef": "The mpls te path verification enable command enables path verification for SR-MPLS TE tunnels. If a label is defective, a device can set the LSP that uses the label to Down.\nThe undo mpls te path verification enable command disables path verification for SR-MPLS TE tunnels. If a label is defective, a device cannot set the LSP that uses the label to Down.\nBy default, path verification is disabled for SR-MPLS TE tunnels.",
    "CLIs": [
        "mpls te path verification enable",
        "undo mpls te path verification enable"
    ],
    "ParentView": [
        "MPLS view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls lsr-id 1.1.1.1",
            "[*HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] mpls te path verification enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nSR-MPLS TE cannot detect tunnel status changes by itself. SR-MPLS TE uses the controller or BFD to detect status changes. If neither a controller nor BFD is available, run the mpls te path verification enable command to enable path verification for SR-MPLS TE tunnels. With this function enabled, if a label becomes defective, the device sets the LSP that uses the label in an SR-MPLS TE tunnel to Down, preventing a traffic blackhole caused by a tunnel fault.\nIf a controller or BFD is configured, run the undo mpls te path verification enable command to disable path verification.\nPrerequisites\nMPLS TE has been enabled globally using the mpls te command.\nPrecautions\nThe MPLS view is used for global configuration, whereas the tunnel interface view is for local configuration. The configuration in the tunnel interface view takes percendence over that in the MPLS view. If a configuration in the MPLS view conflicts with that in the tunnel interface view, the configuration in the tunnel interface view takes effect.\nPath verification takes effect only on SR-MPLS TE tunnels."
}