{
    "PageTitle": "ti-lfa enable",
    "FuncDef": "The ti-lfa enable command enables OSPF topology independent-loop free alternate (TI-LFA).\nThe undo ti-lfa enable command disables OSPF TI-LFA.\nBy default, OSPF TI-LFA is disabled.",
    "CLIs": [
        "ti-lfa enable",
        "undo ti-lfa enable"
    ],
    "ParentView": [
        "OSPF FRR view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospf 1",
            "[*HUAWEI-ospf-1] frr",
            "[*HUAWEI-ospf-1-frr] loop-free-alternate",
            "[*HUAWEI-ospf-1-frr] ti-lfa enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn some LFA or RLFA scenarios, the P space and Q space do not share nodes or have direct neighbors. If a link or node fails, no backup path can be calculated, causing traffic loss and a failure to meet reliability requirements.\nTo satisfy network reliability requirements, TI-LFA is configured to pre-calculate backup links. If a fault occurs, traffic rapidly switches to a backup link before convergence on the control plane is complete. The TI-LFA algorithm is used to calculate the backup links. This algorithm excludes the next hop on the primary LSP or the primary link, re-calculates a shortest path tree (also called a post-convergence tree), and selects a P node and a Q node along the tree. Based on the P and Q node information (see TI-LFA FRR), a label stack for a backup tunnel is generated, directing traffic to be forwarded to the Q node through the tunnel. Upon receipt of a packet, the Q node searches the SR label forwarding table for traffic forwarding based on labels in the packet header.\nPrerequisites\nBefore configuring this command, you need to complete the following configurations:\nGlobal Segment Routing has been enabled using the segment-routing command.FRR has been enabled and the FRR view has been displayed using the frr command.OSPF LFA has been enabled using the loop-free-alternate command."
}