{
    "PageTitle": "bfd enable (Segment routing view)",
    "FuncDef": "The bfd enable command enables bidirectional forwarding detection (BFD) for SR-MPLS BE tunnels created by the SEGR module.\nThe undo bfd enable command disables BFD for SR-MPLS BE tunnels created by the SEGR module.\nBy default, this function is disabled.",
    "CLIs": [
        "bfd enable mode tunnel [ [ filter-policy ip-prefix <ip-prefix-name> ] | [ effect-sr-lsp ] | [ nil-fec ] ] *",
        "undo bfd enable mode tunnel [ [ filter-policy ip-prefix <ip-prefix-name> ] | [ effect-sr-lsp ] | [ nil-fec ] ] *"
    ],
    "ParentView": [
        "Segment routing view"
    ],
    "ParaDef": [
        {
            "Parameters": "filter-policy",
            "Info": "Indicates a filter policy.\n-"
        },
        {
            "Parameters": "ip-prefix ip-prefix-name",
            "Info": "Specifies an IP prefix list.\nThe name is a string of 1 to 169 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "effect-sr-lsp",
            "Info": "Specifies whether to affect the SR LSP.\nIf the effect-sr-lsp parameter is specified, if BFD Down, SEGR module cancels the SR LSP.\n-"
        },
        {
            "Parameters": "nil-fec",
            "Info": "Specifies whether to use nil FEC.\nIn an SR and LDP interworking scenario, the ingress node cannot detect whether LDP LSPs are stitched to SR LSPs in the LDP to SR direction. In the LSP ping packet triggered by BFD, the encapsulated FEC type is LDP. When the packet arrives at the egress node (SR node), the FEC type fails to be verified, preventing BFD from going Up. To resolve this issue, configure the nil-fec parameter.\n-"
        },
        {
            "Parameters": "mode",
            "Info": "Indicates SBFD mode.\n-"
        },
        {
            "Parameters": "tunnel",
            "Info": "Indicates SR-MPLS BE tunnels.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bfd",
            "[*HUAWEI-bfd] quit",
            "[*HUAWEI] segment-routing",
            "[*HUAWEI-segment-routing] bfd enable mode tunnel"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo enable BFD for SR-MPLS BE tunnels created by the SEGR module, run the bfd enable command, which improves reliability.\nPrerequisites\nBFD has been enabled using the bfd command."
}