{
    "PageTitle": "seamless-bfd enable mode tunnel",
    "FuncDef": "The seamless-bfd enable mode tunnel command configures seamless bidirectional forwarding detection (SBFD) for SR-MPLS BE tunnels.\nThe undo seamless-bfd enable mode tunnel command deletes the SBFD function for SR-MPLS BE tunnels.\nBy default, the SBFD function is disabled for SR-MPLS BE tunnels.",
    "CLIs": [
        "seamless-bfd enable mode tunnel [ [ filter-policy ip-prefix <ip-prefix-name> ] | [ effect-sr-lsp ] ] *",
        "undo seamless-bfd enable mode tunnel [ [ filter-policy ip-prefix <ip-prefix-name> ] | [ effect-sr-lsp ] ] *"
    ],
    "ParentView": [
        "Segment routing view"
    ],
    "ParaDef": [
        {
            "Parameters": "filter-policy",
            "Info": "Indicates a filter policy.\n-"
        },
        {
            "Parameters": "ip-prefix ip-prefix-name",
            "Info": "Specifies an IP prefix list.\nThe name is a string of 1 to 169 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "effect-sr-lsp",
            "Info": "Specify whether to affect the SR LSP.\nIf the effect-sr-lsp parameter is specified, if SBFD Down, SEGR module cancels the SR LSP.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bfd",
            "[*HUAWEI-bfd] quit",
            "[*HUAWEI] sbfd",
            "[*HUAWEI-sbfd] quit",
            "[*HUAWEI] segment-routing",
            "[*HUAWEI-segment-routing] seamless-bfd enable mode tunnel"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBidirectional forwarding detection (BFD) techniques are mature. When a large number of BFD sessions are configured to monitor links, the negotiation time of the existing BFD state machine is lengthened. In this situation, seamless bidirectional forwarding detection (SBFD) can be configured to monitor SR tunnels. It is a simplified BFD state machine that shortens the negotiation time and improves network-wide flexibility. To enable SBFD to monitor SR-MPLS BE tunnels, run the seamless-bfd enable mode tunnel command.\nPrerequisites\nBFD and SBFD have been enabled using the bfd and sbfd commands, respectively."
}