{
    "PageTitle": "seamless-bfd tunnel",
    "FuncDef": "The seamless-bfd tunnel command sets seamless bidirectional forwarding detection (SBFD) parameters for Segment Routing tunnels.\nThe undo seamless-bfd tunnel command deletes SBFD parameters for Segment Routing tunnels.\nBy default, no SBFD parameters are set for Segment Routing tunnels.",
    "CLIs": [
        "seamless-bfd tunnel { min-tx-interval <transmit-interval> | min-rx-interval <receive-interval> | detect-multiplier <multiplier-value> } *",
        "undo seamless-bfd tunnel { min-tx-interval [ <transmit-interval> ] | min-rx-interval [ <receive-interval> ] | detect-multiplier [ <multiplier-value> ] } *"
    ],
    "ParentView": [
        "Segment routing view"
    ],
    "ParaDef": [
        {
            "Parameters": "min-tx-interval transmit-interval",
            "Info": "Specifies the minimum interval at which BFD packets are sent to the peer end.\nThe value is an integer ranging from 3 to 20000, in milliseconds. The default value is 10."
        },
        {
            "Parameters": "min-rx-interval receive-interval",
            "Info": "Specifies the minimum interval at which BFD packets are received.\nIn the SBFD scenario, the min-rx-interval <receive-interval> parameter will not take effect.\nThe value is an integer ranging from 3 to 20000, in milliseconds. The default value is 10."
        },
        {
            "Parameters": "detect-multiplier multiplier-value",
            "Info": "Specifies the local detection multiplier.\nThe value is an integer ranging from 3 to 50. The default value is 3."
        },
        {
            "Parameters": "tunnel",
            "Info": "Indicates Segment Routing tunnels.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bfd",
            "[*HUAWEI-bfd] quit",
            "[*HUAWEI] sbfd",
            "[*HUAWEI-sbfd] quit",
            "[*HUAWEI] segment-routing",
            "[*HUAWEI-segment-routing] seamless-bfd enable mode tunnel",
            "[*HUAWEI-segment-routing] seamless-bfd tunnel min-tx-interval 300"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBidirectional forwarding detection (BFD) techniques are mature. When a large number of BFD sessions are configured to monitor links, the negotiation time of the existing BFD state machine is lengthened. In this situation, seamless bidirectional forwarding detection (SBFD) can be configured to monitor SR tunnels. It is a simplified BFD state machine that shortens the negotiation time and improves network-wide flexibility. To adjust SBFD parameters, run the seamless-bfd tunnel command in the Segment Routing view to adapt to various networks.\nPrerequisites\nThe bfd, sbfd and seamless-bfd enable commands have been run."
}