{
    "PageTitle": "segment-routing global-block (IS-IS view)",
    "FuncDef": "The segment-routing global-block command configures a segment routing global block (SRGB).\nThe undo segment-routing global-block command deletes an SRGB.\nBy default, no SRGB is configured.",
    "CLIs": [
        "segment-routing global-block <begin-value> <end-value>",
        "undo segment-routing global-block [ <begin-value> <end-value> ]"
    ],
    "ParentView": [
        "IS-IS view"
    ],
    "ParaDef": [
        {
            "Parameters": "begin-value",
            "Info": "Specifies the beginning value of Segment Routing global block (SRGB).\nThe value changes dynamically, depending on the actual situation of the equipment."
        },
        {
            "Parameters": "end-value",
            "Info": "Specifies the end value of Segment Routing global block (SRGB).\nThe value changes dynamically, depending on the actual situation of the equipment."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] segment-routing",
            "[*HUAWEI-segment-routing] quit",
            "[*HUAWEI] isis 1",
            "[*HUAWEI-isis-1] cost-style wide",
            "[*HUAWEI-isis-1] segment-routing mpls",
            "[*HUAWEI-isis-1] segment-routing global-block 153616 153800"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure an SRGB in an existing IGP instance, run the segment-routing global-block command.\nPrerequisites\nConfigure IS-IS process first.\nEnable the segment-routing in system-view.\nPrecautions\nWithout this command, segment-routing does not work properly, but all segment-routing configurations can be operated normally and are not affected.When modifying SRGB, you need to delete the SRGB configuration first. If the undo segment-routing global-block command is run, the original service flaps.As the next hop of the SR route cannot be iterated to the tunnel interface, if the current OSPF process is enabled on a tunnel interface of the type FA and SRGB is configured, the SR label traffic may be discarded.This command does not support IS-IS multi-topology."
}