{
    "PageTitle": "segment-routing lsp-trigger (IS-IS view)",
    "FuncDef": "The segment-routing lsp-trigger command configures a policy for establishing SR-MPLS BE LSPs on the ingress.\nThe undo segment-routing lsp-trigger command restores the default configuration.\nBy default, the ingress establishes SR-MPLS BE LSPs over IP routes with 32-bit masks.",
    "CLIs": [
        "segment-routing lsp-trigger { host | none }",
        "segment-routing lsp-trigger ip-prefix <ip-prefix-name>",
        "undo segment-routing lsp-trigger [ host | none ]",
        "undo segment-routing lsp-trigger [ ip-prefix <ip-prefix-name> ]"
    ],
    "ParentView": [
        "IS-IS view"
    ],
    "ParaDef": [
        {
            "Parameters": "host",
            "Info": "Specifies to trigger SR-MPLS BE LSPs for host routes with 32-bit addresses.\n-"
        },
        {
            "Parameters": "none",
            "Info": "Indicates that SR-MPLS BE LSP establishment is not triggered.\n-"
        },
        {
            "Parameters": "ip-prefix ip-prefix-name",
            "Info": "Allows the ingress to use an IP prefix list to establish SR-MPLS BE LSPs.\nThe value is a string of 1 to 169 case-sensitive characters, spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] segment-routing",
            "[*HUAWEI-segment-routing] quit",
            "[*HUAWEI] isis 1",
            "[*HUAWEI-isis-1] cost-style wide",
            "[*HUAWEI-isis-1] segment-routing mpls",
            "[*HUAWEI-isis-1] segment-routing lsp-trigger none"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter Segment Routing is enabled, a great number of devices establish excessive SR-MPLS BE LSPs, leading to resource wastes. To prevent resource wastes, a policy for establishing SR-MPLS BE LSPs can be configured.\nThe segment-routing lsp-trigger command configures a policy to allow the ingress to use specified routes to establish SR-MPLS BE LSPs. This prevents unwanted SR-MPLS BE LSPs from being established and reduces resource wastes.\nPrerequisites\nIf ip-prefix is to be used, an IP prefix list must have been created using the ip ip-prefix command.\nPrecautions\nThe segment-routing lsp-trigger command takes effect on the ingress, not on transit nodes or the egress."
}