{
    "PageTitle": "mpls te reverse-lsp binding-sid",
    "FuncDef": "The mpls te reverse-lsp binding-sid command sets a binding SID for a reverse SR-MPLS TE tunnel.\nThe undo mpls te reverse-lsp binding-sid command deletes a binding SID for a reverse SR-MPLS TE tunnel.\nBy default, no binding SID is set for a reverse SR-MPLS TE tunnel.",
    "CLIs": [
        "mpls te reverse-lsp binding-sid label <label-value>",
        "undo mpls te reverse-lsp binding-sid [ label <label-value> ]"
    ],
    "ParentView": [
        "Tunnel interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "label label-value",
            "Info": "Specifies the binding SID label value of a reverse LSP in an SR-MPLS TE tunnel.\nThe value is an integer ranging from 16 to 1048575."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls lsr-id 1.1.1.1",
            "[*HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] interface tunnel 1",
            "[*HUAWEI-Tunnel1] tunnel-protocol mpls te",
            "[*HUAWEI-Tunnel1] mpls te signal-protocol segment-routing",
            "[*HUAWEI-Tunnel1] mpls te reverse-lsp binding-sid label 2000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA forward LSP and a reverse LSP between two nodes are established. Each LSP is bound to the ingress of its reverse CR-LSP. The two LSPs then form an associated bidirectional tunnel. The associated bidirectional tunnel is primarily used to prevent traffic congestion. If a fault occurs on one end, the other end is notified of the fault so that both ends trigger traffic switchovers, which ensures that traffic transmission is uninterrupted.\nTo set a binding SID for a reverse LSP in an SR-MPLS TE tunnel, run the mpls te reverse-lsp binding-sid command. Using binding BIDs reduces the number of labels in a label stack on an NE, which helps build a large-scale network. The controller uses both binding SIDs and BGP peer SIDs to compute a path over which an inter-AS E2E SR-MPLS TE tunnel is established.\nPrecautions\nBinding SIDs are set only on SR-MPLS TE tunnels. If binding SIDs are referenced by an explicit path, they cannot be modified or deleted, and the tunnel type cannot be modified."
}