{
    "PageTitle": "ipv4 adjacency",
    "FuncDef": "The ipv4 adjacency command configures a static adjacency segment ID (SID) for the segment routing connection to be established between the local and remote interfaces.\nThe undo ipv4 adjacency command deletes the static adjacency SID configured for the segment routing connection to be established between the local and remote interfaces.\nBy default, no static adjacency SID is configured for the segment routing connection to be established between the local and remote interfaces.",
    "CLIs": [
        "ipv4 adjacency local-ip-addr <local-ip-address> remote-ip-addr <remote-ip-address> sid <sid-value>",
        "undo ipv4 adjacency local-ip-addr <local-ip-address> remote-ip-addr <remote-ip-address> sid <sid-value>"
    ],
    "ParentView": [
        "Segment routing view"
    ],
    "ParaDef": [
        {
            "Parameters": "remote-ip-addr remote-ip-address",
            "Info": "Specifies the IP address of the remote interface.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "sid sid-value",
            "Info": "Specifies a static adjacency SID.\nThe value is an integer ranging from 321536 to 331775."
        },
        {
            "Parameters": "local-ip-addr local-ip-address",
            "Info": "Specifies the IP address of the local interface.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] segment-routing",
            "[*HUAWEI-segment-routing] ipv4 adjacency local-ip-addr 1.1.1.1 remote-ip-addr 1.1.1.2 sid 330000",
            "[*HUAWEI-segment-routing] ipv4 adjacency local-ip-addr 10.2.1.1 remote-ip-addr 10.2.1.2 sid 330000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter segment routing is enabled, an adjacency SID needs to be configured for the segment routing link to be established between the local and remote interfaces.\nConfiguration Impact\nRunning the command may cause the tunnel to go Down.\nPrecautions\nIf no direct routes are available on the local interface specified by local-ip-addr local-ip-address, no forwarding entries will be generated.\nThe SID can be reused. When the same static SID is configured for multiple adjacencies, it is called a parallel adjacency SID. The parallel adjacency SID can be flooded by the IS-IS protocol and can be advertised to the BGP LS and then reported to the controller through the BGP LS.Up to 6 static SIDs can be configured for the current one adjacency."
}