{
    "PageTitle": "avoid-microloop segment-routing rib-update-delay (OSPF view)",
    "FuncDef": "The avoid-microloop segment-routing rib-update-delay command sets a delay in delivering OSPF routes in Segment Routing.\nThe undo avoid-microloop segment-routing rib-update-delay command deletes a delay in delivering OSPF routes in Segment Routing.\nBy default, the delay in delivering routes in Segment Routing is 5000 ms.",
    "CLIs": [
        "avoid-microloop segment-routing rib-update-delay <rib-update-delay>",
        "undo avoid-microloop segment-routing rib-update-delay",
        "undo avoid-microloop segment-routing rib-update-delay <rib-update-delay>"
    ],
    "ParentView": [
        "OSPF view"
    ],
    "ParaDef": [
        {
            "Parameters": "rib-update-delay",
            "Info": "Sets a delay in delivering routes.\nThe value is an integer ranging from 1000 to 60000, in milliseconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] segment-routing",
            "[*HUAWEI-segment-routing] quit",
            "[*HUAWEI] ospf 1",
            "[*HUAWEI-ospf-1] opaque-capability enable",
            "[*HUAWEI-ospf-1] segment-routing mpls",
            "[*HUAWEI-ospf-1] avoid-microloop segment-routing rib-update-delay 6000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a network fault occurs or is rectified, an IGP performs route convergence. A transient forwarding status inconsistency between nodes results in different convergence rates on devices, which poses the risk of micro-loops. After anti-micro loop is enabled for Segment Routing, the ingress forwards packets strictly along an explicit path during IGP convergence. The forwarding is irrelevant to IGP convergence of devices, which prevents loops. To set a delay in delivering IS-IS/OSPF routes in Segment Routing, run the avoid-microloop segment-routing rib-update-delay command.\nConfiguration Impact\nAfter the avoid-microloop segment-routing command is enabled, route convergence is delayed according to the time configured by the avoid-microloop segment-routing rib-update-delay command. During the route convergence delay, data traffic is forwarded according to the strict label stack."
}