{
    "PageTitle": "mpls te backup active-standby",
    "FuncDef": "The mpls te backup active-standby command enables the active/standby mode for a tunnel association group.\nThe undo mpls te backup active-standby command restores the default configuration.\nBy default, the active/standby mode is not enabled.",
    "CLIs": [
        "mpls te backup active-standby",
        "mpls te backup active-standby wtr <active-standby_wtr>",
        "undo mpls te backup active-standby",
        "undo mpls te backup active-standby wtr [ <active-standby_wtr> ]"
    ],
    "ParentView": [
        "TE tunnel association group view"
    ],
    "ParaDef": [
        {
            "Parameters": "wtr active-standby_wtr",
            "Info": "Configure the Wait-to-Restore time.\nThe value is an integer that ranges from 0 to 2592000, in seconds, and the default value is 300."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls te associate-tunnel-group 1",
            "[*HUAWEI-te-associate-group-1] mpls te backup active-standby"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter the active/standby mode is enabled for the tunnel association group, the original tunnel and split tunnels use the active/standby mode instead of the default load balancing mode.\nSplit tunnels are sorted based on a certain rule. For example, they are sorted by tunnel IDs in ascending order. If the original tunnel is faulty or the tunnel is in the FRR in-use state, traffic is switched from the original tunnel to the first split tunnel. If the first split tunnel becomes faulty, traffic is switched to the second split tunnel. The process repeats to implement traffic switching between the original and split tunnels.\nThe mpls te backup active-standby command enables the active/standby mode for a tunnel association group.\nPrecautions\nIn a tunnel association group working in active/standby mode, the original and split tunnels do not support HSB.\nIn a tunnel association group working in active/standby mode, the original and split tunnels can only be RSVP-TE P2P tunnels.\nIn a tunnel association group working in active/standby mode, the original and split tunnels do not support BFD for TE LSP. After BFD for TE LSP is enabled globally, no BFD session is created for the original and split tunnels.\nThe original and split tunnels do not support the best-effort attribute in active/standby mode.\nIn a tunnel association group working in active/standby mode, the frr-switch degrade command cannot be configured for the original and split tunnels.\nThe original and split tunnels do not support BFD for tunnel. After BFD for tunnel is enabled globally, no BFD session is created for the original and split tunnels."
}