{
    "PageTitle": "mpls te timer auto-bandwidth",
    "FuncDef": "The mpls te timer auto-bandwidth command enables automatic bandwidth adjustment to sample the output rate for MPLS TE tunnels and configures the sampling interval.\nThe undo mpls te timer auto-bandwidth command disables automatic bandwidth adjustment to sample the output rate for MPLS TE tunnels.\nBy default, the sampling is disabled.",
    "CLIs": [
        "mpls te timer auto-bandwidth",
        "mpls te timer auto-bandwidth <interval>",
        "undo mpls te timer auto-bandwidth"
    ],
    "ParentView": [
        "MPLS view"
    ],
    "ParaDef": [
        {
            "Parameters": "interval",
            "Info": "Specifies interval for sampling the packet rate on the outbound interface of a tunnel for which automatic bandwidth adjustment is enabled.\nThe value ranges from 1 to 604800, in seconds. The default value is 300. The default value is recommended."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] mpls rsvp-te",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] interface Tunnel 10",
            "[*HUAWEI-Tunnel10] tunnel-protocol mpls te",
            "[*HUAWEI-Tunnel10] destination 2.2.2.2",
            "[*HUAWEI-Tunnel10] mpls te auto-bandwidth adjustment frequency 3600",
            "[*HUAWEI-Tunnel10] quit",
            "[*HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te timer auto-bandwidth 600"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter automatic bandwidth adjustment is enabled, the average bandwidth for the traffic of the tunnel in an automatic bandwidth adjustment period (such as 24 hours) can be obtained based on the bandwidth values collected in a sampling interval, for example, 5 minutes. After sampling for multiple times in a period, new bandwidth is recalculated based on the average value of sampled values. Then, a new LSP tunnel is set up based on the new bandwidth. The mpls te timer auto-bandwidth command enables the system to sample the output rate for MPLS TE tunnels and configures the sampling interval.\nPrerequisites\nRun the mpls te auto-bandwidth command to configure the automatic bandwidth adjustment function of MPLS TE tunnels."
}