{
    "PageTitle": "mpls rsvp-te challenge-lost",
    "FuncDef": "The mpls rsvp-te challenge-lost command sets the maximum number of Challenge messages allowed to be dropped.\nThe undo mpls rsvp-te challenge-lost command restores the default maximum number.\nBy default, the maximum number of 3 Challenge messages can be dropped.",
    "CLIs": [
        "mpls rsvp-te challenge-lost <max-miss-times>",
        "undo mpls rsvp-te challenge-lost"
    ],
    "ParentView": [
        "MPLS view"
    ],
    "ParaDef": [
        {
            "Parameters": "max-miss-times",
            "Info": "Maximum challenge message misses times,the default is 3.\nThe value is an integer ranging from 1 to 10."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] mpls rsvp-te",
            "[*HUAWEI-mpls] mpls rsvp-te challenge-lost 5"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nNode A and node B are RSVP neighbors and they need to authenticate each other. Node A authenticates node B as follows:\nNode A sends an RSVP message carrying an Integrity object to node B.After node B receives the message and detects that the key ID of node A is different from the key ID in the Integrity object, node B sends a Challenge message to node A and starts a timer for retransmitting the Challenge message periodically and recording the resending times.After node A receives the Challenge message from node B, node A directly copies the Challenge object in another message and adds its Integrity object to the message to generate a Response message to be sent to node B.When node B receives the Response message from node A, node B checks whether the Challenge object in the Response message is consistent with the local Challenge object or not before performed either of the following operations:\nIf the Challenge objects are consistent, node B resets the timer for sending Challenge messages and authentication is successful.If the Challenge message timer expires before node B receives the Response message, authentication fails.\nThe mpls rsvp-te challenge-lost command is used to change the maximum number of resent Challenge messages. In addition, the mpls rsvp-te retrans-timer challenge command is used to change the interval at which a Challenge message is resent."
}