{
    "PageTitle": "bidirectional static-cr-lsp",
    "FuncDef": "The bidirectional static-cr-lsp command creates a static bidirectional co-routed CR-LSP and displays the static bidirectional CR-LSP view.\nThe undo bidirectional static-cr-lsp command deletes a static bidirectional co-routed CR-LSP.\nBy default, no static bidirectional co-routed CR-LSP is configured.",
    "CLIs": [
        "bidirectional static-cr-lsp ingress <tunnel-name>",
        "bidirectional static-cr-lsp transit <lsp-name>",
        "bidirectional static-cr-lsp egress <lsp-name>",
        "undo bidirectional static-cr-lsp ingress <tunnel-name>",
        "undo bidirectional static-cr-lsp transit <lsp-name>",
        "undo bidirectional static-cr-lsp egress <lsp-name>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "transit lsp-name",
            "Info": "Indicates the LSP name of the transit node of a static bidirectional co-routed CR-LSP.\nThe value is a string of 1 to 19 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "egress lsp-name",
            "Info": "Indicates the LSP name of the egress of a static bidirectional co-routed CR-LSP.\nThe value is a string of 1 to 19 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "ingress tunnel-name",
            "Info": "Indicates the ingress tunnel name of a static bidirectional co-routed CR-LSP.\nThe value is a string of 1 to 19 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] bidirectional static-cr-lsp ingress Tunnel10"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] bidirectional static-cr-lsp transit abc"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] bidirectional static-cr-lsp egress Tunnel10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA static bidirectional co-routed CR-LSP is manually established and consists of two CR-LSPs passing through the same nodes and links and transmitting traffic in opposite directions. You have to configure MPLS forwarding entries in both directions on each node of a path over which the bidirectional CR-LSP is to be established and bind the two CR-LSPs in opposite directions together on both the ingress and egress.\nThe bidirectional static-cr-lsp command can be used to create a static bidirectional co-routed LSP and display the static bidirectional LSP view. LSP data, such as the incoming label, outbound interface, and next-hop IP address, can be configured in this view. An ingress is a node where a CR-LSP originates from and its reverse CR-LSP terminates at; an egress is a node where a CR-LSP terminates at and its reverse CR-LSP originates from.\nConfiguration Impact\nIf the undo bidirectional static-cr-lsp command is run, all configurations of the static bidirectional co-routed LSP will be deleted.\nPrecautions\nThe tunnel name specified in the bidirectional static-cr-lsp ingress tunnel-name command must be the name of an established tunnel."
}