{
    "PageTitle": "mpls autobypass-tunnel-number threshold-alarm",
    "FuncDef": "The mpls autobypass-tunnel-number threshold-alarm command configures the conditions that trigger the threshold-reaching alarm and its clear alarm for Auto bypass tunnel interfaces. The conditions include the upper and lower alarm thresholds (percent) for the proportion of configured Auto bypass tunnel interfaces to all supported ones.\nThe undo mpls autobypass-tunnel-number threshold-alarm command restores the default upper and lower alarm thresholds (percent) for the proportion of configured Auto bypass tunnel interfaces to all supported ones.\nBy default, the upper alarm threshold is 80%, and the lower alarm threshold is 75%.",
    "CLIs": [
        "mpls autobypass-tunnel-number threshold-alarm upper-limit <upper-limit-value> lower-limit <lower-limit-value>",
        "undo mpls autobypass-tunnel-number threshold-alarm"
    ],
    "ParentView": [
        "MPLS view"
    ],
    "ParaDef": [
        {
            "Parameters": "lower-limit lower-limit-value",
            "Info": "Sets the lower alarm threshold for the proportion of configured Auto bypass tunnel interfaces to all supported ones.\nThe value is a percent integer ranging from 1 to 100. The lower limit must be less than the upper limit. The default value 75 is recommended."
        },
        {
            "Parameters": "upper-limit upper-limit-value",
            "Info": "Sets the upper alarm threshold for the proportion of configured Auto bypass tunnel interfaces to all supported ones.\nThe value is a percent integer ranging from 1 to 100. Set the value less than 95. Using the default value 80 is recommended."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls autobypass-tunnel-number threshold-alarm upper-limit 90 lower-limit 60"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the number of Auto bypass tunnel interfaces reaches a specified upper limit, new Auto bypass tunnel cannot be configured due to insufficient resources. To alert the administrator in operation and maintenance, enable a device to generate an alarm when the proportion of configured Auto bypass tunnel interfaces to all supported ones reaches a specified upper alarm threshold. The following parameters can be configured in the mpls autobypass-tunnel-number threshold-alarm command:\nupper-limit-value: upper alarm threshold. If the proportion of configured Auto bypass tunnel interfaces to all supported ones reaches the upper alarm threshold, an alarm can be generated.\nupper-limit-value = Number of established Auto bypass tunnels/Configured total number of Auto bypass tunnels that can be established\nlower-limit-value: lower alarm threshold. If the proportion of configured Auto bypass tunnel interfaces to all supported ones falls below the lower alarm threshold, a clear alarm can be generated.\nlower-limit-value = Number of established Auto bypass tunnels/Configured total number of Auto bypass tunnels that can be established\n\nPrecautions\nIf the mpls autobypass-tunnel-number threshold-alarm command is run more than once, the latest configuration overrides the previous one.\nThe mpls autobypass-tunnel-number threshold-alarm command only configures the trigger conditions for an alarm and its clear alarm. Although trigger conditions are met, the alarm and its clear alarm can be generated only after the snmp-agent trap enable feature-name mpls_lspm trap-name { hwmplsresourcethresholdexceed | hwmplsresourcethresholdexceedclear } command is run to enable the device to generate an MPLS resource insufficiency alarm and its clear alarm."
}