{
    "PageTitle": "lsp-loopback",
    "FuncDef": "The lsp-loopback start command enables loopback detection for a specified static bidirectional co-routed CR-LSP on a transit node.\nThe lsp-loopback stop command disables loopback detection for a static bidirectional co-routed CR-LSP.\nBy default, loopback detection for a specified static bidirectional co-routed CR-LSP on a transit node is not enabled.",
    "CLIs": [
        "lsp-loopback { start | stop }"
    ],
    "ParentView": [
        "Static bidirectional co-routed transit view"
    ],
    "ParaDef": [
        {
            "Parameters": "start",
            "Info": "Specifies to enable loopback detection for a specified static bidirectional co-routed CR-LSP on a transit node.\n-"
        },
        {
            "Parameters": "stop",
            "Info": "Specifies to disable loopback detection for a static bidirectional co-routed CR-LSP.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] bidirectional static-cr-lsp transit lsp1",
            "[*HUAWEI-bi-static-transit-lsp1] forward in-label 20 nexthop 10.1.1.1 out-label 30",
            "[*HUAWEI-bi-static-transit-lsp1] backward in-label 60 nexthop 10.2.1.1 out-label 80",
            "[*HUAWEI-bi-static-transit-lsp1] lsp-loopback start",
            "[*HUAWEI-bi-static-transit-lsp1] lsp-loopback stop"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo enable loopback detection for a static bidirectional co-routed CR-LSP, run the lsp-loopback start command on a transit node. The command output helps diagnose minor packet loss and bit errors on the static bidirectional co-routed CR-LSP. After the lsp-loopback start command is run, the loopback detection-enabled node loops traffic back to the ingress through a temporary loop, which adversely affects traffic transmission. After you locate faults, immediately run the lsp-loopback stop command to disable loopback detection to restore service transmission."
}