{
    "PageTitle": "mpls rsvp-lsp-number threshold-alarm",
    "FuncDef": "The mpls rsvp-lsp-number threshold-alarm command configures the alarm threshold for Resource Reservation Protocol (RSVP) label switched path (LSP) usage.\nThe undo mpls rsvp-lsp-number threshold-alarm command restores the default setting.\nBy default, the upper limit of the alarm threshold for RSVP LSP usage is 80%. The default lower limit of the clear alarm threshold for RSVP LSP usage is 75%.",
    "CLIs": [
        "mpls rsvp-lsp-number threshold-alarm upper-limit <upper-limit-value> lower-limit <lower-limit-value>",
        "undo mpls rsvp-lsp-number threshold-alarm"
    ],
    "ParentView": [
        "MPLS view"
    ],
    "ParaDef": [
        {
            "Parameters": "lower-limit lower-limit-value",
            "Info": "Specifies the lower limit of the clear alarm threshold for RSVP LSP usage.\nThe value is an integer ranging from 1 to 100, represented in percentage. The value must be smaller than the value of upper-limit-value. Using the default value is recommended."
        },
        {
            "Parameters": "upper-limit upper-limit-value",
            "Info": "Specifies the upper limit of the alarm threshold for RSVP LSP usage.\nThe value is an integer ranging from 1 to 100, represented in percentage. Using a value larger than 95 is not recommended. Using the default value is recommended."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls rsvp-lsp-number threshold-alarm upper-limit 90 lower-limit 60"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the number of RSVP LSPs in the system reaches a specific limit, establishing subsequent RSVP LSPs may fail because of insufficient resources. To facilitate user operation and maintenance, enable an alarm to be generated when the number of RSVP LSPs reaches the specific limit. To configure the alarm threshold for RSVP LSP usage, run the mpls rsvp-lsp-number threshold-alarm command. The parameters in this command are described as follows:\nWhen the RSVP LSP usage increases to the value of upper-limit-value, an alarm for RSVP LSPs is generated. The alarm name is MPLS_LSPM_1.3.6.1.4.1.2011.5.25.121.2.1.63 hwMplsLspThresholdExceed.When the RSVP LSP usage falls below the value of lower-limit-value, a clear alarm for RSVP LSPs is generated. The alarm name is MPLS_LSPM_1.3.6.1.4.1.2011.5.25.121.2.1.64 hwMplsLspThresholdExceedClear.When RSVP LSP usage reaches a specified threshold, an RSVP LSP threshold-crossing alarm is generated. The alarm name is MPLS_LSPM_1.3.6.1.4.1.2011.5.25.121.2.1.65 hwMplsLspTotalCountExceed.When RSVP LSP usage falls below 95% of a specified threshold, an RSVP LSP threshold-crossing alarm is cleared. The alarm name is MPLS_LSPM_1.3.6.1.4.1.2011.5.25.121.2.1.66 hwMplsLspTotalCountExceedClear.\n\nPrecautions\nIf the mpls rsvp-lsp-number threshold-alarm command is run more than once, the latest configuration overrides the previous one.\nThis command configures the alarm threshold for RSVP LSP usage. The alarm that the number of LSPs reached the upper threshold is generated only when the snmp-agent trap enable feature-name command is run, and the actual RSVP LSP usage reaches the upper limit of the alarm threshold. The alarm that the number of LSPs fell below the lower threshold is generated only when the snmp-agent trap enable feature-name feature-name command is run, and the actual RSVP LSP usage falls below the lower limit of the clear alarm threshold."
}