{
    "PageTitle": "mpls te ttl-mode",
    "FuncDef": "The mpls te ttl-mode command configures a mode for MPLS TE to process TTLs in packets.\nThe undo mpls te ttl-mode command restores the default mode for MPLS TE to process TTLs in packets.\nThis command varies in transport and router modes. For detailed differences, see Differences Between Commands in Transport and Router Modes. This topic describes the command configuration in router mode.\nBy default, MPLS TE processes TTLs in packets in uniform mode.",
    "CLIs": [
        "mpls te ttl-mode { pipe | uniform }",
        "undo mpls te ttl-mode"
    ],
    "ParentView": [
        "MPLS view"
    ],
    "ParaDef": [
        {
            "Parameters": "pipe",
            "Info": "Enables MPLS TE to process TTLs in packets in pipe mode.\n-"
        },
        {
            "Parameters": "uniform",
            "Info": "Enables MPLS TE to process TTLs in packets in uniform mode.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te ttl-mode pipe"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nMPLS TE processes TTLs in MPLS packets in the following two modes:\nUniform Mode: The IP TTL value reduces by one each time it passes through a node in an MPLS network. When IP packets enter the MPLS network, the ingress reduces the IP TTL value by one and copies the IP TTL value to the MPLS TTL field. Each transit node only processes the MPLS TTL. The egress reduces the MPLS TTL by one, compares the MPLS TTL with the IP TTL, and obtains the smaller value to map it to the IP TTL.Pipe Mode: The IP TTL value decreases by one only when passing through the ingress and egress. When IP packets enter the MPLS network, the ingress reduces the IP TTL value in packets by one and sets the MPLS TTL to a specific value. Transit nodes only process the MPLS TTL. When the egress receives the packets, it removes the MPLS label carrying the MPLS TTL from each packet and reduces the IP TTL value by one.\nIn multiple-hop PW Virtual Circuit Connectivity Verification Tracert (VCCV Tracert), all nodes on LSPs must process TTLs in packets in the same mode. Otherwise, the Tracert operation fails.\n\nConfiguration Impact\nIf a node on an MPLS network processes TTLs in MPLS packets in pipe mode, the output of the tracert and tracert lsp commands does not contain information about this node."
}