{
    "PageTitle": "display mpls te protection tunnel aps",
    "FuncDef": "The display mpls te protection tunnel aps command displays information about a specified working tunnel and its protection tunnel in a tunnel protection group.",
    "CLIs": [
        "display mpls te protection tunnel aps { all | <tunnel-id> | interface { <interface-type> <interface-number> | <tunnel-interface-name> } }"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "all",
            "Info": "Display all Tunnel Info.\n-"
        },
        {
            "Parameters": "tunnel-id",
            "Info": "Specifies the tunnel ID.\nThe value is an integer ranging from 1 to 65535."
        },
        {
            "Parameters": "interface tunnel-interface-name",
            "Info": "Specifies the interface name.\n-"
        },
        {
            "Parameters": "interface-type",
            "Info": "Specifies the interface type.\n-"
        },
        {
            "Parameters": "interface-number",
            "Info": "Specifies the interface number.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display mpls te protection tunnel aps 100"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAutomatic protection switching (APS) enables nodes on both ends of a tunnel to switch and restore traffic if a fault occurs, implementing uninterrupted traffic transmission.\nIf a fault occurs on a working tunnel in a tunnel protection group, APS switches services from the working tunnel to a protection tunnel. After the working tunnel recovers, APS switches services back to the working tunnel if the retrieve mode is enabled for the protection group.\nThe display mpls te protection tunnel command can be used to display information about a specified tunnel protection group. The following parameters can be specified to display various types of information:\nIf the ID or tunnel interface of the working tunnel is specified, information about the working tunnel and its protection tunnel is displayed.If the ID or tunnel interface of a protection tunnel is specified, information about the protection tunnel and all its protected working tunnels is displayed."
}