{
    "PageTitle": "display mpls te last-error",
    "FuncDef": "The display mpls te last-error command displays errors that occur on the Tunnel-Manager recently.\nThe display mpls te tunnel-interface last-error command displays last errors occurring on a tunnel interface of the local node.",
    "CLIs": [
        "display mpls te tunnel-interface last-error [ <interface-type> <interface-number> | <tunnel-name> | auto-primary-tunnel <ip-prefix-tunnel-name> ]",
        "display mpls te last-error"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "interface-type",
            "Info": "Interface type.\n-"
        },
        {
            "Parameters": "interface-number",
            "Info": "Interface number.\n-"
        },
        {
            "Parameters": "tunnel-name",
            "Info": "Tunnel Name.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "auto-primary-tunnel ip-prefix-tunnel-name",
            "Info": "IP prefix auto primary tunnel name.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display mpls te last-error",
            "Display last error info of local:",
            "    Error Code:5",
            "    Error Info:Rsvp signal msg process fail, SigMsgType = 2.(IngressLsrID = 5050505, EgressLsrId = 2020202, SessionTunnelId = 1635, LspId = 43506)",
            "    Occur Time:2018/01/26 22:36:18:842"
        ],
        [
            "<HUAWEI> display mpls te tunnel-interface last-error tunnel2",
            " Tunnel Name: Tunnel2",
            "                 ",
            "    Error No.  : 1",
            "    LSP Type   : Hot-Standby modify LSP    LSP ID     : 2.2.2.2:101:59",
            "    Error Code : 12                        Occur Time : 2018-11-17 14:06:03.750",
            "    Error Info : Link 10.1.1.1 is excluded, IGP: ISIS Process-ID: 1 Area: Level-2. No disjoint path available for disjoint algorithm.",
            " ",
            "    Error No.  : 2",
            "    LSP Type   : Hot-Standby modify LSP    LSP ID     : 2.2.2.2:101:59",
            "    Error Code : 12                        Occur Time : 2018-11-17 14:06:03.750",
            "    Error Info : Node 4.4.4.4 is excluded, IGP: ISIS Process-ID: 1 Area: Level-2. No disjoint path available for disjoint algorithm."
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe display mpls te last-error command displays errors occurring on the Tunnel-Manager of the local node. The errors include the following:\nComponent control errorsConfiguration restoration errorsVerification and smoothing errorsSystem errors\nTo view errors on the local node or an error carried in an RSVP PathErr message sent by a downstream node, run the display mpls te tunnel-interface last-error command run on the ingress. The errors are as follows:\nCSPF computation failuresErrors in the RSVP GR processErrors in triggering RSVP signalingErrors that are carried in the received RSVP PathErr messagesThe display mpls te tunnel-interface last-error command displays the last five recorded errors of every TE tunnel and tunnel type, such as primary, modified, or backup CR-LSP.\nIf an RSVP PathErr message sent by a downstream node carries error information, the ErroInfo field in the command displays the IP address of the defective downstream node and the cause of the error. If an error occurs on the ingress, the command displays only the cause of the error."
}