{
    "PageTitle": "next hop",
    "FuncDef": "The next hop command specifies the next-hop address on an explicit path, allowing a path to be established along the nodes in the order in which they are configured.\nThe undo next hop command deletes a specified next-hop address on an explicit path.\nBy default, no next-hop address on an explicit path is specified.",
    "CLIs": [
        "next hop <ip-address> [ include [ [ strict | loose ] | [ incoming | outgoing ] ] * | exclude ]",
        "undo next hop <ip-address>"
    ],
    "ParentView": [
        "Explicit path view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address",
            "Info": "IP address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "include",
            "Info": "Specify included address.\n-"
        },
        {
            "Parameters": "strict",
            "Info": "Strict ER-HOP.\n-"
        },
        {
            "Parameters": "loose",
            "Info": "Loose ER-HOP.\n-"
        },
        {
            "Parameters": "incoming",
            "Info": "Incoming interface.\n-"
        },
        {
            "Parameters": "outgoing",
            "Info": "Outgoing interface.\n-"
        },
        {
            "Parameters": "exclude",
            "Info": "Exclude the address.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] explicit-path p1",
            "[*HUAWEI-explicit-path-p1] next hop 10.0.0.125 exclude"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe next hop command is used to plan nodes for an explicit path.\nConfiguration Impact\nThe following commands are used to adjust nodes on an explicit path:\nThe modify hop command is used to change a node on the explicit path.The delete hop command is used to delete a node from the explicit path.The add hop command is used to add a node to the explicit path.\n\nFollow-up Procedure\nRun the display explicit-path command to view information about the explicit path.\nPrecautions\nIP addresses configured using the next hop ip-address include command and the next hop ip-address exclude command must be different.\nThe include and strict parameters are used by default, meaning the tunnel must pass through a specified node.\nIf a loose next-hop IP address is specified in this command, configure incoming or outgoing, which prevents a failure to compute an expected explicit path."
}