{
    "PageTitle": "mpls rsvp-te timer graceful-shutdown",
    "FuncDef": "The mpls rsvp-te timer graceful-shutdown command sets a graceful shutdown timeout period.\nThe undo mpls rsvp-te timer graceful-shutdown command deletes a graceful shutdown timeout period.\nBy default, no graceful shutdown timeout period is set.",
    "CLIs": [
        "mpls rsvp-te timer graceful-shutdown <graceful-shutdown-time>",
        "undo mpls rsvp-te timer graceful-shutdown"
    ],
    "ParentView": [
        "MPLS view"
    ],
    "ParaDef": [
        {
            "Parameters": "graceful-shutdown-time",
            "Info": "Sets a graceful shutdown timeout period.\nThe value is an integer ranging from 30 to 1200, in seconds.The default value is 0. The original RSVP LSP is automatically deleted only if the graceful shutdown timeout period is set and the rerouting fails within this timeout period."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] mpls rsvp-te",
            "[*HUAWEI-mpls] mpls rsvp-te timer graceful-shutdown 60"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBefore an upgrade is performed on a device, run the mpls rsvp-te timer graceful-shutdown command to set a graceful shutdown timeout period. During a graceful shutdown process, a rerouting request is sent for an RSVP-TE LSP. If the rerouting fails within the configured timeout period, the RSVP-TE LSP is torn down.\nConfiguration Impact\nThe mpls rsvp-te timer graceful-shutdown command affects the rerouting operations triggered only by the graceful shutdown function.\nIf a graceful shutdown timeout period is modified, the modification takes effect on RSVP-TE LSPs only in the next graceful shutdown.\nPrecautions\nBefore the timeout-triggered RSVP LSP deletion is enabled, set a graceful shutdown timeout period and then perform the graceful shutdown function.\nThe graceful shutdown timeout period must be greater than or equal to the delayed switching time configured on each RSVP LSP ingress."
}