{
    "PageTitle": "mpls rsvp-te graceful-shutdown (Interface view)",
    "FuncDef": "The mpls rsvp-te graceful-shutdown command enables graceful shutdown.\nThe undo mpls rsvp-te graceful-shutdown command restores the default configuration.\nBy default, this function is disabled.",
    "CLIs": [
        "mpls rsvp-te graceful-shutdown",
        "undo mpls rsvp-te graceful-shutdown"
    ],
    "ParentView": [
        "40GE interface view",
        "IP-Trunk interface view",
        "GE electrical interface view",
        "Eth-Trunk sub-interface view",
        "GMPLS-UNI interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "POS sub-interface view",
        "GE sub-interface view",
        "XGE interface view",
        "25GE sub-interface view",
        "100GE interface view",
        "XGE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "25GE interface view",
        "100ge sub-interface view",
        "Eth-Trunk interface view",
        "40GE sub-interface view",
        "10GE sub-interface view",
        "POS interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] mpls",
            "[*HUAWEI-GigabitEthernet1/0/0] mpls te",
            "[*HUAWEI-GigabitEthernet1/0/0] mpls rsvp-te",
            "[*HUAWEI-GigabitEthernet1/0/0] mpls rsvp-te graceful-shutdown"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBefore an upgrade or link maintenance is performed on the ingress, services are switched to another path on the ingress. This method is complex. Especially when the upgrade is to be performed on Ps, service switching has to be performed on PEs. To simplify the operation and reduce maintenance expenses, automatic service switching needs to be triggered on an involved P. To tackle the issue, run the mpls rsvp-te graceful-shutdown command. The graceful shutdown function delays the forwarding resource interruption (either a planned interruption or an upgrade). During the delay period, traffic on the control plane is switched to another path. After the Resource Recovery seamless service handoff.\nPrecautions\nThe mpls rsvp-te graceful-shutdown command can be run only on the ingress that supports the graceful shutdown function. If this command is run on the ingress that does not this function, the ingress does not process a rerouting request and deletes and reestablish an LSP, causing traffic loss.\nThe graceful shutdown function takes effect only in IS-IS areas.\nUse the undo mpls rsvp-te graceful-shutdown command to cancel the graceful shutdown function. After the configuration, the TE attributes of all interfaces on the entire device are flooded again to restore the original attribute values.\nThis feature cannot be used with versions that do not support the graceful-shutdown function, because the old version cannot process PathErr messages with rerouting requests when it is the head node, and the LSP will be deleted and rebuilt."
}