{
    "PageTitle": "mpls te service-class",
    "FuncDef": "The mpls te service-class command specifies a service class for packets to be allowed to pass through an MPLS TE tunnel.\nThe undo mpls te service-class command deletes a service class for packets to be allowed to pass through an MPLS TE tunnel.\nBy default, no service class is specified for packets to be allowed to pass through an MPLS TE tunnel.",
    "CLIs": [
        "mpls te service-class { be | af1 | af2 | af3 | af4 | ef | cs6 | cs7 } *",
        "mpls te service-class default",
        "undo mpls te service-class"
    ],
    "ParentView": [
        "Tunnel interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "be",
            "Info": "Specifies the service class for packets over an MPLS TE tunnel to be BE.\n-"
        },
        {
            "Parameters": "af1",
            "Info": "Specifies the service class for packets over an MPLS TE tunnel to be AF1.\n-"
        },
        {
            "Parameters": "af2",
            "Info": "Specifies the service class for packets over an MPLS TE tunnel to be AF2.\n-"
        },
        {
            "Parameters": "af3",
            "Info": "Specifies the service class for packets over an MPLS TE tunnel to be AF3.\n-"
        },
        {
            "Parameters": "af4",
            "Info": "Specifies the service class for packets over an MPLS TE tunnel to be AF4.\n-"
        },
        {
            "Parameters": "ef",
            "Info": "Specifies the service class for packets over an MPLS TE tunnel to be EF.\n-"
        },
        {
            "Parameters": "cs6",
            "Info": "Specifies the service class for packets over an MPLS TE tunnel to be CS6.\n-"
        },
        {
            "Parameters": "cs7",
            "Info": "Specifies the service class for packets over an MPLS TE tunnel to be CS7.\n-"
        },
        {
            "Parameters": "default",
            "Info": "Sets a service class for packets over an MPLS TE tunnel to default.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] quit",
            "[~HUAWEI] interface tunnel 1",
            "[*HUAWEI-Tunnel1] tunnel-protocol mpls te",
            "[*HUAWEI-Tunnel1] mpls te service-class af1 af2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen services recurse to multiple TE tunnels, the mpls te service-class command is run on the TE tunnel interface to set a service class so that a TE tunnel transmits services of a specified service class.\nPrecautions\nThis command is used only on the ingress of an MPLS TE tunnel.\nThe mpls te service-class and load-balance mpls unequal-cost enable commands are mutually exclusive. If both commands are run, the load-balance mpls unequal-cost enable command takes effect.\nIf the mpls te service-class command is run repeatedly on a tunnel interface, the latest configuration overrides the previous one.\nIf a non-be service class is set for packets to be allowed to pass through an MPLS TE tunnel using the mpls te service-class command, service traffic with the be service class can still be forwarded through the MPLS TE tunnel without being interrupted."
}