{
    "PageTitle": "mpls te multi-protect fast-switch enable",
    "FuncDef": "The mpls te multi-protect fast-switch enable command enables rapid FRR switching when MPLS TE HSB is enabled on a device.\nThe undo mpls te multi-protect fast-switch enable command disables rapid FRR switching when MPLS TE HSB is enabled on a device.\nBy default, FRR is disabled for MPLS TE HSB.",
    "CLIs": [
        "mpls te multi-protect fast-switch enable",
        "undo mpls te multi-protect fast-switch enable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls te multi-protect fast-switch enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe mpls te multi-protect fast-switch enable command applies to MPLS TE scenarios. When FRR and HSB are enabled for MPLS TE tunnels, enabling both MPLS TE HSB and rapid FRR switching improves switching performance.\nConfiguration Impact\nPacket loss occurs temporarily when the mpls multistep separate enable command or its undo form is run.\nPrecautions\nThe mpls multistep separate enable command applies to the L3VPN/VLL/VPLS over RSVP-TE scenario and the decoupling function between VPLS/VLL and TE needs to be enabled. This command is not applicable to the LDP over RSVP-TE or BGP over RSVP-TE scenario.\nBefore using the mpls te multi-protect fast-switch enable command, TE FRR needs to be deployed on the entire network. HSB needs to be deployed on the ingress, BFD for TE LSP must be enabled, and the delayed Down function must be enabled on the outbound interface of the P. Otherwise, rapid switching cannot be performed in case of the double points of failure.\nIf both the primary and HSB LSPs fail, check whether the primary LSP has a direct interface fault. If no direct interface is faulty, use the primary LSP to forward traffic. Otherwise, if FRR protection is configured, the FRR protection tunnel is used to forward traffic. If FRR is not configured, traffic is discarded.\nThe mpls te multi-protect fast-switch enable command is not applicable to the LDP over RSVP-TE and BGP over RSVP-TE scenarios. In these scenarios, enabling the command cannot ensure fast switchover of TE LSPs."
}