{
    "PageTitle": "mpls load-balance wtr",
    "FuncDef": "The mpls load-balance wtr command is used to configure the delay time for MPLS equal-cost multiple path (ECMP) switchback.\nThe undo mpls load-balance wtr command is used to restore the default configuration.\nBy default, packet loss occurs during MPLS ECMP switchback.",
    "CLIs": [
        "mpls load-balance wtr <wtr-value>",
        "undo mpls load-balance wtr [ <wtr-value> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "wtr-value",
            "Info": "Sets a WTR time for MPLS ECMP.\nThe value is an integer ranging from 5 to 60, in seconds. When the undo mpls load-balance wtr command is run, the default delay time for MPLS ECMP switchback is 0 seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls load-balance wtr 20"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn an L3VPN over BGP over TE or IP over BGP over TE scenario, to prevent packet loss between boards in ECMP, run the mpls load-balance wtr command to set a WTR time for MPLS ECMP.\nPrecautions\nThe mpls load-balance wtr command is used in the following scenarios:\nL3VPN/ L2VPN traffic is recursively transmitted over load-balancing LDP/SR-MPLS BE tunnels. The delayed switchback needs to be configured for these load-balancing LDP/SR-MPLS BE tunnels.L3VPN/ L2VPN traffic is recursively transmitted over load-balancing TE/SR-MPLS TE tunnels. The delayed switchback needs to be configured for these load-balancing TE/SR-MPLS TE tunnels.L3VPN/ L2VPN traffic is recursively transmitted over an LDP/SR-MPLS BE tunnel. The LDP/SR-MPLS BE tunnel recurses to load-balancing TE/SR-MPLS TE tunnels. The delayed switchback needs to be configured for these load-balancing TE/SR-MPLS TE tunnels.The delayed switchback needs to be configured for load-balancing LSPs within an LDP/SR-MPLS BE tunnel on a transit node.A transit node on an LDP/SR-MPLS BE tunnel recursively transmits traffic over a TE tunnel. The delayed switchback needs to be configured for load-balancing LSPs within the TE tunnel.A transit node on a BGP tunnel recursively transmits traffic over load-balancing LDP/SR-MPLS BE tunnels. The delayed switchback needs to be configured for these load-balancing LDP/SR-MPLS BE tunnels.A transit node on a BGP tunnel recursively transmits traffic over an LDP/SR-MPLS BE tunnel, and the LDP/SR-MPLS BE tunnel recurses to load-balancing TE/SR-MPLS TE tunnels. The delayed switchback needs to be configured for these load-balancing TE/SR-MPLS TE tunnels.A transit node on a BGP tunnel recursively transmits traffic over a TE/SR-MPLS TE tunnel. The delayed switchback needs to be configured for load-balancing LSPs within the TE/SR-MPLS TE tunnel.The delayed switchback needs to be configured for load-balancing LSPs within an SR-MPLS TE tunnel on a node through which the SR-MPLS TE tunnel passes.The delayed switchback needs to be configured for load-balancing LSPs within an SR-MPLS TE tunnel on a stitching node.The delayed switchback needs to be configured for BGP-EPE SR-MPLS TE ECMP."
}