{
    "PageTitle": "mpls te auto-primary-tunnel",
    "FuncDef": "The mpls te auto-primary-tunnel command enables the automatic primary tunnel function.\nThe undo mpls te auto-primary-tunnel command disables the automatic primary tunnel function.\nBy default, the automatic primary tunnel function is disabled.",
    "CLIs": [
        "mpls te auto-primary-tunnel ip-prefix <ip-prefix> [ p2p-template <template-name> ]",
        "undo mpls te auto-primary-tunnel ip-prefix <ip-prefix> [ p2p-template <template-name> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-prefix ip-prefix",
            "Info": "Specifies an IP prefix list.\nThe name is a string of 1 to 169 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "p2p-template template-name",
            "Info": "Specifies the name of a P2P TE tunnel template.\nThe name is a string of 1 to 31 case-sensitive characters. The name cannot contain spaces or start with an underscore (_)."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] ip ip-prefix forl3vpn permit 2.2.2.9 32",
            "[*HUAWEI] mpls te auto-primary-tunnel ip-prefix forl3vpn"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen you want to create a large number of MPLS TE tunnels or create MPLS TE tunnels to form a full-mesh network, creating them one by one is laborious and complex. To simplify configuration, run the mpls te auto-primary-tunnel command to enable a device to use an IP prefix list and a P2P TE tunnel template to automatically establish MPLS TE tunnels in a batch.\nPrerequisites\nMPLS TE has been enabled globally using the mpls te command.\nAn IP prefix list has been created."
}