{
    "PageTitle": "explicit-null-label",
    "FuncDef": "The explicit-null-label ttl-mode command configures a mode used by an egress PE to process the TTL field in packets when the explicit null label is assigned to a penultimate node.\nThe explicit-null-label exp-mode command configures a mode used by an egress PE to process the EXP field in packets when the explicit null label is assigned to a penultimate node.\nBy default, the processing mode is uniform mode.",
    "CLIs": [
        "explicit-null-label exp-mode { uniform | pipe }",
        "explicit-null-label ttl-mode { uniform | pipe }"
    ],
    "ParentView": [
        "MPLS view"
    ],
    "ParaDef": [
        {
            "Parameters": "uniform",
            "Info": "Specifies uniform mode.\n-"
        },
        {
            "Parameters": "pipe",
            "Info": "Specifies pipe mode.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[~HUAWEI-mpls] explicit-null-label ttl-mode uniform"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[~HUAWEI-mpls] explicit-null-label ttl-mode pipe"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[~HUAWEI-mpls] explicit-null-label exp-mode uniform"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[~HUAWEI-mpls] explicit-null-label exp-mode pipe"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf an explicit null label is used, a device processes the TTL field in MPLS packets in either of the following modes:\nuniform: The egress reduces the MPLS TTL by one, compares the MPLS TTL with the IP TTL, and obtains the smaller value to map it to the IP TTL.pipe: The egress reduces the IP TTL by one, without propagating the MPLS TTL to the IP TTL.\nIf an explicit null label is used, an egress PE processes the EXP field in MPLS packets in either of the following modes:\nuniform: The egress PE copies the EXP value in an MPLS packet to the EXP field in the IP or inner packet.pipe: The egress PE does not copy the EXP value in an MPLS packet to the EXP field in the IP or inner packet.\n\nPrerequisites\nMPLS has been enabled globally using the mpls command in the system view. The egress PE has been enabled to advertise the explicit null label using the label advertise explicit-null command.\nImplementation Procedure\nAfter the command line is configured, it takes effect immediately.\nPrecautions\nThis command takes effect only on the egress PE."
}