{
    "PageTitle": "multicast p2mp root load-balance spmsi disable",
    "FuncDef": "The multicast p2mp root load-balance spmsi disable command disables trunk load balancing for an S-PMSI tunnel on the root node.\nThe undo multicast p2mp root load-balance spmsi disable command restores the default configuration.\nBy default, trunk load balancing for an S-PMSI tunnel is enabled on the root node.",
    "CLIs": [
        "multicast p2mp root load-balance spmsi disable",
        "undo multicast p2mp root load-balance spmsi disable"
    ],
    "ParentView": [
        "Eth-Trunk interface view",
        "IP-Trunk interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Eth-Trunk 1",
            "[*HUAWEI-Eth-Trunk1] multicast p2mp root load-balance enable",
            "[*HUAWEI-Eth-Trunk1] multicast p2mp root load-balance spmsi disable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf multiple multicast flows are transmitted over the same P2MP tunnel and the tunnel's outbound interface is an Eth-Trunk interface , the flows are not balanced among the member interfaces of the trunk interface by default. If an S-PMSI tunnel exists, run the multicast p2mp root load-balance spmsi disable command to disable trunk load balancing for the S-PMSI tunnel. This configuration does not affect trunk load balancing for an I-PMSI tunnel and helps save multicast resources.\nThis command takes effect only to S-PMSI tunnels on the root node.\nPrerequisites\nMulticast load balancing for a Trunk interface has been enabled using the multicast p2mp force-loadbalance enable (in the system view) or multicast p2mp root load-balance enable (in the interface view) command.\nConfiguration Impact\nAfter the multicast p2mp root load-balance spmsi disable or undo multicast p2mp root load-balance spmsi disable command is run on a device, packet loss lasts for a short time over the P2MP tunnel on the device.\nPrecautions\nThis command applies to P2MP tunnels, including mLDP LSPs and P2MP TE tunnels. LDP LSPs and P2P TE tunnels are not affected by this command."
}