{
    "PageTitle": "multicast p2mp load-balance",
    "FuncDef": "The multicast p2mp load-balance enable command enables trunk load balancing for multicast traffic in the P2MP tunnel of a transit, branch, or bud node.\nThe undo multicast p2mp load-balance enable command disables trunk load balancing for multicast traffic in the P2MP tunnel of a transit, branch, or bud node.\nThe multicast p2mp root load-balance enable command enables trunk load balancing for multicast traffic in the P2MP tunnel of a root node and of an ABR (ASBR) in an NG MVPN scenario.\nThe undo multicast p2mp root load-balance enable command disables trunk load balancing for multicast traffic in the P2MP tunnel of a root node and of an ABR (ASBR) in an NG MVPN scenario.\nBy default, trunk load balancing is disabled for multicast traffic in a P2MP tunnel.",
    "CLIs": [
        "multicast p2mp load-balance enable",
        "multicast p2mp root load-balance enable",
        "undo multicast p2mp load-balance enable",
        "undo multicast p2mp root load-balance enable"
    ],
    "ParentView": [
        "Eth-Trunk interface view",
        "IP-Trunk interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Eth-Trunk 1",
            "[*HUAWEI-Eth-Trunk1] multicast p2mp load-balance enable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Eth-Trunk 1",
            "[*HUAWEI-Eth-Trunk1] multicast p2mp root load-balance enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf multiple multicast flows are transmitted over the same P2MP tunnel and whose outbound interface is a Trunk interface, the flows are not balanced among the member interfaces of the trunk interface by default. To implement load balancing on the trunk member interfaces, run the multicast p2mp load-balance enable or multicast p2mp root load-balance enable command.\nThe multicast p2mp load-balance enable command applies only to the P2MP tunnel of a transit, branch, or bud node.\nThe multicast p2mp root load-balance enable command applies only to the P2MP tunnel of a root node and of an ABR (ASBR) in an NG MVPN scenario.\nConfiguration Impact\nRunning the multicast p2mp load-balance enable, undo multicast p2mp load-balance enable, multicast p2mp root load-balance enable, or undo multicast p2mp root load-balance enable command may cause packet loss for a short time in the target P2MP tunnel.\nOnly transit, branch and BUD nodes support P2MP trunk load balancing.\nRunning the multicast p2mp load-balance enable command consumes a large number of hardware resources. Do not configure excess P2MP or mLDP tunnels on a trunk for load balancing on the live network. The recommended number of P2MP or mLDP tunnels to be configured for multicast load balancing varies according to device models. For detailed specifications, contact Huawei technical support personnel.\nPrecautions\nThe NE40E supports only the LPUF-400, LPUI-480, LPUI-1T, LPUF-400-B and LPUI-400 boards."
}