{
    "PageTitle": "bypass-attributes (MPLS TE P2MP template view)",
    "FuncDef": "The bypass-attributes command sets bypass tunnel attributes.\nThe undo bypass-attributes command restores the default bypass tunnel attributes.\nBy default, the bandwidth of a bypass tunnel is equal to that of the primary tunnel, and the setup and holding priority values are both 7.",
    "CLIs": [
        "bypass-attributes { bandwidth <bandwidth> | priority <setup-priority> [ <hold-priority> ] } *",
        "undo bypass-attributes"
    ],
    "ParentView": [
        "MPLS TE P2MP template view"
    ],
    "ParaDef": [
        {
            "Parameters": "bandwidth bandwidth",
            "Info": "Specifies the bandwidth value for a bypass tunnel.\nThe value is an integer ranging from 1 to the maximum reservable bandwidth of a primary tunnel, in kbit/s. When bandwidth protection is enabled, the default bypass tunnel bandwidth is equal to the primary tunnel bandwidth."
        },
        {
            "Parameters": "priority setup-priority",
            "Info": "Specifies the setup priority value.\nThe value is an integer ranging from 0 to 7. The smaller the value, the higher the priority. The default setup priority value is 7."
        },
        {
            "Parameters": "priority hold-priority",
            "Info": "Specifies the holding priority value. The holding priority must be higher than or equal to the setup priority.\nThe value is an integer ranging from 0 to 7. The smaller the value, the higher the priority. The default holding priority value is 7."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] mpls te p2mp-te",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls te p2mp-template Template1",
            "[*HUAWEI-te-p2mp-template-Template1] bandwidth ct0 3000",
            "[*HUAWEI-te-p2mp-template-Template1] fast-reroute bandwidth",
            "[*HUAWEI-te-p2mp-template-Template1] bypass-attributes bandwidth 2048"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA bypass tunnel is established using the configured bandwidth value. The bypass tunnel bandwidth cannot exceed the primary tunnel bandwidth. The setup priority of a bypass tunnel must be lower than or equal to the holding priority. Both of them must be lower than or equal to those of the primary tunnel.\nPrerequisites\nP2MP TE FRR for bandwidth protection has been enabled using the fast-reroute bandwidth command."
}