{
    "PageTitle": "affinity property (MPLS TE P2MP template view)",
    "FuncDef": "The affinity property command defines an affinity in a P2MP tunnel template.\nThe undo affinity property command deletes affinities.\nBy default, no affinities are defined in a P2MP tunnel template.",
    "CLIs": [
        "affinity property <properties> [ mask <mask-value> ]",
        "undo affinity property"
    ],
    "ParentView": [
        "MPLS TE P2MP template view"
    ],
    "ParaDef": [
        {
            "Parameters": "properties",
            "Info": "Specifies the affinity value of a link.\nThe 32-bit value ranges from 0x0 to 0xFFFFFFFF, each bit in which represents a property. The default value is 0x0."
        },
        {
            "Parameters": "mask mask-value",
            "Info": "Specifies the mask of affinities.\nThe 32-bit value ranges from 0x0 to 0xFFFFFFFF. The default value is 0x0."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] mpls te p2mp-te",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls te p2mp-template Template1",
            "[*HUAWEI-te-p2mp-template-Template1] affinity property a04 mask e0c"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAn affinity is a 32-bit vector value used to describe an MPLS link. An affinity and an administrative group attribute define the nodes through which an MPLS TE tunnel passes. Affinity masks determine the link properties that should be checked by a device. If some bits in the mask are 1, at least one bit in an administrative group is 1, and the corresponding bit in the affinity must be 1. If the bits in the affinity are 0s, the corresponding bits in the administrative group cannot be 1.\nTo use affinities to control the nodes through which an automatic P2MP TE tunnel passes, run the affinity property command in the view of the P2MP tunnel template.\nPrerequisites\nA P2MP tunnel template has been configured using the mpls te p2mp-template command."
}