{
    "PageTitle": "mpls te p2mp-template",
    "FuncDef": "The mpls te p2mp-template command creates a P2MP tunnel template and displays the template view.\nThe undo mpls te p2mp-template command deletes a specific P2MP tunnel template.\nBy default, no P2MP tunnel template is created.",
    "CLIs": [
        "mpls te p2mp-template <template-name>",
        "undo mpls te p2mp-template <template-name>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "template-name",
            "Info": "Specifies the name of a P2MP tunnel template.\nThe name is a string of 1 to 31 case-sensitive characters. The name cannot contain spaces or start with an underscore (_)."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] mpls te p2mp-te",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls te p2mp-template Template1",
            "[*HUAWEI-te-p2mp-template-Template1] record-route label"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAutomatic P2MP TE tunnels can transmit services for next generation (NG) multicast VPN (MVPN) and multicast VPLS networks. In the MVPN or multicast VPLS scenario, NG MVPN signaling or multicast VPLS signaling triggers the establishment of mLDP P2MP LSPs.\nAn automatic P2MP TE tunnel does not have a tunnel interface on which tunnel attributes can be configured. Before you configure tunnel attributes, run the mpls te p2mp-template command to create a P2MP tunnel template. You can specify attributes in the template and reference the template when you deploy NG MVPN signaling or multicast VPLS. An automatic P2MP TE tunnel can be established using the attributes defined in the template.\nPrerequisites\nMPLS TE has been enabled globally using the mpls te command.\nPrecautions\nTo modify attributes of an automatic P2MP TE tunnel, modify the attributes in the P2MP tunnel template that is used to establish the tunnel."
}