{
    "PageTitle": "tie-breaking (MPLS TE P2P template view)",
    "FuncDef": "The tie-breaking command configures a rule for selecting a route among multiple routes to the same destination.\nThe undo tie-breaking command restores the default tie-breaking rule.\nBy default, the random tie-breaking rule is used.",
    "CLIs": [
        "tie-breaking { least-fill | most-fill | random }",
        "undo tie-breaking"
    ],
    "ParentView": [
        "MPLS TE P2P template view"
    ],
    "ParaDef": [
        {
            "Parameters": "least-fill",
            "Info": "Selects a route with the lowest ratio of the used bandwidth to the maximum reservable bandwidth.\n-"
        },
        {
            "Parameters": "most-fill",
            "Info": "Selects a route with the highest ratio of the used bandwidth to the maximum reservable bandwidth.\n-"
        },
        {
            "Parameters": "random",
            "Info": "Selects a route randomly.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls te p2p-template Template1",
            "[*HUAWEI-te-p2p-template-Template1] tie-breaking least-fill"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA route is selected based on the ratio of the used available bandwidth to the maximum reservable bandwidth. If least-fill is configured, the route with the lowest ratio is selected; if most-fill is configured, the route with the highest ratio is selected.\nThe Most-fill and Least-fill modes are only effective when the difference in bandwidth usage between the two links exceeds 10%, such as 50% of link A bandwidth utilization and 45% of link B bandwidth utilization. The value is 5%. At this time, the Most-fill and Least-fill modes do not take effect, and the Random mode is still used.\nPrerequisites\nA P2P TE tunnel template has been configured using the mpls te p2p-template command."
}