{
    "PageTitle": "whitelist session-car rsvp-te",
    "FuncDef": "The whitelist session-car rsvp-te command sets Session-CAR parameters for the RSVP-TE whitelist.\nThe undo whitelist session-car rsvp-te command restores the default Session-CAR values for the RSVP-TE whitelist.\nBy default, the CIR, CBS, PIR, and PBS of the Session-CAR function for the RSVP-TE whitelist are 75 kbit/s, 15000 bytes, 4000 kbit/s, and 9000000 bytes, respectively.",
    "CLIs": [
        "whitelist session-car rsvp-te { cir <cir-value> | cbs <cbs-value> | pir <pir-value> | pbs <pbs-value> } *",
        "undo whitelist session-car rsvp-te [ { cir <cir-value> | cbs <cbs-value> | pir <pir-value> | pbs <pbs-value> } * ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "cir cir-value",
            "Info": "Specifies a committed information rate (CIR), that is, the average rate at which packets can be transmitted or forwarded.\nThe value is an integer ranging from 1 to 1000000, in kbit/s. The default value is 75."
        },
        {
            "Parameters": "cbs cbs-value",
            "Info": "Specifies a committed burst size (CBS), that is, the committed volume of burst traffic that can pass instantly.\nThe value is an integer ranging from 1 to 9000000, in bytes. The default value is 15000."
        },
        {
            "Parameters": "pir pir-value",
            "Info": "Specifies a peak information rate (PIR), that is, the peak rate at which packets can be transmitted or forwarded.\nThe value is an integer ranging from 1 to 1000000, in kbit/s. The default value is 4000."
        },
        {
            "Parameters": "pbs pbs-value",
            "Info": "Specifies a peak burst size (PBS), that is, the peak volume of burst traffic that can pass instantly.\nThe value is an integer ranging from 1 to 9000000, in bytes. The default value is 9000000."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] whitelist session-car rsvp-te cir 2 cbs 1600 pir 4000 pbs 5000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a device receives a large number of RSVP-TE messages, you can run the whitelist session-car rsvp-te command to modify the bandwidth values as needed for the message channels between RSVP-TE sessions. This configuration ensures that RSVP-TE messages can be properly sent.\nPrecautions\npir-value must be greater than or equal to cir-value. If you attempt to set a pir-value value smaller than cir-value, the following error message will be displayed: \"Error: The pir %d must be greater than or equal to the cir %d.\"\npbs-value must be greater than or equal to cbs-value. If you attempt to set a pbs-value value smaller than cbs-value, the following error message will be displayed: \"Error: The pbs %d must be greater than or equal to the cbs %d.\""
}