{
    "PageTitle": "mpls rsvp-te authentication window-size (Interface view)",
    "FuncDef": "The mpls rsvp-te authentication window-size command specifies the maximum number of RSVP authentication messages that a device can receive.\nThe undo mpls rsvp-te authentication window-size command deletes the maximum number of RSVP authentication messages that a device can receive.\nBy default, the maximum number of RSVP authentication messages that a device can receive is 1.",
    "CLIs": [
        "mpls rsvp-te authentication window-size <window-size>",
        "undo mpls rsvp-te authentication window-size"
    ],
    "ParentView": [
        "40GE interface view",
        "IP-Trunk interface view",
        "GE electrical interface view",
        "Eth-Trunk sub-interface view",
        "GMPLS-UNI interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "POS sub-interface view",
        "GE sub-interface view",
        "XGE interface view",
        "25GE sub-interface view",
        "100GE interface view",
        "XGE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "25GE interface view",
        "100ge sub-interface view",
        "Eth-Trunk interface view",
        "40GE sub-interface view",
        "10GE sub-interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "window-size",
            "Info": "Specifies the size of a sliding window.\nThe value is an integer ranging from 1 to 64. The default value is 1."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] mpls rsvp-te",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] mpls",
            "[*HUAWEI-GigabitEthernet1/0/0] mpls te",
            "[*HUAWEI-GigabitEthernet1/0/0] mpls rsvp-te",
            "[*HUAWEI-GigabitEthernet1/0/0] mpls rsvp-te authentication cipher Huawei-123",
            "[*HUAWEI-GigabitEthernet1/0/0] mpls rsvp-te authentication handshake",
            "[*HUAWEI-GigabitEthernet1/0/0] mpls rsvp-te authentication window-size 64"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nEnhanced RSVP authentication can be configured to improve the system security and the capability to authenticate users in the unfavorable environment such as network congestion. Enhanced RSVP authentication functions are as follows:\nSets the sliding window size for RSVP authentication messages.Configures the RSVP-TE handshake mechanism.\nTraditional RSVP authentication is used to prevent an unauthorized remote node from setting up a neighbor relationship with the local node. It also prevents attacks (such as maliciously reserving a large number of bandwidth resources) initiated by a remote node after the remote node constructs pseudo RSVP messages to set up an RSVP neighbor relationship with the local node. Traditional RSVP authentication, however, cannot prevent anti-replay attacks or prevent the problem of neighbor relationship termination resulted from RSVP message missequence.\nIn an unfavorable environment, the mpls rsvp-te authentication window-size command can be used to set the maximum number of RSVP authentication messages that can be received. This setting prevents authentication termination due to RSVP message missequence.\n\nPrecautions\nSetting the window size to a value greater than 32 is recommended. If the size of a sliding window is small, the RSVP messages may be dropped and the RSVP neighbor relationship may be terminated."
}