{
    "PageTitle": "mpls rsvp-te authentication lifetime (MPLS RSVP-TE neighbor view)",
    "FuncDef": "The mpls rsvp-te authentication lifetime command is used to configure the RSVP-TE authentication lifetime.\nThe undo mpls svp-te authentication lifetime command is used to restore the default RSVP-TE authentication lifetime.\nBy default, the RSVP-TE authentication lifetime is 30 minutes.",
    "CLIs": [
        "mpls rsvp-te authentication lifetime <lifetime>",
        "undo mpls rsvp-te authentication lifetime"
    ],
    "ParentView": [
        "MPLS RSVP-TE neighbor view"
    ],
    "ParaDef": [
        {
            "Parameters": "lifetime",
            "Info": "Specifies the authentication lifetime formatted as HH:MM:SS.\nThe value is in time format."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] mpls rsvp-te",
            "[*HUAWEI-mpls] mpls rsvp-te peer 10.1.0.1",
            "[*HUAWEI-mpls-rsvp-te-peer-10.1.0.1] mpls rsvp-te authentication cipher Huawei-123",
            "[*HUAWEI-mpls-rsvp-te-peer-10.1.0.1] mpls rsvp-te authentication lifetime 00:40:00"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nEnable RSVP authentication before running the mpls rsvp-te authentication lifetime command.\nIf no CR-LSP exists between RSVP neighbors, an RSVP adjacency remains until the RSVP authentication lifetime elapses, preventing frequent handshakes. Configuring the RSVP authentication lifetime does not affect existing CR-LSPs.\nThe lifetime setting helps prevent RSVP authentication from failing to stop. For example, RTA and RTB establish an RSVP authentication relationship. If the key carried in packets that RTA sends to RTB is damaged because the packets are tampered with, RTB discards the packets after receiving them and detecting the incorrect key. Without a lifetime set, this process repeats because the authentication relationship cannot be torn down. To prevent this issue, set a lifetime value. If valid packets are received within the lifetime, the RSVP authentication lifetime is reset. If no valid packets received after the lifetime elapses, the RSVP-TE authentication relationship is torn down.The authentication period must be greater than or equal to three times as long as the update time.The default value is recommended."
}