{
    "PageTitle": "whitelist session-car self-ping",
    "FuncDef": "The whitelist session-car self-ping command sets Session-CAR parameters for the self-ping whitelist.\nThe undo whitelist session-car self-ping command restores the default Session-CAR values for the self-ping whitelist.\nBy default, the CIR, CBS, PIR, and PBS of the Session-CAR function for the self-ping whitelist are 256 kbit/s, 50000 bytes, 600 kbit/s, and 76800 bytes, respectively.",
    "CLIs": [
        "whitelist session-car self-ping { cir <cir-value> | cbs <cbs-value> | pir <pir-value> | pbs <pbs-value> } *",
        "undo whitelist session-car self-ping [ { cir <cir-value> | cbs <cbs-value> | pir <pir-value> | pbs <pbs-value> } * ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "cir cir-value",
            "Info": "Specifies a committed information rate (CIR), that is, the average rate at which packets can be transmitted or forwarded.\nThe value is an integer ranging from 1 to 1000000, in kbit/s. The default value is 256."
        },
        {
            "Parameters": "cbs cbs-value",
            "Info": "Specifies a committed burst size (CBS), that is, the committed volume of burst traffic that can pass instantly.\nThe value is an integer ranging from 1 to 9000000, in bytes. The default value is 50000."
        },
        {
            "Parameters": "pir pir-value",
            "Info": "Specifies a peak information rate (PIR), that is, the peak rate at which packets can be transmitted or forwarded.\nThe value is an integer ranging from 1 to 1000000, in kbit/s. The default value is 600."
        },
        {
            "Parameters": "pbs pbs-value",
            "Info": "Specifies a peak burst size (PBS), that is, the peak volume of burst traffic that can pass instantly.\nThe value is an integer ranging from 1 to 9000000, in bytes. The default value is 76800."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] whitelist session-car self-ping cir 2 cbs 1600 pir 4000 pbs 5000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a device receives a large number of self-ping messages, you can run the whitelist session-car self-ping command to modify the bandwidth values as needed for the message channels between self-ping sessions. This configuration ensures that self-ping messages can be properly sent.\nPrecautions\npir-value must be greater than or equal to cir-value. If you attempt to set a pir-value value smaller than cir-value, the following error message will be displayed: \"Error: The pir %d must be greater than or equal to the cir %d.\"\npbs-value must be greater than or equal to cbs-value. If you attempt to set a pbs-value value smaller than cbs-value, the following error message will be displayed: \"Error: The pbs %d must be greater than or equal to the cbs %d.\""
}