{
    "PageTitle": "path explicit-path",
    "FuncDef": "The path explicit-path command configures explicit paths to leaf nodes on a P2MP TE tunnel.\nThe undo path explicit-path command deletes all explicit paths to leaf nodes on the P2MP TE tunnel.\nBy default, no explicit path is specified for each leaf node.",
    "CLIs": [
        "path explicit-path <path-name>",
        "undo path explicit-path"
    ],
    "ParentView": [
        "Leaf node view"
    ],
    "ParaDef": [
        {
            "Parameters": "path-name",
            "Info": "Specifies a name of an explicit path. The parameter is specified using the explicit-path command.\nThe value is a string of 1 to 128 case-insensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] explicit-path path1",
            "[*HUAWEI-explicit-path-path1] next hop 4.4.4.4",
            "[*HUAWEI-explicit-path-path1] quit",
            "[*HUAWEI] mpls te leaf-list iptvch1",
            "[*HUAWEI-mpls-te-leaf-list-iptvch1] destination 2.2.2.2",
            "[*HUAWEI-mpls-te-leaf-list-iptvch1-destination-2.2.2.2] path explicit-path path1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA P2MP TE tunnel can be established using constraint shortest path first (CSPF) to calculate a path that originates from the ingress and is destined for each leaf node. It can also be established over explicit paths. Configuring explicit paths facilitates the control and planning of the paths over which a P2MP TE tunnel is established. A user can configure an explicit path for a specific leaf node or each leaf node. The path explicit-path command configures explicit paths to leaf nodes.\nPrerequisites\nLeaf nodes have been created in a leaf list using the destination command.\nConfiguration Impact\nConfiguring an explicit path for path planning must prevent a re-merge or cross-over event."
}