{
    "PageTitle": "mpls te tie-breaking (Tunnel interface view)",
    "FuncDef": "The mpls te tie-breaking command configures a rule for selecting a route from multiple equal-cost routes to the destination.\nThe undo mpls te tie-breaking command restores the default tie-breaker.\nBy default, the random routing principle is used.",
    "CLIs": [
        "mpls te tie-breaking { least-fill | most-fill | random }",
        "undo mpls te tie-breaking"
    ],
    "ParentView": [
        "Tunnel interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "least-fill",
            "Info": "The path with maximum available bandwidth ratio is preferred.\n-"
        },
        {
            "Parameters": "most-fill",
            "Info": "The path with minimum available bandwidth ratio is preferred.\n-"
        },
        {
            "Parameters": "random",
            "Info": "Path selection is random.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] interface tunnel 1",
            "[*HUAWEI-Tunnel1] tunnel-protocol mpls te",
            "[*HUAWEI-Tunnel1] mpls te tie-breaking least-fill"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA rule for selecting a route configured in the local tunnel interface view is preferred for a tunnel. If no rule is configured in the tunnel interface view, a rule configured in the MPLS view is used.\nA route is selected based on the ratio of the used available bandwidth to the maximum reservable bandwidth. If least-fill is configured, the route with the lowest ratio is selected; if most-fill is configured, the route with the highest ratio is selected.\nThe Most-fill and Least-fill modes are only effective when the difference in bandwidth usage between the two links exceeds 10%, such as 50% of link A bandwidth utilization and 45% of link B bandwidth utilization. The value is 5%. At this time, the Most-fill and Least-fill modes do not take effect, and the Random mode is still used."
}