{
    "PageTitle": "mpls te passive-tunnel",
    "FuncDef": "The mpls te passive-tunnel command enables the reverse tunnel attribute.\nThe undo mpls te passive-tunnel command disables the reverse tunnel attribute.\nBy default, the reverse tunnel attribute is disabled.",
    "CLIs": [
        "mpls te passive-tunnel",
        "undo mpls te passive-tunnel"
    ],
    "ParentView": [
        "Tunnel interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] interface Tunnel10",
            "[*HUAWEI-Tunnel10] tunnel-protocol mpls te",
            "[*HUAWEI-Tunnel10] destination 3.3.3.3",
            "[*HUAWEI-Tunnel10] mpls te signal-protocol cr-static",
            "[*HUAWEI-Tunnel10] mpls te tunnel-id 1",
            "[*HUAWEI-Tunnel10] mpls te passive-tunnel"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA static bidirectional co-routed LSP is a type of LSP over which two flows are transmitted in opposite directions by the same nodes over the same links. A static bidirectional co-routed LSP is established manually. To configure a static bidirectional co-routed LSP, configure MPLS forwarding entries in both directions on each node of a path over which the bidirectional CR-LSP is to be established and bind the two CR-LSPs in opposite directions together on both the ingress and egress.\nIn addition to two forwarding tables for packets sent in opposite directions, the following configurations need to be performed on the egress:\nRun the mpls te passive-tunnel command to enable the reverse tunnel attribute. The tunnel interface that is configured and enabled with the reverse tunnel attribute on the egress can only be bound to a reverse CR-LSP. This allows the reverse LSP to be used by upper-layer applications.Run the mpls te binding command to bind a tunnel interface to the specified static bidirectional co-routed LSP on the egress. This allows the tunnel interface to go Up.\n\nPrerequisites\nStatic CR-LSP signaling has been enabled using the mpls te signal-protocol cr-static command in the tunnel interface view."
}