{
    "PageTitle": "mpls te backup frr-in-use (Tunnel interface view)",
    "FuncDef": "The mpls te backup frr-in-use command configures the system to use a TE FRR bypass tunnel if a primary CR-LSP fails (which means the primary CR-LSP is in the FRR In-use state) and attempts to set up a backup CR-LSP while attempting to restore the primary CR-LSP.\nThe undo mpls te backup frr-in-use command restores the default configuration.\nBy default, if a primary CR-LSP fails, the system uses a TE FRR bypass tunnel and attempts to restore the primary CR-LSP, but does not set up a backup CR-LSP.",
    "CLIs": [
        "mpls te backup frr-in-use",
        "undo mpls te backup frr-in-use"
    ],
    "ParentView": [
        "Tunnel interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] mpls rsvp-te",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] interface tunnel 1",
            "[*HUAWEI-Tunnel1] tunnel-protocol mpls te",
            "[*HUAWEI-Tunnel1] destination 2.2.2.2",
            "[*HUAWEI-Tunnel1] mpls te backup ordinary",
            "[*HUAWEI-Tunnel1] mpls te fast-reroute",
            "[*HUAWEI-Tunnel1] mpls te backup frr-in-use"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe mpls te backup frr-in-use command provides either of the following backup functions to protect traffic on a primary CR-LSP if the primary CR-LSP fails:\nIf ordinary backup is configured, traffic switches to a TE FRR bypass tunnel and the system attempts to set up an ordinary backup CR-LSP while attempting to restore the primary CR-LSP. If the ordinary backup CR-LSP is set up successfully before the primary CR-LSP is restored, traffic switches to the backup CR-LSP.If hot standby is configured and a hot-standby backup CR-LSP is Up, traffic switches to a TE FRR bypass tunnel and immediately to the hot-standby backup CR-LSP, and the system attempts to restore the primary CR-LSP. Alternatively, if hot standby is configured but a hot-standby CR-LSP is Down, the follow-up procedure is the same as that in ordinary backup.\nConfiguring ordinary backup together with the mpls te backup frr-in-use command is recommended, saving bandwidth and improving tunnel security.\n\nPrerequisites\nHot standby or ordinary backup has been enabled to protect end-to-end protection using the mpls te backup ordinary command, and TE FRR has been enabled to provide local protection by using the mpls te fast-reroute command."
}