{
    "PageTitle": "mpls te self-ping enable (Tunnel interface view)",
    "FuncDef": "The mpls te self-ping enable command enables the self-ping of the local tunnel.\nThe undo mpls te self-ping enable command disables the self-ping of the local tunnel.\nBy default, the local tunnel self-ping capability is disable.",
    "CLIs": [
        "mpls te self-ping enable",
        "undo mpls te self-ping enable"
    ],
    "ParentView": [
        "Tunnel interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[*HUAWEI] interface tunnel1",
            "[*HUAWEI-Tunnel1] tunnel-protocol mpls te",
            "[*HUAWEI-Tunnel1] mpls te self-ping enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe mpls te self-ping enable command in the MPLS view enables self-ping on all RSVP TE P2P tunnel interfaces on which the mpls te self-ping block commands have not been run.\nThe difference between the mpls te self-ping block command and the undo mpls te self-ping enable command in the RSVP TE P2P tunnel interface view is as follows:\nIf the mpls te self-ping enable command has been run in the MPLS view of a RSVP TE P2P tunnel interface, the interface still obtains the self-ping capability by default even if the undo mpls te self-ping enable command is run.If the mpls te self-ping block command has been run on a RSVP TE P2P tunnel interface, the interface no longer obtains the self-ping capability even if the mpls te bfd enable command is run in the MPLS view of the tunnel interface.To enable the self-ping capability on a majority of RSVP TE P2P tunnel interfaces, run the mpls te self-ping block command to block self-ping on a minority of interfaces and then run the mpls te self-ping enable command in the MPLS view to enable the self-ping capability on the other interfaces.To enable self-ping capability on a few RSVP TE P2P tunnel interfaces, run the mpls te self-ping enable command on these interfaces and then run the undo mpls te self-ping enable command or the mpls te self-ping block command to disable self-ping from these interfaces."
}