{
    "PageTitle": "mpls te protected-interface (Tunnel interface view)",
    "FuncDef": "The mpls te protected-interface command specifies the interface to be protected by a bypass tunnel.\nThe undo mpls te protected-interface command deletes the configuration.\nBy default, no interface is protected by a bypass tunnel.",
    "CLIs": [
        "mpls te protected-interface { <interface-type> <interface-number> | <interface-name> }",
        "undo mpls te protected-interface { <interface-type> <interface-number> | <interface-name> }"
    ],
    "ParentView": [
        "Tunnel interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "interface-type interface-number",
            "Info": "Specifies the type and number of an interface to be protected.\nThe value is a string of 1 to 255 characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] interface GigabitEthernet1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] mpls",
            "[*HUAWEI-GigabitEthernet1/0/0] mpls te",
            "[*HUAWEI-GigabitEthernet1/0/0] quit",
            "[*HUAWEI] interface tunnel 3",
            "[*HUAWEI-Tunnel3] tunnel-protocol mpls te",
            "[*HUAWEI-Tunnel3] mpls te protected-interface GigabitEthernet 1/0/0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nEnabling TE FRR improves tunnel security. TE FRR sets up a bypass tunnel to protect a specified node or link.\nThe mpls te protected-interface command must be used to specify an interface to be protected by a bypass tunnel; otherwise, protection provided by the bypass tunnel fails.\nPrerequisites\nThe MPLS TE tunneling protocol has been specified using the tunnel-protocol mpls te command.\nPrecautions\nThe mpls te protected-interface command must be configured together with the mpls te bypass-tunnel command on the same tunnel interface. Otherwise, the mpls te protected-interface command cannot take effect after being run.\nA bypass tunnel protects a maximum number of 24 MPLS TE-enabled interfaces.\nThe mpls te protected-interface command run in the tunnel interface view cannot be configured with the following commands:\nmpls te fast-reroutempls te backupmpls te detour"
}