{
    "PageTitle": "mpls te leaf-list (Tunnel interface view)",
    "FuncDef": "The mpls te leaf-list command configures a leaf list for a P2MP TE tunnel. The leaf list allows the ingresses to establish sub-LSPs based on the leaf node addresses.\nThe undo mpls te leaf-list command deletes the leaf list configured for the P2MP RSVP-TE tunnel.\nBy default, no leaf list is configured for a P2MP TE tunnel.",
    "CLIs": [
        "mpls te leaf-list <leaf-list-name>",
        "undo mpls te leaf-list"
    ],
    "ParentView": [
        "Tunnel interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "leaf-list-name",
            "Info": "Specifies the name of a leaf list. The parameter is specified running the mpls te leaf-list command in the system view.\nThe name is a string of 1 to 31 case-sensitive characters. The name cannot start with an underscore (_) and when quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] mpls te p2mp-te",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls te leaf-list iptvch1",
            "[*HUAWEI-mpls-te-leaf-list-iptvch1] destination 2.2.2.2",
            "[*HUAWEI-mpls-te-leaf-list-iptvch1] quit",
            "[*HUAWEI] interface Tunnel 10",
            "[*HUAWEI-Tunnel10] tunnel-protocol mpls te",
            "[*HUAWEI-Tunnel10] mpls te p2mp-mode",
            "[*HUAWEI-Tunnel10] mpls te leaf-list iptvch1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nVRP supports the way of using a leaf list to manage leaf nodes on a P2MP TE tunnel. When a P2MP TE tunnel is being configured, a leaf list must be specified for the tunnel. This process ensures that the ingress on the tunnel establishes sub-LSPs based on the leaf nodes addresses in the leaf list.\nPrerequisites\nA leaf list has been configured using the mpls te leaf-list command.The tunnel has been switched from the P2P to the P2MP mode using the mpls te p2mp-mode command."
}