{
    "PageTitle": "mpls te reverse-lsp",
    "FuncDef": "The mpls te reverse-lsp command configures a reverse CR-LSP for a tunnel on a specified tunnel interface.\nThe undo mpls te reverse-lsp command tears down a reverse CR-LSP for a tunnel on a specified tunnel interface.\nBy default, no reverse CR-LSP is specified in a tunnel interface view.",
    "CLIs": [
        "mpls te reverse-lsp protocol rsvp-te ingress-lsr-id <ingress-lsr-id> tunnel-id <tunnel-id>",
        "mpls te reverse-lsp protocol static lsp-name <lsp-name>",
        "undo mpls te reverse-lsp"
    ],
    "ParentView": [
        "Tunnel interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "ingress-lsr-id ingress-lsr-id",
            "Info": "Specifies the ingress LSR ID of a reverse CR-LSP.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "tunnel-id tunnel-id",
            "Info": "Specifies the tunnel ID of a reverse CR-LSP.\nThe value is an integer ranging from 1 to 65535."
        },
        {
            "Parameters": "protocol",
            "Info": "Reverse LSP protocol.\n-"
        },
        {
            "Parameters": "static",
            "Info": "Indicates that the protocol type is set to static for a reverse CR-LSP on a specified tunnel interface.\n-"
        },
        {
            "Parameters": "lsp-name lsp-name",
            "Info": "Specifies the name of a reverse CR-LSP.\nThe value is a string of 1 to 35 case-insensitive characters, spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "rsvp-te",
            "Info": "Indicates the type of a protocol based on which the reverse CR-LSP is established.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] mpls rsvp-te",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] interface Tunnel 10",
            "[*HUAWEI-Tunnel10] tunnel-protocol mpls te",
            "[*HUAWEI-Tunnel10] mpls te reverse-lsp protocol rsvp-te ingress-lsr-id 1.1.1.1 tunnel-id 100"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe tunnel-id must be configured before committing the tunnel configuration, or it will fail to create tunnel.\nPrecautions\nWhen the label to be advertised is explicit-null and implicit-null, run the mpls te reverse-lsp command to specify a reverse RSVP-TE LSP function fails. After the undo mpls te reverse-lsp command is run, the reverse LSP in a bidirectional co-routed LSP in a protection tunnel group is torn down. As a result, the protection tunnel group becomes unavailable."
}