{
    "PageTitle": "mpls te signalled tunnel-name (Tunnel interface view)",
    "FuncDef": "The mpls te signalled tunnel-name command configures the name for a TE tunnel.\nThe undo mpls te signalled tunnel-name command restores the default TE tunnel name.\nBy default, the name of a tunnel interface on the ingress is used as a tunnel name.",
    "CLIs": [
        "mpls te signalled tunnel-name <signalled-tunnel-name>",
        "undo mpls te signalled tunnel-name"
    ],
    "ParentView": [
        "Tunnel interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "signalled-tunnel-name",
            "Info": "Tunnel Name.\nThe value is a string of 1 to 63 case-sensitive characters, spaces or slashes (/) not supported. However, when quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] interface Tunnel 10",
            "[*HUAWEI-Tunnel10] tunnel-protocol mpls te",
            "[*HUAWEI-Tunnel10] mpls te signalled tunnel-name LSRAtoLSRC"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA tunnel interface name is used as a tunnel name by default, for example, Tunnel 10. Alternatively, the mpls te signalled tunnel-name command can be used to configure a TE tunnel name. For example, a TE tunnel from LSR A to LSR C is named LSRAtoLSRC.\nPrerequisites\nMPLS TE has been enabled using the mpls te command.\nConfiguration Impact\nIf a TE tunnel name is specified, RSVP signaling messages will carry the specified name. If a configured TE tunnel name is deleted or no TE tunnel name is specified, RSVP signaling messages will carry the TE tunnel interface name as the TE tunnel name.\nPrecautions\nA TE tunnel name must be unique on an entire device.\nThe mpls te signalled tunnel-name command or its undo form takes effect on a TE tunnel established by using only RSVP signaling, not a static route."
}