{
    "PageTitle": "mpls te srlg path-calculation",
    "FuncDef": "The mpls te srlg path-calculation command configures an SRLG-based path calculation mode.\nThe undo mpls te srlg path-calculation command deletes an SRLG-based path calculation mode.\nBy default, when calculating a path, CSPF does not consider an SRLG constraint or check whether or not the primary tunnel and a bypass tunnel or a hot-standby CR-LSP are in the same SRLG.",
    "CLIs": [
        "mpls te srlg path-calculation { strict | preferred }",
        "mpls te srlg path-calculation",
        "undo mpls te srlg path-calculation"
    ],
    "ParentView": [
        "MPLS view"
    ],
    "ParaDef": [
        {
            "Parameters": "strict",
            "Info": "Indicates that CSPF must calculate a bypass tunnel or a hot-standby CR-LSP based on the SRLG attribute. A link that a primary tunnel uses and a link that a bypass tunnel or hot-standby CR-LSP uses must be in different SRLGs.\n-"
        },
        {
            "Parameters": "preferred",
            "Info": "Indicates that CSPF prefers the SRLG attribute when calculating a hot-standby CR-LSP for the first time. If calculation fails, CSPF no longer uses the SRLG attribute as a constraint.\nIf no path calculation mode is specified in the mpls te srlg path-calculation command, SRLG-based path calculation is performed in preferred mode by default.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] mpls te srlg path-calculation strict"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn the TE hot standby scenario, the mpls te srlg path-calculation command on the ingress of a primary tunnel is run to enable CSPF to calculate a path for a hot-standby CR-LSP based on the SRLG attribute.\nIf strict is configured, CSPF uses an SRLG as a constraint when calculating a path for a hot-standby CR-LSP.\nIf preferred is configured, CSPF uses an SRLG as a constraint when calculating a path for a hot-standby CR-LSP for the first time; if calculation fails, CSPF no longer uses the SRLG as a constraint.\nWhen SRLG is used, only the SRLG configured on the out-interface of corresponding main LSP is considered."
}