{
    "PageTitle": "mpls te auto-frr reoptimization",
    "FuncDef": "The mpls te auto-frr reoptimization command enables auto bypass tunnel re-optimization.\nThe undo mpls te auto-frr reoptimization command disables auto bypass tunnel re-optimization.\nBy default, auto bypass tunnel re-optimization is disabled.",
    "CLIs": [
        "mpls te auto-frr reoptimization [ frequency <interval> ]",
        "undo mpls te auto-frr reoptimization"
    ],
    "ParentView": [
        "MPLS view"
    ],
    "ParaDef": [
        {
            "Parameters": "frequency interval",
            "Info": "Specifies the re-optimization interval. Paths are recalculated at the interval based on auto bypass tunnel constraints. If an optimal path to the same destination is available, the system re-optimizes the auto bypass tunnel.\nThe value is an integer ranging from 60 to 604800, in seconds. The default value is 3600s (one hour)."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] mpls te auto-frr reoptimization frequency 432"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nNetwork changes often cause the changes in optimal paths. Run the mpls te auto-frr reoptimization to allow the system to re-optimize an auto bypass tunnel if an optimal path to the same destination is found due to some reasons, such as the changes in the cost. In this manner, network resources are optimized.\nAuto bypass tunnel re-optimization can be classified into the following modes:\nAutomatic re-optimization: Auto bypass tunnels are re-optimized at intervals, requiring no manual intervention. The mpls te auto-frr reoptimization command can be used to implement the function, and this command takes effect on the auto bypass tunnels that have been already set up successfully.Manual re-optimization: After the mpls te auto-frr reoptimization command is run, run the mpls te reoptimization (user view) command to re-optimize auto bypass tunnels manually.\n\nPrerequisites\nMPLS TE has been enabled using the mpls te command."
}