{
    "PageTitle": "mpls te bfd enable (MPLS view)",
    "FuncDef": "The mpls te bfd enable command enables BFD for TE LSP globally.\nThe undo mpls te bfd enable command disables BFD for TE LSP globally.\nBy default, BFD for TE LSP is disabled.",
    "CLIs": [
        "mpls te bfd enable",
        "mpls te bfd enable one-arm-echo",
        "undo mpls te bfd enable"
    ],
    "ParentView": [
        "MPLS view"
    ],
    "ParaDef": [
        {
            "Parameters": "one-arm-echo",
            "Info": "One arm echo mode.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bfd",
            "[*HUAWEI-bfd] quit",
            "[*HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] mpls te bfd enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe mpls te bfd enable command is used to enable BFD for TE LSP for a TE tunnel, and the mpls te bfd command is used to set BFD parameters for detecting faults in the TE tunnel.This command does not take effect on Initiated tunnels.\nThe mpls te bfd enable command in the MPLS view enables BFD for TE LSP on all tunnel interfaces on which the mpls te bfd block and undo mpls te bfd enable commands have not been run. In addition, BFD parameters configured using the mpls te bfd command in the MPLS view take effect on these interfaces.\nThe one-arm-echo parameter is available only for manual tunnels, not automatic tunnels that are established based on the trigger of controllers.\nThe difference between the mpls te bfd block command and the undo mpls te bfd enable command in the tunnel interface view is as follows:\nIf the mpls te bfd enable command has been run in the MPLS view of a tunnel interface, the interface still obtains the BFD for TE LSP capability by default even if the mpls te bfd block command is run.If the mpls te bfd block command has been run on a tunnel interface, the interface no longer obtains the BFD for TE LSP capability even if the mpls te bfd enable command is run in the MPLS view of the tunnel interface.\nIf the mpls te bfd enable option-tlv command is configured in tunnel interface view, the tunnel interface enables the BFD check function in interworking mode.\nTo enable the BFD for TE LSP capability on a majority of interfaces, run the mpls te bfd block command to block BFD for TE LSP on a minority of interfaces and then run the mpls te bfd enable command in the MPLS view to enable the BFD for TE LSP capability on the other interfaces.To enable BFD for TE LSP capability on a few interfaces, run the mpls te bfd enable command on these interfaces and then run the undo mpls te bfd enable command or the mpls te bfd block command to disable BFD for TE LSP from these interfaces."
}