{
    "PageTitle": "mpls te bandwidth dynamic (Interface view)",
    "FuncDef": "The mpls te bandwidth dynamic command sets the proportion of the BC0 dynamic reservable bandwidth to the maximum reservable bandwidth on an MPLS TE interface.\nBy default, the proportion of the BC0 dynamic reservable bandwidth to the maximum reservable bandwidth is not set on an MPLS TE interface.",
    "CLIs": [
        "mpls te bandwidth dynamic bc0 <bc0-bw-percentage>"
    ],
    "ParentView": [
        "40GE interface view",
        "IP-Trunk interface view",
        "GE electrical interface view",
        "Eth-Trunk sub-interface view",
        "GMPLS-UNI interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "POS sub-interface view",
        "GE sub-interface view",
        "XGE interface view",
        "25GE sub-interface view",
        "100GE interface view",
        "XGE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "25GE interface view",
        "100ge sub-interface view",
        "Eth-Trunk interface view",
        "40GE sub-interface view",
        "10GE sub-interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "bc0 bc0-bw-percentage",
            "Info": "BC0 dynamic bandwidth value(%).\nThe value is a percent integer ranging from 1 to 100."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] mpls",
            "[*HUAWEI-GigabitEthernet1/0/0] mpls te",
            "[*HUAWEI-GigabitEthernet1/0/0] mpls te bandwidth max-reservable-bandwidth dynamic 80",
            "[*HUAWEI-GigabitEthernet1/0/0] mpls te bandwidth dynamic bc0 60"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA reservable bandwidth value is set on each interface along an MPLS TE tunnel. The MPLS TE module checks whether links meets the bandwidth requirements of all tunnels based on the reservable bandwidth. If a fixed bandwidth value is set on an interface and the physical bandwidth changes on the interface, the MPLS TE module cannot correctly evaluate link bandwidth resources because the available bandwidth may be different than the configured reservable bandwidth.\nTo remain the reserved bandwidth within the reservable bandwidth range, run the mpls te bandwidth max-reservable-bandwidth dynamic to set the maximum reservable bandwidth on the interface and run the mpls te bandwidth dynamic command to set the BC0 dynamic bandwidth. The former is the proportion (percentage) of the maximum reservable bandwidth to the physical bandwidth. The later is the proportion (percentage) of BC0 bandwidth to the maximum reservable bandwidth. The two parameters help the interface dynamically reserve bandwidth for an MPLS TE tunnel.\nTo specify the proportion of the BC0 dynamic bandwidth to the maximum reservable bandwidth, run the mpls te bandwidth dynamic command on a specific MPLS TE interface.\nPrerequisites\nEither of the following steps must be performed before you run the mpls te bandwidth dynamic command:\nRun the mpls te bandwidth max-reservable-bandwidth command to set the maximum reservable bandwidth for MPLS TE links.Run the mpls te bandwidth max-reservable-bandwidth dynamic command to set the dynamic maximum reservable bandwidth for MPLS TE links.\n\nConfiguration Impact\nWhen both the mpls te bandwidth dynamic command and the mpls te bandwidth command are run in a random order on an interface, the last executed command takes effect."
}