{
    "PageTitle": "mpls te bandwidth change thresholds",
    "FuncDef": "The mpls te bandwidth change thresholds command sets the percentage threshold of physical link bandwidth used by an MPLS TE tunnel for flooding link information.\nThe undo mpls te bandwidth change thresholds command restores the default percentage threshold.\nBy default, if the ratio of the reserved (or released) bandwidth for a tunnel to the remaining bandwidth in a Traffic Engineering DataBase (TEDB) is greater than or equal to 10%, an IGP floods link information and CSPF updates the TEDB.",
    "CLIs": [
        "mpls te bandwidth change thresholds up <percent-up>",
        "mpls te bandwidth change thresholds down <percent-down>",
        "undo mpls te bandwidth change thresholds up",
        "undo mpls te bandwidth change thresholds down"
    ],
    "ParentView": [
        "40GE interface view",
        "IP-Trunk interface view",
        "GE electrical interface view",
        "Eth-Trunk sub-interface view",
        "GMPLS-UNI interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "POS sub-interface view",
        "GE sub-interface view",
        "XGE interface view",
        "25GE sub-interface view",
        "100GE interface view",
        "XGE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "25GE interface view",
        "100ge sub-interface view",
        "Eth-Trunk interface view",
        "40GE sub-interface view",
        "10GE sub-interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "down percent-down",
            "Info": "Indicates the flooding percentage threshold of the bandwidth used by an MPLS TE tunnel. If the ratio of the bandwidth used by an MPLS TE tunnel to the remaining link bandwidth in a TEDB is greater than or equal to the threshold, an IGP floods link information, and CSPF updates the TEDB.\nThe value is an integer ranging from 0 to 100."
        },
        {
            "Parameters": "up percent-up",
            "Info": "Indicates the flooding percentage threshold of the bandwidth released by an MPLS TE tunnel. If the ratio of the bandwidth released by an MPLS TE tunnel to the remaining link bandwidth in a TEDB is greater than or equal to the threshold, an IGP floods link information, and CSPF updates the TEDB.\nThe value is an integer ranging from 0 to 100. The default value is 10."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] interface GigabitEthernet1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] mpls",
            "[*HUAWEI-GigabitEthernet1/0/0] mpls te",
            "[*HUAWEI-GigabitEthernet1/0/0] mpls te bandwidth change thresholds up 25",
            "[*HUAWEI-GigabitEthernet1/0/0] mpls te bandwidth change thresholds down 10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the bandwidth changes slightly, flooding the bandwidth wastes network resources. Assume the bandwidth of a link is 100 Mbit/s. If 100 TE tunnels each with the bandwidth of 1 Mbit/s are set up, the system floods link information 100 times. If the flooding threshold is set to 10%, no bandwidth is flooded when tunnels 1 to 9 are created. After tunnel 10 is created, the bandwidth of tunnels 1 to 10 (10 Mbit/s in total) is flooded. Similarly, no bandwidth is flooded when tunnels 11 to 18 are created. After tunnel 19 is created, the bandwidth of tunnels 11 to 19 is flooded, and so on."
}