{
    "PageTitle": "mpls te bandwidth max-reservable-bandwidth dynamic",
    "FuncDef": "The mpls te bandwidth max-reservable-bandwidth dynamic command sets the proportion of the maximum reservable bandwidth to the physical bandwidth of a specific interface.\nBy default, the bandwidth proportion is not specified on an MPLS TE interface.",
    "CLIs": [
        "mpls te bandwidth max-reservable-bandwidth dynamic <max-dynamic-bw-value>"
    ],
    "ParentView": [
        "40GE interface view",
        "IP-Trunk interface view",
        "GE electrical interface view",
        "Eth-Trunk sub-interface view",
        "GMPLS-UNI interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "POS sub-interface view",
        "GE sub-interface view",
        "XGE interface view",
        "25GE sub-interface view",
        "100GE interface view",
        "XGE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "25GE interface view",
        "100ge sub-interface view",
        "Eth-Trunk interface view",
        "40GE sub-interface view",
        "10GE sub-interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "max-dynamic-bw-value",
            "Info": "Value of dynamic bandwidth(%).\nThe value is a percent integer ranging from 1 to 1000."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] mpls",
            "[*HUAWEI-GigabitEthernet1/0/0] mpls te",
            "[*HUAWEI-GigabitEthernet1/0/0] mpls te bandwidth max-reservable-bandwidth dynamic 80"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAn MPLS TE tunnel can only be established on interfaces with sufficient bandwidth reserved for the tunnel. Since the physical bandwidth requirements are not static, the amount of bandwidth that can be reserved for an MPLS TE interface must be flexible, the statically reserved bandwidth may exceed the maximum bandwidth that can be reserved on that interface. In this case, the interface cannot reserve sufficient bandwidth for MPLS TE links.\nTo enable the interface to dynamically reserve bandwidth within the reservable bandwidth range, set the following parameters:\nProportion of the maximum reservable bandwidth to the physical bandwidth of the interfaceProportion of the bandwidth in a BC pool to the maximum reservable bandwidth\nThe two parameters help the interface dynamically reserve bandwidth for an MPLS TE tunnel.\nTo set the proportion of the maximum reservable bandwidth to the physical bandwidth of a specific interface, run the mpls te bandwidth max-reservable-bandwidth dynamic command.\n\nPrerequisites\nMPLS TE has been enabled using the mpls te command on the interface.\nConfiguration Impact\nWhen both the mpls te bandwidth max-reservable-bandwidth dynamic command and the mpls te bandwidth max-reservable-bandwidth command are run in a random order on an interface, the last executed command takes effect.\nAfter the mpls te bandwidth max-reservable-bandwidth dynamic command is run on an interface, only the mpls te bandwidth dynamic command can be used to set the proportion of the bandwidth in a BC pool to the maximum reservable bandwidth."
}