{
    "PageTitle": "mpls te reoptimization link-up disable",
    "FuncDef": "The mpls te reoptimization link-up disable command disables RSVP-TE tunnel re-optimization triggered by link changes.\nThe undo mpls te reoptimization link-up disable command enables RSVP-TE tunnel re-optimization triggered by link changes.\nBy default, link change-triggered RSVP-TE tunnel re-optimization is enabled.",
    "CLIs": [
        "mpls te reoptimization link-up disable",
        "undo mpls te reoptimization link-up disable"
    ],
    "ParentView": [
        "MPLS view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] mpls te reoptimization link-up disable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter the mpls te reoptimization command is run in the tunnel interface view, automatic tunnel re-optimization is enabled. If links are changed, CSPF recalculates paths to optimize tunnels. If route flapping occurs, tunnel re-optimization is repeatedly performed, which wastes network resources. To prevent this problem, run the mpls te reoptimization link-up disable command to disable RSVP-TE tunnel re-optimization triggered by links. After this command is run, tunnels are not optimized.\nPrerequisites\nMPLS TE has been enabled globally using the mpls te command.\nPrecautions\nThe mpls te reoptimization link-up disable command can be used to disable link change-triggered tunnel re-optimization only after automatic tunnel re-optimization has been enabled using the mpls te reoptimization command run in the tunnel interface view.\nThis command prevents tunnel re-optimization triggered by link changes. If the frequency interval parameter is set in the mpls te reoptimization command run in the tunnel interface view to enable tunnel re-optimization for a specific tunnel, the tunnel can be optimized properly.The mpls te reoptimization link-up disable command disables all tunnel re-optimization functions."
}