{
    "PageTitle": "mpls te pce passive-delegate report-only",
    "FuncDef": "The mpls te pce passive-delegate report-only command configures an ingress to report LSP information on TE tunnels to a PCE server and not to delegate LSPs to the PCE server.\nThe undo mpls te pce passive-delegate report-only command disables an ingress from reporting LSP information on TE tunnels to a PCE server.\nBy default, the ingress does not report LSP information on TE tunnels to a PCE server.",
    "CLIs": [
        "mpls te pce passive-delegate report-only",
        "undo mpls te pce passive-delegate report-only"
    ],
    "ParentView": [
        "Tunnel interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] interface Tunnel1",
            "[*HUAWEI-Tunnel1] tunnel-protocol mpls te",
            "[*HUAWEI-Tunnel1] mpls te pce passive-delegate report-only"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen PCE is used to calculate a path for an MPLS TE tunnel, the ingress must be configured as a PCE client. If the ingress has to delegate LSPs only in some TE tunnels to the PCE server, the ingress must report information about both delegated and undelegated LSPs to the PCE server, which helps the PCE server correctly calculate global bandwidth information. To implement partial LSP delegation, perform either of the following configurations:\nRun the mpls te pce delegate command in the MPLS view to enable the ingress to delegate LSPs in all TE tunnels to the PCE server. Then run the mpls te pce passive-delegate report-only command in a specified TE tunnel interface view to enable the ingress to report LSP information on the specified TE tunnel to the PCE server and withdraw LSP delegation from the PCE server.Run the mpls te pce passive-delegate report-only command in the MPLS view to enable the ingress to only report LSP information on all TE tunnels to the PCE server. Then run the mpls te pce delegate command in a specified TE tunnel interface view to enable the ingress to delegate LSPs in the specified TE tunnel to the PCE server.\n\nPrerequisites\nMPLS TE has been enabled using the mpls te command.\nThe tunneling protocol has been set to MPLS TE using the tunnel-protocol mpls te command on the tunnel interface.\nPrecautions\nIf both the mpls te pce passive-delegate report-only and mpls te pce delegate commands are run in the MPLS view, the later configuration overrides the previous one.\nIf both the mpls te pce passive-delegate report-only and mpls te pce delegate commands are run in the same tunnel interface view, the later configuration overrides the previous one.\nPCE is in conflict with ordinary CR-LSP backup.\nPCE is in conflict with best-effort CR-LSP backup.\nPCE is in conflict with P2MP TE."
}