{
    "PageTitle": "mpls te split-tunnel (Tunnel interface view)",
    "FuncDef": "The mpls te split-tunnel command configures an existing tunnel as a split tunnel.\nThe undo mpls te split-tunnel command deletes a split tunnel.\nBy default, no split tunnel is configured.",
    "CLIs": [
        "mpls te split-tunnel",
        "undo mpls te split-tunnel"
    ],
    "ParentView": [
        "Tunnel interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] interface Tunnel 10",
            "[*HUAWEI-Tunnel10] tunnel-protocol mpls te",
            "[*HUAWEI-Tunnel10] mpls te split-tunnel"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen a device computes an optimal path for a tunnel and fails to establish the tunnel due to insufficient bandwidth resources, a tunnel can be split into two to balance traffic to increase the bandwidth and bandwidth use efficiency.\nIf a controller finds that an original tunnel in an associated tunnel group needs bandwidth resources more than the available bandwidth of the original tunnel to an extent, the controller creates a split tunnel for the original tunnel and adds the split tunnel to the associated tunnel group. The original and split tunnels in the associated tunnel group balance traffic. After the controller finds that the traffic transmitted through the associated tunnel group falls below a specified threshold, the controller automatically removes a split tunnel from the associated tunnel group and deletes the tunnel interface after a specified period of time.\nPrerequisites\nMPLS TE has been configured using the tunnel-protocol mpls te command on the tunnel interface of the split tunnel.\nPrecautions\nAn original tunnel of an associated tunnel group cannot be configured as a split tunnel.For a split tunnel in an associated tunnel group, its split tunnel attribute and tunnel ID cannot be deleted, and its destination IP address, protocol type, and bandwidth tunnel cannot be modified.A split tunnel cannot be function as an outbound interface of a route or monitored by BFD for tunnel.If an SR-MPLS TE tunnel is configured as a split tunnel, node labels cannot be configured.If the mpls te lock command is run on a tunnel interface, the commands used to configured and delete a split tunnel cannot be run.The mpls te split-tunnel and mpls te signal-protocol cr-static commands are mutually exclusive.The mpls te split-tunnel and mpls te fast-reroute commands are mutually exclusive.The mpls te split-tunnel and mpls te backup ordinary commands are mutually exclusive.The mpls te split-tunnel and mpls te protection tunnel commands are mutually exclusive.The mpls te split-tunnel and mpls te detour commands are mutually exclusive.The mpls te split-tunnel and mpls te bypass-tunnel commands are mutually exclusive.The mpls te split-tunnel and mpls te protected-interface commands are mutually exclusive.The mpls te split-tunnel and mpls te p2mp-mode commands are mutually exclusive.The mpls te split-tunnel and mpls te reverse-lsp commands are mutually exclusive.The mpls te split-tunnel and mpls te reserved-for-binding commands are mutually exclusive.The mpls te split-tunnel and mpls te igp shortcut commands are mutually exclusive.The mpls te split-tunnel and mpls te igp advertise commands are mutually exclusive."
}