{
    "PageTitle": "hotstandby-switch",
    "FuncDef": "The hotstandby-switch force command forcibly switches traffic from a primary CR-LSP to a hot-standby CR-LSP.\nThe hotstandby-switch clear command disables the forcible switchover function.",
    "CLIs": [
        "hotstandby-switch { clear | force }"
    ],
    "ParentView": [
        "Tunnel interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "clear",
            "Info": "Forcibly switches traffic from a hot-standby CR-LSP to a primary CR-LSP.\n-"
        },
        {
            "Parameters": "force",
            "Info": "Forcibly switches traffic from a primary CR-LSP to a hot-standby CR-LSP.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] interface Tunnel 10",
            "[*HUAWEI-Tunnel10] tunnel-protocol mpls te",
            "[*HUAWEI-Tunnel10] mpls te backup hot-standby",
            "[*HUAWEI-Tunnel10] hotstandby-switch force"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a hot-standby CR-LSP is established and a primary CR-LSP needs to be adjusted, run the hotstandby-switch force command to switch traffic forcibly to the hot-standby CR-LSP. After the primary CR-LSP has been adjusted, run the hotstandby-switch clear command to disable the forcible switchover function and switch traffic back to the primary CR-LSP.\nPrerequisites\nA hot-standby LSP has been created. The display mpls te tunnel-interface command output shows that the hot-standby LSP has been established.\nPrecautions\nWhen using the hotstandby-switch force command, note the following points:\nBefore running the hotstandby-switch force command to switch traffic to a hot-standby LSP, ensure that a backup CR-LSP has been established. Otherwise, packet loss occurs. You do not need to run the commit command to commit the hotstandby-switch force command configuration.If you configure the non-revertive operation mode for a hot-standby CR-LSP, the hotstandby-switch clear command configuration does not take effect.If you configure the revertive operation mode for a hot-standby CR-LSP and the revertive switching delay is not 0, running the hotstandby-switch clear command causes an intermediate CR-LSP switchover."
}