{
    "PageTitle": "mpls rsvp-te resv-rro transit",
    "FuncDef": "The mpls rsvp-te resv-rro transit command specifies the contents of a Record Route Object (RRO) carried in a Resv message on transit node.\nThe undo mpls rsvp-te resv-rro transit command restores the default RRO contents.\nBy default, the RRO carried in a Resv message sent by a transit LSP contains the address of the inbound interface and the label allocated to the upstream LSR, LSR ID and the label allocated to the upstream LSR, and address of the outbound interface.",
    "CLIs": [
        "mpls rsvp-te resv-rro transit { { incoming | incoming-with-label } | { routerid | routerid-with-label } | { outgoing | outgoing-with-label } } *",
        "undo mpls rsvp-te resv-rro transit"
    ],
    "ParentView": [
        "MPLS view"
    ],
    "ParaDef": [
        {
            "Parameters": "incoming",
            "Info": "Incoming interface.\n-"
        },
        {
            "Parameters": "incoming-with-label",
            "Info": "Incoming interface with label.\n-"
        },
        {
            "Parameters": "routerid",
            "Info": "Router ID.\n-"
        },
        {
            "Parameters": "routerid-with-label",
            "Info": "Router ID with label.\n-"
        },
        {
            "Parameters": "outgoing",
            "Info": "Outgoing interface.\n-"
        },
        {
            "Parameters": "outgoing-with-label",
            "Info": "Outgoing interface with label.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] mpls rsvp-te",
            "[*HUAWEI-mpls] mpls rsvp-te resv-rro transit routerid-with-label incoming outgoing-with-label"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen RSVP-TE is used to establish an MPLS TE tunnel, devices of different vendors cannot communicate because the sequence numbers of subobjects in RRO fields of Resv messages sent by these devices are inconsistent. The mpls rsvp-te resv-rro command can be used to adjust the sequence numbers of sub-objects in the RRO fields of Resv messages so that devices of different vendors can communicate.\nThis command can be used to specify the following contents of the RRO field in a Resv message:\nSubobjects in the RRO fieldWhether each subobject carries a label\n\nPrerequisites\nEnable MPLS RSVP-TE\nConfiguration Impact\nAfter the configuration, the content and sequence of the RRO in the Resv message are affected.\nPrecautions\nThe mpls rsvp-te resv-rro transit command takes effect only for new LSPs, not existing LSPs."
}