{
    "PageTitle": "color-flag",
    "FuncDef": "The color-flag command configures measurement flags.\nThe undo color-flag command restores the default measurement flags.\nBy default, the sixth bit in the type of service (ToS) field of the IPv4 packet header is used as the loss measurement flag; the seventh bit in the ToS field of the IPv4 packet header is used as the delay measurement flag. Using the default configurations is recommended.",
    "CLIs": [
        "color-flag loss-measure { tos-bit <tos-bit> | flags-bit0 } delay-measure { tos-bit <tos-bit> | flags-bit0 }",
        "color-flag loss-measure { tos-bit <tos-bit> | flags-bit0 } delay-measure none",
        "undo color-flag"
    ],
    "ParentView": [
        "IPFPM-DCP view"
    ],
    "ParaDef": [
        {
            "Parameters": "tos-bit tos-bit",
            "Info": "Specifies a bit from the third to seventh bits in the ToS field of the IPv4 packet header as a measurement flag.\nThe value is an integer ranging from 3 to 7."
        },
        {
            "Parameters": "flags-bit0",
            "Info": "Specifies Bit 0 in the Flags field of the IPv4 packet header as a measurement flag.\n-"
        },
        {
            "Parameters": "delay-measure",
            "Info": "Indicates IP FPM delay measurement.\n-"
        },
        {
            "Parameters": "loss-measure",
            "Info": "Indicates IP Flow Performance Monitor (IP FPM) packet loss measurement.\n-"
        },
        {
            "Parameters": "none",
            "Info": "Indicates that no measurement flags are set.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nqa ipfpm dcp",
            "[*HUAWEI-nqa-ipfpm-dcp] color-flag loss-measure tos-bit 3 delay-measure tos-bit 4"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBefore using IP FPM to measure network performance, run the color-flag command to specify a bit as a measurement flag based on network planning.\nPrerequisites\nThe nqa ipfpm dcp command has been run to enable DCP globally.\nPrecautions\nThe loss and delay measurement flags cannot use the same bit, and the bits used for loss and delay measurement must not have been used in other measurement tasks.\nThe IP FPM measurement flag can be configured only in Admin-VS. Other VSs use the measurement flag configurations in Admin-VS. If the measurement flag configuration conflicts with the QoS configuration, modify the measurement flag configuration in Admin-VS."
}