{
    "PageTitle": "authentication-mode (IPFPM-DCP view)",
    "FuncDef": "The authentication-mode command configures the authentication mode and password for a data collecting point (DCP).\nThe undo authentication-mode command deletes the authentication mode and password of a DCP.\nBy default, no authentication mode or password is configured for a DCP.",
    "CLIs": [
        "authentication-mode hmac-sha256 key-id <key-id> [ cipher ] password",
        "authentication-mode hmac-sha256 key-id <key-id> [ cipher ] password",
        "undo authentication-mode hmac-sha256"
    ],
    "ParentView": [
        "IPFPM-DCP view"
    ],
    "ParaDef": [
        {
            "Parameters": "key-id key-id",
            "Info": "Specifies the key ID for an authentication password of a DCP.\nThe value is an integer ranging from 1 to 64."
        },
        {
            "Parameters": "cipher",
            "Info": "Indicates that an authentication password is displayed in ciphertext.\n-"
        },
        {
            "Parameters": "password",
            "Info": "Specifies the authentication password of an DCP.\nThe value is a string of characters.\nThe value ranges from 1 to 255 for simple passwords.The value ranges from 24 or 32 to 432 for ciphertext passwords."
        },
        {
            "Parameters": "password",
            "Info": "Indicates the interactive mode for password configuration.\n-"
        },
        {
            "Parameters": "hmac-sha256",
            "Info": "Indicates the hashed message authentication code - secure hash algorithm 256 (HMAC-SHA256) authentication algorithm to be used for packets sent by a DCP to an MCP.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nqa ipfpm dcp",
            "[*HUAWEI-nqa-ipfpm-dcp] authentication-mode hmac-sha256 key-id 1 cipher Huawei-123"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nqa ipfpm dcp",
            "[*HUAWEI-nqa-ipfpm-dcp] authentication-mode hmac-sha256 key-id 1 password",
            "Plain text with length of 1-255, Encrypted text with length of 24 or 32-432",
            "Enter Password:",
            "Confirm Password:"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo enhance network security and performance statistics reliability, run the authentication-mode command so that authentication is performed during IP FPM performance statistics. An MCP and its associated DCPs must have the same authentication mode and password configured. The MCP processes packets only from the authenticated DCPs.\nPrerequisites\nThe nqa ipfpm dcp command has been run to enable DCP globally."
}