{
    "PageTitle": "tlp nexthop",
    "FuncDef": "The tlp nexthop command configures a next hop address for a TLP in an IP Flow Performance Measurement (IP FPM) instance.\nThe undo tlp nexthop command deletes a next hop address of a TLP in an IP FPM instance.\nBy default, no next hop address is configured for TLPs in an IP FPM instance.",
    "CLIs": [
        "tlp <tlp-id> [ index <index-id> ] nexthop <nexthop-ip-address>",
        "undo tlp <tlp-id> [ index <index-id> ] nexthop [ <nexthop-ip-address> ]"
    ],
    "ParentView": [
        "IPFPM-DCP instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "tlp-id",
            "Info": "Specifies a TLP ID.\nThe value is an integer ranging from 1 to 16777215."
        },
        {
            "Parameters": "index index-id",
            "Info": "Specifies a load balancing index.\nThe value is an integer ranging from 1 to 16."
        },
        {
            "Parameters": "nexthop nexthop-ip-address",
            "Info": "Specifies a next hop address.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nqa ipfpm dcp",
            "[*HUAWEI-nqa-ipfpm-dcp] instance 1",
            "[*HUAWEI-nqa-ipfpm-dcp-instance-1] tlp 100 nexthop 10.1.1.1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn the case of public tunnel detection, if the traffic of a device is diverted to downstream devices through a switch, the interface connecting the device and switch may be assigned the same label. In this case, MAC addresses must be used to differentiate the downstream devices. To configure a next hop address for a TLP in an IP FPM instance so that the corresponding MAC address is obtained based on the outbound interface and next hop address, run the tlp nexthop command. In a load-balancing scenario where different paths share the same interface, the index parameter must be configured to specify the load balancing index corresponding to the next hop address."
}