{
    "PageTitle": "authentication-mode (IPFPM-DCP instance view)",
    "FuncDef": "The authentication-mode command configures the authentication mode and password for an IP Flow Performance Measurement (IP FPM) instance.\nThe undo authentication-mode command deletes the authentication mode and password of an IP FPM instance.\nBy default, no authentication mode or password is configured for an IP FPM instance.",
    "CLIs": [
        "authentication-mode hmac-sha256 key-id <key-id-value> [ cipher ] <auth-text>",
        "authentication-mode hmac-sha256 key-id <key-id-value> [ cipher ] password",
        "undo authentication-mode hmac-sha256"
    ],
    "ParentView": [
        "IPFPM-DCP instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "cipher",
            "Info": "Indicates that an authentication password is displayed in ciphertext.\n-"
        },
        {
            "Parameters": "auth-text",
            "Info": "Specifies the authentication password of a DCP.\nThe value is a string of characters.\nThe value ranges from 1 to 255 for simple passwords.The value ranges from 24 or 32 to 432 for ciphertext passwords."
        },
        {
            "Parameters": "hmac-sha256",
            "Info": "Indicates the HMAC-SHA256 authentication algorithm to be used for packets sent by a DCP to an MCP.\n-"
        },
        {
            "Parameters": "key-id key-id-value",
            "Info": "Specifies the key ID for an authentication password of an IP FPM instance.\nThe value is an integer ranging from 1 to 64."
        },
        {
            "Parameters": "password",
            "Info": "Indicates the interactive mode for password configuration.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nqa ipfpm dcp",
            "[*HUAWEI-nqa-ipfpm-dcp] instance 1",
            "[*HUAWEI-nqa-ipfpm-dcp-instance-1] authentication-mode hmac-sha256 key-id 1 cipher Huawei-123"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nqa ipfpm dcp",
            "[*HUAWEI-nqa-ipfpm-dcp] instance 1",
            "[*HUAWEI-nqa-ipfpm-dcp-instance-1] authentication-mode hmac-sha256 key-id 1 password",
            "Plain text with length of 1-255, Encrypted text with length of 24 or 32-432",
            "Enter Password:",
            "Confirm Password:"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo enhance network security and performance statistics reliability, run the authentication-mode command so that authentication is performed during IP FPM performance statistics. An MCP and its associated DCPs must have the same authentication mode and password configured. The MCP processes packets only from the authenticated DCPs.\nPrerequisites\nThe instance command has been run to configure an IP FPM instance on a DCP.\nPrecautions\nIf no authentication mode or password is configured for an IP FPM instance on a DCP, the authentication mode and password configured for the DCP takes effect. If the authentication mode and password are configured in both the DCP view and IP FPM instance view, the configuration in the IP FPM instance view takes effect."
}