{
    "PageTitle": "mcp",
    "FuncDef": "The mcp command specifies a measurement control point (MCP) ID for all IP Flow Performance Measurement (IP FPM) instances on a data collecting point (DCP).\nThe undo mcp command deletes the MCP ID of all IP FPM instances on a DCP.\nBy default, no MCP ID is specified for IP FPM instances on a DCP.",
    "CLIs": [
        "mcp <mcp-id> [ port <port-number> ] [ vpn-instance <vpn-instance-name> | net-manager-vpn ]",
        "undo mcp"
    ],
    "ParentView": [
        "IPFPM-DCP view"
    ],
    "ParaDef": [
        {
            "Parameters": "mcp-id",
            "Info": "Specifies an MCP ID for all IP FPM instances on a DCP.\nUsing the Router ID of a device that is configured as an MCP as its MCP ID is recommended.\nThis value is in dotted decimal notation."
        },
        {
            "Parameters": "port port-number",
            "Info": "Specifies a UDP port number for a DCP to communicate with an MCP.\nThe value is an integer ranging from 1024 to 65535.\nThe default value is 65030 and is recommended."
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies a VPN instance for a DCP to communicate with an MCP.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "net-manager-vpn",
            "Info": "Specifies a management VPN for a DCP to communicate with an MCP.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nqa ipfpm dcp",
            "[*HUAWEI-nqa-ipfpm-dcp] mcp 10.1.1.1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo allow a DCP in an IP FPM instance to report the statistics collected by TLPs to an MCP, run the mcp command to specify the MCP ID for all IP FPM instances on the DCP.\nPrerequisites\nThe nqa ipfpm dcp command has been run to enable DCP globally.\nThe VPN instance has been created on the DCP before you configure the parameter vpn-instance-name or net-manager-vpn to allow the DCP to report the statistics to the MCP through the specified VPN or management VPN.\nPrecautions\nThe MCP ID must be an IP address reachable to the DCPs. The MCP ID specified for all IP FPM instances on a DCP must be the same as that specified in the mcp id command run on the MCP associated with this DCP.\nThe UDP port number configured on the DCP must be the same as that configured in the protocol udp port command run on the MCP associated with this DCP. Otherwise, the DCP cannot report the statistics to the MCP.\nIf the mcp command has been run in the IP FPM instance view for some instances on a DCP and an MCP ID is specified for all IP FPM instances on the DCP, the MCP ID specified in the IP FPM instance view takes effect."
}