{
    "PageTitle": "dcp tlp",
    "FuncDef": "The dcp tlp command creates a Target Logical Port (TLP) in-group or out-group for a target flow.\nThe undo dcp tlp command deletes a TLP in-group or out-group for a target flow.\nBy default, no TLP in-group or TLP out-group is configured for the target flow.",
    "CLIs": [
        "{ in-group | out-group } dcp <dcp-id> tlp <tlp-id>",
        "undo { in-group | out-group } [ dcp <dcp-id> tlp <tlp-id> ]"
    ],
    "ParentView": [
        "IPFPM-MCP-ACH view"
    ],
    "ParaDef": [
        {
            "Parameters": "in-group",
            "Info": "Specify configuration information of flow input group.\n-"
        },
        {
            "Parameters": "out-group",
            "Info": "Specify configuration information of flow output group.\n-"
        },
        {
            "Parameters": "dcp-id",
            "Info": "Specifies the ID of a DCP to which TLPs in a TLP in-group or out-group belongs.\nThis value is in dotted decimal notation."
        },
        {
            "Parameters": "tlp-id",
            "Info": "Specifies the ID of a TLP in a TLP in-group or out-group.\nThe value is an integer ranging from 1 to 16777215."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nqa ipfpm mcp",
            "[*HUAWEI-nqa-ipfpm-mcp] instance 1",
            "[*HUAWEI-nqa-ipfpm-mcp-instance-1] ach 1",
            "[*HUAWEI-nqa-ipfpm-mcp-instance-1-ach-1] out-group dcp 10.1.1.1 tlp 100"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nqa ipfpm mcp",
            "[*HUAWEI-nqa-ipfpm-mcp] instance 1",
            "[*HUAWEI-nqa-ipfpm-mcp-instance-1] ach 1",
            "[*HUAWEI-nqa-ipfpm-mcp-instance-1-ach-1] in-group dcp 10.1.1.1 tlp 100"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo measure the packet loss or delay of service packets entering a network, run the in-group command. In IP FPM hop-by-hop performance statistics scenarios, a hop is a set of links and interfaces that service packets travel through, from one measurement point or group to the next measurement point or group, and therefore is represented by TLP in-group or TLP out-group. Performance statistics are implemented on the TLP in-point or in-group through which service packets enter a network and the TLP out-point or out-group through which service packets leave the network.\nPrerequisites\nThe ach command has been run to create an ACH and display the ACH view."
}