{
    "PageTitle": "delay-measure two-way delay-threshold (IPFPM-MCP instance view)",
    "FuncDef": "The delay-measure two-way delay-threshold command configures the two-way delay alarm threshold and its clear alarm threshold.\nThe undo delay-measure two-way delay-threshold command restores the default two-way delay alarm threshold and its clear alarm threshold.\nBy default, the two-way delay alarm threshold and its clear alarm threshold are not configured, meaning that the system does not generate a two-way delay alarm or clear alarm.",
    "CLIs": [
        "delay-measure two-way delay-threshold upper-limit <upper-limit> lower-limit <lower-limit>",
        "undo delay-measure two-way delay-threshold"
    ],
    "ParentView": [
        "IPFPM-MCP instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "upper-limit upper-limit",
            "Info": "Specifies the two-way delay alarm threshold.\nThe value is an integer ranging from 1 to 2147483647, in microseconds."
        },
        {
            "Parameters": "lower-limit lower-limit",
            "Info": "Specifies the two-way delay clear alarm threshold.\nThe value is an integer ranging from 1 to 2147483647, in microseconds.\nlower-limit must be less than or equal to upper-limit."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nqa ipfpm mcp",
            "[*HUAWEI-nqa-ipfpm-mcp] instance 1",
            "[*HUAWEI-nqa-ipfpm-mcp-instance-1] delay-measure two-way delay-threshold upper-limit 10 lower-limit 5"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAn IP FPM statistical period is an interval between when a TLP counts the number of packets or bytes and when the TLP records the send and receive timestamps. The period can be set to 1s, 10s, 60s, or 600s. By default, the IP FPM statistical period is 10s.\nTo configure the two-way delay alarm threshold and its clear alarm threshold, run the delay-measure two-way delay-threshold command. The conditions for alarm generation are as follows:\nIf the two-way delay for five statistical periods exceeds the configured upper-limit, the hwIpfpmTwoDelayExceed alarm is generated, and the link fault occurrence is notified in real time.If the two-way delay for five statistical periods falls below the configured lower-limit, the wIpfpmTwoDelayRecovery alarm is generated, and the link fault rectification is notified in real time.\nTo help network operation and maintenance, run the delay-measure two-way delay-threshold command based on network performance requirements.\n\nPrecautions\nIf the delay-measure two-way delay-threshold command is run more than once, the latest configuration overrides the previous one.\nThe delay-measure two-way delay-threshold command only configures the thresholds. The system generates a two-way delay alarm or its clear alarm only when the two-way delay alarm or its clear alarm function is enabled and the two-way delay for five statistical periods reaches the configured alarm threshold or falls below the configured clear alarm threshold."
}