{
    "PageTitle": "as-notation plain",
    "FuncDef": "The as-notation plain command configures BGP 4-byte AS numbers to be displayed as an integer.\nThe undo as-notation plain command configures BGP 4-byte AS numbers to be displayed in dotted notation.\nBy default, BGP 4-byte AS numbers are displayed in dotted notation (in the format of x.y).",
    "CLIs": [
        "as-notation plain",
        "undo as-notation plain"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] as-notation plain"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, display commands such as the display bgp peer command display 4-byte AS numbers in dotted notation.\nTo display 4-byte AS numbers as an integer, run the as-notation plain command. After the as-notation plain command is run. 4-byte AS numbers include:\nIndependent 4-byte AS number4-byte AS number in an extended community attribute4-byte AS number in a route distinguisher (RD)4-byte AS number in a VPN target (also called a route target)4-byte AS number in the Site-of-Origin attribute\nFor example, a 4-byte AS number in dotted notation is x.y. The conversion relationship between an integral 4-byte AS number and a 4-byte AS number in dotted notation is as follows:\nIntegral 4-byte AS number = x x 65536 + y\nFor example, if a 4-byte AS number in dotted notation is 2.3, the corresponding integral 4-byte AS number is 131075 (2 x 65536 + 3).\n\nPrecautions\nAfter the as-notation plain command is run:\nIf 4-byte AS numbers are configured to be displayed as an integer, 4-byte AS numbers in the configuration information generated by the system are also displayed as integers.If 4-byte AS numbers are configured to be displayed in dotted notation, 4-byte AS numbers in the configuration information generated by the system are also displayed in dotted notation.\nChanging the format of 4-byte AS numbers will affect matching results of AS_Path regular expressions and extended community attribute filters. Therefore, if the system is using an AS_Path regular expression or an extended community attribute filter as an import or export policy, reconfigure an AS_Path regular expression using the ip as-path-filter command or an extended community attribute filter using the ip extcommunity-filter or ip extcommunity-list soo command after changing the format of 4-byte AS numbers. This reconfiguration ensures that routes match the import or export policy.\nIf 4-byte AS numbers are configured to be displayed as an integer, change 4-byte AS numbers in AS_Path regular expressions and extended community attribute filters to integral 4-byte AS numbers.If 4-byte AS numbers are configured to be displayed in dotted notation, change 4-byte AS numbers in AS_Path regular expressions and extended community attribute filters to 4-byte AS numbers in dotted notation."
}