{
    "PageTitle": "auto-frr (BGP-VPNv4 address family view)",
    "FuncDef": "The auto-frr command enables BGP Auto fast reroute (FRR).\nThe undo auto-frr command restores the default configuration.\nBy default, BGP Auto FRR is disabled.",
    "CLIs": [
        "auto-frr",
        "undo auto-frr"
    ],
    "ParentView": [
        "BGP-VPNv4 address family view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv4-family vpnv4",
            "[*HUAWEI-bgp-af-vpnv4] auto-frr"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAs networks evolve continuously, voice, on-line video, and financial services raise increasingly high requirements for real-time performance. Usually, primary and backup links are deployed on a network to ensure the stability of these services. In a traditional forwarding mode, a device selects a route out of several routes that are bound for the same destination network as the optimal route and delivers the route to the FIB table to guide data forwarding. If the optimal route fails, a device has to wait for route convergence to be completed before reselecting an optimal route. During this period, services are interrupted. After a device delivers the reselected optimal route to the FIB table, services are restored. Service interruption in this mode lasts a long time, which cannot meet services' requirements.\nAfter BGP Auto FRR is enabled on a device, the device selects the optimal route from the routes that are bound for the same destination network. In addition, a device automatically adds information about the second optimal route to the backup forwarding entries of the optimal route. If the primary link fails, a device quickly switches traffic to the backup link. The switchover does not depend on route convergence. Therefore, the service interruption time is very short, reaching the sub-second level.\nIn the BGP-VPNv4 address family view, this command enables BGP Auto FRR for VPNv4 routes. The function is mainly used in inter-domain VPN OptionB and H-VPN scenarios but deployed at different positions.In inter-domain VPN OptionB scenarios, the VPNv4 FRR function is deployed on ASBR nodes.In H-VPN scenarios, the VPNv4 FRR function is deployed on SPE nodes.\n\n\nImplementation Procedure\nIf both the ip frr and auto-frr commands are configured, the auto-frr command takes precedence over the ip frr command.\nPrecautions\nUsing both BGP Auto FRR and BFD is recommended. They can rapidly detect a link fault and switch traffic to a backup link if a fault occurs."
}