{
    "PageTitle": "bestroute med-plus-igp (BGP-VPNv6 address family view)",
    "FuncDef": "The bestroute med-plus-igp command enables BGP to use the sum of MED multiplied by a MED multiplier and IGP cost multiplied by an IGP cost multiplier to select routes when MED is required to determine the optimal route.\nThe undo bestroute med-plus-igp command restores the default configuration.\nBy default, the MED and IGP cost of each route are used as separate route selection criteria.",
    "CLIs": [
        "bestroute med-plus-igp [ igp-multiplier <igp-multiplier> | med-multiplier <med-multiplier> ] *",
        "undo bestroute med-plus-igp [ igp-multiplier <igp-multiplier> | med-multiplier <med-multiplier> ] *"
    ],
    "ParentView": [
        "BGP-VPNv6 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "igp-multiplier igp-multiplier",
            "Info": "Specifies an IGP cost multiplier.\nThe value is an integer ranging from 1 to 1000. The default value is 1."
        },
        {
            "Parameters": "med-multiplier med-multiplier",
            "Info": "Specifies a MED multiplier.\nThe value is an integer ranging from 1 to 1000. The default value is 1."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv6-family vpnv6",
            "[*HUAWEI-bgp-af-vpnv6] bestroute med-plus-igp"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, the MED and IGP cost of each route are used as separate route selection criteria. To enable BGP to use the sum of MED multiplied by a MED multiplier and IGP cost multiplied by an IGP cost multiplier to select routes when MED is required to determine the optimal route, run the bestroute med-plus-igp command. If you need two routes with different MEDs and IGP costs to balance traffic, ensure that the sum of MED multiplied by the MED multiplier and IGP cost multiplied by the IGP cost multiplier is the same between the two routes.\nBy default, if routes carry no MED, 0 is used as the MED."
}