{
    "PageTitle": "bestroute nexthop-resolved (BGP-VPNv4-multicast address family view)",
    "FuncDef": "The bestroute nexthop-resolved ip command configures the labeled routes that recurse to IP addresses to participate in route selection.\nThe bestroute nexthop-resolved tunnel command configures the labeled routes that recurse to LSPs to participate in route selection.\nThe undo bestroute nexthop-resolved command restores the default configuration.\n\nBy default, the following routes participate in route selection:\n\n\nLabeled BGP IPv4 unicast routes that recurse to IP addresses\n\n\nLabeled BGP IPv6 unicast routes that recurse to reachable LSPs\n\n\nBGP VPNv4/6 routes that recurse to IP addresses\n\n\nIn the BGP-labeled address family view, unicast labeled routes whose next hops recurse to LSPs\n\n\nIn the BGP-EVPN address family, BGP EVPN routes whose next hops recurse to IP addresses",
    "CLIs": [
        "bestroute nexthop-resolved { ip | tunnel }",
        "undo bestroute nexthop-resolved"
    ],
    "ParentView": [
        "BGP-VPNv4-multicast address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip",
            "Info": "Allows labeled routes that recurse to IP addresses to participate in route selection.\n-"
        },
        {
            "Parameters": "tunnel",
            "Info": "Allows labeled routes that recurse to LSPs to participate in route selection.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv4-family vpnv4-multicast",
            "[*HUAWEI-bgp-af-vpnv4-multicast] bestroute nexthop-resolved tunnel"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn non-RR networking, or RR networking where the BGP next hop is changed, BGP needs to check whether there is an LSP destined for the next hop. If such an LSP is unavailable, BGP needs to establish one. If the default setting is adopted, a labeled BGP IPv4 unicast route may be selected prior to LSP establishment. As a result, services are incorrectly switched before LSP establishment, packet loss may occur, which affects service stability. The bestroute nexthop-resolved tunnel command can be run to allow route selection only after the labeled BGP IPv4 route recurses to an LSP.\nIn RR networking, if a router only transmits routing information and other routes forwards traffic, you can configure labeled BGP IPv6 unicast routes that recurse to IP addresses to participate in route selection. The bestroute nexthop-resolved command is not applied to the unlabeled routes in the IPv6 unicast address family.\nIf the device is an ASBR, the optimal route must have recursed to an LSP; if load balancing or FRR is configured on the ASBR, the non-optimal routes must recurse to LSPs so that these routes can participate in load balancing or FRR. The bestroute nexthop-resolved tunnel command can be run to allow route selection only after the BGP VPNv4/6 routes recurse to LSPs.\nBy default, BGP EVPN routes can participate in route selection only when their next hops recurse to IP addresses. Before an ASBR sends a preferred route, ensure that the next hop of the preferred route can recurse to an LSP. However, if load balancing or FRR is configured on an ASBR, non-preferred routes that are used for load balancing or FRR may not recurse to LSPs, causing load balancing or FRR to fail. To resolve this problem, enable only BGP EVPN routes whose next hops recurse to LSPs to participate in route selection.\nConfiguration Impact\nThe bestroute nexthop-resolved ip command is mutually exclusive with the bestroute nexthop-resolved tunnel command.\nThe bestroute nexthop-resolved tunnel command is mutually exclusive with the bestroute nexthop-resolved tunnel inherit-ip-cost command."
}