{
    "PageTitle": "bestroute nexthop-resolved (BGP-IPv6 unicast address family view)",
    "FuncDef": "The bestroute nexthop-resolved ip command configures the BGP IPv6 unicast routes that recurse to IP addresses to participate in route selection.\nThe bestroute nexthop-resolved tunnel command configures the BGP IPv6 unicast routes that recurse to tunnels to participate in route selection.\nThe undo bestroute nexthop-resolved command restores the default configuration.\nBy default, labeled BGP IPv6 unicast routes that recurse to reachable LSPs.",
    "CLIs": [
        "bestroute nexthop-resolved { ip | tunnel [ inherit-ip-cost ] }",
        "undo bestroute nexthop-resolved",
        "undo bestroute nexthop-resolved tunnel inherit-ip-cost"
    ],
    "ParentView": [
        "BGP-IPv6 unicast address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip",
            "Info": "Allows labeled routes that recurse to IP addresses to participate in route selection.\n-"
        },
        {
            "Parameters": "tunnel",
            "Info": "Allows labeled routes that recurse to LSPs to participate in route selection.\n-"
        },
        {
            "Parameters": "inherit-ip-cost",
            "Info": "Allows the labeled routes that recurse to IP addresses to inherit the cost values of corresponding IP routes during route selection.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv6-family unicast",
            "[*HUAWEI-bgp-af-ipv6] bestroute nexthop-resolved ip"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the device is an ASBR, the optimal route must have recursed to an LSP; if load balancing or FRR is configured on the ASBR, the non-optimal routes must recurse to LSPs so that these routes can participate in load balancing or FRR. The bestroute nexthop-resolved tunnel command can be run to allow route selection only after the BGP VPNv6 routes recurse to LSPs.\nConfiguration Impact\nThe bestroute nexthop-resolved ip command is mutually exclusive with the bestroute nexthop-resolved tunnel command.\nThe bestroute nexthop-resolved tunnel command is mutually exclusive with the bestroute nexthop-resolved tunnel inherit-ip-cost command."
}