{
    "PageTitle": "mpls bgp bfd-trigger-tunnel",
    "FuncDef": "The mpls bgp bfd-trigger-tunnel command configures a policy used to establish BGP BFD sessions.\nThe undo mpls bgp bfd-trigger-tunnel command deletes a policy used to establish BGP BFD sessions.\nBy default, no policy used to establish BGP BFD sessions is configured.",
    "CLIs": [
        "mpls bgp bfd-trigger-tunnel { host | ip-prefix <ip-prefix-name> }",
        "undo mpls bgp bfd-trigger-tunnel"
    ],
    "ParentView": [
        "MPLS view"
    ],
    "ParaDef": [
        {
            "Parameters": "host",
            "Info": "Allows a device to use host addresses to establish BGP BFD sessions.\n-"
        },
        {
            "Parameters": "ip-prefix ip-prefix-name",
            "Info": "Allows a device to use a specified IP prefix list to establish BGP BFD sessions.\nThe name is a string of 1 to 169 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bfd",
            "[*HUAWEI-bfd] quit",
            "[*HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls bgp bfd-trigger-tunnel host"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBFD for BGP tunnel rapidly detects faults in E2E BGP tunnels. Before a BGP BFD session is established, the mpls bgp bfd enable command must be run to enable MPLS to dynamically establish BGP BFD sessions on the ingress of a BGP tunnel. To specify a policy used to establish BGP BFD sessions, run the mpls bgp bfd-trigger-tunnel command.\nEither of the following policies can be used:\nHost address-based policy: used when all host addresses can be used to establish BGP BFD sessions.IP prefix list-based policy: used when only some host addresses can be used to establish BFD sessions.\n\nPrerequisites\nBFD has been globally enabled using the bfd command.\nPrecautions\nIf the mpls bgp bfd-trigger-tunnel command is run more than once, the latest configuration overrides the previous one."
}