{
    "PageTitle": "supernet advertise (BGP-VPN instance IPv4 address family view)",
    "FuncDef": "The supernet unicast advertise enable command configures a BGP device to advertise BGP supernet unicast routes to its peers.\nThe undo supernet unicast advertise enable or supernet unicast advertise disable command restores the default configuration.\nThe supernet label-route advertise disable command disables a BGP device from advertising labeled BGP supernet routes.\nThe undo supernet label-route advertise disable or supernet label-route advertise enable command restores the default configuration.\nBy default, labeled BGP supernet routes can be preferentially selected and advertised. BGP supernet unicast routes are considered invalid and cannot be advertised to BGP peers or delivered to the IP routing table.",
    "CLIs": [
        "supernet unicast advertise enable",
        "supernet unicast advertise disable",
        "supernet label-route advertise enable",
        "supernet label-route advertise disable",
        "undo supernet unicast advertise enable",
        "undo supernet label-route advertise disable"
    ],
    "ParentView": [
        "BGP-VPN instance IPv4 address family view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ipv4-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv4-family vpn-instance vpn1",
            "[*HUAWEI-bgp-vpn1] supernet unicast advertise enable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ipv4-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv4-family vpn-instance vpn1",
            "[*HUAWEI-bgp-vpn1] supernet label-route advertise disable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA BGP supernet route has the same destination address and next hop address or has a destination address that is more detailed than the next hop address. Any route that meets one of the following conditions is a BGP supernet route:\nIf you perform bitwise AND operations on the destination address mask with the destination address and next hop address, respectively, the calculated network addresses are the same, and the destination address mask is greater than or equal to the next hop address mask.If you perform bitwise AND operations on the destination address mask with the destination address and next hop address, respectively, the calculated network addresses are different. However, if you perform bitwise AND operations on the next hop address mask with the destination address and next hop address, respectively, the calculated network addresses are the same.\nBGP supernet routes include labeled BGP supernet routes and unicast BGP supernet routes. Run the supernet label-route advertise disable command to disable the BGP device from advertising labeled BGP supernet routes.\nTo allow a Huawei device to advertise BGP supernet unicast routes that it receives from a connected non-Huawei device to its BGP peers, run the supernet unicast advertise enable command on the Huawei device."
}