{
    "PageTitle": "slow-peer absolute-detection (BGP multi-instance VPN instance IPv4 address family view)",
    "FuncDef": "The slow-peer absolute-detection disable command disables slow peer detection in absolute mode.\nThe undo slow-peer absolute-detection disable command enables slow peer detection in absolute mode.\nThe slow-peer absolute-detection threshold command configures an absolute threshold for slow peer detection.\nThe undo slow-peer absolute-detection threshold command restores the absolute threshold of slow peer detection.\n\nBy default, slow peer detection in absolute mode is enabled.\n\n\nBy default, the absolute threshold of slow peer detection is 9s.",
    "CLIs": [
        "slow-peer absolute-detection threshold <threshold>",
        "slow-peer absolute-detection disable",
        "undo slow-peer absolute-detection threshold <threshold>",
        "undo slow-peer absolute-detection disable"
    ],
    "ParentView": [
        "BGP multi-instance VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "threshold threshold",
            "Info": "Specifies an absolute threshold for slow peer detection.\nThe value is an integer ranging from 3 to 3600, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv4-family",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] vpn-target 111:1 both",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] quit",
            "[*HUAWEI-instance-vpna] quit",
            "[*HUAWEI] bgp 100 instance a",
            "[*HUAWEI-bgp-instance-a] ipv4-family vpn-instance vpna",
            "[*HUAWEI-bgp-instance-a-vpna] slow-peer absolute-detection threshold 100"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter slow peer detection is enabled, the local device calculates the difference between the time taken to send Update messages to each BGP peer and the shortest time taken to send Update messages to a BGP peer in the group. If the difference between the time taken to send Update messages to BGP peer 1 and the shortest time is greater than the specified threshold, the local device considers BGP peer 1 as a slow peer and removes it from the update peer-group. The removal of the slow peer prevents this slow peer from affecting update message advertisement to other peers in the group. If Update messages fail to be advertised, the traditional slow peer detection function cannot be used to detect slow peers. To address this problem, configure an absolute threshold for slow peer detection. If the delay in sending Update messages to a peer is greater than the absolute threshold, the peer is considered a slow peer.\nTo configure an absolute threshold for slow peer detection, run the slow-peer absolute-detection threshold command."
}