{
    "PageTitle": "peer route-policy export (BGP multi-instance VPNv4 address family view) (group)",
    "FuncDef": "The peer route-policy export command specifies a route-policy for filtering routes to be advertised to a peer group.\nThe undo peer route-policy export command deletes a specified route-policy.\nBy default, no route-policy is configured for the routes to be advertised to a specified BGP peer group.",
    "CLIs": [
        "peer <group-name> route-policy <route-policy-name> export",
        "undo peer <group-name> route-policy <route-policy-name> export"
    ],
    "ParentView": [
        "BGP multi-instance VPNv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "group-name",
            "Info": "Specifies the name of a peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "route-policy-name",
            "Info": "Specifies the name of a route-policy.\nThe name is a string of 1 to 200 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "export",
            "Info": "Applies a route-policy to routes to be advertised to a peer group.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] route-policy test-policy permit node 10",
            "[*HUAWEI-route-policy] commit",
            "[~HUAWEI-route-policy] quit",
            "[~HUAWEI] bgp 100 instance p1",
            "[~HUAWEI-bgp-instance-p1] group a internal",
            "[~HUAWEI-bgp-instance-p1] ipv4-family vpnv4",
            "[~HUAWEI-bgp-instance-p1-af-vpnv4] peer a enable",
            "[~HUAWEI-bgp-instance-p1-af-vpnv4] peer a route-policy test-policy export"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter a route-policy is created, the peer route-policy export command is used to apply a Route-Policy to a peer group so that the routes advertised to a peer group can be controlled. To be specific, only the necessary routes are advertised to the peer group. In this manner, route management is implemented, the scale of the routing table is reduced, and fewer network resources are consumed.\nPrerequisites\nIf the command specifies a route-policy that does not exist, use the route-policy command to create the route-policy.\nConfiguration Impact\nIf the peer route-policy command is run for a peer group, all the members of the peer group inherit the configuration.\nThe peer route-policy command is mutually exclusive with the peer route-filter commands.\nBinding a route-policy after a BGP peer relationship is established may cause peer flapping."
}