{
    "PageTitle": "peer ssl-policy role",
    "FuncDef": "The peer ssl-policy role client command configures a peer as an SSL client.\nThe undo peer ssl-policy role client command cancels the SSL client configuration.\nThe peer ssl-policy role server command configures a peer as an SSL server.\nThe undo peer ssl-policy role server command cancels the SSL server configuration.\nThe peer ssl-policy role disable command disables SSL role setting for a peer.\nThe undo peer ssl-policy role disable command restores the default configuration and takes effect only when the peer ssl-policy role disable command is run.\nBy default, no peer is configured as an SSL client or server.",
    "CLIs": [
        "peer { <ipv4-address> | <ipv6-address> } ssl-policy role server",
        "peer { <ipv4-address> | <ipv6-address> } ssl-policy role client",
        "peer { <ipv4-address> | <ipv6-address> } ssl-policy role disable",
        "undo peer { <ipv4-address> | <ipv6-address> } ssl-policy role server",
        "undo peer { <ipv4-address> | <ipv6-address> } ssl-policy role client",
        "undo peer { <ipv4-address> | <ipv6-address> } ssl-policy role disable"
    ],
    "ParentView": [
        "BGP view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv4-address",
            "Info": "Specifies the IPv4 address of a BGP peer.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "ipv6-address",
            "Info": "Specifies the IPv6 address of a peer.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "disable",
            "Info": "Disables SSL role setting for a peer.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 10.1.1.2 as-number 100",
            "[*HUAWEI-bgp] peer 10.1.1.2 ssl-policy role client"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe Secure Sockets Layer (SSL) protocol protects data privacy on the Internet by preventing attackers from eavesdropping on data exchanged between a client and a server. Specifically, to ensure data transmission security on a network, a peer needs to be configured as an SSL client using the peer ssl-policy role client command or as a server using the peer ssl-policy role server command, and the SSL data encryption, identity authentication, and message integrity verification mechanisms need to be used.\nPrerequisites\nA BGP peer relationship has been established using the peer as-number command.\nPrecautions\nA set SSL role (server or client) of a peer or peer group cannot be changed to another role unless you first run the peer ssl-policy role disable or undo peer ssl-policy role command to cancel the role configuration of the peer.\nIf a peer or peer group is configured as an SSL client, the peer listen-only command cannot be run. That is, the peer listen-only command is mutually exclusive with the peer ssl-policy role client command. If a peer or peer group is configured as an SSL server, the peer connect-only command cannot be run. That is, the peer connect-only command is mutually exclusive with the peer ssl-policy role client command.\nThe SSL role configuration for a peer takes precedence over that for a peer group to which the peer belongs.\nSSL/TLS authentication takes effect only when SSL client and server roles are specified, SSL policies are applied to the client and server, and SSL/TLS authentication is enabled on the server (SSL/TLS authentication is not required on the client)."
}