{
    "PageTitle": "peer as-path-filter import (BGP multi-instance VPNv4 address family view) (group)",
    "FuncDef": "The peer as-path-filter import command configures a policy based on an AS_Path list for filtering BGP routes received from a peer group.\nThe undo peer as-path-filter import command cancels this configuration.\nBy default, no policy based on an AS_Path list is configured for filtering BGP routes received from a peer group, and all the BGP routes will be received from the peer group.",
    "CLIs": [
        "peer <group-name> as-path-filter { <number> | <name> } import",
        "undo peer <group-name> as-path-filter { <number> | <name> } import"
    ],
    "ParentView": [
        "BGP multi-instance VPNv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "group-name",
            "Info": "Specifies the name of a peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "number",
            "Info": "Specifies the number of an AS_Path filter.\nThe value is an integer ranging from 1 to 256."
        },
        {
            "Parameters": "name",
            "Info": "Specifies the name of an AS_Path filter.\nThe value is a string of 1 to 51 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip as-path-filter 2 permit",
            "[*HUAWEI] bgp 100 instance p1",
            "[*HUAWEI-bgp-instance-p1] group a internal",
            "[*HUAWEI-bgp-instance-p1] ipv4-family vpnv4",
            "[*HUAWEI-bgp-instance-p1-af-vpnv4] peer a enable",
            "[*HUAWEI-bgp-instance-p1-af-vpnv4] peer a as-path-filter 2 import"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter the peer as-path-filter import command is used to apply a route filtering policy based on an AS_Path list to BGP routes to be received from a specified peer group, the routers that do not match the policy are filtered out.\nPrerequisites\nThe ip as-path-filter command has been run to define an AS-Path filter.\nPrecautions\nOnly one AS_Path filter can be used to filter routes to be received from the same peer.\nThe peer as-path-filter import command is mutually exclusive with the peer route-filter import commands."
}