{
    "PageTitle": "peer ssl-server certificate",
    "FuncDef": "The peer ssl-server certificate command enables SSL/TLS authentication on an SSL server.\nThe peer ssl-server certificate disable command disables SSL/TLS authentication on an SSL server.\nThe undo peer ssl-server certificate command cancels SSL/TLS authentication on an SSL server.\nThe undo peer ssl-server certificate disable command restores the default configuration and takes effect only when the peer ssl-server certificate disable command is run.\nBy default, SSL/TLS authentication is disabled on an SSL server.",
    "CLIs": [
        "peer { <ipv4-address> | <ipv6-address> } ssl-server certificate",
        "peer { <ipv4-address> | <ipv6-address> } ssl-server certificate disable",
        "undo peer { <ipv4-address> | <ipv6-address> } ssl-server certificate",
        "undo peer { <ipv4-address> | <ipv6-address> } ssl-server certificate disable"
    ],
    "ParentView": [
        "BGP view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv4-address",
            "Info": "Specifies the IPv4 address of a BGP peer.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "ipv6-address",
            "Info": "Specifies the IPv6 address of a peer.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "disable",
            "Info": "Disables SSL/TLS authentication on an SSL server.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 10.1.1.2 as-number 100",
            "[*HUAWEI-bgp] peer 10.1.1.2 ssl-server certificate"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe Secure Sockets Layer (SSL) protocol protects data privacy on the Internet by preventing attackers from eavesdropping on data exchanged between a client and a server. The Transport Layer Security (TLS) protocol is an SSL successor and ensures data integrity and privacy. To enable SSL/TLS authentication on an SSL server, run the peer ssl-server certificate command. BGP messages are then encrypted to ensure data transmission security on the network.\nPrerequisites\nA BGP peer relationship has been established using the peer as-number command.\nPrecautions\nSSL/TLS authentication can be enabled only on servers.\nThe SSL/TLS authentication configuration for a peer takes precedence over that for a peer group to which the peer belongs.\nSSL/TLS authentication takes effect only when SSL client and server roles are specified, SSL policies are applied to the client and server, and SSL/TLS authentication is enabled on the server (SSL/TLS authentication is not required on the client)."
}