{
    "PageTitle": "load-balancing (BGP multi-instance VPN instance IPv4 address family view)",
    "FuncDef": "The load-balancing eibgp command enables load balancing among EBGP and IBGP routes.\nThe undo load-balancing eibgp command disables load balancing among EBGP and IBGP routes.\nThe load-balancing igp-metric-ignore command prevents a router from comparing IGP costs when selecting routes for load balancing.\nThe undo load-balancing igp-metric-ignore command restores the default configuration.\nBy default, load balancing is implemented only among IBGP routes or EBGP routes, and a device compares IGP costs when selecting routes for load balancing.",
    "CLIs": [
        "load-balancing { eibgp | igp-metric-ignore }",
        "undo load-balancing { eibgp | igp-metric-ignore }"
    ],
    "ParentView": [
        "BGP multi-instance VPN instance IPv4 address family view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv4-family",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] vpn-target 111:1 both",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] quit",
            "[*HUAWEI-instance-vpna] quit",
            "[*HUAWEI] bgp 100 instance a",
            "[*HUAWEI-bgp-instance-a] ipv4-family vpn-instance vpna",
            "[*HUAWEI-bgp-instance-a-vpna] load-balancing igp-metric-ignore"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo enable load balancing among EBGP and IBGP routes, run the load-balancing eibgp command.\nWhen both EBGP and IBGP routes are available and load balancing among them is required, run the load-balancing eibgp command. Exercise caution when using the command because the execution of this command will change the conditions of load balancing.\nTo prevent a router from comparing IGP costs when selecting routes for load balancing, run the load-balancing igp-metric-ignore command.\nWhen routes with different IGP costs are available and load balancing among them is required, run the load-balancing igp-metric-ignore command. Exercise caution when using the command because the execution of this command will change the conditions of load balancing.\nPrecautions\nThe load-balancing eibgp command and the maximum load-balancing { ebgp | ibgp }or maximum load-balancing eibgp command are mutually exclusive."
}