{
    "PageTitle": "peer public-as-only import (BGP multi-instance VPN instance IPv4 address family view)",
    "FuncDef": "The peer public-as-only import command enables a device to remove private AS numbers from the AS_Path list in received BGP Update messages.\nThe undo peer public-as-only import command allows a device to accept BGP Update messages in which the AS_Path list carries private AS numbers.\nBy default, a device does not remove private AS numbers from the AS_Path list when receiving BGP Update messages.",
    "CLIs": [
        "peer <peerIpv4Addr> public-as-only import [ force ]",
        "peer <peerIpv4Addr> public-as-only import disable",
        "undo peer <peerIpv4Addr> public-as-only import [ force ]",
        "undo peer <peerIpv4Addr> public-as-only import disable"
    ],
    "ParentView": [
        "BGP multi-instance VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "peerIpv4Addr",
            "Info": "Specifies the name of a peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "force",
            "Info": "Deletes all private AS numbers from the AS_Path attribute.\n-"
        },
        {
            "Parameters": "disable",
            "Info": "Disables a device from removing the private AS numbers from the AS_Path list in received BGP Update messages.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna] quit",
            "[*HUAWEI] bgp 100 instance a",
            "[*HUAWEI-bgp-instance-a] ipv4-family vpn-instance vrf1",
            "[*HUAWEI-bgp-instance-a-vrf1] peer 10.1.1.1 as-number 100",
            "[*HUAWEI-bgp-instance-a-vrf1] peer 10.1.1.1 public-as-only import"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn general, an AS number is an integer ranging from 1 to 4294967295. A public AS number ranges from 1 to 64511, and from 65536 (which represents 1.0 in the x.y format) to 4294967295 (65535.65535 in the x.y format). A private AS number ranges from 64512 to 65534. The AS number 65535 is reserved for special use.\nIf the 4-byte private AS number function is enabled using the private-4-byte-as enable command, the private AS number range also includes 4200000000 to 4294967294 (or 64086.59904 to 65535.65534 in the x.y format).\nPublic AS numbers can be advertised to the Internet, whereas private AS numbers cannot. Private AS numbers can only be used within ASs. If they are used on the Internet, routing loops may occur.\nTo prevent routing loops, run the peer public-as-only import command. After the command is run with no parameter specified:\nIf the AS_Path list in BGP Update messages contains only private AS numbers, BGP deletes these private AS numbers and then accepts the Update messages.\nIf the AS_Path list contains both public and private AS numbers, BGP does not delete the private AS numbers. If private AS numbers are deleted in this case, a forwarding error may occur. To forcibly delete all the private AS numbers in the AS_Path list, specify the force parameter in the peer public-as-only import command."
}