{
    "PageTitle": "peer graceful-restart timer restart (BGP multi-instance view) (group)",
    "FuncDef": "The peer graceful-restart timer restart command sets the maximum duration on a device for each peer in a specified group to wait for its BGP peer relationship to be reestablished with the device. After the command is run, the device will advertise the maximum duration to all the peers in the specified group.\nThe undo peer graceful-restart timer restart command deletes the configured duration.\nBy default, each peer in a specified group on a device waits for its BGP peer relationship to be reestablished for a maximum of 150 seconds.",
    "CLIs": [
        "peer <group-name> graceful-restart timer restart <time-value>",
        "undo peer <group-name> graceful-restart timer restart"
    ],
    "ParentView": [
        "BGP multi-instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "group-name",
            "Info": "Specifies the name of a BGP peer group.\nThe value is a string of 1 to 47 case-sensitive characters. If spaces are used, the string must start and end with double quotation marks (\")."
        },
        {
            "Parameters": "time-value",
            "Info": "Specifies the maximum duration on a device for each peer in a specified group to wait for its BGP peer relationship to be reestablished with the device.\nThe value is an integer ranging from 3 to 3600, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100 instance a",
            "[*HUAWEI-bgp-instance-a] group a",
            "[*HUAWEI-bgp-instance-a] peer a graceful-restart timer restart 100"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo set the maximum duration on a device for each peer in a specified group to wait for its BGP peer relationship to be reestablished with the device, run the peer graceful-restart timer restart command.\nConfiguration Impact\nAfter the peer graceful-restart timer restart command is run, the involved BGP peer relationships will be disconnected and then reestablished."
}