{
    "PageTitle": "slow-peer detection (BGP multi-instance VPN instance IPv4 address family view)",
    "FuncDef": "The slow-peer detection threshold command configures a threshold for slow peer detection.\nThe undo slow-peer detection threshold command restores the threshold of slow peer detection.\nThe slow-peer detection disable command disables slow peer detection.\nThe undo slow-peer detection disable command enables slow peer detection.\nBy default, slow peer detection is enabled, and the slow peer detection threshold is 300s.",
    "CLIs": [
        "slow-peer detection threshold <threshold-value>",
        "slow-peer detection disable",
        "undo slow-peer detection [ threshold <threshold-value> ]",
        "undo slow-peer detection disable"
    ],
    "ParentView": [
        "BGP multi-instance VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "threshold threshold-value",
            "Info": "Specifies a slow peer detection threshold. If the difference between the time taken to send packets to BGP peer 1 and the shortest time taken to send packets to BGP peer 2 is greater than the threshold, BGP peer 1 is considered as a slow peer.\nThe value is an integer ranging from 120 to 3600, in seconds. The default value is 300."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv4-family",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] vpn-target 111:1 both",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] quit",
            "[*HUAWEI-instance-vpna] quit",
            "[*HUAWEI] bgp 100 instance a",
            "[*HUAWEI-bgp-instance-a] ipv4-family vpn-instance vpna",
            "[*HUAWEI-bgp-instance-a-vpna] slow-peer detection threshold 200"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAn update peer-group may consist of multiple BGP peers. If a network problem (congestion for example) occurs and slows down the speed at which the local device advertises routes to a BGP peer in the update peer-group, the speed at which the local device advertises routes to other BGP peers in the update peer-group is affected. To address this problem, run the slow-peer detection command to enable slow peer detection.\nAfter slow peer detection is enabled, the local device calculates the difference between the time taken to send packets to each BGP peer and the shortest time taken to send packets to a BGP peer in the group. If the difference between the time taken to send packets to BGP peer 1 and the shortest time is greater than the threshold, the local device considers BGP peer 1 as a slow peer and removes it from the update peer-group, which prevents this slow peer from affecting route advertisement to other peers in the group.\nConfiguration Impact\nIf the command is run more than once, the latest configuration overrides the previous one."
}