{
    "PageTitle": "ext-community-change enable (BGP multi-instance VPN instance IPv4 address family view)",
    "FuncDef": "The ext-community-change enable command enables a device to use route-policies to change the VPN-Target and SoO extended community attributes in matched BGP routes.\nThe undo ext-community-change enable command disables a device from using route-policies to change the VPN-Target or SoO extended community attribute in matched BGP routes.\nBy default, a BGP device cannot use route-policies to change the VPN-Target or SoO extended community attribute in matched BGP routes.",
    "CLIs": [
        "ext-community-change enable",
        "undo ext-community-change enable"
    ],
    "ParentView": [
        "BGP multi-instance VPN instance IPv4 address family view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv4-family",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] vpn-target 111:1 both",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] quit",
            "[*HUAWEI-instance-vpna] quit",
            "[*HUAWEI] bgp 100 instance a",
            "[*HUAWEI-bgp-instance-a] ipv4-family vpn-instance vrf1",
            "[*HUAWEI-bgp-instance-a-vrf1] ext-community-change enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, BGP prevents a device from using a route-policy to change the VPN-Target or SoO extended community attribute in the matched routes either learned from or to be advertised to a peer or peer group. To enable a device to use route-policies to change the extended community attributes in matched routes, run the ext-community-change enable command. After running this command, you can configure an import route-policy to change the extended community attributes in the matched routes received from a peer or peer group. You can also configure an export route-policy to filter the optimal routes selected by BGP and then change the extended community attributes in the matched routes that are to be advertised to the peer or peer group.\nPrerequisites\nThe specified address family view has been displayed.\nPrecautions\nThe ext-community-change enable and peer route-policy import commands must both be run so that the device can use an import policy to change extended community attributes of the routes learned from a peer or peer group.The ext-community-change enable command must be run with either of the following commands so that the extended community attributes changed based on an export policy can be advertised to a peer or peer group:\npeer advertise-ext-communitypeer route-policy export\nThe ext-community-change enable command allows a device to use only route-policies to change the VPN-Target and SoO extended community attributes in matched routes."
}