{
    "PageTitle": "supernet label-route advertise (BGP multi-instance VPN instance IPv4 address family view)",
    "FuncDef": "The supernet label-route advertise disable command disables a BGP device from advertising labeled BGP supernet routes.\nThe undo supernet label-route advertise disable command restores the default configuration.\nThe supernet label-route advertise enable command restores the default configuration.\nBy default, labeled BGP supernet routes can be preferentially selected and advertised.",
    "CLIs": [
        "supernet label-route advertise disable",
        "supernet label-route advertise enable",
        "undo supernet label-route advertise disable"
    ],
    "ParentView": [
        "BGP multi-instance VPN instance IPv4 address family view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv4-family",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] vpn-target 111:1 both",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] quit",
            "[*HUAWEI-instance-vpna] quit",
            "[*HUAWEI] bgp 100 instance a",
            "[*HUAWEI-bgp-instance-a] ipv4-family vpn-instance vpna",
            "[*HUAWEI-bgp-instance-a-vpna] supernet label-route advertise disable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA BGP supernet route has the same destination address and next hop address or has a destination address that is more detailed than the next hop address. Any route that meets one of the following conditions is a BGP supernet route:\nIf you perform bitwise AND operations on the destination address mask with the destination address and next hop address, respectively, the calculated network addresses are the same, and the destination address mask is greater than or equal to the next hop address mask.If you perform bitwise AND operations on the destination address mask with the destination address and next hop address, respectively, the calculated network addresses are different. However, if you perform bitwise AND operations on the next hop address mask with the destination address and next hop address, respectively, the calculated network addresses are the same.\nFor example, the route destined for 6.6.6.6 in the following command output is a BGP supernet route.\nBGP supernet routes include labeled BGP supernet routes and unicast BGP supernet routes. Run the supernet label-route advertise disable command to disable the BGP device from advertising labeled BGP supernet routes."
}