{
    "PageTitle": "peer capability-advertise graceful-restart (BGP multi-instance VPN instance IPv4 address family view)",
    "FuncDef": "The peer capability-advertise graceful-restart command enables GR for a specified peer on a device. After this command is run, the device will advertise the GR capability to the specified peer.\nThe peer capability-advertise graceful-restart disable command disables GR for a specified peer on a device.\nThe undo peer capability-advertise graceful-restart command cancels GR enabling for a specified peer on a device.\nThe undo peer capability-advertise graceful-restart disable command cancels GR disabling for a specified peer on a device.\nBy default, GR is not enabled for a peer specified on a device.",
    "CLIs": [
        "peer <ipv4-address> capability-advertise graceful-restart",
        "peer <ipv4-address> capability-advertise graceful-restart disable",
        "undo peer <ipv4-address> capability-advertise graceful-restart",
        "undo peer <ipv4-address> capability-advertise graceful-restart disable"
    ],
    "ParentView": [
        "BGP multi-instance VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv4-address",
            "Info": "Specifies the IPv4 address of a BGP peer.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ipv4-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] bgp 100 instance a",
            "[*HUAWEI-bgp-instance-a] ipv4-family vpn-instance vpn1",
            "[*HUAWEI-bgp-instance-a-vpn1] peer 10.1.1.1 as-number 100",
            "[*HUAWEI-bgp-instance-a-vpn1] peer 10.1.1.1 capability-advertise graceful-restart"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the graceful-restart command is run in the BGP view to enable GR globally on a device, all the device's peer relationships are disconnected, and the device has to renegotiate the GR capability with its peers. You are therefore advised to run the peer capability-advertise graceful-restart command instead to enable GR for a specified peer. After the command is run, the device advertises the GR capability to the specified peer. This ensures that the device does not delete the routes received from the specified peer and related forwarding entries before the GR time elapses, thereby preventing traffic interruption.\nConfiguration Impact\nEnabling or disabling GR for a specified peer on a device causes the BGP peer relationship to be disconnected and then reestablished."
}