{
    "PageTitle": "default med (BGP multi-instance VPN instance IPv4 address family view)",
    "FuncDef": "The default med command configures a MED for BGP routes.\nThe undo default med command restores the default value.\nBy default, the MED value of an imported route equals the cost of the imported route; the MED value carried in a route learned.",
    "CLIs": [
        "default med <med>",
        "undo default med"
    ],
    "ParentView": [
        "BGP multi-instance VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "med",
            "Info": "Specifies the MED for BGP routes.\nThe value is an integer ranging from 0 to 4294967295."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv4-family",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] vpn-target 111:1 both",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] quit",
            "[*HUAWEI-instance-vpna] quit",
            "[*HUAWEI] bgp 100 instance a",
            "[*HUAWEI-bgp-instance-a] ipv4-family vpn-instance vrf1",
            "[*HUAWEI-bgp-instance-a-vrf1] default med 10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe default med command applies only to the routes imported using the import-route command and BGP summary routes.\nAfter the default med command is run, the BGP routes that the local device sends to its BGP peers carry the MED, which helps control route selection for the traffic entering the local AS. If the other attributes of routes to the same destination are the same, BGP selects the route with the smallest MED as the optimal route.\nConfiguration Impact\nIf more than one MED is configured for BGP routes, the latest configuration overrides the previous one.\nPrecautions\nThe MED attribute is transmitted only between two neighboring ASs. The AS that receives the MED attribute does not advertise it to a third AS."
}