{
    "PageTitle": "peer ssl-policy (BGP view)",
    "FuncDef": "The peer ssl-policy name command applies an SSL policy to an SSL client or server.\nThe peer ssl-policy disable command disables an SSL policy applied to an SSL client or server.\nThe undo peer ssl-policy name command cancels the configuration of applying an SSL policy to an SSL client or server.\nThe undo peer ssl-policy disable command restores the default configuration and takes effect only when the peer ssl-policy disable command is run.\nBy default, no SSL policy is applied to an SSL client or server.",
    "CLIs": [
        "peer { <ipv4-address> | <ipv6-address> } ssl-policy name <ssl-policy-name>",
        "peer { <ipv4-address> | <ipv6-address> } ssl-policy disable",
        "undo peer { <ipv4-address> | <ipv6-address> } ssl-policy name <ssl-policy-name>",
        "undo peer { <ipv4-address> | <ipv6-address> } ssl-policy disable"
    ],
    "ParentView": [
        "BGP view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv4-address",
            "Info": "Specifies the IPv4 address of a BGP peer.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "ipv6-address",
            "Info": "Specifies the IPv6 address of a peer.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "name ssl-policy-name",
            "Info": "Specifies the name of an SSL policy.\nThe value is a string of 1 to 23 case-insensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "disable",
            "Info": "Disables an SSL policy applied to an SSL client or server.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ssl policy ftps_der",
            "[*HUAWEI-ssl-policy-ftps_der] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 10.1.1.2 as-number 100",
            "[*HUAWEI-bgp] peer 10.1.1.2 ssl-policy client",
            "[*HUAWEI-bgp] peer 10.1.1.2 ssl-policy name ftps_der"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe Secure Sockets Layer (SSL) protocol protects data privacy on the Internet by preventing attackers from eavesdropping on data exchanged between a client and a server. Specifically, to ensure data transmission security on a network, an SSL policy needs to be applied to an SSL client or server using the peer ssl-policy name command, and SSL data encryption, identity authentication, and message integrity verification mechanisms need to be used.\nPrerequisites\nAn SSL policy has been created using the ssl policy command, and a peer relationship has been established using the peer as-number command.\nPrecautions\nThe same SSL policy cannot be applied to different SSL roles.\nThe SSL policy configuration for a peer takes precedence over that for a peer group to which the peer belongs.\nSSL/TLS authentication takes effect only when SSL client and server roles are specified, SSL policies are applied to the client and server, and SSL/TLS authentication is enabled on the server (SSL/TLS authentication is not required on the client)."
}