{
    "PageTitle": "peer entropy-label (BGP view)",
    "FuncDef": "The peer entropy-label command enables the entropy label capability for a device to improve load balancing during traffic forwarding.\nThe undo peer entropy-label command cancels the existing configuration.\nBy default, the entropy label capability is not enabled for a device.",
    "CLIs": [
        "peer <peerIpv4Addr> entropy-label",
        "peer <peerIpv4Addr> entropy-label disable",
        "undo peer <peerIpv4Addr> entropy-label",
        "undo peer <peerIpv4Addr> entropy-label disable"
    ],
    "ParentView": [
        "BGP view"
    ],
    "ParaDef": [
        {
            "Parameters": "peerIpv4Addr",
            "Info": "Specifies the IPv4 address of a peer.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "peerIpv4Addr",
            "Info": "Specifies the IPv4 address of a peer.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "disable",
            "Info": "Disable the entropy label forwarding capability.\n-"
        },
        {
            "Parameters": "disable",
            "Info": "Disable the entropy label forwarding capability.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 10.1.1.1 as-number 200",
            "[*HUAWEI-bgp] peer 10.1.1.1 label-route-capability",
            "[*HUAWEI-bgp] peer 10.1.1.1 entropy-label"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 1.1.1.1 as-number 200",
            "[*HUAWEI-bgp] peer 1.1.1.1 label-route-capability",
            "[*HUAWEI-bgp] peer 1.1.1.1 entropy-label"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf load balancing is uneven on a network, you can run the peer entropy-label command to enable the entropy label capability for the device. This capability is effective in scenarios where traffic is forwarded along received BGP routes that carry the entropy label. Therefore, you also need to run the peer advertise-entropy-label elc command on the peer to enable the peer to add the entropy label of the entropy label capability (ELC) type to routes to be advertised to the local device. The two configurations help equalize and improve the performance of load balancing.\nAfter a peer is added to a peer group, the peer inherits the configuration of the peer group. If the entropy label capability is enabled on the local device and for the peer group, run the peer entropy-label disable command on the local device if this newly added peer does not need to have the entropy label capability.\nPrecautions\nIf the peer entropy-label command is run in the BGP-IPv4 unicast address family, the configuration takes effect only for labeled routes."
}