{
    "PageTitle": "whitelist session-car bgp",
    "FuncDef": "The whitelist session-car bgp command sets values for the BGP whitelist session CAR parameters.\nThe undo whitelist session-car bgp command restores the default values for the BGP whitelist session CAR parameters.\nBy default, the CIR, CBS, PIR, and PBS of BGP whitelist session CAR are 24 kbit/s, 15000 bytes, 48000 kbit/s, and 6000000 bytes, respectively.",
    "CLIs": [
        "whitelist session-car bgp { cir <cir-value> | cbs <cbs-value> | pir <pir-value> | pbs <pbs-value> } *",
        "undo whitelist session-car bgp [ { cir <cir-value> | cbs <cbs-value> | pir <pir-value> | pbs <pbs-value> } * ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "cir cir-value",
            "Info": "Specifies a committed information rate (CIR), that is, the average rate at which packets can be transmitted or forwarded.\nThe value ranges from 24 to 1200, in kbit/s. The default value is 24."
        },
        {
            "Parameters": "cbs cbs-value",
            "Info": "Specifies a committed burst size (CBS), which limits the maximum number of bytes available for a burst of packets in a short interval to remain within CIR.\nThe value ranges from 15000 to 1500000, in bytes. The default value is 15000."
        },
        {
            "Parameters": "pir pir-value",
            "Info": "Specifies a peak information rate (PIR), that is, the peak rate at which packets can be transmitted or forwarded.\nThe value ranges from 12000 to 60000, in kbit/s. The default value is 48000."
        },
        {
            "Parameters": "pbs pbs-value",
            "Info": "Specifies a peak burst size (PBS), which limits the maximum number of bytes available for a burst of packets in a short interval to remain within PIR.\nThe value ranges from 1500000 to 7500000, in bytes. The default value is 6000000."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] whitelist session-car bgp cir 24 cbs 15000 pir 48000 pbs 6000000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a device receives a large number of BGP messages, you can run the whitelist session-car bgp command to modify the bandwidth values as needed for the message channels between BGP sessions. This configuration ensures that BGP messages can be properly sent.\nPrecautions\npir-value must be greater than or equal to cir-value. If you attempt to set a pir-value value smaller than cir-value, the following error message will be displayed: \"Error: The pir %d must be greater than or equal to the cir %d.\"\npbs-value must be greater than or equal to cbs-value. If you attempt to set a pbs-value value smaller than cbs-value, the following error message will be displayed: \"Error: The pbs %d must be greater than or equal to the cbs %d.\""
}