{
    "PageTitle": "peer ebgp-max-hop (BGP multi-instance VPN instance IPv4 address family view) (group)",
    "FuncDef": "The peer ebgp-max-hop command configures a BGP device to establish an EBGP peer relationship with a peer on an indirectly-connected network and set the maximum number of hops between the two devices.\nThe undo peer ebgp-max-hop command cancels the existing configuration.\nBy default, an EBGP connection can be set up only on a directly-connected physical link.",
    "CLIs": [
        "peer <group-name> ebgp-max-hop [ <hop-count> ]",
        "undo peer <group-name> ebgp-max-hop"
    ],
    "ParentView": [
        "BGP multi-instance VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "group-name",
            "Info": "Specifies the name of a peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "hop-count",
            "Info": "Specifies the maximum number of hops.\nThe value is an integer ranging from 1 to 255. By default, the maximum number of hops in an EBGP connection is 1. If the specified maximum number of hops is 1, EBGP connection cannot be established between non-directly connected devices. If hop-count is not specified in the peer ebgp-max-hop command, 255 is used as the maximum number of hops in EBGP connections."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv4-family",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] vpn-target 111:1 both",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] quit",
            "[*HUAWEI-instance-vpna] quit",
            "[*HUAWEI] bgp 100 instance a",
            "[*HUAWEI-bgp-instance-a] ipv4-family vpn-instance vpna",
            "[*HUAWEI-bgp-instance-a-vpna] group test external",
            "[*HUAWEI-bgp-instance-a-vpna] peer test ebgp-max-hop"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA directly-connected physical link must be available between EBGP peers. Otherwise, the peer ebgp-max-hop command must be used to allow EBGP peers to establish a TCP connection over multiple hops.\nIf loopback interfaces are used to establish an EBGP peer relationship, the peer ebgp-max-hop command (hop-count >= 2) must be run; otherwise, the peer relationship cannot be established.\nPrecautions\nIf the peer ebgp-max-hop command is used on one end of an EBGP connection, it must also be used on the other end.\nThe configurations of GTSM and EBGP-MAX-HOP affect the TTL values of sent BGP packets, and the configurations of the two functions are mutually exclusive."
}