{
    "PageTitle": "peer route-server-client (BGP view) (group)",
    "FuncDef": "The peer route-server-client command enables the route server function on a device and specifies an EBGP peer as its client.\nThe peer route-server-client disable command disables the route server function on a device and cancels the client configuration.\nThe undo peer route-server-client command cancels the route server function and client configuration.\nThe undo peer route-server-client disable command restores the default configuration and takes effect only when the peer route-server-client disable command is run.\nBy default, the route server function is not enabled on a device, and no EBGP peer is configured as its client.",
    "CLIs": [
        "peer <group-name> route-server-client",
        "undo peer <group-name> route-server-client"
    ],
    "ParentView": [
        "BGP view"
    ],
    "ParaDef": [
        {
            "Parameters": "group-name",
            "Info": "Specifies the name of a peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] group test external",
            "[*HUAWEI-bgp] peer test as-number 200",
            "[*HUAWEI-bgp] peer test route-server-client"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn some scenarios on the live network, to achieve network traffic interworking, EBGP full-mesh connections may be required. However, establishing full-mesh connections among Routers that function as ASBRs is costly and places high requirements on the performance of the Routers, which adversely affects the network topology and Router expansion. The route server function is similar to the RR function in IBGP scenarios and allows Routers to advertise routes to their clients (ASBR Routers) without changing route attributes, such as AS_Path, Nexthop, and MED. With the route server function, EBGP full-mesh connections are not required among the ASBR Routers, which reduces network resource consumption.\nPrecautions\nThe configuration of a peer takes precedence over that of the peer group to which the peer belongs.\nAfter the route server function is enabled and an EBGP peer is specified, the messages that the local end sends to the peer does not carry the local AS number. In this case, you also need to run the peer check-first-as disable command to disable the check on the first AS number in the AS_Path attribute of the Update messages sent by the specified EBGP peer group; otherwise, the peer relationship cannot be established.\nThe command is mutually exclusive with the peer label-route-capability, confederation id, confederation peer-as, or confederation nonstandard command."
}