{
    "PageTitle": "confederation id",
    "FuncDef": "The confederation id command configures a BGP confederation and specifies a confederation ID.\nThe undo confederation id command deletes the configured BGP confederation.\nBy default, no BGP confederation is configured.",
    "CLIs": [
        "confederation id <as-number>",
        "undo confederation id"
    ],
    "ParentView": [
        "BGP view"
    ],
    "ParaDef": [
        {
            "Parameters": "as-number",
            "Info": "Specifies an AS number.\nFor an integral AS number, the value is an integer ranging from 1 to 4294967295.\nFor an AS number in dotted notation, the value is in the format of x.y, where x and y are integers ranging from 1 to 65535 and from 0 to 65535, respectively."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 41",
            "[*HUAWEI-bgp] confederation id 9",
            "[*HUAWEI-bgp] confederation peer-as 38 39 40",
            "[*HUAWEI-bgp] peer 1.2.3.4 as-number 38",
            "[*HUAWEI-bgp] peer 11.11.11.1 as-number 98"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA large AS may contain a huge number of fully meshed IBGP peer relationships. To reduce the number of fully meshed IBGP peer relationships in the AS and keep the integrity of the original AS, perform the following operations:\nDivide the AS into multiple sub-ASs and run the confederation id command to configure a BGP confederation. Then establish EBGP connections between sub-ASs and establish fully meshed IBGP connections within the same sub-AS.\nSome key attributes of routes, such as the next hop, MED, and Local_Pref are not discarded when these routes pass through sub-ASs.\nPrecautions\nThe confederation ID is equal to the AS number. During the establishment of a peer relationship with a peer in an external AS, specify the confederation ID. All the sub-ASs in the same confederation must be configured with the same confederation ID, and the confederation ID must be different from the number of any sub-AS."
}