{
    "PageTitle": "confederation peer-as",
    "FuncDef": "The confederation peer-as command configures the number of each sub-AS of a confederation.\nThe undo confederation peer-as command removes the specified sub-AS from the confederation.\nBy default, no sub-AS number of the confederation is configured.",
    "CLIs": [
        "confederation peer-as { <as-number> } &<1-32>",
        "undo confederation peer-as { <as-number> } &<1-32>"
    ],
    "ParentView": [
        "BGP view"
    ],
    "ParaDef": [
        {
            "Parameters": "as-number",
            "Info": "Specifies an AS number.\nFor an integral AS number, the value is an integer ranging from 1 to 4294967295.\nFor an AS number in dotted notation, the value is in the format of x.y, where x and y are integers ranging from 1 to 65535 and from 0 to 65535, respectively."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 1090",
            "[*HUAWEI-bgp] confederation id 100",
            "[*HUAWEI-bgp] confederation peer-as 1091 1092 1093"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA large AS may contain a huge number of fully meshed IBGP peer relationships. In this situation, configure a confederation. To configure the number of each sub-AS of the confederation, run the confederation peer-as command.\nPrerequisites\nA confederation ID has been configured using the confederation id command.\nConfiguration Impact\nThe sub-ASs configured in this command belong to the same confederation, and devices in each sub-AS are fully meshed.\nPrecautions\nThe old speaker with a 2-byte AS number and the new speaker with a 4-byte AS number cannot exist in the same confederation. AS4_Path does not support the confederation. If a 2-byte AS number and a 4-byte AS number co-exist in the same confederation, routing loops may occur, and the sub-AS numbers in the confederation may be transmitted out of the confederation.\nIf a confederation ID is configured and the command is run, all the TCP connections of the BGP peer relationships established using the sub-AS numbers specified in the command are torn down, and the BGP peer relationships are reestablished. Therefore, exercise caution when running this command."
}