{
    "PageTitle": "display ip vpn-instance import-vt",
    "FuncDef": "The display ip vpn-instance import-vt command displays all VPN instances with the specified import VPN target.",
    "CLIs": [
        "display ip vpn-instance import-vt <ivt-value>"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "ivt-value",
            "Info": "Specifies the value of the import VPN target.\nThe VPN target can be expressed in any of the following formats:\n2-byte AS number:4-byte user-defined number, for example, 1:3. An AS number ranges from 0 to 65535. A user-defined number ranges from 0 to 4294967295. The AS number and the user-defined number cannot be 0s at the same time. That is, a VPN target cannot be 0:0.4-byte AS number in dotted notation:2-byte user-defined number, for example, 0.0:3 or 0.1:0. A 4-byte AS number in dotted notation is in the format of x.y, where x and y are integers that range from 1 to 65535 and from 0 to 65535, respectively. A user-defined number ranges from 0 to 65535. The AS number and user-defined number cannot be both 0s. That is, a VPN target cannot be 0.0:0.4-byte IP address:16-bit user-defined number, for example, 192.168.122.15:1. An IP address ranges from 0.0.0.0 to 255.255.255.255. A user-defined number ranges from 0 to 65535."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display ip vpn-instance import-vt 1:1",
            "The number of ipv4-family matched the import-vt : 3",
            " VPN-Instance Name and ID : vrf1, 1",
            " VPN-Instance Name and ID : vrf4, 5",
            " VPN-Instance Name and ID : vrf5, 4",
            "",
            "The number of ipv6-family matched the import-vt : 2",
            " VPN-Instance Name and ID : vrf1, 1",
            " VPN-Instance Name and ID : vrf5, 4"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo learn a VPNv4 route with a specified export VPN target can be imported to which VPN instances on a PE, run the display ip vpn-instance import-vt command.\nVPN targets control route learning between VPN instances. A VPN target may be either an import VPN target or an export VPN target. An export VPN target is contained in a VPNv4 route to be advertised to a remote MP-BGP peer. Upon receiving a VPNv4 route, an MP-BGP peer compares the received export VPN target with the local import VPN target to determine whether the VPNv4 route can be added to the routing table of the local VPN instance IPv4 address family."
}