{
    "PageTitle": "display bgp vpn-instance group",
    "FuncDef": "The display bgp vpn-instance group command displays information about BGP peer groups in a specified VPN instance.",
    "CLIs": [
        "display bgp vpnv4 vpn-instance <vpn-instance-name> group",
        "display bgp vpnv4 vpn-instance <vpn-instance-name> group <group-name>",
        "display bgp instance <instance-name> vpnv4 vpn-instance <vpn-instance-name> group",
        "display bgp instance <instance-name> vpnv4 vpn-instance <vpn-instance-name> group <group-name>",
        "display bgp labeled vpn-instance <vpn-instance-name> group",
        "display bgp labeled vpn-instance <vpn-instance-name> group <group-name>"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "vpnv4",
            "Info": "Displays information about BGP VPNv4 peer groups.\n-"
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Displays information about BGP peer groups in a specified VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "group-name",
            "Info": "Specifies the name of a peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "instance instance-name",
            "Info": "Specifies the name of a BGP multi-instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "labeled",
            "Info": "Specify labeled-unicast sub-address family.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display bgp vpnv4 vpn-instance vpn2 group",
            "",
            " BGP peer-group: bb",
            " Remote AS number isn't specified",
            " VPN-Instance(IPv4-family): vpn2",
            " ",
            " Authentication type configured: None",
            " Type : external",
            " PeerSession Members: ",
            " 10.1.1.2                                 ",
            "",
            " Peer Members: ",
            " 10.1.1.2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nConfiguring BGP peer groups simplifies BGP network configuration and improves route advertisement efficiency.\nThe\ndisplay bgp vpn-instance group command displays information about BGP peer groups in a specified VPN instance, including peers in the peer group and configuration information about the peer group. The\ndisplay bgp vpn-instance group command is used in the following scenarios:\nVerify the configuration after a peer group is configured using the group command.Verify the configuration after a peer is added to a peer group using the peer group command.Verify the configuration after a peer is deleted from a peer group using the undo peer group command.Verify the configuration after modifying the configuration of a peer group.\n\nPrecautions\nBGP has multiple address families, each of which is configured independently. Information about peer groups in address families can be displayed by specifying different parameters.\nIf no parameter is specified, the display bgp vpn-instance group command displays default information about peer groups in the IPv4 unicast address family."
}