{
    "PageTitle": "display bgp vpn-instance peer",
    "FuncDef": "The display bgp vpn-instance peer command displays information about BGP peers in a specified VPN instance.\nThe display bgp vpn-instance slow-peer command displays information about slow BGP peers in a specified VPN instance.",
    "CLIs": [
        "display bgp vpnv4 vpn-instance <vpn-instance-name> peer",
        "display bgp vpnv4 vpn-instance <vpn-instance-name> slow-peer",
        "display bgp instance <instance-name> vpnv4 vpn-instance <vpn-instance-name> peer",
        "display bgp instance <instance-name> vpnv4 vpn-instance <vpn-instance-name> slow-peer",
        "display bgp labeled vpn-instance <vpn-instance-name> peer",
        "display bgp labeled vpn-instance <vpn-instance-name> slow-peer"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "vpnv4",
            "Info": "Specifies a BGP-VPNv4 address family.\n-"
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "instance instance-name",
            "Info": "Specifies a BGP multi-instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "labeled",
            "Info": "Displays information about slow BGP peers in the BGP-VPNv4 address family.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display bgp vpnv4 vpn-instance vrf1 peer",
            "BGP local router ID : 1.1.1.9",
            " Local AS number : 100",
            " Total number of peers : 1                 Peers in established state : 1",
            "Peer        V    AS  MsgRcvd  MsgSent  OutQ  Up/Down       State PrefRcv",
            "",
            "  10.1.1.1    4 65410      207      192     0 02:59:49 Established       1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe display bgp vpn-instance peer command displays information about BGP peers in a specified VPN instance. You can implement the following operations based on the command output:\nTo check the status of BGP connectionsTo check information about a BGP peerTo check whether a BGP peer is configured using the peer as-number commandTo check whether a BGP peer is deleted using the undo peer as-number command\nThe display bgp vpn-instance peer command can be used for troubleshooting, with details as follows: If BGP peers are disconnected, specify log-info in the command to check the log information of the specified peer. In the command output, Date/Time indicates the time when the peers were disconnected, and Error Code and Error Subcode indicate the cause of the disconnection.\nTo check information about slow BGP peers, run the display bgp slow-peer command. The information includes the time when a peer began to be identified as a slow peer, the time when a peer last exited from the slow peer state, the number of times a peer has been identified as a slow peer, and the remaining time for a peer to exit from the slow peer state."
}