{
    "PageTitle": "display bgp l2vpn-ad peer (or slow-peer)",
    "FuncDef": "The display bgp l2vpn-ad peer command displays information about BGP peers in the L2VPN AD address family.\nThe display bgp l2vpn-ad slow-peer command displays information about slow BGP peers in the L2VPN AD address family.",
    "CLIs": [
        "display bgp l2vpn-ad peer",
        "display bgp l2vpn-ad slow-peer"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> display bgp l2vpn-ad peer",
            " BGP local router ID : 10.2.2.2",
            " Local AS number : 100",
            " Total number of peers : 2                 Peers in established state : 2",
            "",
            "  Peer            V          AS  MsgRcvd  MsgSent  OutQ  Up/Down       State PrefRcv",
            "  10.3.3.3        4         100      482      484     0 07:58:05 Established       1",
            "  10.4.4.4        4         100      439      439     0 07:13:16 Established       3"
        ],
        [
            "<HUAWEI> display bgp l2vpn-ad slow-peer",
            "Total number of peers : 2                 ",
            " Switchback detection timer: Remaining 3581 Second(s)",
            " Peer            LastSlowEndTime              SlowStartTime                SlowCount ",
            " 10.1.1.1        2016-04-10 20:41:33+00:00    2016-04-12 00:02:33+00:00    3 ",
            " 10.2.2.1        2016-04-11 23:02:40+00:00    2016-04-12 00:02:40+00:00    5"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe display bgp l2vpn-ad peer command displays BGP peer information in the L2VPN AD address family. You can implement the following operations based on the command output:\nTo check the status of BGP connectionsTo check information about a BGP peerTo check whether a BGP peer is configured using the peer as-number commandTo check whether a BGP peer is deleted using the undo peer as-number command\nTo check information about slow BGP peers in the L2VPN AD address family, run the display bgp l2vpn-ad slow-peer command. The information includes the time when a peer began to be identified as a slow peer, the time when a peer last exited from the slow peer state, the number of times a peer has been identified as a slow peer, and the remaining time for a peer to exit from the slow peer state."
}