{
    "PageTitle": "peer route-update-interval (BGP-VPNv4-multicast address family view) (group)",
    "FuncDef": "The peer route-update-interval command sets the interval at which a device sends routing updates carrying the same prefix to a peer group.\nThe undo peer route-update-interval command restores the default setting.\nBy default, the interval at which routing updates are sent to IBGP peers is 15s, and the interval at which routing updates are sent to EBGP peers is 30s.",
    "CLIs": [
        "peer <group-name> route-update-interval <interval>",
        "undo peer <group-name> route-update-interval"
    ],
    "ParentView": [
        "BGP-VPNv4-multicast address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "group-name",
            "Info": "Specifies the name of a peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "interval",
            "Info": "Specifies the minimum interval at which routing updates are sent.\nThe value is an integer ranging from 0 to 600, in seconds. The value 0 indicates that the device immediately sends BGP Update messages to notify its peers of route changes."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[~HUAWEI-bgp] group a internal",
            "[*HUAWEI-bgp] ipv4-family vpnv4-multicast",
            "[*HUAWEI-bgp-af-vpnv4-multicast] peer a enable",
            "[*HUAWEI-bgp-af-vpnv4-multicast] peer a route-update-interval 10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen routes change, the Router sends routing updates to notify its peers. If a route changes frequently, the peer route-update-interval command can be used to adjust the interval at which Update packets are sent for changes of this route. This frees the Router from sending Update packets for every route change.\nImplementation Procedure\nIf the peer route-update-interval command is used but no peer exists, a message is displayed, indicating that the peer does not exist.\nPrecautions\nIf a route is withdrawn, the Router immediately sends an Update message to its peers, regardless of the peer route-update-interval configuration. If a route is added and the interval between the last route addition time and the current route addition time is greater than the interval configured using the peer route-update-interval command, the Router immediately sends an Update message to its peers. If a route is added and the interval between the last route addition time and the current route addition time is less than the interval configured using the peer route-update-interval command, the Router sends an Update message to its peers only after the configured interval expires."
}