{
    "PageTitle": "peer signaling vpls (BGP-L2VPN-AD address family view) (group)",
    "FuncDef": "The peer signaling vpls command configures the VPLS signaling mode for a specified peer group.\nThe undo peer signaling vpls command restores the default signaling mode of a specified peer group.\nBy default, after the peer enable command is run in the L2VPN AD address family view, the BGP AD signaling mode is enabled for all peers or peer groups.",
    "CLIs": [
        "peer <group-name> signaling vpls",
        "undo peer <group-name> signaling vpls"
    ],
    "ParentView": [
        "BGP-L2VPN-AD address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "group-name",
            "Info": "Specifies the name of a peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "vpls",
            "Info": "Configures the signaling mode of a specified peer group as VPLS.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] group test internal",
            "[*HUAWEI-bgp] l2vpn-ad-family",
            "[*HUAWEI-bgp-af-l2vpn-ad] peer test enable",
            "[*HUAWEI-bgp-af-l2vpn-ad] peer test signaling vpls"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn BGP VPLS scenarios, configure the signaling mode for peers or peer groups in the L2VPN AD address family view so that peers can advertise routes to each other. The parameters used in different scenarios are described as follows:\nIn the BGP VPLS scenario, configure vpls in the peer signaling command.In the BGP AD VPLS scenario, the BGP AD signaling is enabled for all peers or peer groups in the L2VPN AD address family view by default.\n\nPrerequisites\nA peer group has been created using the peer enable command.\nPrecautions\nThe signaling mode configured for a peer is preferred over that configured for the peer group to which the peer belongs. When a signaling mode is configured for a peer group but not configured for a peer that belongs to the peer group, the peer uses the signaling mode configured for its peer group."
}