{
    "PageTitle": "peer advertise-entropy-label elc (BGP view) (group)",
    "FuncDef": "The peer advertise-entropy-label elc command enables a device to add the entropy label of the entropy label capability (ELC) type to the BGP routes to be advertised to a specified peer.\nThe undo peer advertise-entropy-label command cancels the existing configuration.\nBy default, a device advertises BGP routes without the entropy label to a peer group.",
    "CLIs": [
        "peer <peerGroupName> advertise-entropy-label elc [ padding <paddingValue> ]",
        "undo peer <peerGroupName> advertise-entropy-label elc [ padding <paddingValue> ]"
    ],
    "ParentView": [
        "BGP view"
    ],
    "ParaDef": [
        {
            "Parameters": "peerGroupName",
            "Info": "Specify an peer group name.\nThe value is a string of 1 to 47 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "peerGroupName",
            "Info": "Specify an peer group name.\nThe value is a string of 1 to 47 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "padding paddingValue",
            "Info": "Padding format of the ELC attribute.\nThe value is a hexadecimal string containing 1 to 32 characters (16 hexadecimal numbers). It cannot contain spaces, and can only contain uppercase letters (A to F) and digits (0 to 9), and the length must be an even number."
        },
        {
            "Parameters": "padding paddingValue",
            "Info": "Padding format of the ELC attribute.\nThe value is a hexadecimal string containing 1 to 32 characters (16 hexadecimal numbers). It cannot contain spaces, and can only contain uppercase letters (A to F) and digits (0 to 9), and the length must be an even number."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] group A external",
            "[*HUAWEI-bgp] peer A label-route-capability",
            "[*HUAWEI-bgp] peer A advertise-entropy-label elc"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] group A external",
            "[*HUAWEI-bgp] peer A label-route-capability",
            "[*HUAWEI-bgp] peer A advertise-entropy-label elc"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf load balancing is uneven on a network, you can run the peer advertise-entropy-label elc command to enable a device to add the entropy label of the ELC type to the BGP routes to be advertised to a specified peer. This command together with the peer entropy-label command helps equalize and improve the performance of load balancing. The standard that the peer advertise-entropy-label elc command complies with does not define the format of a padding value. To ensure flexible padding adjustment, specify the padding parameter to set a padding value for the entropy label as required. When changing the next hop of a route received from a peer, the device replaces the padding value carried the route with the padding value specified using the peer advertise-entropy-label elc command.\nIf a device is enabled to add the entropy label to the BGP routes to be advertised to a peer group, the device can add the entropy label to the BGP routes to be advertised to all the members in the peer group. This simplifies networking configuration and facilitates route maintenance and management."
}