{
    "PageTitle": "peer advertise link-bandwidth (BGP-IPv6 unicast address family view)(group)",
    "FuncDef": "The peer advertise ebgp link-bandwidth command enables a device to advertise the Link Bandwidth extended community attribute to a specified EBGP peer group.\nThe undo peer advertise ebgp link-bandwidth command cancels the existing configuration.\nThe peer advertise link-bandwidth transitive command enables a device to convert the Link Bandwidth extended community attribute (optional non-transitive) carried in BGP routes into an optional transitive attribute before advertising the BGP routes to a specified peer group.\nThe undo peer advertise link-bandwidth transitive command cancels the existing configuration.\nBy default, a device cannot advertise the Link Bandwidth extended community attribute to an EBGP peer group, and cannot convert the Link Bandwidth extended community attribute (optional non-transitive) carried in BGP routes into an optional transitive attribute before advertising the BGP routes to a peer group.",
    "CLIs": [
        "peer <peerGroupName> advertise ebgp link-bandwidth",
        "peer <peerGroupName> advertise link-bandwidth transitive",
        "undo peer <peerGroupName> advertise ebgp link-bandwidth",
        "undo peer <peerGroupName> advertise link-bandwidth transitive"
    ],
    "ParentView": [
        "BGP-IPv6 unicast address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "peerGroupName",
            "Info": "Specifies the name of a peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] group test external",
            "[*HUAWEI-bgp] ipv6-family unicast",
            "[*HUAWEI-bgp-af-ipv6] ext-community-change enable",
            "[*HUAWEI-bgp-af-ipv6] peer test enable",
            "[*HUAWEI-bgp-af-ipv6] peer test advertise-ext-community",
            "[*HUAWEI-bgp-af-ipv6] peer test advertise ebgp link-bandwidth"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo enable a device to advertise the Link Bandwidth extended community attribute to a specified EBGP peer group, run the peer advertise ebgp link-bandwidth command.\nTo enable a device to convert the Link Bandwidth extended community attribute (optional non-transitive) carried in BGP routes into an optional transitive attribute before advertising the BGP routes to a specified peer group, run the peer advertise link-bandwidth transitive command.\nPrecautions\nBefore running the peer advertise ebgp link-bandwidth or peer advertise link-bandwidth transitive command, you need to use a route-filter to add the Link Bandwidth extended community attribute to BGP routes. Currently, either command can be used to process only one Link Bandwidth extended community attribute per BGP route. However, if a device changes the next-hop address of a received route carrying the Link Bandwidth extended community attribute to its own address, the device deletes this attribute before advertising it to other peers."
}