{
    "PageTitle": "peer filter-policy import (BGP-IPv6 unicast address family view) (group)",
    "FuncDef": "The peer filter-policy import command configures an ACL-based policy for filtering BGP routes received from a specified peer group.\nThe undo peer filter-policy import command cancels this configuration.\nBy default, no filtering policy is set for a peer group.",
    "CLIs": [
        "peer <group-name> filter-policy <acl-number> import",
        "peer <group-name> filter-policy acl6-name <acl6-name> import",
        "undo peer <group-name> filter-policy <acl-number> import",
        "undo peer <group-name> filter-policy acl6-name <acl6-name> import"
    ],
    "ParentView": [
        "BGP-IPv6 unicast address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "group-name",
            "Info": "Specifies the name of a peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "acl-number",
            "Info": "Specifies the number of a basic ACL.\nThe value is an integer ranging from 2000 to 2999."
        },
        {
            "Parameters": "import",
            "Info": "Filters received routes.\n-"
        },
        {
            "Parameters": "acl6-name acl6-name",
            "Info": "Specifies the name of a named basic ACL6.\nThe value is a string of 1 to 64 case-sensitive characters without spaces. The value must start with a letter (a to z or A to Z, case sensitive)."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl ipv6 2001",
            "[*HUAWEI-acl6-basic-2001] rule permit",
            "[*HUAWEI-acl6-basic-2001] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] group test external",
            "[*HUAWEI-bgp] peer test as-number 200",
            "[*HUAWEI-bgp] ipv6-family unicast",
            "[*HUAWEI-bgp-af-ipv6] peer test enable",
            "[*HUAWEI-bgp-af-ipv6] peer test filter-policy 2001 import"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe peer filter-policy import command is used to configure an ACL-based policy for filtering routes to be received from a peer group.\nA proper basic ACL needs to be selected based on the address family of a peer group.\nConfiguration Impact\nIf the peer filter-policy import command is run multiple times, the latest configuration overwrites the previous one. For example, if the peer 2001:DB8:2::2 filter-policy 2600 import command is run and then the peer 2001:DB8:2::2 filter-policy 2400 import command is run, the configuration of the peer 2001:DB8:2::2 filter-policy 2400 import command overwrites that of the peer 2001:DB8:2::2 filter-policy 2600 import command.\nPrecautions\nWhen the rule command is run to configure rules for a named ACL, only the source address range specified by source and the time period specified by time-range take effect.\nThe peer route-filter import command is mutually exclusive with the peer route-filter import commands."
}