{
    "PageTitle": "peer import reoriginate (BGP-VPNv6 address family view) (group)",
    "FuncDef": "The peer import reoriginate command enables the function to add the regeneration flag to the routes received from the peer.\nThe undo peer import reoriginate command restores the default configuration.\nBy default, the local device does not add the regeneration flag to the routes received from the peer.",
    "CLIs": [
        "peer <peerGroupName> import reoriginate",
        "undo peer <peerGroupName> import reoriginate"
    ],
    "ParentView": [
        "BGP-VPNv6 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "peerGroupName",
            "Info": "Specifies the name of a BGP peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] group gp1",
            "[*HUAWEI-bgp] peer 10.1.1.1 group gp1",
            "[*HUAWEI-bgp] peer 10.2.2.2 group gp1",
            "[*HUAWEI-bgp] ipv6-family vpnv6",
            "[*HUAWEI-bgp-af-vpnv6] peer gp1 enable",
            "[*HUAWEI-bgp-af-vpnv6] peer gp1 import reoriginate"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn the data center interconnect (DCI) solution, DCI-PE adds the regeneration flag to the received VPNv6 routes before sending the routes to the peer. By default, the function to add the regeneration flag to the routes received from the peer is disabled. Specifically, DCI-PE does not re-encapsulate the routes received from the peer. Therefore, to allow DCI-PE to re-encapsulate VPNv6 routes, run the peer import reoriginate command to enable the function to add the regeneration flag to the routes received from the peer.\nPrerequisites\nRoute exchange with a specified peer group has been enabled using the peer group-name enable command."
}