{
    "PageTitle": "peer description (BGP view) (group)",
    "FuncDef": "The peer description command configures a description for a peer group.\nThe undo peer description command deletes the description of a peer group.\nBy default, no description is configured for a peer group.",
    "CLIs": [
        "peer <group-name> description <description-text>",
        "undo peer <group-name> description"
    ],
    "ParentView": [
        "BGP view"
    ],
    "ParaDef": [
        {
            "Parameters": "group-name",
            "Info": "Specifies the name of a peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "description-text",
            "Info": "Specifies a description, which can be letters and digits.\nThe value is a string of 1 to 255 characters, with spaces supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] group test external",
            "[*HUAWEI-bgp] peer test as-number 200",
            "[*HUAWEI-bgp] peer test description ISP1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe peer description can be used to configure a description for a peer group, which facilitates management of peers or peer groups. The description records information about the peer group, such as the VPN instance to which the peer group belongs, and devices that establish peer relationships with the peer group.\nImplementation Procedure\nThe description configured by using the peer description command for a peer is displayed from the first non-space character.\nConfiguration Impact\nIf the peer description command is run multiple times to configure a description for a peer, the latest configuration overwrites the previous one.\nFollow-up Procedure\nYou can run display bgp peer verbose command can be used to view the description of a peer."
}