{
    "PageTitle": "peer update-packet standard-compatible (BGP-VPNv4-multicast address family view) (group)",
    "FuncDef": "The peer update-packet standard-compatible command enables a device to receive from and send to a specified BGP-VPNv4-multicast peer group Update packets without labels.\nThe undo peer update-packet standard-compatible command enables a device to receive from and send to a specified BGP-VPNv4-multicast peer group Update packets with labels.\nBy default, Huawei devices receive from and send to BGP-VPNv4-multicast peers or peer groups Update packets without labels.",
    "CLIs": [
        "peer <group-name> update-packet standard-compatible",
        "undo peer <group-name> update-packet standard-compatible"
    ],
    "ParentView": [
        "BGP-VPNv4-multicast address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "group-name",
            "Info": "Specifies the name of a peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[~HUAWEI-bgp] group a internal",
            "[*HUAWEI-bgp] ipv4-family vpnv4-multicast",
            "[*HUAWEI-bgp-af-vpnv4-multicast] peer a enable",
            "[*HUAWEI-bgp-af-vpnv4-multicast] peer a update-packet standard-compatible"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAccording to standard protocols, the Update packets exchanged between BGP-VPNv4-multicast peers do not carry labels. However, the implementation on devices varies with the vendor. If a BGP-VPNv4-multicast peer relationship is established between two devices with different implementations, Update packets exchanged between them may be discarded. To enable a Huawei device to establish a BGP-VPNv4-multicast peer relationship with a non-Huawei device with a different implementation and allow the Huawei device to receive from and send to the peer Update packets with labels, run the undo peer update-packet standard-compatible command."
}