{
    "PageTitle": "ingress-lsp trigger route-policy",
    "FuncDef": "The ingress-lsp trigger route-policy command specifies a routing policy to control the creation of ingress LSPs based on labeled BGP IPv4 routes.\nThe undo ingress-lsp trigger command restores the default configuration.\nBy default, ingress LSPs are created based on all received BGP labeled routes.",
    "CLIs": [
        "ingress-lsp trigger route-policy <route-policy-name>",
        "undo ingress-lsp trigger"
    ],
    "ParentView": [
        "BGP-IPv4 unicast address family view",
        "BGP view"
    ],
    "ParaDef": [
        {
            "Parameters": "route-policy route-policy-name",
            "Info": "Specifies the name of a routing policy to be used to create ingress LSPs based on BGP labeled routes.\nThe name is a string of 1 to 200 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] route-policy test-policy permit node 10",
            "[*HUAWEI-route-policy] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv4-family unicast",
            "[*HUAWEI-bgp-af-ipv4] ingress-lsp trigger route-policy test-policy"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn a MAN where the hybrid access mode is used, a large number of labeled BGP routes are used to establish end-to-end LSPs. On certain intermediate nodes where VPN services do not need to be supported, excessive ingress LSPs are created, causing the waste of network resources. In this case, you can run the ingress-lsp trigger command to create ingress LSPs based on a routing policy to save network resources.\nPrerequisites\nIf the routing policy specified in the ingress-lsp trigger command does not exist, you need to configure the routing policy using the route-policy command first.\nConfiguration Impact\nIf the ingress-lsp trigger command is run more than once, the latest configuration overrides the previous one.\nWhen a large number of routes flap on a device and the ingress-lsp trigger command is run, a delay occurs when labeled routes recurse to BGP LSPs, but service traffic is not affected.\nWhen a large number of routes flap on a device and the undo ingress-lsp trigger command is run, a delay occurs in the switchback of labeled routes to the original tunnels, but service traffic is not affected."
}