{
    "PageTitle": "ipv4-family",
    "FuncDef": "The ipv4-family command enables the IPv4 address family for a VPN instance and displays the VPN instance IPv4 address family view.\nThe undo ipv4-family command disables the IPv4 address family for a VPN instance.\nBy default, the IPv4 address family is not enabled for a VPN instance.",
    "CLIs": [
        "ipv4-family [ unicast ]",
        "undo ipv4-family [ unicast ]"
    ],
    "ParentView": [
        "VPN instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "unicast",
            "Info": "Displays the unicast address family view.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ipv4-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ipv4-family"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn L3VPN networking, after you run the ip vpn-instance command to create a VPN instance, you can run the ipv4-family command to enable the IPv4 address family for the VPN instance and perform VPN configurations in the address family view if you want to have IPv4 VPN routes advertised and IPv4 VPN data forwarded.\nFollow-up Procedure\nRun the route-distinguisher command to configure an RD for the IPv4 address family of the VPN instance. VPN configurations can be performed in the IPv4 address family view only after an RD is configured for the IPv4 address family of the VPN instance.\nPrecautions\nConfigurations of the commands run in the VPN instance view, except the description command, are automatically synchronized to the VPN instance IPv4 address family view.\nAfter the IPv4 address family for a VPN instance is disabled using the undo ipv4-family [ unicast ] command, configurations in the IPv4 address family as well as the IPv4 address family-related configurations in the BGP view will be deleted. Therefore, exercise caution when you run this command."
}