{
    "PageTitle": "ipv4-labeled-unicast vpn-instance",
    "FuncDef": "The ipv4-labeled-unicast vpn-instance command enables a BGP-labeled-VPN instance IPv4 address family and displays the BGP-labeled-VPN instance IPv4 address family view.\nThe undo ipv4-labeled-unicast vpn-instance command deletes all the configurations in the BGP-labeled-VPN instance IPv4 address family view.\nBy default, the BGP-IPv4 unicast address family view is displayed.",
    "CLIs": [
        "ipv4-labeled-unicast vpn-instance <vpn-instance-name>",
        "undo ipv4-labeled-unicast vpn-instance <vpn-instance-name>"
    ],
    "ParentView": [
        "BGP view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance-name",
            "Info": "Specifies the name of a VPN instance with which a BGP-labeled-VPN instance IPv4 address family is associated.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv4-family",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vpna] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] vpn-instance vpna",
            "[*HUAWEI-bgp-instance-vpna] peer 2.2.2.2 as-number 100",
            "[*HUAWEI-bgp-instance-vpna] quit",
            "[*HUAWEI-bgp] ipv4-labeled-unicast vpn-instance vpna"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBefore you perform configurations in a BGP-labeled-VPN instance IPv4 address family, run the ipv4-labeled-unicast vpn-instance command in the BGP view to enable it. After the configuration, the BGP-labeled-VPN instance IPv4 address family view is displayed. By default, BGP uses the BGP-IPv4 unicast address family.\nPrecautions\nIf the local device is enabled to exchange BGP labeled routes with a specified peer or peer group using the peer enable command in both the BGP-labeled-VPN instance IPv4 address family view and BGP-VPN instance IPv4 address family view, but the peer or peer group is enabled to send or receive BGP labeled routes using a route-policy and the peer label-route-capability command only in the BGP-IPv4 unicast address family view, routes may be withdrawn or overwritten unexpectedly."
}