{
    "PageTitle": "ipv4-family labeled-unicast",
    "FuncDef": "The ipv4-family labeled-unicast command creates and enters the BGP unicast labeled address family view.\nThe undo ipv4-family labeled-unicast command deletes the BGP unicast labeled address family view.\nBy default, the BGP unicast labeled address family view does not exist.",
    "CLIs": [
        "ipv4-family labeled-unicast",
        "undo ipv4-family labeled-unicast"
    ],
    "ParentView": [
        "BGP view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv4-family labeled-unicast",
            "[*HUAWEI-bgp-af-ipv4-labeled]"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBefore performing configurations in a unicast labeled address family, run the ipv4-family labeled-unicast command in the BGP view to enable the unicast labeled address family and display its view. By default, BGP-IPv4 unicast address family is enabled.\nAfter a BGP peer relationship is established in the BGP-labeled address family view, the BGP peers can send BGP labeled routes to each other and establish BGP LSPs between them. BGP labeled routes in the BGP-labeled address family view are stored in an independent BGP label routing table and can participate in route selection when next hops recurse to LSPs. Additionally, BGP peers can generate BGP labeled routes and send them to each other by configuring a routing policy and running the peer label-route-capability command. However, such BGP labeled routes are BGP unicast labeled routes and are stored in the BGP unicast routing table. Such routes can participate in route selection when next hops recurse to IP addresses.\nPrecautions\nIf the local device is enabled to exchange BGP labeled routes with a specified peer or peer group using the peer enable command in both the BGP unicast labeled address family view and BGP-IPv4 unicast address family view, but the peer or peer group is enabled to send or receive BGP labeled routes using a route-policy and the peer label-route-capability command only in the BGP-IPv4 unicast address family view, routes may be withdrawn or overwritten unexpectedly."
}