{
    "PageTitle": "import-route (BGP-IPv4 unicast address family view) (Non-IGP)",
    "FuncDef": "The import-route command configures BGP to import routes from other protocols.\nThe undo import-route command cancels the configuration.\nBy default, BGP does not import routes from other protocols.",
    "CLIs": [
        "import-route { direct | static | unr | op-route } [ [ med <med> ] | [ [ route-policy <route-policy-name> ] | [ route-filter <route-filter-name> ] ] ] *",
        "import-route { direct | static } [ [ med <med> ] | [ [ route-policy <route-policy-name> ] | [ route-filter <route-filter-name> ] ] ] * [ non-relay-tunnel ]",
        "undo import-route { direct | static | unr | op-route }"
    ],
    "ParentView": [
        "BGP-IPv4 unicast address family view",
        "BGP-Labeled address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "direct",
            "Info": "Configures BGP to import direct routes.\n-"
        },
        {
            "Parameters": "static",
            "Info": "Configures BGP to import static routes.\n-"
        },
        {
            "Parameters": "unr",
            "Info": "Configures BGP to import UNR routes.\n-"
        },
        {
            "Parameters": "op-route",
            "Info": "Configures BGP to import open programming (OP)-routes.\n-"
        },
        {
            "Parameters": "med med",
            "Info": "Specifies the MED for imported routes.\nThe value is an integer ranging from 0 to 4294967295."
        },
        {
            "Parameters": "route-policy route-policy-name",
            "Info": "Specifies the route-policy used to filter routes and modify route attributes when these routes are imported from other protocols.\nThe name is a string of 1 to 200 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "route-filter route-filter-name",
            "Info": "Specifies the route-filter used to filter routes and modify route attributes when these routes are imported from other protocols.\nThe value is a string of 1 to 200 case-sensitive characters, spaces not supported. If parameters are included in the referenced route-filter, specify values for them in the format of (var1, var2, ...var8) behind the route-filter name. A maximum of eight parameters can be specified, and each value ranges from 1 to 200 characters."
        },
        {
            "Parameters": "non-relay-tunnel",
            "Info": "Prevents the routes imported by BGP from recursing to tunnels.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv4-family unicast",
            "[*HUAWEI-bgp-af-ipv4] import-route static"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBGP can import routes using the import-route command or network command:\nThe import-route command imports routes of a specified type into the BGP routing table, such as RIP, OSPF, IS-IS, static, or direct routes.The network command imports routes with the specified prefix and mask into the BGP routing table. Compared with the import-route command, the network command imports more specific routes.\nWhen the import-route static command is run, only active static routes are imported.\n\nConfiguration Impact\nIf the default-route imported command has not been used when you run the import-route command to import routes from other protocols, BGP cannot import default routes.\nPrecautions\nThe import-route route-policy command is mutually exclusive with the import-route route-filter command."
}