{
    "PageTitle": "peer local-graceful-restart timer restart (BGP multi-instance view) (group)",
    "FuncDef": "The peer local-graceful-restart timer restart command sets the maximum duration for a device to wait for the BGP peer relationship with each peer in a specified group to be reestablished. After this command is run, the device will not advertise the maximum duration to any peer in the specified group.\nThe undo peer local-graceful-restart timer restart command deletes the configured duration.\nBy default, a device waits for the BGP peer relationship with each peer in a specified group to be reestablished for a maximum of 150s.",
    "CLIs": [
        "peer <group-name> local-graceful-restart timer restart <restart-time>",
        "undo peer <group-name> local-graceful-restart timer restart"
    ],
    "ParentView": [
        "BGP multi-instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "group-name",
            "Info": "Specifies the name of a BGP peer group.\nThe value is a string of 1 to 47 case-sensitive characters. If spaces are used, the string must start and end with double quotation marks (\")."
        },
        {
            "Parameters": "restart-time",
            "Info": "Specifies the maximum duration for a device to wait for the GR recovery of each peer in a specified group.\nThe value is an integer ranging from 3 to 3600, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100 instance vpn1",
            "[*HUAWEI-bgp-instance-vpn1] group aa",
            "[*HUAWEI-bgp-instance-vpn1] peer aa local-graceful-restart timer restart 250"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo set the maximum duration for a device to wait for the BGP peer relationship with each peer in a group to be reestablished, run the peer local-graceful-restart timer restart command. After this command is run, if the device detects that a peer in the group is down, the involved BGP session on the device enters the GR process. If the peer relationship fails to be reestablished within the specified duration, the BGP session exits from the GR process and the device selects the optimal route from current reachable routes."
}