{
    "PageTitle": "peer local-graceful-restart timer restart (BGP multi-instance VPN instance IPv4 address family view)",
    "FuncDef": "The peer local-graceful-restart timer restart command sets the maximum duration for a device to wait for the BGP peer relationship with a specified peer to be reestablished. After this command is run, the device will not advertise the maximum duration to the specified peer.\nThe undo peer local-graceful-restart timer restart command deletes the configured duration.\nBy default, a device waits for the peer relationship with a peer to be reestablished for a maximum of 150 seconds.",
    "CLIs": [
        "peer <ipv4-address> local-graceful-restart timer restart <restart-time>",
        "undo peer <ipv4-address> local-graceful-restart timer restart"
    ],
    "ParentView": [
        "BGP multi-instance VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv4-address",
            "Info": "Specifies the IPv4 address of a BGP peer.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "restart-time",
            "Info": "Specifies the maximum duration for a device to wait for the GR recovery of a specified peer.\nThe value is an integer ranging from 3 to 3600, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] route-distinguisher 1:1",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[*HUAWEI] bgp 100 instance a",
            "[*HUAWEI-bgp-instance-a] ipv4-family vpn-instance vpn1",
            "[*HUAWEI-bgp-instance-a-vpn1] peer 10.1.1.2 as-number 100",
            "[*HUAWEI-bgp-instance-a-vpn1] peer 10.1.1.2 local-graceful-restart timer restart 250"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a device supports GR but a BGP peer specified on the device does not support GR, you can run the peer local-graceful-restart timer restart command to set the maximum duration for the device to wait for the BGP peer relationship with the peer to be reestablished. After this command is run, if the device detects that the peer is down, the BGP session on the device enters the GR process. If the peer relationship fails to be reestablished within the specified duration, the BGP session exits from the GR process and the device selects the optimal route from current reachable routes."
}