{
    "PageTitle": "peer local-graceful-restart timer wait-for-rib (BGP-VPN instance IPv6 address family view) (group)",
    "FuncDef": "The peer local-graceful-restart timer wait-for-rib command sets the maximum duration for a BGP restarter to wait for the End-of-RIB flag from each peer in a specified group.\nThe undo peer local-graceful-restart timer wait-for-rib command deletes the configured duration.\nBy default, a BGP restarter waits for the End-of-RIB flag from each peer in a specified group for a maximum of 600s.",
    "CLIs": [
        "peer <group-name> local-graceful-restart timer wait-for-rib <wfrtime>",
        "undo peer <group-name> local-graceful-restart timer wait-for-rib"
    ],
    "ParentView": [
        "BGP-VPN instance IPv6 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "group-name",
            "Info": "Specifies the name of a BGP peer group.\nThe value is a string of 1 to 47 case-sensitive characters. If spaces are used, the string must start and end with double quotation marks (\")."
        },
        {
            "Parameters": "wfrtime",
            "Info": "Specifies the maximum duration for a BGP restarter to wait for the End-of-RIB flag.\nThe value is an integer ranging from 3 to 3000, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ipv6-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv6] route-distinguisher 1:1",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv6] quit",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv6-family vpn-instance vpn1",
            "[*HUAWEI-bgp-6-vpn1] group aa",
            "[*HUAWEI-bgp-6-vpn1] peer aa local-graceful-restart timer wait-for-rib 100"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo set the maximum duration for a device to wait for the End-of-RIB flag from each peer in a group, run the peer local-graceful-restart timer wait-for-rib command on the device. After a BGP session between the device and a peer in the group is reestablished, if the device does not receive the End-of-RIB flag within the specified duration, the involved BGP session on the device exits from the GR process and the device selects the optimal route among reachable routes."
}