{
    "PageTitle": "if-match ip route-originator",
    "FuncDef": "The if-match ip route-originator command configures an NG MVPN route filtering rule that is based on the IP addresses of route advertising devices.\nThe undo if-match ip route-originator command restores the default configuration.\nBy default, no NG MVPN route filtering rule that is based on the IP addresses of route advertising devices is configured.",
    "CLIs": [
        "if-match ip route-originator { ip-prefix <ip-prefix-name> | acl { <acl-number> | <acl-name> } }",
        "undo if-match ip route-originator"
    ],
    "ParentView": [
        "Route-policy view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-prefix ip-prefix-name",
            "Info": "Specifies the name of an IPv4 prefix list.\nThe name is a string of 1 to 169 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "acl acl-number",
            "Info": "Specifies the number of a basic ACL.\nThe value is an integer ranging from 2000 to 2999."
        },
        {
            "Parameters": "acl acl-name",
            "Info": "Specifies the name of a named ACL.\nThe value is a string of 1 to 64 case-sensitive characters without spaces. The value must start with a letter (a to z or A to Z, case sensitive)."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl 2000",
            "[*HUAWEI-acl4-basic-2000] quit",
            "[*HUAWEI] route-policy policy permit node 10",
            "[*HUAWEI-route-policy] if-match ip route-originator acl 2000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn segmented NG MVPN scenarios, to enable a device to match NG MVPN routes based on the IP addresses of the route advertising devices, run the if-match ip route-originator command.\nThe relationship between the if-match clauses in a node of a route-policy is \"AND\". A route must match all the rules before the action defined by the apply clause is taken. If no if-match clause is specified, all routes will match the node in the route-policy.\nPrerequisites\nA route-policy has been configured using the route-policy command."
}