{
    "PageTitle": "route-mode local-rib (BMP monitor view)",
    "FuncDef": "The route-mode local-rib command configures the device to send statistics about Local-RIB routes of BGP peers in a specified address family to the monitoring server.\nThe undo route-mode local-rib command restores the default configuration.\nBy default, a BMP device is not enabled to report any routing information to any server.",
    "CLIs": [
        "route-mode { { { ipv4-family | ipv6-family } unicast } | { ipv4-family labeled-unicast } } local-rib [ add-path ]",
        "undo route-mode { { { ipv4-family | ipv6-family } unicast } | { ipv4-family labeled-unicast } } local-rib [ add-path ]"
    ],
    "ParentView": [
        "BMP monitor view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv4-family",
            "Info": "Configures the device to send statistics about Local-RIB routes of BGP peers in the IPv4 address family to the monitoring server.\n-"
        },
        {
            "Parameters": "ipv6-family",
            "Info": "Configures the device to send statistics about Local-RIB routes of BGP peers in the IPv6 address family to the monitoring server.\n-"
        },
        {
            "Parameters": "unicast",
            "Info": "Configures the device to send statistics about Local-RIB routes of BGP peers in the unicast address family to the monitoring server.\n-"
        },
        {
            "Parameters": "labeled-unicast",
            "Info": "Configures the device to send statistics about Local-RIB routes of BGP peers in the unicast labeled address family to the monitoring server.\n-"
        },
        {
            "Parameters": "add-path",
            "Info": "Configures the device to send statistics about Add-Path routes of BGP peers to the monitoring server.If the parameter is specified, statistics about load balancing routes are reported to the monitoring server.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bmp",
            "[*HUAWEI-bmp] bmp-session 10.1.1.1",
            "[*HUAWEI-bmp-session-10.1.1.1] monitor public",
            "[*HUAWEI-bmp-session-10.1.1.1-public] route-mode ipv4-family unicast local-rib"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure the device to send statistics about Local-RIB routes (routes received from peers and locally imported routes) of BGP peers in a specified address family to the monitoring server, run the route-mode local-rib command.\nPrerequisites\nThe BMP-Monitor view has been displayed using either of the following commands:\nmonitor public: The BMP device sends statistics about Local-RIB routes of all BGP peers in the public network address family to the monitoring server.monitor vpn-instance: The BMP device sends statistics about Local-RIB routes of all BGP peers in a specified VPN instance address family to the monitoring server."
}