{
    "PageTitle": "monitor vpn-instance peer",
    "FuncDef": "The monitor vpn-instance peer command displays the BMP-Monitor view and allows the BGP running status of a specified BGP peer in a specified VPN instance address family to be monitored.\nThe undo monitor vpn-instance peer command restores the default configuration.\nBy default, the BGP running status of BGP peers is not monitored.",
    "CLIs": [
        "monitor vpn-instance <vpn-instance-name> peer <ipv4-address>",
        "monitor vpn-instance <vpn-instance-name> peer <ipv6-address>",
        "undo monitor vpn-instance <vpn-instance-name> peer <ipv4-address>",
        "undo monitor vpn-instance <vpn-instance-name> peer <ipv6-address>"
    ],
    "ParentView": [
        "BMP session view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance-name",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "ipv4-address",
            "Info": "Specifies the IPv4 address of a BGP peer.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "ipv6-address",
            "Info": "Specifies the IPv6 address of a BGP peer.\nThe address is a 32-bit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ipv4-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[*HUAWEI] bmp",
            "[*HUAWEI-bmp] bmp-session 10.1.1.1 alias a",
            "[*HUAWEI-bmp-session-10.1.1.1-a] monitor vpn-instance vpn1 peer 10.1.1.1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBMP is used to monitor BGP running status of devices in real time, such as the establishment and termination status of BGP peer relationships and route update status. To allow the BGP running status of a specified BGP peer in a specified VPN instance address family to be monitored, run the monitor vpn-instance peer command. After a TCP connection is established between the device and the monitoring server, the device reports BGP running status to the monitoring server, improving network monitoring efficiency.\nFollow-up Procedure\nPerform either of the following operations as required:\nRun the route-mode { { ipv4-family | ipv6-family } unicast | { ipv4-family labeled-unicast } } adj-rib-in { pre-policy | post-policy } command to set the type of RIB-in route (received from a specified peer in a specified VPN instance address family) whose statistics are to be sent by the device to the monitoring server.Run the route-mode { { ipv4-family | ipv6-family } unicast | { ipv4-family labeled-unicast } } adj-rib-out { pre-policy | post-policy } command to set the type of RIB-out route (to be advertised or already advertised to a specified peer in a specified VPN instance address family) whose statistics are to be sent by the device to the monitoring server."
}