{
    "PageTitle": "monitor vpn-instance",
    "FuncDef": "The monitor vpn-instance command displays the BMP-Monitor view and allows the BGP running status of all BGP peers in a specified VPN instance address family to be monitored.\nThe undo monitor vpn-instance command restores the default configuration.\nBy default, the BGP running status of BGP peers is not monitored.",
    "CLIs": [
        "monitor vpn-instance <vpn-instance-name>",
        "undo monitor vpn-instance <vpn-instance-name>"
    ],
    "ParentView": [
        "BMP session view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance-name",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ipv4-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[*HUAWEI] bmp",
            "[*HUAWEI-bmp] bmp-session 10.1.1.1 alias a",
            "[*HUAWEI-bmp-session-10.1.1.1-a] monitor vpn-instance vpn1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBMP is used to monitor BGP running status of devices in real time, such as the establishment and termination status of BGP peer relationships and route update status. To allow the BGP running status of all BGP peers in an address family of a specified VPN instance to be monitored, run the monitor vpn-instance command. After a TCP connection is established between the device and the monitoring server, the device reports BGP running status to the monitoring server, improving network monitoring efficiency."
}