{
    "PageTitle": "route-mode adj-rib-in (BMP monitor view)(vpnv4/vpnv6)",
    "FuncDef": "The route-mode adj-rib-in command sets the type of RIB-in route whose statistics are to be sent by the BMP device to the monitoring server in a specified address family.\nThe undo route-mode adj-rib-in command restores the default configuration.\nThe route-mode adj-rib-in command sets the type of RIB-out route whose statistics are to be sent by the BMP device to the monitoring server in a specified address family.\nThe undo route-mode adj-rib-in command restores the default configuration.\nBy default, a BMP device is not enabled to report any routing information to any server.",
    "CLIs": [
        "route-mode { ipv4-family vpnv4 | ipv6-family vpnv6 } { adj-rib-in | adj-rib-out } { pre-policy | post-policy }",
        "undo route-mode { ipv4-family vpnv4 | ipv6-family vpnv6 } { adj-rib-in | adj-rib-out } { pre-policy | post-policy }"
    ],
    "ParentView": [
        "BMP monitor view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv4-family",
            "Info": "Sets the type of RIB-in or RIB-out route whose statistics are to be sent by the BMP device to the monitoring server in the IPv4 address family.\n-"
        },
        {
            "Parameters": "vpnv4",
            "Info": "Sets the type of RIB-in or RIB-out route whose statistics are to be sent by the BMP device to the monitoring server in the VPNv4 address family.\n-"
        },
        {
            "Parameters": "ipv6-family",
            "Info": "Sets the type of RIB-in or RIB-out route whose statistics are to be sent by the BMP device to the monitoring server in the IPv6 address family.\n-"
        },
        {
            "Parameters": "vpnv6",
            "Info": "Sets the type of RIB-in or RIB-out route whose statistics are to be sent by the BMP device to the monitoring server in the VPNv6 address family.\n-"
        },
        {
            "Parameters": "pre-policy",
            "Info": "Sends statistics about all received routes to the monitoring server.\n-"
        },
        {
            "Parameters": "post-policy",
            "Info": "Sends statistics about only accepted routes to the monitoring server.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bmp",
            "[*HUAWEI-bmp] bmp-session 10.1.1.1",
            "[*HUAWEI-bmp-session-10.1.1.1] monitor public",
            "[*HUAWEI-bmp-session-10.1.1.1-public] route-mode ipv4-family vpnv4 adj-rib-out pre-policy"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo set the type of RIB-in route (received from peers) whose statistics are to be sent by the BMP device to the monitoring server in a specified address family, run the route-mode adj-rib-in command. To configure the device to send statistics about all received routes to the monitoring server, specify pre-policy in the command. To configure the device to send statistics about only accepted routes (delivered to the routing table) to the monitoring server, specify post-policy in the command.\nTo set the type of RIB-out route whose statistics are to be sent by the BMP device to the monitoring server in a specified address family, run the route-mode adj-rib-out command. If you want the monitoring server to monitor all the routes to be advertised, regardless of whether they match the export policy, specify pre-policy in the command. If you want the monitoring server to monitor only the advertised routes (those that match the export policy), specify post-policy in the command.\nPrerequisites\nThe BMP-Monitor view has been displayed using any of the following commands:\nmonitor public: The BMP device sends statistics about RIB-IN or RIB-OUT routes of all BGP peers in the public network address family to the monitoring server.monitor all-vpn-instance: The BMP device sends statistics about RIB-IN or RIB-OUT routes of all BGP peers in all VPN instance address families to the monitoring server.monitor peer: The BMP device sends statistics about RIB-IN or RIB-OUT routes of a specified BGP peer in the public network address family to the monitoring server.monitor vpn-instance: The BMP device sends statistics about RIB-IN or RIB-OUT routes of all BGP peers in a specified VPN instance address family to the monitoring server.monitor vpn-instance peer: The BMP device sends statistics about RIB-IN or RIB-OUT routes of a specified BGP peer in a specified VPN instance address family to the monitoring server.\n\nPrecautions\nIf pre-policy is specified in the command, run the keep-all-routes command in the BGP view to save the routes carried in the BGP Update messages that are received from all BGP peers or peer groups after BGP connections are established, or run the peer keep-all-routes command to save the routes carried in the BGP Update messages that are received from a specified BGP peer or peer group after the BGP connection is established."
}