{
    "PageTitle": "signaling multi-homing non-standard-compatible",
    "FuncDef": "The signaling multi-homing non-standard-compatible command enable VPLS Multi-homing signaling.\nThe undo signaling multi-homing non-standard-compatible command restores the default setting.\nBy default, after the peer enable command is run in the L2VPN AD address family view, the BGP AD signaling mode is enabled for all peers or peer groups.",
    "CLIs": [
        "signaling multi-homing non-standard-compatible",
        "undo signaling multi-homing non-standard-compatible"
    ],
    "ParentView": [
        "BGP-L2VPN-AD address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "non-standard-compatible",
            "Info": "Configures the signaling mode of all peers or peer groups as VPLS Multi-homing.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] l2vpn-ad-family",
            "[*HUAWEI-bgp-af-l2vpn-ad] signaling multi-homing non-standard-compatible"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn BGP VPLS and BGP AD VPLS scenarios, configure the signaling mode for peers or peer groups in the L2VPN AD address family view so that peers can advertise routes to each other. The parameters used in different scenarios are described as follows:\nIn the BGP VPLS scenario, configure vpls in the signaling command.In the BGP AD VPLS scenario, the BGP AD signaling is enabled for all peers or peer groups in the L2VPN AD address family view by default.\nIn VPLS multi-homing scenarios, after you run the signaling vpls command to enable VPLS signaling for all peers, run the signaling multi-homing non-standard-compatible command to enable VPLS Multi-homing signaling.\n\nPrerequisites\nA peer or peer group has been created using the peer enable command.\nPrecautions\nThe signaling mode configured for a peer group using the peer signaling command takes precedence over that configured using the signaling command. When a signaling mode is not configured for a peer or peer group, the peer and peer group use the signaling mode configured using the signaling command."
}