{
    "PageTitle": "nexthop third-party (BGP view)",
    "FuncDef": "The nexthop third-party command prevents a BGP speaker from changing the next hop address of a route when the BGP speaker advertises the route to its peers in the following scenarios:\n- The route is learned from a directly connected peer and is to be advertised to a directly connected EBGP peer, the original next hop of the route resides on the same network segment as the local interface that is used to establish the BGP peer relationship with the EBGP peer, and all directly connected interfaces are broadcast interfaces.\n- The route is locally imported and is to be advertised to a directly connected IBGP or EBGP peer, the next hop to which the route recurses resides on the same network segment as the local interface that is used to establish the BGP peer relationship with the IBGP or EBGP peer, and all directly connected interfaces are broadcast interfaces.\nThe undo nexthop third-party command restores the default configurations.\n\nThe default configurations are as follows:\n\n\nBefore advertising a route that is learned from a directly connected peer to a directly connected EBGP peer, the device changes the next hop of the route to the IP address of the local interface that is used to establish the BGP peer relationship with the EBGP peer.\n\nBefore advertising a locally imported route to a directly connected IBGP or EBGP peer, the device changes the next hop of the route to the IP address of the local interface that is used to establish the BGP peer relationship with the IBGP or EBGP peer.",
    "CLIs": [
        "nexthop third-party",
        "undo nexthop third-party"
    ],
    "ParentView": [
        "BGP view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] nexthop third-party"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn a Layer 2 protocol tunneling scenario, to ensure that traffic is transmitted along the optimal route, run the nexthop third-party command.\nPrecautions\nIf the command and load balancing function are both configured, this command does not take effect."
}