{
    "PageTitle": "peer route-update-interval (BGP-IPv6 MVPN address family view)",
    "FuncDef": "The peer route-update-interval command sets the interval at which a device sends routing updates carrying the same prefix to peer.\nThe undo peer route-update-interval command restores the default setting.\nBy default, the interval at which routing updates are sent to IBGP peers is 15s, and the interval at which routing updates are sent to EBGP peers is 30s.",
    "CLIs": [
        "peer <ipv4-address> route-update-interval <interval>",
        "undo peer <ipv4-address> route-update-interval"
    ],
    "ParentView": [
        "BGP-IPv6 MVPN address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv4-address",
            "Info": "Specifies the IPv4 address of a peer.\nThe address is in dotted decimal notation."
        },
        {
            "Parameters": "interval",
            "Info": "Specifies the minimum interval at which routing updates are sent.\nThe value is an integer ranging from 0 to 600, in seconds. The value 0 indicates that the device immediately sends BGP Update messages to notify its peers of route changes."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 10.1.1.1 as-number 10",
            "[*HUAWEI-bgp] ipv6-family mvpn",
            "[*HUAWEI-bgp-af-mvpnv6] peer 10.1.1.1 enable",
            "[*HUAWEI-bgp-af-mvpnv6] peer 10.1.1.1 route-update-interval 10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen routes change, the router sends routing updates to notify its peers. If a route changes frequently, the peer route-update-interval command can be used to adjust the interval at which Update packets are sent for changes of this route. This frees the router from sending Update packets for every route change.\nPrecautions\nIf a route is withdrawn, the router immediately sends an Update message to its peers, regardless of the peer route-update-interval configuration. If a route is added and the interval between the last route addition time and the current route addition time is greater than the interval configured using the peer route-update-interval command, the router immediately sends an Update message to its peers. If a route is added and the interval between the last route addition time and the current route addition time is less than the interval configured using the peer route-update-interval command, the router sends an Update message to its peers only after the configured interval expires."
}