{
    "PageTitle": "peer next-hop-invariable (BGP-L2VPN-AD address family view)",
    "FuncDef": "The peer next-hop-invariable command has the following functions:\n- When the BGP speaker advertises routes to EBGP peers, the BGP speaker does not change the Next_Hop.\n- When the BGP speaker advertises labeled routes to IBGP peers, the BGP speaker does not change the Next_Hop.\n- When the BGP speaker advertises imported IGP routes to IBGP peers, the BGP speaker changes the Next_Hop to the Next_Hops of the IGP routes.\nThe undo peer next-hop-invariable command restores the default configuration.\n\nBy default:\n\n\nA device sets its interface IP address as the Next_Hops of routes when advertising these routes to EBGP peers.\n\nA device does not modify the Next_Hops of non-labeled routes if the routes are learned from EBGP peers and are to be advertised to IBGP peers; the device sets its interface IP address as the Next_Hops of labeled routes if the routes are learned from EBGP peers and are to be advertised to IBGP peers.\n\nA device does not change the Next_Hops of routes if the routes are learned from an IBGP peer and are to be advertised to another IBGP peer.\n\nA device sets its interface IP address as the Next_Hops of routes when advertising imported IGP routes to IBGP peers.\n\nA device modifies the Next_Hop of imported static routes to the local interface's IP address when advertising the routes to IBGP peers.",
    "CLIs": [
        "peer <ipv4-address> next-hop-invariable",
        "undo peer <ipv4-address> next-hop-invariable"
    ],
    "ParentView": [
        "BGP-L2VPN-AD address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv4-address",
            "Info": "Specifies the IPv4 address of a peer.\nIt is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 10.1.1.1 as-number 100",
            "[*HUAWEI-bgp] l2vpn-ad-family",
            "[*HUAWEI-bgp-af-l2vpn-ad] peer 10.1.1.1 enable",
            "[*HUAWEI-bgp-af-l2vpn-ad] peer 10.1.1.1 next-hop-invariable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn an inter-AS VPN Option C scenario where an VPNv4 Route Reflector (RR) is used, the peer next-hop-invariable command needs to be run on the RR to prevent the RR from modifying the Next_Hops of routes before advertising the routes to EBGP peers. This ensures that the remote PE recurses routes to the LSP destined for the local PE during traffic transmission.\nPrerequisites\nThe peer as-number command has been used to create a peer.\nPrecautions\nThe peer next-hop-invariable command takes effect only for received routes. However, the configuration does not take effect for received IPv4 routes that do not carry labels.\nIf a device needs to advertise routes to its IBGP peer or peer group, the peer next-hop-invariable and peer next-hop-local commands are mutually exclusive on the device."
}