{
    "PageTitle": "peer advertise link-bandwidth transitive (BGP-IPv6 unicast address family view)",
    "FuncDef": "The peer advertise link-bandwidth transitive command enables a device to convert the Link Bandwidth extended community attribute (optional non-transitive) carried in BGP routes into an optional transitive attribute before advertising the BGP routes to a specified peer.\nThe undo peer advertise link-bandwidth transitive command cancels the existing configuration.\nBy default, a device cannot convert the Link Bandwidth extended community attribute (optional non-transitive) carried in a BGP route into an optional transitive attribute before advertising the route to a BGP peer.",
    "CLIs": [
        "peer <peerIpv4Addr> advertise link-bandwidth transitive",
        "peer <peerIpv4Addr> advertise link-bandwidth transitive disable",
        "undo peer <peerIpv4Addr> advertise link-bandwidth transitive",
        "undo peer <peerIpv4Addr> advertise link-bandwidth transitive disable"
    ],
    "ParentView": [
        "BGP-IPv6 unicast address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "peerIpv4Addr",
            "Info": "Specifies the IPv4 address of a peer.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "disable",
            "Info": "Disables a device to advertise the Link Bandwidth extended community attribute to a specified EBGP peer.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 10.1.1.1 as-number 200",
            "[*HUAWEI-bgp] ipv6-family unicast",
            "[*HUAWEI-bgp-af-ipv6] ext-community-change enable",
            "[*HUAWEI-bgp-af-ipv6] peer 10.1.1.1 enable",
            "[*HUAWEI-bgp-af-ipv6] peer 10.1.1.1 advertise-ext-community",
            "[*HUAWEI-bgp-af-ipv6] peer 10.1.1.1 advertise ebgp link-bandwidth",
            "[*HUAWEI-bgp-af-ipv6] peer 10.1.1.1 advertise link-bandwidth transitive"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo enable a device to convert the Link Bandwidth extended community attribute (optional non-transitive) carried in BGP routes into an optional transitive attribute before advertising the BGP routes to a specified peer, run the peer advertise link-bandwidth transitive command.\nAfter a peer is added to a peer group, the peer inherits the configuration of the peer group. If the peer advertise link-bandwidth transitive command is run on the local device for the peer group and the newly added peer does not need to inherit this configuration, you need to run the peer advertise link-bandwidth transitive disable command on the local device for the peer.\nPrecautions\nBefore running the peer advertise link-bandwidth transitive command, you need to use a route-filter to add the Link Bandwidth extended community attribute to BGP routes.\nCurrently, this command can be used to process only one Link Bandwidth extended community attribute per BGP route.\nHowever, if a device changes the next-hop address of a received route carrying the Link Bandwidth extended community attribute to its own address, the device deletes this attribute before advertising it to other peers."
}