{
    "PageTitle": "peer ipv6-prefix export (BGP-IPv6 unicast address family view) (IPv6)",
    "FuncDef": "The peer ipv6-prefix export command configures a policy based on an IPv6 prefix list for filtering BGP routes to be advertised to a specified peer.\nThe undo peer ipv6-prefix export command cancels this configuration.\nBy default, no route filtering policy based on an IP address prefix list is configured for a peer.",
    "CLIs": [
        "peer <ipv6-address> ipv6-prefix <ipv6-prefix-name> export",
        "undo peer <ipv6-address> ipv6-prefix [ <ipv6-prefix-name> ] export"
    ],
    "ParentView": [
        "BGP-IPv6 unicast address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv6-address",
            "Info": "Specifies the IPv6 address of a peer.\nThe prefix is in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "ipv6-prefix ipv6-prefix-name",
            "Info": "Indicates the filtering policy that is based on the IPv6 prefix list of the peer.\nThe name is a string of 1 to 169 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "export",
            "Info": "Applies a filtering policy to the routes to be advertised to a peer.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip ipv6-prefix list1 permit 2001:DB8:1::1 8 greater-equal 17 less-equal 18",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 2001:DB8:1::1 as-number 200",
            "[*HUAWEI-bgp] ipv6-family unicast",
            "[*HUAWEI-bgp-af-ipv6] peer 2001:DB8:1::1 ipv6-prefix list1 export"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe peer ipv6-prefix export command can be used to configure a route filtering policy that is based on an IPv6 prefix list for filtering BGP routes to be advertised to a specified peer, implementing route control.\nPrerequisites\nIf the peer ipv6-prefix command specifies an IPv6 prefix list that does not exist for a peer, use the ip ipv6-prefix command to create an IPv6 prefix list.\nConfiguration Impact\nIf an IPv6 prefix list is specified for a peer group, all the members of the peer group inherit the configuration.\nAfter an IPv6 prefix list is specified for a peer, the peer filter the routes to be advertised to other peers based on the IPv6 prefix list. Only the routes that pass the filtering of the IPv6 prefix list can be advertised.\nPrecautions\nThe peer ipv6-prefix export command is mutually exclusive with the peer route-filter export commands."
}