{
    "PageTitle": "peer graceful-restart peer-reset (BGP view)(group)",
    "FuncDef": "The peer graceful-restart peer-reset command enables a device to use the GR mode to reset BGP connections with all peers in a specified group.\nThe undo peer graceful-restart peer-reset command cancels the enabling configuration.\nBy default, a device cannot use the GR mode to reset a BGP connection with any peer in a specified group.",
    "CLIs": [
        "peer <group-name> graceful-restart peer-reset",
        "undo peer <group-name> graceful-restart peer-reset"
    ],
    "ParentView": [
        "BGP view"
    ],
    "ParaDef": [
        {
            "Parameters": "group-name",
            "Info": "Specifies the name of a BGP peer group.\nThe value is a string of 1 to 47 case-sensitive characters. If spaces are used, the string must start and end with double quotation marks (\")."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] group aaa",
            "[*HUAWEI-bgp] peer aaa graceful-restart peer-reset"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nCurrently, BGP does not support dynamic capability negotiation. Therefore, each time a BGP capability is changed or a new BGP capability is enabled, a BGP speaker tears down the existing sessions with peers in the affected group and renegotiates BGP capabilities with the peers. To enable the BGP speaker to use the GR mode to reset BGP connections with all peers in the group, run the peer graceful-restart peer-reset command. After this command is run, if the BGP speaker establishes a peer relationship with a peer in the BGP IPv4 unicast address family and then attempts to establish a new relationship with the same peer in another address family, the BGP IPv4 unicast session enters the GR process and the BGP speaker renegotiates BGP capabilities with the peer. During this process, the BGP speaker reestablishes the BGP IPv4 unicast session. However, the BGP speaker retains the routes received from the BGP IPv4 unicast peer. This allows the forwarding module to continue forwarding IPv4 services according to the existing routing entries, thereby ensuring service continuity."
}