{
    "PageTitle": "peer update-packet standard-compatible (BGP-VPNv4-Multicast address family view)",
    "FuncDef": "The peer update-packet standard-compatible command enables a device to receive from and send to a specified BGP-VPNv4-multicast peer Update packets without labels.\nThe undo peer update-packet standard-compatible command enables a device to receive from and send to a specified BGP-VPNv4-multicast peer Update packets with labels.\nBy default, Huawei devices receive from and send to BGP-VPNv4-multicast peers or peer groups Update packets without labels.",
    "CLIs": [
        "peer <ipv4-address> update-packet standard-compatible",
        "undo peer <ipv4-address> update-packet standard-compatible"
    ],
    "ParentView": [
        "BGP-VPNv4-multicast address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv4-address",
            "Info": "Specifies the IPv4 address of a peer.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 10.2.2.2 as-number 100",
            "[*HUAWEI-bgp] ipv4-family vpnv4-multicast",
            "[*HUAWEI-bgp-af-vpnv4-multicast] peer 10.2.2.2 enable",
            "[*HUAWEI-bgp-af-vpnv4-multicast] undo peer 10.2.2.2 update-packet standard-compatible"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAccording to standard protocols, the Update packets exchanged between BGP-VPNv4-multicast peers do not carry labels. However, the implementation on devices varies with the vendor. If a BGP-VPNv4-multicast peer relationship is established between two devices with different implementations, Update packets exchanged between them may be discarded. To enable a Huawei device to establish a BGP-VPNv4-multicast peer relationship with a non-Huawei device with a different implementation and allow the Huawei device to receive from and send to the peer Update packets with labels, run the undo peer update-packet standard-compatible command."
}