{
    "PageTitle": "peer upe (BGP-VPNv4 address family view) (IPv6)",
    "FuncDef": "The peer upe command specifies a BGP peer as UPE of HoVPN.\nThe undo peer upe command cancels the configuration.\nBy default, no BGP peer is specified as UPE of HoVPN.",
    "CLIs": [
        "peer <peerIpv6Addr> upe",
        "undo peer <peerIpv6Addr> upe"
    ],
    "ParentView": [
        "BGP-VPNv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "peerIpv6Addr",
            "Info": "Specifies the IPv6 address of a peer.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 2001:db8::1 as-number 100",
            "[*HUAWEI-bgp] ipv4-family vpnv4",
            "[*HUAWEI-bgp-af-vpnv4] peer 2001:db8::1 enable",
            "[*HUAWEI-bgp-af-vpnv4] peer 2001:db8::1 upe"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn an HoVPN scenario, run the peer upe command to specify a device as a UPE. After a UPE is specified on the SPE using the peer upe command, the SPE does not send a specific route to the UPE. If the peer route-policy export command is run on the SPE to configure routing policies for the UPE and certain specific routes can pass the filtration of routing policies, these specific routes can be sent to the UPE.After you run the peer upe command on an SPE to specify a device as a UPE, the SPE can change the next hops of routes received from the UPE to itself and reflect these routes to the NPE.\nPrerequisites\nBefore you run the peer upe command, the peer as-number command should be used to create a peer.\nPrecautions\nYou can configure the SPE to send the default route to the UPE in either of the following modes:\nRoute filtering mode: You can configure the default static route and routing policy to enable the SPE to send the default route to the UPE.Command control mode: You can run the peer default-originate vpn-instance command to enable the SPE to automatically generate the default route and send it to the UPE."
}