{
    "PageTitle": "peer capability-advertise orf ip-prefix (BGP-IPv4 unicast address family view) (IPv6)",
    "FuncDef": "The peer capability-advertise orf ip-prefix command configures a BGP device to advertise the prefix-based ORF capability to its peer.\nThe undo peer capability-advertise orf ip-prefix command cancels the configuration.\nBy default, a BGP device is not configured to advertise the prefix-based ORF capability to its peer.",
    "CLIs": [
        "peer <peerIpv6Addr> capability-advertise orf ip-prefix { both | receive | send }",
        "peer <peerIpv6Addr> capability-advertise orf non-standard-compatible ip-prefix { both | receive | send }",
        "undo peer <peerIpv6Addr> capability-advertise orf ip-prefix { both | receive | send }",
        "undo peer <peerIpv6Addr> capability-advertise orf non-standard-compatible ip-prefix { both | receive | send }"
    ],
    "ParentView": [
        "BGP-IPv4 unicast address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "peerIpv6Addr",
            "Info": "Specifies the IPv6 address of a BGP peer.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "both",
            "Info": "Indicates that a peer is allowed to send and receive ORF packets.\n-"
        },
        {
            "Parameters": "receive",
            "Info": "Indicates that a peer is allowed only to receive ORF packets.\n-"
        },
        {
            "Parameters": "send",
            "Info": "Indicates that a peer is allowed only to send ORF packets.\n-"
        },
        {
            "Parameters": "non-standard-compatible",
            "Info": "Indicates that ORF supported by Huawei devices is compatible with that supported by a non-Huawei device.\n-"
        }
    ],
    "Examples": [
        [
            "HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 2001:DB8:1::1 as-number 100",
            "[*HUAWEI-bgp] ipv4-family unicast",
            "[*HUAWEI-bgp-af-ipv4] peer 2001:DB8:1::1 enable",
            "[*HUAWEI-bgp-af-ipv4] peer 2001:DB8:1::1 capability-advertise orf ip-prefix both"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nORF enables a BGP device to send to its BGP peer a set of routing policies that can be used by its peer to filter out unwanted routes during route advertisement.\nPrecautions\nIf a peer is specified when the peer capability-advertise orf command is run, a peer group is specified when the peer route-filter command is run, and then the peer is added to the peer group, the peer cannot inherit the configuration of the peer route-filter command from the peer group."
}