{
    "PageTitle": "peer capability-advertise graceful-restart (BGP view)(group)",
    "FuncDef": "The peer capability-advertise graceful-restart command enables GR for all peers in a specified group on a device. After this command is run, the device will advertise the GR capability to all the peers in the group.\nThe undo peer capability-advertise graceful-restart command cancels GR enabling for each peer in a specified group on a device.\nBy default, GR is not enabled for any peer in a specified group on a device.",
    "CLIs": [
        "peer <group-name> capability-advertise graceful-restart",
        "undo peer <group-name> capability-advertise graceful-restart"
    ],
    "ParentView": [
        "BGP view"
    ],
    "ParaDef": [
        {
            "Parameters": "group-name",
            "Info": "Specifies the name of a BGP peer group.\nThe value is a string of 1 to 47 case-sensitive characters. If spaces are used, the string must start and end with double quotation marks (\")."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] group a",
            "[*HUAWEI-bgp] peer a capability-advertise graceful-restart"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the graceful-restart command is run in the BGP view to enable GR globally on a device, all the device's peer relationships are disconnected, and the device has to renegotiate the GR capability with its peers. You are therefore advised to run the peer capability-advertise graceful-restart command instead to enable GR for peers in a specified group. After the command is run, the device advertises the GR capability to all the peers in the group. This ensures that the device does not delete the routes received from these peers and forwarding entries before the GR time elapses, thereby preventing traffic interruption.\nConfiguration Impact\nEnabling or disabling GR for each peer in a specified group on a device causes the BGP peer relationships to be disconnected and then reestablished.\nPrecautions\nIf a specified group on a device has peers that do not support GR, you are advised to enable both GR and local GR for all the peers in the group."
}