{
    "PageTitle": "peer capability-advertise add-path (BGP-VPNv4 address family view)",
    "FuncDef": "The peer capability-advertise add-path command enables BGP Add-Path function.\nThe undo peer capability-advertise add-path command restores the default setting.\nBy default, the route-refresh and 4-byte AS number functions are enabled, but the general router function and Add-Path are disabled.",
    "CLIs": [
        "peer <ipv4-address> capability-advertise add-path { both | receive | send }",
        "undo peer <ipv4-address> capability-advertise add-path { both | receive | send }"
    ],
    "ParentView": [
        "BGP-VPNv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv4-address",
            "Info": "Specifies the IPv4 address of a peer.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "add-path",
            "Info": "Indicates the Add-Path function.\nadd-path takes effect only on IBGP peers.\n-"
        },
        {
            "Parameters": "both",
            "Info": "Enables the RR to receive Add-Path routes from and send Add-Path routes to a specified IBGP peer.\n-"
        },
        {
            "Parameters": "receive",
            "Info": "Enables the RR to receive Add-Path routes from a specified IBGP peer.\n-"
        },
        {
            "Parameters": "send",
            "Info": "Enables the RR to send Add-Path routes to a specified IBGP peer.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 10.2.2.2 as-number 200",
            "[*HUAWEI-bgp] ipv4-family vpnv4",
            "[*HUAWEI-bgp-af-vpnv4] peer 10.2.2.2 enable",
            "[*HUAWEI-bgp-af-vpnv4] peer 10.2.2.2 capability-advertise add-path send"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThere are multiple optional BGP functions when a BGP peer advertises routes to its peer. The optional BGP functions include route-refresh, general router function, 4-byte AS number, and Add-Path. You can run the peer capability-advertise command to select one of the functions based on the needs on the live network.\nConfiguration Impact\nIf you enable or disable the route-refresh, general router, 4-byte AS number, or Add-Path function, the BGP peer relationship will be re-established, which can lead to a temporary network interruption. Therefore, exercise caution when running the related commands.\nPrecautions\nIf a peer is specified when the peer capability-advertise add-path command is run, a peer group is specified when the peer advertise best-external command is run, and then the peer is added to the peer group, the peer cannot inherit the configuration of the peer advertise best-external command from the peer group."
}