{
    "PageTitle": "refresh bgp ipv6",
    "FuncDef": "The refresh bgp ipv6 command softly resets a BGP connection. BGP soft reset can be used to refresh the BGP routing table and apply new routing policies, without closing any BGP connection.",
    "CLIs": [
        "refresh bgp ipv6 { <ipv6-address> | group <group-name> } { export | import }",
        "refresh bgp ipv6 { all | <ipv4-address> | external | internal } { export | import }"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv6-address",
            "Info": "Specifies the IPv6 address of a BGP4+ peer.\nThe address is in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "group group-name",
            "Info": "Specifies the name of a BGP peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "export",
            "Info": "Triggers outbound soft resetting.\n-"
        },
        {
            "Parameters": "import",
            "Info": "Triggers inbound soft resetting.\n-"
        },
        {
            "Parameters": "ipv6",
            "Info": "Softly resets BGP4+ connections.\n-"
        },
        {
            "Parameters": "all",
            "Info": "Softly resets all the BGP IPv4 connections.\n-"
        },
        {
            "Parameters": "ipv4-address",
            "Info": "Specifies the IPv4 address of a BGP peer.\nIt is in dotted decimal notation."
        },
        {
            "Parameters": "external",
            "Info": "Softly resets BGP connections.\n-"
        },
        {
            "Parameters": "internal",
            "Info": "Softly resets IBGP connections.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> refresh bgp ipv6 2001:DB8:1::1 export"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a device's peer supports route-refresh, the refresh bgp command can be used on the device to softly reset the BGP connection with the peer. BGP soft resetting can be used to refresh the BGP routing table and apply new routing policies, without closing any BGP connection.\nPrerequisites\nConfiguring BGP soft resetting requires that the peers support the route-refresh capability.\nPrecautions\nAssume that a device supports route-refresh and is configured with the peer keep-all-routes command. After the refresh bgp command is run on the device, the device does not refresh its routing table."
}