{
    "PageTitle": "reset rpki session",
    "FuncDef": "The reset rpki session command resets a specified Resource Public Key Infrastructure (RPKI) session.",
    "CLIs": [
        "reset rpki session { all | [ vpn-instance <vpn-instance-name> ] { <ipv4Addr> | <ipv6Addr> } }"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "all",
            "Info": "Resets all RPKI sessions.\n-"
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Resets the RPKI session in a specified VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "ipv4Addr",
            "Info": "Resets an RPKI session with an IPv4 session address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "ipv6Addr",
            "Info": "Resets an RPKI session with an IPv6 session address.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset rpki session 10.1.1.1"
        ],
        [
            "<HUAWEI> reset rpki session 2001:DB8:1::1"
        ],
        [
            "<HUAWEI> reset rpki session all"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter configuring RPKI session parameters, run the reset rpki session command to reset the RPKI session for the new RPKI session parameters to take effect.\nRun the following commands can change the RPKI session configurations:\nThe session command specifies an address of the RPKI server for the TCP connection between the router and the RPKI server.The tcp command configures parameters for the TCP connection between the router and the RPKI server.The timer command configures timers for the RPKI session.\n\nConfiguration Impact\nRunning the reset rpki session command will reset the TCP connection and RPKI session between the router and the RPKI server. Therefore, exercise caution when running this command."
}