{
    "PageTitle": "reset bgp instance vpnv4 dampening",
    "FuncDef": "The reset bgp instance vpnv4 dampening command clears BGP route dampening information and releases suppressed routes.",
    "CLIs": [
        "reset bgp instance <instance-name> vpnv4 dampening",
        "reset bgp instance <instance-name> vpnv4 dampening <ipv4-address> [ <mask> | <mask-length> ]"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpnv4",
            "Info": "Clears route dampening information of BGP VPNv4 routes and releases suppressed routes.\n-"
        },
        {
            "Parameters": "instance instance-name",
            "Info": "Specifies a BGP multi-instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "ipv4-address",
            "Info": "Specifies an IPv4 network address.\nIt is in dotted decimal notation."
        },
        {
            "Parameters": "mask",
            "Info": "Specifies the network mask in dotted decimal notation. If neither of the mask nor mask length is specified, the address is considered as a classful address.\nIt is in dotted decimal notation."
        },
        {
            "Parameters": "mask-length",
            "Info": "Specifies the network mask length. If neither of the mask nor mask length is specified, the address is considered as a classful address.\nThe value is an integer that ranges from 0 to 32."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset bgp instance aa vpnv4 dampening"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nRoute dampening is enabled to solve the problem of route instability. In most situations, BGP is applied to complex networks where routes change frequently. Route dampening is then used to suppress unstable routes.\nThe reset bgp dampening command is used to clear dampening information about specified routes on the public network and release specified suppressed routes. If no IP address is specified in the command, dampening information about all routes on the public network is cleared and all suppressed routes are released.\nPrerequisites\nYou can use display bgp routing-table dampened command to view information about suppressed routes.\nConfiguration Impact\nAfter the reset bgp dampening command is run, suppressed routes are released. If the status of some routes still changes frequently, route flapping may occur. Routing flapping consumes a large number of bandwidth and CPU resources.\nWhen ipv6-address prefix-length is not specified, after you run the reset bgp ipv6 dampening command, IPv6 route dampening information in the whole BGP routing table is cleared."
}