{
    "PageTitle": "reset bgp dampening (User view)(IPv6)",
    "FuncDef": "The reset bgp dampening command clears BGP route dampening information and releases suppressed routes.",
    "CLIs": [
        "reset bgp ipv6 dampening",
        "reset bgp ipv6 dampening <ipv6-address> <prefix-length>",
        "reset bgp vpn-instance <vpn-instance-name> ipv6-family dampening [ <ipv6-address> <prefix-length> ]"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv6",
            "Info": "Clears IPv6 route dampening information and releases suppressed routes.\n-"
        },
        {
            "Parameters": "ipv6-address",
            "Info": "Specifies the IPv6 address of a peer.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "prefix-length",
            "Info": "Specifies the network mask in dotted decimal notation. If neither of the mask nor mask length is specified, the address is considered as a classful address.\nThe value is an integer that ranges from 0 to 128."
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Clears route dampening information of a specified VPN instance enabled with an IPv6 address family.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "ipv6-family",
            "Info": "IPv6 address family.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset bgp vpn-instance vpn1 ipv6-family dampening"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nRoute dampening is enabled to solve the problem of route instability. In most situations, BGP is applied to complex networks where routes change frequently. Route dampening is then used to suppress unstable routes.\nThe reset bgp dampening command is used to clear dampening information about specified routes on the public network and release specified suppressed routes. If no IP address is specified in the command, dampening information about all routes on the public network is cleared and all suppressed routes are released.\nPrerequisites\nYou can use display bgp routing-table dampened command to view information about suppressed routes."
}