{
    "PageTitle": "reset bgp mvpn vpnv6",
    "FuncDef": "The reset bgp mvpn vpnv6 command resets specified BGP connections.",
    "CLIs": [
        "reset bgp mvpn vpnv6 { all | <as-number> | <ipv4-address> | external | internal | group <group-name> }"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "all",
            "Info": "Resets all BGP connections.\n-"
        },
        {
            "Parameters": "as-number",
            "Info": "Resets BGP connections with peers in ASs expressed in dotted notation.\nThe value is in the format of x.y, where x and y are integers that range from 1 to 65535 and from 0 to 65535, respectively."
        },
        {
            "Parameters": "ipv4-address",
            "Info": "Resets the BGP connection with a specified peer.\nIt is in dotted decimal notation."
        },
        {
            "Parameters": "external",
            "Info": "Resets all EBGP connections.\n-"
        },
        {
            "Parameters": "internal",
            "Info": "Resets all IBGP connections.\n-"
        },
        {
            "Parameters": "group group-name",
            "Info": "Resets the BGP connection with a specified peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "mvpn",
            "Info": "Resets BGP connections associated with Multicast Virtual Private Network (MVPN).\n-"
        },
        {
            "Parameters": "vpnv6",
            "Info": "Resets BGP connections associated with VPNv6.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset bgp mvpn vpnv6 all"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe reset bgp command is used to make new BGP configurations take effect.\nIf a BGP routing policy is configured on the router that does not support Route-Refresh, the reset bgp command can be used to make the new routing policy to take effect.\nConfiguration Impact\nThis command resets all TCP connections established between BGP peers and therefore results in the re-establishment of the BGP peer relationships. Exercise caution when running this command."
}