{
    "PageTitle": "reset bgp flapping-count",
    "FuncDef": "The reset bgp flapping-count command resets the flapping count of a specified BGP peer.",
    "CLIs": [
        "reset bgp { <ipv4-address> | vpn-instance <vpn-instance-name> ipv4-family <ipv4-address> } flapping-count",
        "reset bgp labeled <ipv4-address> flapping-count"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies the name of VPN instance enabled with an IPv4 address family.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "ipv4-family ipv4-address",
            "Info": "Specifies the IPv4 address of a BGP peer.\nIt is in dotted decimal notation."
        },
        {
            "Parameters": "flapping-count",
            "Info": "Specifies the neighbor flapping count.\n-"
        },
        {
            "Parameters": "labeled",
            "Info": "Resets BGP IPv4 connections in the labeled-unicast address family view.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset bgp 10.1.1.1 flapping-count"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBGP peer flapping affects the stability of a BGP network and BGP route convergence.\nThe reset bgp flapping-count command can be used to clear the flapping account of a BGP peer. This allows the Router to re-collect the flapping statistics of a peer to locate BGP network problems.\nConfiguration Impact\nAfter the reset bgp flapping-count command is run, the flapping statistics of BGP peers are reset and cannot be displayed.\nFollow-up Procedure\nAfter the reset bgp flapping-count command is used to clear the statistics count of a specified BGP peer, run the display bgp peer command to display the flapping count of BGP peers and locate BGP network problems."
}