{
    "PageTitle": "reset bmp session",
    "FuncDef": "The reset bmp session command resets a specified BGP Monitoring Protocol (BMP) session.",
    "CLIs": [
        "reset bmp session [ vpn-instance <vrf-name> ] { <ipv4Addr> | <ipv6Addr> | all }",
        "reset bmp session [ vpn-instance <vrf-name> ] { <ipv4Addr> | <ipv6Addr> } alias <alias-name>"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance vrf-name",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "ipv4Addr",
            "Info": "Resets a BMP session with an IPv4 session address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "ipv6Addr",
            "Info": "Resets a BMP session with an IPv6 session address.\nThe address is a 32-bit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "all",
            "Info": "Resets all BMP sessions.\n-"
        },
        {
            "Parameters": "alias alias-name",
            "Info": "Specifies a session alias. When the device needs to establish multiple TCP connections with the same monitoring server through different port numbers, specify session aliases for differentiation.\nThe value is a string of 1 to 31 case-sensitive characters. Spaces are allowed only when the string is enclosed in double quotation marks (\"\")."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset bmp session 10.1.1.1"
        ],
        [
            "<HUAWEI> reset bmp session 2001:DB8:1::1"
        ],
        [
            "<HUAWEI> reset bmp session all"
        ],
        [
            "<HUAWEI> reset bmp session 10.1.1.1 alias aa"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter configuring BMP session parameters, run the reset bmp session command to reset the BMP session for the new BMP session parameters to take effect.\nRun the following commands can change the BMP session configurations:\nThe bmp-session command specifies an address of the monitoring server for the TCP connection between the router and the monitoring server.The tcp command configures parameters for the TCP connection between the router and the monitoring server.\n\nConfiguration Impact\nRunning the reset bmp session command will reset the TCP connection and BMP session between the router and the monitoring server. Therefore, exercise caution when running this command."
}