{
    "PageTitle": "router-id",
    "FuncDef": "The router-id command configures a Router ID for the Device. Each Router ID uniquely identifies one Device in an AS.\nThe undo router-id command deletes the Router ID configured for the Device.\nBy default, no BGP Router ID is configured, and the Router ID configured for the route management module through the router id command is used.",
    "CLIs": [
        "router-id <router-id-value>",
        "undo router-id"
    ],
    "ParentView": [
        "BGP view"
    ],
    "ParaDef": [
        {
            "Parameters": "router-id-value",
            "Info": "Specifies the router ID in the format of an IPv4 address.\nIt is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] router-id 10.1.1.1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe router-id command is used to configure a Router ID for the Device. Each Router ID uniquely identifies one BGP Router in an AS.\nBy configuring automatic Router ID selection for BGP-VPN instance, you can differentiate the configured Router ID of BGP-VPN instance from the BGP Router ID. For more information about the Router ID of a BGP-VPN instance , see the router-id (BGP-VPN Instance IPv4 Address Family View) command.\nPrerequisites\nThe bgp command is run to enable BGP.\nConfiguration Impact\nChanging or deleting a configured Router ID in the BGP view resets a BGP session.If a BGP session has been established in a BGP-VPN instance , deleting the configured Router ID resets the BGP session.Exercise caution when changing or deleting a Router ID.\nPrecautions\nBy default, the Device that is not configured with any interface uses the Router ID of 0.0.0.0 assigned by routing management.\nIf router-id is configured in both the BGP VPN instance IPv4 address family view and BGP VPN instance view, it will be displayed in both views. Deleting the configuration from one view will also delete the configuration from the other view."
}