{
    "PageTitle": "session (RPKI view)",
    "FuncDef": "The session command specifies the address of a Resource Public Key Infrastructure (RPKI) server to establish a TCP connection between the router and the RPKI server.\nThe undo session command restores the default setting.\nBy default, no TCP connection is established.",
    "CLIs": [
        "session [ vpn-instance <vpn-instance-name> ] { <ipv4-address> | <ipv6-address> }",
        "undo session [ vpn-instance <vpn-instance-name> ] { <ipv4-address> | <ipv6-address> }"
    ],
    "ParentView": [
        "RPKI view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies the VPN instance to which the RPKI session belongs.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "ipv4-address",
            "Info": "Specifies the IPv4 address used by an RPKI session.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "ipv6-address",
            "Info": "Specifies the IPv6 address used by an RPKI session.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vrf1",
            "[~HUAWEI-vpn-instance-vrf1] ipv4-family",
            "[~HUAWEI-vpn-instance-vrf1-af-ipv4] quit",
            "[~HUAWEI-vpn-instance-vrf1] quit",
            "[~HUAWEI] rpki",
            "[*HUAWEI-rpki] session vpn-instance vrf1 10.1.1.1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe session command specifies the address of an RPKI server to establish a TCP connection between the router and the RPKI server. You can also specify vpn-instance vpn-instance-name in the command to set the VPN instance to which the RPKI session belongs. If the command is not run, TCP connections cannot be established, and the RPKI server cannot collect statistics about origin ASs of BGP routes."
}