{
    "PageTitle": "routing-table limit (VPN instance IPv4 address family view)",
    "FuncDef": "The routing-table limit command sets a limit on the maximum number of routes that the IPv4 or IPv6 address family of a VPN instance can support.\nThe undo routing-table limit command restores the default configurations.\nBy default, there is no limit on the maximum number of routes that the IPv4 or IPv6 address family of a VPN instance can support, but the total number of private network and public network routes on a device cannot exceed the unicast route limit supported by the device.",
    "CLIs": [
        "routing-table limit <number> { <alert-percent> | simply-alert }",
        "undo routing-table limit"
    ],
    "ParentView": [
        "VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "number",
            "Info": "Specifies the maximum number of routes supported by a VPN instance.\nRanges from 1 to 4294967295."
        },
        {
            "Parameters": "alert-percent",
            "Info": "Specifies the percentage of the maximum number of routes. When the maximum number of routes that join the VPN instance is up to the value (number*alert-percent)/100, the system prompts alarms. The VPN routes can be still added to the routing table, but after the number of routes reaches number, the subsequent routes are dropped.\nAn integer ranging from 1 to 100."
        },
        {
            "Parameters": "simply-alert",
            "Info": "Indicates that when VPN routes exceed number, routes can still be added into the routing table, but the system prompts alarms. However, after the total number of VPN routes and network public routes reaches the unicast route limit supported by the device, the subsequent VPN routes are dropped.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[~HUAWEI-vpn-instance-vpn1] ipv4-family",
            "[~HUAWEI-vpn-instance-vpn1-af-ipv4] routing-table limit 1000 simply-alert"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo prevent excessive routes from being imported into the routing table of the IPv4 or IPv6 address family of a VPN instance, run the routing-table limit command to limit the maximum number of routes in the routing table. If the number of routes in the routing table of the IPv4 or IPv6 address family of a VPN instance exceeds the upper threshold, the excessive routes cannot be advertised to the peer. After the undo routing-table limit command is run, the excessive routes will be added to the VPN instance's routing table.\nPrecautions\nIf the simply-alert parameter is specified and the number of routes exceeds the upper threshold, only an alarm is generated, and the excessive routes are still added to the routing table.\nIf the number of IPv4 routes in a VPN instance exceeds the maximum number supported, both L3VPN_MIB_TRAP_THRESH_EXCEED and hwIpv4RouteExceed alarms are reported. If the number of IPv4 routes in a VPN instance exceeds the middle threshold, both L3VPN_MIB_TRAP_MID_THRESH_EXCEED and hwIpv4RouteThresholdExceed alarms are reported."
}