{
    "PageTitle": "peer tcp-mss (BGP-VPN instance view) (IPv6)",
    "FuncDef": "The peer tcp-mss command configures a TCP MSS value used when the local device establishes TCP connections with a peer.\nThe undo peer tcp-mss command deletes the configured TCP MSS value.\nBy default, no TCP MSS is configured for the local device to establish TCP connections with a peer.",
    "CLIs": [
        "peer <ipv6-address> tcp-mss <tcp-mss-number>",
        "undo peer <ipv6-address> tcp-mss"
    ],
    "ParentView": [
        "BGP-VPN instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv6-address",
            "Info": "Specifies the IPv6 address of a peer.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "tcp-mss-number",
            "Info": "Specifies the TCP MSS value used for TCP connection establishment.\nThe value is an integer ranging from 176 to 4096, in bytes."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] vpn-instance vpn1",
            "[*HUAWEI-bgp-instance-vpn1] peer 2001:DB8:1::1 as-number 200",
            "[*HUAWEI-bgp-instance-vpn1] peer 2001:DB8:1::1 tcp-mss 200"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nYou can run the peer tcp-mss command to configure a TCP MSS value used for TCP connection establishment so that it is used to encapsulate BGP packets when the path MTU is unavailable. Such configuration improves network performance.\nPrecautions\nIf you change the tcp-mss-number value, the TCP connection will be re-established.\nIf both the peer tcp-mss and peer path-mtu auto-discovery commands are run, note the following rules:\nIf the local device obtains the path MTU, the smaller value of TCP MSS and path MTU takes effect.If the local device fails to obtain the path MTU, TCP MSS takes effect."
}