{
    "PageTitle": "tcp (BMP session view)",
    "FuncDef": "The tcp command configures parameters for the TCP connection between the router and the monitoring server.\nThe undo tcp command restores the default configuration.\nBy default, no parameters are configured for TCP connections.",
    "CLIs": [
        "tcp connect port <port-number> [ password md5 <cipher-password> | keychain <keychain-name> ]",
        "undo tcp connect port <port-number>",
        "undo tcp connect port"
    ],
    "ParentView": [
        "BMP session view"
    ],
    "ParaDef": [
        {
            "Parameters": "password",
            "Info": "Specifies the authentication.\n-"
        },
        {
            "Parameters": "md5 cipher-password",
            "Info": "Specifies the authentication password for the TCP connection.\nThe new password is at least eight characters long and contains at least two of the following types: upper-case letters, lower-case letters, digits, and special characters.The encryption algorithm used for MD5 authentication poses security risks. Therefore, you are advised to use an authentication mode based on a more secure encryption algorithm.\nThe value is a string of case-sensitive characters, spaces not supported. If the password is input in plaintext mode, the password length ranges from 1 to 255; if the password is input in ciphertext mode, the password length ranges from 20 to 432. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "keychain keychain-name",
            "Info": "Specifies the name of the Keychain authentication.\nBefore configuring this parameter, run the keychain command to create a keychain. Then, run the key-id, key-string, and algorithm commands to configure a key ID, a password, and an authentication algorithm for this keychain. Otherwise, the authentication will fail, and the BGP peer relationship fails to be established.\nThe value is a string of 1 to 47 case-insensitive characters, question marks (?) and spaces not supported. However, the string can contain spaces if it is enclosed in double quotation marks (\" \")."
        },
        {
            "Parameters": "connect",
            "Info": "Configures the device to initiate unsolicited TCP connection requests.\n-"
        },
        {
            "Parameters": "port port-number",
            "Info": "BMP server port number of the TCP connection.\nThe value is an integer ranging from 1 to 65535."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bmp",
            "[*HUAWEI-bmp] bmp-session 10.1.1.1",
            "[*HUAWEI-bmp-session-10.1.1.1] tcp connect port 5364"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo establish a BMP session and ensure the validity and security of the TCP connection, run the tcp command to configure parameters for the TCP connection between the router and the monitoring server. The configurable parameters are the TCP connection mode (whether the device initiates unsolicited TCP connection requests or accepts TCP connection requests), TCP connection port number, authentication password of the TCP connection or the name of the Keychain authentication."
}