{
    "PageTitle": "peer password (BGP-VPN instance view) (group)",
    "FuncDef": "The peer password command enables a BGP device to implement Message Digest 5 (MD5) authentication for BGP messages exchanged during the establishment of a TCP connection with a peer.\nThe undo peer password command disables a BGP device to implement Message Digest 5 (MD5) authentication for BGP messages exchanged during the establishment of a TCP connection with a peer.\nBy default, the BGP device to implement Message Digest 5 (MD5) authentication for BGP messages exchanged during the establishment of a TCP connection with a peer is disabled.",
    "CLIs": [
        "peer <group-name> password simple <simple-password>",
        "peer <group-name> password cipher <cipher-password>",
        "undo peer <group-name> password"
    ],
    "ParentView": [
        "BGP-VPN instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "group-name",
            "Info": "Specifies the name of a peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "simple simple-password",
            "Info": "Specifies a simple text password.\nThe new password is at least eight characters long and contains at least two of the following types: upper-case letters, lower-case letters, digits, and special characters.For security purposes, you are advised to configure a password in ciphertext mode. To further improve device security, periodically change the password.\nThe value is a string of 1 to 255 case-sensitive characters, without spaces.\nExcept the question mark (?) and space. However, when quotation marks (\") are used around the password, spaces are allowed in the password."
        },
        {
            "Parameters": "cipher cipher-password",
            "Info": "Specifies a cipher text password.\nIn the case of a plain text, the value is a string of 1 to 255 case-sensitive characters, without spaces. In the case of a cipher text password, the value is a string of 20 to 432 case-sensitive characters, without spaces.\nExcept the question mark (?) and space. However, when quotation marks (\") are used around the password, spaces are allowed in the password."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] vpn-instance vpn1",
            "[*HUAWEI-bgp-instance-vpn1] group test",
            "[*HUAWEI-bgp-instance-vpn1] peer test password cipher Huawei-123"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBGP uses TCP as the transport layer protocol. To enhance BGP security, MD5 authentication can be implemented for BGP packets exchanged during the establishment of a TCP connection. MD5 authentication sets the MD5 authentication password for the TCP connection, and the authentication is performed by TCP.\nA password can be set either in cipher text or plain text. A plain text password is a configured character string that is directly recorded in a configuration file. A cipher text password is a character string that is encrypted by using a special algorithm and then recorded in a configuration file.\nPrerequisites\nThe peer as-number command has been used to create a peer group.\nConfiguration Impact\nBGP uses TCP as the transport layer protocol. To enhance BGP security, MD5 authentication can be implemented for BGP packets exchanged during the establishment of a TCP connection. MD5 authentication, however, does not authenticate BGP packets. Instead, it sets the MD5 authentication password for the TCP connection, and the authentication is performed by TCP. If authentication fails, no TCP connection is established.\nPrecautions\nThe encryption algorithms MD5 has a low security, which may bring security risks. If protocols allowed, using more secure encryption algorithms.\nMD5 authentication and Keychain authentication are mutually exclusive on a peer.\nIf the passwords of BGP peers at both ends are the same, the BGP peer relationship will not be re-established. If the interval configurations at both ends exceed the BGP peer hold time or passwords at both ends are different, the BGP peer relationship is disconnected due to timeout.\nIf you want to add a BGP peer on which the peer password command has been run to a peer group on which the command has also been run and enable the BGP peer to inherit the authentication configuration of the peer group, run the undo peer password command first before running the peer group command to add the BGP peer to the peer group.\nThe space is not allowed in the password."
}