{
    "PageTitle": "connect-interface (BMP session view)",
    "FuncDef": "The connect-interface command specifies a source interface to send BMP messages and a source IP address to set up a BMP session.\nThe undo connect-interface command restores the default configuration.\nBy default, no source interface is specified to send BMP messages.",
    "CLIs": [
        "connect-interface { <interface-name> | <ipv4-source-address> | <interface-type> <interface-number> | <interface-name> <ipv4-source-address> | <interface-type> <interface-number> <ipv4-source-address> }",
        "undo connect-interface",
        "undo connect-interface { <interface-name> | <ipv4-source-address> | <interface-type> <interface-number> | <interface-name> <ipv4-source-address> | <interface-type> <interface-number> <ipv4-source-address> }"
    ],
    "ParentView": [
        "BMP session view"
    ],
    "ParaDef": [
        {
            "Parameters": "interface-name",
            "Info": "Specifies an interface name.\n-"
        },
        {
            "Parameters": "ipv4-source-address",
            "Info": "Specifies a source IPv4 address to set up a BMP session.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "interface-type",
            "Info": "Specifies an interface type and number.\n-"
        },
        {
            "Parameters": "interface-number",
            "Info": "Specifies an interface type and number.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bmp",
            "[*HUAWEI-bmp] bmp-session 10.1.1.1",
            "[*HUAWEI-bmp-session-10.1.1.1] connect-interface 10.1.1.1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBMP is used to monitor BGP running status of devices in real time, such as the status of BGP peer relationship establishment and termination and route updates.\nAfter a TCP connection is established between a monitoring server and a device to be monitored, the device sends unsolicited BMP messages to the monitoring server to report BGP running statistics. After receiving these BMP messages, the monitoring server parses them and displays the BGP running status in the monitoring view. By analyzing the headers in the BMP messages, the monitoring server can determine from which BGP peer the routes carried in the messages were received. By default, the source interface used to send BMP messages is not specified after a TCP connection is established between a monitoring server and a device to be monitored. If the device encounters a failure, the source interface used to send BMP messages may change. In this case, the monitoring server cannot determine whether the new source interface belongs to a new device. To address this problem, run the connect-interface command to specify a source interface to send BMP messages.\nThe connect-interface command can be run in both the BMP view and BMP session view. If the command is run in both views, the configuration in the BMP session view takes precedence over that in the BMP view.\nPrecautions\nIf the connect-interface command is run more than once, the last configuration overrides the previous one.\nIn the BMP view, a source IPv4 address to set up a BMP session can be specified using the connect-interface command, whereas no source IPv6 address to set up a BMP session or source interface to send BMP messages can be specified. If the command is run in the BMP view, all IPv4 BMP sessions without a source IP address or source interface configured will be reestablished."
}