{
    "PageTitle": "monitor public",
    "FuncDef": "The monitor public command displays the BMP-Monitor view and allows the BGP running status of all BGP peers in the public network address family to be monitored.\nThe undo monitor public command restores the default configuration.\nBy default, the BGP running status of BGP peers is not monitored.",
    "CLIs": [
        "monitor public",
        "undo monitor public"
    ],
    "ParentView": [
        "BMP session view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bmp",
            "[*HUAWEI-bmp] bmp-session 10.1.1.1 alias a",
            "[*HUAWEI-bmp-session-10.1.1.1-a] monitor public"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBMP is used to monitor BGP running status of devices in real time, such as the establishment and termination status of BGP peer relationships and route update status. To allow the BGP running status of all BGP peers in the public network address family to be monitored, run the monitor public command. After a TCP connection is established between a device and a monitoring server, the device reports BGP running status to the monitoring server, improving network monitoring efficiency.\nFollow-up Procedure\nPerform either of the following operations as required:\nRun the route-mode { { { ipv4-family | ipv6-family } unicast } | ipv4-family labeled-unicast | ipv4-family vpnv4 | ipv6-family vpnv6 } adj-rib-in { pre-policy | post-policy } command to set the type of RIB-in route (received from all peers in a specified public network address family) whose statistics are to be sent by the device to the monitoring server.Run the route-mode { { { ipv4-family | ipv6-family } unicast } | ipv4-family labeled-unicast | ipv4-family vpnv4 | ipv6-family vpnv6 } adj-rib-out { pre-policy | post-policy } command to set the type of RIB-out route (to be advertised or already advertised to all peers in a specified public network address family) whose statistics are to be sent by the device to the monitoring server.Run the route-mode { { { ipv4-family | ipv6-family } unicast } | ipv4-family labeled-unicast | ipv4-family vpnv4 | ipv6-family vpnv6 } local-rib [ add-path ] command to configure the device to send statistics about Local-RIB routes of all BGP peers in the specified public network address family to the monitoring server."
}