{
    "PageTitle": "peer graceful-restart timer restart (BGP-VPN instance view) (IPv4 and IPv6)",
    "FuncDef": "The peer graceful-restart timer restart command sets the maximum duration on a device for a specified peer to wait for its BGP peer relationship to be reestablished with the device. After the command is run, the device will advertise the maximum duration to the specified peer.\nThe undo peer graceful-restart timer restart command deletes the configured duration.\nBy default, a peer specified on a device waits for its BGP peer relationship to be reestablished for a maximum of 150 seconds.",
    "CLIs": [
        "peer <ipv4-address> graceful-restart timer restart <time-value>",
        "peer <ipv6-address> graceful-restart timer restart <time-value>",
        "undo peer <ipv4-address> graceful-restart timer restart",
        "undo peer <ipv6-address> graceful-restart timer restart"
    ],
    "ParentView": [
        "BGP-VPN instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv4-address",
            "Info": "Specifies the IPv4 address of a BGP peer.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "time-value",
            "Info": "Specifies the maximum duration on a device for a peer to wait for its BGP peer relationship to be reestablished with the device.\nThe value is an integer ranging from 3 to 3600, in seconds."
        },
        {
            "Parameters": "ipv6-address",
            "Info": "Specifies the IPv6 address of a BGP peer.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] bgp 100",
            "[*HUAWEI-bgp] vpn-instance vpn1",
            "[*HUAWEI-bgp-instance-vpn1] peer 10.1.1.1 as-number 100",
            "[*HUAWEI-bgp-instance-vpn1] peer 10.1.1.1 graceful-restart timer restart 100"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a device and a BGP peer specified on the device both support GR, you can run the peer graceful-restart timer restart command to set the maximum duration on the device for the peer to wait for its BGP peer relationship to be reestablished with the device. After this command is run, if the peer detects that the device is down, the BGP session on the peer enters the GR process. If the peer relationship fails to be reestablished within the specified duration, the BGP session exits from the GR process and the peer selects the optimal route from current reachable routes.\nConfiguration Impact\nAfter the peer graceful-restart timer restart command is run, the involved BGP peer relationship will be disconnected and then reestablished."
}