{
    "PageTitle": "bmp-session (BMP view)(IPv6)",
    "FuncDef": "The bmp-session command specifies a BMP session address for a BMP device to set up a TCP connection with a monitoring server.\nThe undo bmp-session command restores the default configuration.\nBy default, no BMP session address is set for a BMP device. In this case, the client is not in TCP connections with any monitoring servers.",
    "CLIs": [
        "bmp-session [ vpn-instance <vpn-instance-name> ] <ipv6-address>",
        "undo bmp-session [ vpn-instance <vpn-instance-name> ] <ipv6-address>"
    ],
    "ParentView": [
        "BMP view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "ipv6-address",
            "Info": "Specifies the IPv6 address of a BMP session.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bmp",
            "[*HUAWEI-bmp] bmp-session 2001:DB8:1::1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBMP is used to monitor BGP running status of devices in real time, such as the establishment and termination status of BGP peer relationships and route update status. After a TCP connection is established between a device and a monitoring server, the device reports BGP running status to the monitoring server, improving network monitoring efficiency. To specify a BMP session address for a BMP device to establish a TCP session with a monitoring server, run the bmp-session command. If the command is not run, a BMP device cannot establish TCP connections with any monitoring servers, and therefore its BGP running status cannot be monitored on any servers.\nPrecautions\nIf a device needs to establish TCP connections with multiple monitoring servers, specify different IP addresses. If the device needs to establish multiple TCP connections with the same monitoring server through different port numbers, specify one IP address and different session aliases (through the alias-name parameter) for differentiation."
}