{
    "PageTitle": "supernet unicast advertise (BGP-IPv6 unicast address family view)",
    "FuncDef": "The supernet unicast advertise enable command configures a BGP device to advertise BGP supernet unicast routes to its peers.\nThe undo supernet unicast advertise enable or supernet unicast advertise disable command restores the default configuration.\nBy default, BGP supernet unicast routes are considered invalid and cannot be advertised to BGP peers or delivered to the IP routing table.",
    "CLIs": [
        "supernet unicast advertise enable",
        "supernet unicast advertise disable",
        "undo supernet unicast advertise enable"
    ],
    "ParentView": [
        "BGP-IPv6 unicast address family view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv6-family unicast",
            "[*HUAWEI-bgp-af-ipv6] supernet unicast advertise enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA BGP supernet route has the same destination address and next hop address or has a more detailed destination address than the next hop address. Any route that meets one of the following conditions is a BGP supernet route.\nIf you perform bitwise AND operations on the destination address mask with the destination address and next hop address, respectively, the calculated network addresses are the same, and the destination address mask is greater than or equal to the next hop address mask.If you perform bitwise AND operations on the destination address mask with the destination address and next hop address, respectively, the calculated network addresses are different. However, if you perform bitwise AND operations on the next hop address mask with the destination address and next hop address, respectively, the calculated network addresses are the same.\nBGP supernet routes include BGP supernet labeled routes and BGP supernet unicast routes. To allow a Huawei device to advertise BGP supernet unicast routes that it receives from a connected non-Huawei device to its BGP peers, run the supernet unicast advertise enable command on the Huawei device."
}