{
    "PageTitle": "unicast-route recursive-lookup tunnel-v4 (BGP-IPv6 unicast address family view)",
    "FuncDef": "The unicast-route recursive-lookup tunnel-v4 command enables a device to recurse BGP IPv6 unicast routes to tunnels.\nThe undo unicast-route recursive-lookup tunnel-v4 command restores the default configuration.\nBy default, the device can recurse BGP IPv6 unicast routes to outbound interfaces and next hops, but not to tunnels.",
    "CLIs": [
        "unicast-route recursive-lookup tunnel-v4 [ tunnel-selector <tunnel-selector-name> ]",
        "undo unicast-route recursive-lookup tunnel-v4 [ tunnel-selector <tunnel-selector-name> ]"
    ],
    "ParentView": [
        "BGP-IPv6 unicast address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "tunnel-selector tunnel-selector-name",
            "Info": "Specifies the name of a tunnel selector.\nThe value is a string of 1 to 40 case-sensitive characters, spaces not supported.\nThe character string can contain spaces if it is enclosed in double quotation marks (\" \")."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] tunnel-selector tnl1 permit node 10",
            "[*HUAWEI-tunnel-selector] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv6-family unicast",
            "[*HUAWEI-bgp-af-ipv6] unicast-route recursive-lookup tunnel-v4 tunnel-selector tnl1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, the device can recurse BGP IPv6 unicast routes to outbound interfaces and next hops, but not to tunnels. To enable the device to recurse BGP IPv6 unicast routes to tunnels, run the unicast-route recursive-lookup tunnel-v4 command. After the command is run, the device preferentially recurses BGP IPv6 unicast routes to tunnels (LSPs, GRE tunnels, or local IFNET tunnels); if no such tunnels are available, the device recurses the BGP IPv6 unicast routes to outbound interfaces and next hops.\nIf tunnel-selector is specified in the command, BGP IPv6 unicast routes recurse to the tunnels that match the specified tunnel selector.\nPrecautions\nIf the unicast-route recursive-lookup tunnel-v4 command is run more than once, the latest configuration overrides the previous one.\nThe SRv6 TE Policy or SRv6 TE Policy Group of tunnel is not supported in a tunnel selector specified in the command."
}