{
    "PageTitle": "import route-filter (VPN instance IPv6 address family view)",
    "FuncDef": "The import route-filter command associates an import route-filter with a VPN instance IPv6 address family.\nThe undo import route-filter command dissociates an import route-filter from a VPN instance IPv6 address family.\nBy default, no import route-filter is associated with a VPN instance IPv6 address family.",
    "CLIs": [
        "import route-filter <route-filter-name>",
        "undo import route-filter <route-filter-name>"
    ],
    "ParentView": [
        "VPN instance IPv6 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "route-filter-name",
            "Info": "Specifies the name of an import route-filter to be associated with a VPN instance IPv6 address family.\nThe value is a string of 1 to 200 case-sensitive characters, spaces not supported. If parameters are included in the referenced route-filter, specify values for them in the format of (var1, var2, ...var8) behind the route-filter name. A maximum of eight parameters can be specified, and each value ranges from 1 to 200 characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] xpl route-filter aaa",
            "[~HUAWEI-xpl-filter] end-filter",
            "[*HUAWEI] ip vpn-instance vrf1",
            "[*HUAWEI-vpn-instance-vrf1] ipv6-family",
            "[*HUAWEI-vpn-instance-vrf1-af-ipv6] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vrf1-af-ipv6] import route-filter aaa"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf no import route-filter is configured, the routes whose export VPN targets match the import VPN target of the local VPN instance IPv6 address family are added to the VPN instance IPv6 address family. To control the import of the routes into the VPN instance IPv6 address family more precisely, use the import route-filter. The import route-filter is used to filter the imported routing information and to set the routing attributes of the routes that pass the filtering.\nCompared with the import route-filter command, the peer route-filter import command configured in the BGP-VPN instance IPv6 address family view filters the routes received by the VPN instance IPv6 address family from the CE (a BGP peer).\nPrerequisites\nThe ipv6-family command has been run in the VPN instance view to enable the IPv6 address family, and the route-distinguisher command has been run in the VPN instance view to set an RD for the VPN instance IPv6 address family.\nConfiguration Impact\nOnly one import route-filter can be associated with a VPN instance IPv6 address family. If the import route-filter command is run more than once, the latest configuration overrides the previous one.\nFollow-up Procedure\nIf the import route-filter to be associated with a VPN instance IPv6 address family does not exist, configure the route-filter."
}