{
    "PageTitle": "peer advertise best-external (BGP-VPNv6 address family view)",
    "FuncDef": "The peer advertise best-external command enables a BGP device to advertise Best-external routes to its peers.\nThe undo peer advertise best-external command restores the default configurations.\nBy default, Best-external routes are not advertised.",
    "CLIs": [
        "peer <ipv4-address> advertise best-external",
        "undo peer <ipv4-address> advertise best-external"
    ],
    "ParentView": [
        "BGP-VPNv6 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv4-address",
            "Info": "Specifies the IPv4 address of a peer.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 10.1.1.1 as-number 100",
            "[*HUAWEI-bgp] ipv6-family vpnv6",
            "[*HUAWEI-bgp-af-vpnv6] peer 10.1.1.1 enable",
            "[*HUAWEI-bgp-af-vpnv6] peer 10.1.1.1 advertise best-external"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo enable a BGP device to advertise Best-external routes to non-client IBGP peers, run the peer advertise best-external command. Best-external routes cannot be advertised to EBGP peers or clients.\nPrerequisites\nThe BGP device has been enabled to select Best-external routes if the route preferentially selected based on the policies for BGP route selection is an IBGP route using the bestroute best-external command.\nPrecautions\nThe peer advertise best-external and peer reflect-client commands are mutually exclusive.\nIf a peer is specified when the peer advertise best-external command is run, a peer group is specified when the peer advertise add-path, peer capability-advertise add-path, or peer reflect-client command is run, and then the peer is added to the peer group, the peer cannot inherit the configuration of the peer advertise add-path, peer capability-advertise add-path, or peer reflect-client command from the peer group."
}