{
    "PageTitle": "peer aigp (BGP-VPNv4 address family view) (group)",
    "FuncDef": "The peer aigp command enables the AIGP capability for a BGP peer group.\nThe undo peer aigp command disables the AIGP capability for a BGP peer group.\nBy default, the AIGP capability is disabled for a BGP peer group.",
    "CLIs": [
        "peer <group-name> aigp",
        "undo peer <group-name> aigp"
    ],
    "ParentView": [
        "BGP-VPNv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "group-name",
            "Info": "Name of a BGP peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] group test internal",
            "[*HUAWEI-bgp] peer test as-number 100",
            "[*HUAWEI-bgp] ipv4-family vpnv4",
            "[*HUAWEI-bgp-af-vpnv4] peer test enable",
            "[*HUAWEI-bgp-af-vpnv4] peer test aigp"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAn AIGP administrative domain is a set of ASs in a common administrative domain. The AIGP attribute is an optional non-transitive BGP path attribute. The AIGP attribute enables BGP to select routes based on metrics in an AIGP administrative domain. As a result, all devices in the AIGP administrative domain can use the optimal routes to forward data.\nAfter the peer aigp command is configured, a local device can receive BGP routes carrying the AIGP attribute from BGP peers or peer groups or send such routes to BGP peers or peer groups.\nPrerequisites\nThe peer as-number command has been run to create BGP peers or BGP peer groups.\nPrecautions\nIf a device does not change the next hop of a route to itself, the device must not change the AIGP attribute value of the route.\nBGP allows you to enable the AIGP capability for either a BGP peer or a BGP peer group. If a BGP peer with the AIGP capability joins a BGP peer group that does not have the AIGP capability, the BGP peer still retains the AIGP capability. If a BGP peer without the AIGP capability joins a BGP peer group that has the AIGP capability, the BGP peer inherits the AIGP capability of the BGP peer group. After a BGP peer inherits the AIGP capability of a BGP peer group, you can run the undo peer aigp command to delete the AIGP configuration from the BGP peer."
}