{
    "PageTitle": "peer bfd block (BGP-VPN instance IPv4 address family view)",
    "FuncDef": "The peer bfd block command prevents a peer from inheriting the BFD function of its peer group.\nThe undo peer bfd block command restores the default configuration.\nBy default, a peer inherits the BFD function from its peer group.",
    "CLIs": [
        "peer <ipv4-address> bfd block",
        "undo peer <ipv4-address> bfd block"
    ],
    "ParentView": [
        "BGP-VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv4-address",
            "Info": "Specifies the IPv4 address of a peer.\nThe value is in dotted decimal notation"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ipv4-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv4-family vpn-instance vpn1",
            "[*HUAWEI-bgp-vpn1] peer 192.168.1.1 bfd block"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBFD provides millisecond-level fault detection. It helps BGP to detect faults in neighboring devices or links more quickly, and instructs BGP to recalculate routes for correct packet forwarding. If a peer group is configured with BFD, all members of the peer group will establish BFD sessions. The peer bfd block command can be used to prevent a peer from inheriting the BFD function from its peer group.\nPrerequisites\nA BFD session has been established.\nConfiguration Impact\nAfter the peer bfd block command is run on a peer, the corresponding BFD session on the peer is deleted. As a result, fast link fault detection cannot be implemented.\nPrecautions\nThe peer bfd block command and the peer bfd enable command are mutually exclusive. After the peer bfd block command is run, related BFD sessions are automatically deleted."
}