{
    "PageTitle": "peer route-filter import (BGP-labeled VPN instance IPv4 address family view/BGP-VPN instance IPv4 address family view) (group)",
    "FuncDef": "The peer route-filter import command specifies a route-filter for the routes to be received from a specified BGP peer group.\nThe undo peer route-filter import command restores the default configuration.\nBy default, no route-filter is specified for the routes to be received from a specified BGP peer group.",
    "CLIs": [
        "peer <group-name> route-filter <route-filter-name> import",
        "undo peer <group-name> route-filter <route-filter-name> import"
    ],
    "ParentView": [
        "BGP-labeled VPN instance IPv4 address family view",
        "BGP-VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "group-name",
            "Info": "Specifies the name of a peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "route-filter-name",
            "Info": "Specifies the name of a route-filter.\nThe value is a string of 1 to 200 case-sensitive characters, spaces not supported. If parameters are included in the referenced route-filter, specify values for them in the format of (var1, var2, ...var8) behind the route-filter name. A maximum of eight parameters can be specified, and each value ranges from 1 to 200 characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv4-family",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vpna] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] vpn-instance vpna",
            "[*HUAWEI-bgp-instance-vpna] group test",
            "[*HUAWEI-bgp-instance-vpna] quit",
            "[*HUAWEI-bgp] ipv4-labeled-unicast vpn-instance vpna",
            "[*HUAWEI-bgp-labeled-vpna] peer test enable",
            "[*HUAWEI-bgp-labeled-vpna] peer test route-filter aaa import"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter a route-filter is created, you can run the peer route-filter import command to use the route-filter to filter the routes to be received from a specified BGP peer group. The command configuration ensures that only desired routes are accepted, which helps manage routes and reduces the routing table size and system resource consumption.\nPrerequisites\nThe route-filter paragraph editing interface view has been displayed and a route-filter has been created using the edit xpl route-filter command.\nConfiguration Impact\nIf the peer route-filter command with a BGP peer group specified is run, all the members in the group inherit the command configuration.\nPrecautions\nThe peer route-filter command is mutually exclusive with the peer as-path-filter, peer filter-policy, peer ip-prefix, peer route-policy commands.\nIf a peer is specified when the peer route-filter command is run, a peer group is specified when the peer capability-advertise orf command is run, and then the peer is added to the peer group, the peer cannot inherit the configuration of the peer capability-advertise orf command from the peer group."
}