{
    "PageTitle": "peer load-balancing (BGP-VPN instance IPv4 address family view) (group)",
    "FuncDef": "The peer load-balancing command enables BGP peer group-based load balancing.\nThe undo peer load-balancing command restores the default configuration.\nBy default, BGP load balancing is not enabled.",
    "CLIs": [
        "peer <group-name> load-balancing [ as-path-ignore | as-path-relax ]",
        "undo peer <group-name> load-balancing [ as-path-ignore | as-path-relax ]"
    ],
    "ParentView": [
        "BGP-VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "group-name",
            "Info": "Specifies the name of a peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "as-path-ignore",
            "Info": "Prevents the router from comparing AS_Path attributes when selecting routes for load balancing.\n-"
        },
        {
            "Parameters": "as-path-relax",
            "Info": "Configures the device to ignore comparing the AS_Path attributes of the same length when selecting routes for load balancing.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ipv4-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv4-family vpn-instance vpn1",
            "[*HUAWEI-bgp-vpn1] group test",
            "[*HUAWEI-bgp-vpn1] peer test load-balancing as-path-relax"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn large networks, there may be multiple valid routes to the same destination. BGP, however, advertises only the optimal route to its peers. This may result in unbalanced traffic on different routes. To prevent this problem, configure load balancing.\nAfter the peer load-balancing command is run, BGP peer-based load balancing is implemented only when the following conditions are met:\nThe routes are received from the specified peer group.The optimal route and optimal equal-cost routes exist.The AS_Path attribute is the same as that of the optimal route, or as-path-ignore or as-path-relax is specified in the peer load-balancing command.If as-path-ignore is specified, the device ignores comparing AS_Path attributes when selecting routes for load balancing. In this case, routes can participate in load balancing even if their AS_Path attributes are different.If as-path-relax is specified, the device ignores comparing the AS_Path attributes of the same length when selecting routes for load balancing. In this case, routes cannot participate in load balancing if their AS_Path attributes are of different lengths. For example, the AS_Path attribute of route A is 10, and the AS_Path attribute of route B is 10, 20. Because the two AS_Path attributes are of different lengths, the two routes cannot participate in load balancing.\n\n\nPrecautions\nGlobal load balancing configured using the maximum load-balancing command takes precedence over BGP peer group-based load balancing configured using the peer load-balancing command. Specifically, a configured maximum number of routes learned from all BGP peers may participate in load balancing as long as the maximum load-balancing command is run.\nBy default, BGP does not change the next-hop IP addresses of the routes to be advertised to IBGP peers to the local IP address. However, if BGP peer group-based load balancing is enabled, BGP changes the next-hop IP addresses of the routes to be advertised to the peer group to the local IP address.\nIf the peer load-balancing command without as-path-ignore or as-path-relax specified and the load-balancing as-path-ignore or load-balancing as-path-relax command are run, the load-balancing as-path-ignore or load-balancing as-path-relax command takes effect. If the peer load-balancing command with as-path-ignore or as-path-relax specified and the load-balancing as-path-ignore or load-balancing as-path-relax command are run, the peer load-balancing command takes effect."
}