{
    "PageTitle": "nexthop recursive-lookup restrain disable (BGP-VPN instance IPv4 address family view)",
    "FuncDef": "The nexthop recursive-lookup restrain disable command disables BGP recursion suppression in case of next hop flapping.\nThe undo nexthop recursive-lookup restrain disable command enables BGP recursion suppression in case of next hop flapping.\nBy default, BGP recursion suppression in case of next hop flapping is enabled.",
    "CLIs": [
        "nexthop recursive-lookup restrain disable",
        "undo nexthop recursive-lookup restrain disable"
    ],
    "ParentView": [
        "BGP-labeled VPN instance IPv4 address family view",
        "BGP-VPN instance IPv4 address family view",
        "BGP-VPN instance IPv6 address family view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv4-family",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vpna] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] vpn-instance vpna",
            "[*HUAWEI-bgp-instance-vpna] peer 1.1.1.1 as-number 100",
            "[*HUAWEI-bgp-instance-vpna] quit",
            "[*HUAWEI-bgp] ipv4-labeled-unicast vpn-instance vpna",
            "[*HUAWEI-bgp-labeled-vpna] nexthop recursive-lookup restrain disable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a large number of routes recurse to the same next hop that flaps frequently, the system will be busy processing changes of these routes, which consumes excessive system resources and leads to high CPU usage. To address this problem, configure BGP recursion suppression in case of next hop flapping. If you do not care about whether the system is busy processing route selection and advertisement and the possible high CPU usage, run the nexthop recursive-lookup restrain disable command to disable BGP recursion suppression in case of next hop flapping."
}