{
    "PageTitle": "peer exp-mode (BGP-VPN instance IPv4 address family view)",
    "FuncDef": "The peer exp-mode command specifies the mode in which a BGP label inherits the QoS priority in the outer tunnel label carried in packets.\nThe undo peer exp-mode command restores the default mode.\n\nThe default QoS priority inheriting mode varies according to the outer MPLS tunnel type:\n\n\nLDP: By default, the BGP label inherits the QoS priority carried in the outer MPLS tunnel label.",
    "CLIs": [
        "peer <peerIpv4Addr> exp-mode { pipe | uniform }",
        "undo peer <peerIpv4Addr> exp-mode"
    ],
    "ParentView": [
        "BGP-VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "peerIpv4Addr",
            "Info": "Specifies the IPv4 address of a BGP peer.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "pipe",
            "Info": "Allows the BGP label to use its own QoS priority.\n-"
        },
        {
            "Parameters": "uniform",
            "Info": "Allows the BGP label to inherit the QoS priority carried in the outer MPLS tunnel label.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv4-family",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] route-distinguisher 1:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vpna] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv4-family vpn-instance vpna",
            "[*HUAWEI-bgp-vpna] peer 1.2.3.4 as-number 100",
            "[*HUAWEI-bgp-vpna] peer 1.2.3.4 exp-mode uniform"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn a CSC(Carrier Support Carrier) scenario, each packet arriving at a PE carries an inner private label, a BGP LSP label, and an outer MPLS tunnel label. The PE remove outer MPLS tunnel labels from packets before sending the packets to each other. If the BGP LSP label in a packet carries a QoS priority different from that in the outer MPLS tunnel label in the packet, run the peer exp-mode command on the PE to determine whether the BGP LSP label inherits the QoS priority carried in the outer MPLS tunnel label to be removed."
}