{
    "PageTitle": "as-number",
    "FuncDef": "The as-number command configures an AS number for a VPN instance.\nThe undo as-number command restores the default setting.\nBy default, a VPN instance uses the AS number of BGP.",
    "CLIs": [
        "as-number <vrf-as>",
        "undo as-number"
    ],
    "ParentView": [
        "BGP-VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "vrf-as",
            "Info": "Specifies the number of an AS.\nFor Integral AS number, The value is an integer ranging from 1 to 4294967295.\nFor AS number in dotted notation, The value is in the format of x.y, where x and y are integers that range from 1 to 65535 and from 0 to 65535, respectively."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ipv4-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv4-family vpn-instance vpn1",
            "[*HUAWEI-bgp-vpn1] as-number 65001"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nDuring network transfer or service identification, a device needs to be simulated as multiple BGP devices logically. In this case, you can run the as-number command to configure an AS number for each VPN instance.\nAfter the as-number command is used:\nBGP peer relationships in the VPN instance are established by using the configured AS number.The configured AS number is used to generate the aggregator attribute during route aggregation.When advertising routes to an external border gateway protocol (EBGP) peer, the local device carries the AS number configured in the VPN instance.\n\nPrerequisites\nIf a BGP peer or a BGP peer group is configured in the VPN instance, you need to delete the configuration of the BGP peer or peer group before configuring or deleting an AS number.\nPrecautions\nA VPN instance configured with an AS number cannot be configured with BGP confederation. Conversely, a VPN instance configured with BGP confederation cannot be configured with an AS number.\nThe AS number configured in the BGP-VPN instance view cannot be the same as the AS number configured in the BGP view."
}