{
    "PageTitle": "peer ignore (BGP-VPN instance IPv4 address family view)",
    "FuncDef": "The peer ignore command prevents a BGP device from establishing a session with a peer.\nThe undo peer ignore command cancels the configuration.\nBy default, a BGP device is allowed to establish a session with a BGP peer.",
    "CLIs": [
        "peer <ipv4-address> ignore",
        "undo peer <ipv4-address> ignore"
    ],
    "ParentView": [
        "BGP-VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv4-address",
            "Info": "Specifies the IPv4 address of a peer.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ipv4-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv4-family vpn-instance vpn1",
            "[*HUAWEI-bgp-vpn1] peer 10.1.1.1 as-number 100",
            "[*HUAWEI-bgp-vpn1] peer 10.1.1.1 ignore"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen a BGP device needs to transitorily close the session with a peer and reconfiguring the peer requires too much workload, the peer ignore command can be used to avoid the reconfiguration of the peer. For example, if the peer relationship frequently alternates between Up and Down because of the upgrade of a peer or the adjustment of the link, the BGP peer relationship needs to be interrupted temporarily. In this case, the peer ignore command can be used on the stabler end to prevent frequent flapping of the route or peer relationship.\nThe peer ignore command is used to tear down sessions between a BGP device and its peer and delete all related routing information. In the case of a peer group, a large number of sessions are suddenly torn down.\nConfiguration Impact\nAfter the peer ignore command is run on a device, the session between the device and its peer is closed and all the related routing information is cleared.\nAfter a BGP session is successfully established, running the peer ignore command interrupts the BGP session. The interrupted BGP session cannot be established again, and the status of the corresponding BGP peer relationship is displayed as Idle."
}