{
    "PageTitle": "peer check-tunnel-reachable (BGP-labeled VPN instance IPv4 address family view)",
    "FuncDef": "The peer check-tunnel-reachable command enables a peer in a labeled address family to check the reachability of a tunnel between the BGP peers.\nThe undo peer check-tunnel-reachable command disables a peer in a labeled address family from checking the reachability of a tunnel between BGP peers.\nBy default, a peer in a labeled address family is not enabled to check the reachability of a tunnel between BGP peers.",
    "CLIs": [
        "peer <group-name> check-tunnel-reachable",
        "undo peer <group-name> check-tunnel-reachable"
    ],
    "ParentView": [
        "BGP-labeled VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "group-name",
            "Info": "Specifies the name of a peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "check-tunnel-reachable",
            "Info": "Checks the tunnel reachability before an imported route functions as a labeled route.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv4-family",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vpna] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] vpn-instance vpna",
            "[*HUAWEI-bgp-instance-vpna] group test",
            "[*HUAWEI-bgp-instance-vpna] quit",
            "[*HUAWEI-bgp] ipv4-labeled-unicast vpn-instance vpna",
            "[*HUAWEI-bgp-labeled-vpna] peer test enable",
            "[*HUAWEI-bgp-labeled-vpna] peer test check-tunnel-reachable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo enable a peer in a labeled address family to check reachability of a tunnel between the BGP peers, run the peer check-tunnel-reachable command.\nPrecautions\nAfter the command is run, the device advertises the routes imported in the labeled address family to the specified peer only when the tunnel to the peer is up. There is no limit on the tunnel type."
}