{
    "PageTitle": "peer ip-prefix import (BGP-VPN instance IPv4 address family view) (group)",
    "FuncDef": "The peer ip-prefix import command configures a policy based on an IP prefix list for filtering BGP routes received from a specified peer group.\nThe undo peer ip-prefix import command cancels this configuration.\nBy default, no route filtering policy based on an IP address prefix list is configured for a peer group.",
    "CLIs": [
        "peer <group-name> ip-prefix <ip-prefix-name> import",
        "undo peer <group-name> ip-prefix [ <ip-prefix-name> ] import"
    ],
    "ParentView": [
        "BGP-labeled VPN instance IPv4 address family view",
        "BGP-VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "group-name",
            "Info": "Specifies the name of a peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "ip-prefix ip-prefix-name",
            "Info": "specifies the name of an IP address prefix list.\nThe name is a string of 1 to 169 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "import",
            "Info": "Applies a filtering policy to the routes received from a peer group.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv4-family",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vpna] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] vpn-instance vpna",
            "[*HUAWEI-bgp-instance-vpna] group test",
            "[*HUAWEI-bgp-instance-vpna] quit",
            "[*HUAWEI-bgp] ipv4-labeled-unicast vpn-instance vpna",
            "[*HUAWEI-bgp-labeled-vpna] peer test enable",
            "[*HUAWEI-bgp-labeled-vpna] peer test ip-prefix list1 import",
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv4-family",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vpna] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv4-family vpn-instance vpna",
            "[*HUAWEI-bgp-vpna] group a",
            "[*HUAWEI-bgp-vpna] peer a ip-prefix list1 import"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe peer ip-prefix import command can be used to configure a route filtering policy that is based on an IP prefix list for filtering BGP routes to be received from a specified peer group, implementing route control.\nPrerequisites\nIf the peer ip-prefix command specifies an IP prefix list that does not exist for a peer, use the ip ip-prefix command to create an IP prefix list.\nConfiguration Impact\nIf an IP prefix list is specified for a peer group, all the members of the peer group inherit the configuration.\nAfter an IP prefix list is specified for a peer group, the peers in the peer group filter the routes received from other peers based on the IP prefix list. Only the routes that pass the filtering of the IP prefix list can be received.\nPrecautions\nThe peer ip-prefix import command is mutually exclusive with the peer route-filter import commands."
}