{
    "PageTitle": "vpn-instance (BGP view)",
    "FuncDef": "The vpn-instance command creates a BGP VPN instance and displays the BGP VPN instance view.\nThe undo vpn-instance command deletes a BGP VPN instance.\nBy default, no BGP VPN instance is created.",
    "CLIs": [
        "vpn-instance <vpn-instance-name>",
        "undo vpn-instance <vpn-instance-name>"
    ],
    "ParentView": [
        "BGP view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance-name",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ipv4-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] vpn-instance vpn1",
            "[*HUAWEI-bgp-instance-vpn1]"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nRunning the vpn-instance command creates a BGP VPN instance and displays the BGP VPN instance view. The configuration in this view takes effect for the routes and peers in all address families of the specified VPN instance.\nPrerequisites\nA VPN instance has been created using the ip vpn-instance command.\nConfiguration Impact\nRunning the undo vpn-instance command to delete a BGP VPN instance clears all the configurations in the BGP VPN instance.\nFollow-up Procedure\nAfter the BGP VPN instance is created, run the peer as-number command in the BGP VPN instance view to create BGP peers and enable these BGP peers in the BGP VPN instance IPv6 address family view.\nPrecautions\nThe BGP peers configured in the BGP VPN instance view can be used in both the BGP VPN instance IPv4 address family view and the BGP VPN instance IPv6 address family view."
}