{
    "PageTitle": "peer (BGP-VPN instance IPv4 address family view) (group)",
    "FuncDef": "The peer listen-only command configures a peer group to only listen to connection requests and not to initiatively send connection requests.\nThe undo peer listen-only command cancels the function.\nThe peer connect-only command configures a peer group to send connection requests but rejects connection requests.\nThe undo peer connect-only command restores the default setting.\nBy default, a peer group listens to, accepts, and proactively sends connection requests.",
    "CLIs": [
        "peer <group-name> { listen-only | connect-only }",
        "undo peer <group-name> { listen-only | connect-only }"
    ],
    "ParentView": [
        "BGP-VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "group-name",
            "Info": "Specifies the name of a peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ipv4-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv4-family vpn-instance vpn1",
            "[*HUAWEI-bgp-vpn1] group test",
            "[*HUAWEI-bgp-vpn1] peer test connect-only"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe peer listen-only command is used to configure a peer group to only listen to connection requests and not to initiatively send connection requests.\nThe peer connect-only command is used to configure a peer group to send connection requests but rejects connection requests.\nConfiguration Impact\nIf the peer listen-only command is run multiple times, the latest configuration overwrites the previous one.\nAfter being configured with the peer listen-only command, a peer does not initiate any connection request.\nPrecautions\nThe peer listen-only command can be run at only one end of a peer relationship. If this command is run at both ends of a peer relationship, the ends fail to establish a connection.\nThe peer connect-only command or the peer listen-only command cannot be run on two devices that will establish a peer relationship. Otherwise, no peer relationship can be established between the two devices."
}