{
    "PageTitle": "nexthop recursive-lookup delay (BGP-VPN instance IPv4 address family view)",
    "FuncDef": "The nexthop recursive-lookup delay command enables a device to respond to BGP recursion changes after a specified delay time.\nThe undo nexthop recursive-lookup delay command restores the default setting.\nBy default, a device immediately responds to BGP recursion changes.",
    "CLIs": [
        "nexthop recursive-lookup delay [ <delay-time> ]",
        "nexthop recursive-lookup non-critical-event delay [ <delay-time> ]",
        "undo nexthop recursive-lookup delay",
        "undo nexthop recursive-lookup non-critical-event delay"
    ],
    "ParentView": [
        "BGP-VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "delay-time",
            "Info": "Specifies the delay in responding to recursion changes.\nThe value is an integer that ranges from 1 to 100, in seconds. The default value is 5 seconds."
        },
        {
            "Parameters": "non-critical-event",
            "Info": "Indicates the delay in responding to non-critical recursion changes.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ipv4-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv4-family vpn-instance vpn1",
            "[*HUAWEI-bgp-vpn1] nexthop recursive-lookup non-critical-event delay 10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf repeated recursion causes the BGP next hop to frequently change on a device, the device frequently selects and advertises routes. To prevent unwanted re-routing and route advertisement, run the\nnexthop recursive-lookup delay command to enable the device to respond to BGP recursion changes after a specified delay time. The recursion results are as follows:\nCritical recursion result change: The recursive next hop is changed, and BGP route reachability is also changed. For example, if a fault occurs on a network, a device finds no next-hop route or tunnel to which a BGP route recurses. As a result, traffic is interrupted.Non-critical recursion result change: The recursive next hop is changed, and BGP route reachability is not affected. For example, after the interface or type of a tunnel to which the next hop of a BGP route recurses is changed, traffic keeps traveling over the BGP route.\n\nConfiguration Impact\nAfter the nexthop recursive-lookup delay command is run, the device delays responses to all recursion changes. After the nexthop recursive-lookup non-critical-event delay command is run, the device delays responses only to non-critical BGP recursion changes. If both commands are run, the nexthop recursive-lookup non-critical-event delay command takes precedence over the nexthop recursive-lookup delay command. Table 1 provides examples of the two commands.\nPrecautions\nThe delay time specified in the nexthop recursive-lookup non-critical-event delay command must be greater than or equal to that specified in the nexthop recursive-lookup delay command if both commands are run.\nThe BGP next hop delayed response applies to a scenario where the next hop has multiple links to reach the same destination. If there is only one link between the next hop and the destination, configuring the BGP next hop delayed response may cause heavier traffic loss when the link fails because link switching is impossible."
}