{
    "PageTitle": "route-filter (BGP-VPN instance IPv4 address family view)",
    "FuncDef": "The route-filter export command filters the routes to be advertised so that BGP advertises only desired routes.\nThe undo route-filter export command restores the default configuration.\nThe route-filter import command filters the routes to be received.\nThe undo route-filter import command restores the default configuration.\nBy default, received routes or the routes to be advertised are not filtered.",
    "CLIs": [
        "route-filter <route-filter-name> { import | export [ direct | isis <process-id> | ospf <process-id> | rip <process-id> | static ] }",
        "undo route-filter <route-filter-name> { import | export [ direct | isis <process-id> | ospf <process-id> | rip <process-id> | static ] }"
    ],
    "ParentView": [
        "BGP-VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "route-filter-name",
            "Info": "Specifies the name of a route-filter.\nThe value is a string of 1 to 200 case-sensitive characters, spaces not supported. If parameters are included in the referenced route-filter, specify values for them in the format of (var1, var2, ...var8) behind the route-filter name. A maximum of eight parameters can be specified, and each value ranges from 1 to 200 characters."
        },
        {
            "Parameters": "direct",
            "Info": "Filters the direct routes to be advertised.\n-"
        },
        {
            "Parameters": "isis process-id",
            "Info": "Specifies the ID of an IS-IS process.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "ospf process-id",
            "Info": "Specifies the ID of an OSPF process.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "rip process-id",
            "Info": "Specifies the ID of an RIP process.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "static",
            "Info": "Filters the static routes to be advertised.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] xpl route-filter aaa",
            "[~HUAWEI-xpl-filter] end-filter",
            "[*HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ipv4-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv4-family vpn-instance vpn1",
            "[*HUAWEI-bgp-vpn1] route-filter aaa export"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo filter the routes to be advertised using a route-filter, run the route-filter export command.\nIf you specify a route protocol in the command, BGP filters only the routes of this protocol before advertising them. If you do not specify any protocol in the command, BGP filters all routes before advertising them.\nConfiguration Impact\nIf the route-filter export command with the same route protocol specified is run more than once, the latest configuration overrides the previous one.\nThe route-filter export command is mutually exclusive with the filter-policy export command.\nIf the route-filter export command is run, some BGP routes are not added to the IP routing table. Therefore, exercise caution when using the command.\nIf the route-filter import is run more than once, the latest configuration overrides the previous one.\nThe route-filter import command is mutually exclusive with the filter-policy import command."
}