{
    "PageTitle": "peer graceful-restart timer wait-for-rib (BGP-VPN instance IPv6 address family view) (group)",
    "FuncDef": "The peer graceful-restart timer wait-for-rib command sets the maximum duration for a BGP restarter to wait for the End-of-RIB flag from each peer in a specified group.\nThe undo peer graceful-restart timer wait-for-rib command deletes the configured duration.\nBy default, a BGP restarter waits for the End-of-RIB flag from each peer in a specified group for a maximum of 600s.",
    "CLIs": [
        "peer <group-name> graceful-restart timer wait-for-rib <time-value>",
        "undo peer <group-name> graceful-restart timer wait-for-rib"
    ],
    "ParentView": [
        "BGP-VPN instance IPv6 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "group-name",
            "Info": "Specifies the name of a peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "time-value",
            "Info": "Specifies the period during which the BGP restarter waits for the End-Of-RIB flag.\nThe value is an integer ranging from 3 to 3000, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv6-family",
            "[*HUAWEI-vpn-instance-vpna-af-ipv6] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv6] bgp 100",
            "[*HUAWEI-bgp] ipv6-family vpn-instance vpna",
            "[*HUAWEI-bgp-6-vpna] group aaa",
            "[*HUAWEI-bgp-6-vpna] peer aaa graceful-restart timer wait-for-rib 100"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo set the maximum duration for a device to wait for the End-of-RIB flag from each peer in a specified group, run the peer graceful-restart timer wait-for-rib command on the device. After the BGP session between the device and a peer in the group is reestablished, if the device does not receive the End-of-RIB flag within the specified duration, the BGP session on the device exits from the GR process and the device selects the optimal route among reachable routes.\nConfiguration Impact\nIf the peer graceful-restart timer wait-for-rib command is run more than once, the latest configuration overrides the previous one."
}