{
    "PageTitle": "peer as-number (BGP-VPN instance IPv6 address family view) (group)",
    "FuncDef": "The peer as-number command configures an AS number for a specified peer group.\nThe undo peer as-number command deletes the AS number of a specified peer group.\nBy default, no BGP peer is configured, and no AS number is specified for a peer group.",
    "CLIs": [
        "peer <group-name> as-number <as-number>",
        "undo peer <group-name> as-number"
    ],
    "ParentView": [
        "BGP-VPN instance IPv6 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "group-name",
            "Info": "Specifies the name of a peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "as-number",
            "Info": "Specifies a destination AS number.\nFor an integral AS number, the value is an integer ranging from 1 to 4294967295.\nFor an AS number in dotted notation, the value is in the format of x.y, where x and y are integers ranging from 1 to 65535 and from 0 to 65535, respectively."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv6-family",
            "[*HUAWEI-vpn-instance-vpna-af-ipv6] quit",
            "[*HUAWEI-vpn-instance-vpna] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv6-family vpn-instance vpna",
            "[*HUAWEI-bgp-6-vpna] group test external",
            "[*HUAWEI-bgp-6-vpna] peer test as-number 200"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe peer as-number command is used to create a BGP peer.\nPrecautions\nIf a peer does not join any peer group or the peer group to which a peer belongs is not configured with an AS number, deleting the AS number of the peer will reset the peer relationship.\nIf a peer in a peer group is not configured with an AS number, deleting the AS number of the peer group will interrupt the connection on the peer.\nThe AS number for external session group cannot be the same as the local AS number."
}