{
    "PageTitle": "ipv6 qppb (BGP-VPN instance IPv6 address family view)",
    "FuncDef": "The ipv6 qppb command enables the import policies of a BGP peer and a VPN instance to support IPv6 QoS policy propagation on BGP (QPPB).\nThe undo ipv6 qppb command disables the import policies of a BGP peer and a VPN instance from supporting IPv6 QPPB.\nBy default, BGP does not support IPv6 QPPB.",
    "CLIs": [
        "ipv6 qppb",
        "undo ipv6 qppb"
    ],
    "ParentView": [
        "BGP-VPN instance IPv6 address family view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vrf1",
            "[*HUAWEI-vpn-instance-vrf1] ipv6-family",
            "[*HUAWEI-vpn-instance-vrf1-af-ipv6] quit",
            "[*HUAWEI-vpn-instance-vrf1] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv6-family vpn-instance vrf1",
            "[*HUAWEI-bgp-6-vrf1] ipv6 qppb"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, QPPB is not supported in the BGP-VPN instance IPv6 address family view. To apply QPPB to the BGP-VPN instance IPv6 address family view, run the ipv6 qppb command.\nPrerequisites\nThe BGP-VPN instance IPv6 address family view has been displayed using the ipv6-family vpn-instance command.\nConfiguration Impact\nAfter the ipv6 qppb command is run, BGP-VPN IPv6 routes carry QoS attributes. The RM module obtains the QoS attributes from the received BGP-VPN IPv6 routes so that traffic statistics can be collected for these routes.\nPrecautions\nThe ipv6 qppb command must be used with the peer route-policy import command (BGP-VPN instance IPv6 address family view or BGP-VPNv6 instance address family view). If they are not used together, configuration of the ipv6 qppb command does not take effect.\nThe ipv6 qppb command must also be used with the import route-policy policy-name command (VPN instance IPv6 address family view). If they are not used together, configuration of the ipv6 qppb command does not take effect."
}