{
    "PageTitle": "peer group enable (BGP-VPN instance IPv6 address family view) (IPv6)",
    "FuncDef": "The peer group enable command enables a peer to be added to a peer group in the BGP VPN instance address family.\nThe undo peer group enable command disables a peer from being added to a peer group in the BGP VPN instance address family.\nBy default, a peer is disabled from being added to a peer group in the BGP VPN instance address family.",
    "CLIs": [
        "peer <ipv6-address> group <group-name> enable",
        "undo peer <ipv6-address> group <group-name> enable"
    ],
    "ParentView": [
        "BGP-VPN instance IPv6 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv6-address",
            "Info": "Specifies the IPv6 address of a peer.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "group-name",
            "Info": "Specifies the name of a peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ipv6-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv6] quit",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] vpn-instance vpn1",
            "[*HUAWEI-bgp-instance-vpn1] group yy internal",
            "[*HUAWEI-bgp-instance-vpn1] peer 2001:DB8:1::1 group yy",
            "[*HUAWEI-bgp-instance-vpn1] quit",
            "[*HUAWEI-bgp] ipv6-family vpn-instance vpn1",
            "[*HUAWEI-bgp-6-vpn1] peer yy enable",
            "[*HUAWEI-bgp-6-vpn1] peer 2001:DB8:1::1 group yy enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA large number of BGP peers may exist on a large-scale BGP network. Among these BGP peers, many of them may use the same policies and have the same command configurations. In this situation, you can use peer groups to simplify configurations. Specifically, when configuring multiple peers in the same way, you can create and configure a peer group, and add multiple peers to the peer group. Then, all peers in the peer group will inherit the configurations of the peer group. The peer group enable command enables a peer to be added to a peer group in the BGP VPN instance address family. After being added to a peer group, a peer automatically inherits the configurations of the peer group.\nPrerequisites\nBGP peers and BGP peer groups have been configured in the BGP VPN instance view.\nPrecautions\nPeers in the same peer group can have different import and export routing policies.\nThe undo peer group enable command provides the same function as the undo peer enable command."
}