{
    "PageTitle": "peer ipv6-prefix import (BGP-VPN instance IPv6 address family view)",
    "FuncDef": "The peer ipv6-prefix import command configures a policy based on an IPv6 prefix list for filtering BGP routes received from a specified peer.\nThe undo peer ipv6-prefix import command cancels this configuration.\nBy default, no route filtering policy based on an IP address prefix list is configured for a peer.",
    "CLIs": [
        "peer <ipv4-address> ipv6-prefix <ipv6-prefix-name> import",
        "undo peer <ipv4-address> ipv6-prefix [ <ipv6-prefix-name> ] import"
    ],
    "ParentView": [
        "BGP-VPN instance IPv6 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv4-address",
            "Info": "Specifies the IPv4 address of a peer.\nIt is in dotted decimal notation."
        },
        {
            "Parameters": "ipv6-prefix ipv6-prefix-name",
            "Info": "Indicates the filtering policy that is based on the IPv6 prefix list of the peer or peer group.\nThe name is a string of 1 to 169 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "import",
            "Info": "Applies a filtering policy to the routes received from a peer.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip ipv6-prefix list1 permit 2001:DB8:1::1 8 greater-equal 17 less-equal 18",
            "[*HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv6-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv6] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv6] quit",
            "[*HUAWEI-vpn-instance-vpna] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] vpn-instance vpna",
            "[*HUAWEI-bgp-vpna] peer 10.1.1.1 as-number 100",
            "[*HUAWEI-bgp-vpna] quit",
            "[*HUAWEI-bgp] ipv6-family vpn-instance vpna",
            "[*HUAWEI-bgp-6-vpna] peer 10.1.1.1 enable",
            "[*HUAWEI-bgp-6-vpna] peer 10.1.1.1 ipv6-prefix list1 import"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe peer ipv6-prefix import command can be used to configure a route filtering policy that is based on an IPv6 prefix list for filtering BGP routes to be received from a specified peer, implementing route control.\nPrerequisites\nIf the peer ipv6-prefix command specifies an IPv6 prefix list that does not exist for a peer, use the ip ipv6-prefix command to create an IPv6 prefix list.\nConfiguration Impact\nIf an IPv6 prefix list is specified for a peer group, all the members of the peer group inherit the configuration.\nAfter an IPv6 prefix list is specified for a peer, the peer filter the routes to be received from other peers based on the IPv6 prefix list. Only the routes that pass the filtering of the IPv6 prefix list can be received.\nPrecautions\nThe peer ipv6-prefix import command is mutually exclusive with the peer route-filter import commands."
}