{
    "PageTitle": "peer description (BGP-VPN instance IPv6 address family view) (IPv6)",
    "FuncDef": "The peer description command configures a description for a peer.\nThe undo peer description command deletes the description of a peer.\nBy default, no description is configured for a peer.",
    "CLIs": [
        "peer <ipv6-address> description <description-text>",
        "undo peer <ipv6-address> description"
    ],
    "ParentView": [
        "BGP-VPN instance IPv6 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv6-address",
            "Info": "Specifies the IPv6 address of a peer.\nThe prefix is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "description-text",
            "Info": "Specifies a description, which can be letters and digits.\nThe value is a string of 1 to 255 characters, with spaces supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv6-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv6] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv6] quit",
            "[*HUAWEI-vpn-instance-vpna] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv6-family vpn-instance vpna",
            "[*HUAWEI-bgp-6-vpna] peer 2001:DB8:1::1 as-number 100",
            "[*HUAWEI-bgp-6-vpna] peer 2001:DB8:1::1 description ISP1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe peer description can be used to configure a description for a peer, which facilitates management of peers or peer groups. The description records information about the peer, such as the VPN instance to which the peer belongs, and devices that establish peer relationships with the peer.\nImplementation Procedure\nThe description configured by using the peer description command for a peer is displayed from the first non-space character.\nConfiguration Impact\nIf the peer description command is run multiple times to configure a description for a peer, the latest configuration overwrites the previous one.\nFollow-up Procedure\nYou can run display bgp peer verbose command can be used to view the description of a peer."
}