{
    "PageTitle": "peer check-first-as (BGP-VPN instance IPv6 address family view) (IPv6)",
    "FuncDef": "The peer check-first-as enable command enables a device to check the first AS number in the AS_Path attribute contained in the update messages received from a specified EBGP peer.\nThe peer check-first-as disable command disables a device from checking the first AS number in the AS_Path attribute contained in the update messages received from a specified EBGP peer.\nThe undo peer check-first-as enable command disables a device from checking the first AS number in the AS_Path attribute contained in the update messages received from a specified EBGP peer.\nThe undo peer check-first-as disable command enables a device to check the first AS number in the AS_Path attribute contained in the update messages received from a specified EBGP peer.\nBy default, a device checks the first AS number in the AS_Path attribute contained in the update messages received from all EBGP peers or peer groups.",
    "CLIs": [
        "peer <ipv6-address> check-first-as enable",
        "peer <ipv6-address> check-first-as disable",
        "undo peer <ipv6-address> check-first-as enable",
        "undo peer <ipv6-address> check-first-as disable"
    ],
    "ParentView": [
        "BGP-VPN instance IPv6 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv6-address",
            "Info": "Specifies the IPv6 address of a peer.\nThe value is in the format of X:X:X:X:X:X:X:X."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vrf1",
            "[*HUAWEI-vpn-instance-vrf1] ipv6-family",
            "[*HUAWEI-vpn-instance-vrf1-af-ipv6] quit",
            "[*HUAWEI-vpn-instance-vrf1] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv6-family vpn-instance vrf1",
            "[*HUAWEI-bgp-6-vrf1] peer 2001:db8:9:1::2 as-number 200",
            "[*HUAWEI-bgp-6-vrf1] peer 2001:db8:9:1::2 check-first-as enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the peer check-first-as enable command is run, the device checks whether the first AS number in the AS_Path attribute contained in the update messages received from the specified EBGP peer is the number of the AS where the EBGP peer resides. If the two AS numbers are different, the local device discards the update messages. If the peer check-first-as disable command is run, the device accepts all update messages received from the specified EBGP peer, regardless whether the two AS numbers are the same. If the undo peer check-first-as disable command is run, the default configuration takes effect.\nThe check function can be configured for a specified EBGP peer, peer group, or for BGP as a whole. If the function is not configured for a specified EBGP peer, the device checks whether the function is configured for the related peer group; if the function is not configured for the peer group, the device checks whether the function is configured in the BGP view.\nFollow-up Procedure\nAfter the check function is enabled, to enable the device to perform a check on received update messages, run the refresh bgp command.\nPrecautions\nThe configuration of the peer check-first-as { enable | disable } command is displayed in the configuration file.\nThe check-first-as command applies to all EBGP peers, whereas the peer check-first-as command applies only to the specified EBGP peer."
}