{
    "PageTitle": "peer preferred-value (BGP-VPN instance IPv6 address family view)",
    "FuncDef": "The peer preferred-value command sets a preferred value for the routes that a BGP device learns from its peer.\nThe undo peer preferred-value command deletes the preferred value set for the routes that a BGP device learns from its peer.\nBy default, the preferred value of a route learned from a BGP peer is 0.",
    "CLIs": [
        "peer <ipv4-address> preferred-value <preferredvalue>",
        "undo peer <ipv4-address> preferred-value"
    ],
    "ParentView": [
        "BGP-VPN instance IPv6 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv4-address",
            "Info": "Specifies the IPv4 address of a peer.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "preferredvalue",
            "Info": "Specifies the preferred value of the routes that a BGP device learns from its peer.\nThe value is an integer ranging from 0 to 65535."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] ipv6-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv6] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv6] quit",
            "[*HUAWEI-vpn-instance-vpna] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] vpn-instance vpna",
            "[*HUAWEI-bgp-vpna] peer 1.1.1.1 as-number 100",
            "[*HUAWEI-bgp-vpna] quit",
            "[*HUAWEI-bgp] ipv6-family vpn-instance vpna",
            "[*HUAWEI-bgp-6-vpna] peer 1.1.1.1 enable",
            "[*HUAWEI-bgp-6-vpna] peer 1.1.1.1 preferred-value 50"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter the peer preferred-value command is run, all the routes learned from the specified peer have the preferred value. If there are multiple routes to the same address prefix, the route with the highest preferred value is preferred.\nPrerequisites\nA BGP peer has been configured. If the peer preferred-value command is used but no BGP peer exists, a message is displayed, indicating that the peer does not exist.\nConfiguration Impact\nIf a preferred value is set for the routes that a BGP device learns from a peer group, all members of the peer group inherit the configuration."
}