{
    "PageTitle": "qos-local-id (BGP-VPN instance IPv6 address family view)",
    "FuncDef": "The qos-local-id command sets a value for the QoS local ID.\nThe undo qos-local-id command deletes the value set for the QoS local ID.\nBy default, no value is set for the QoS local ID.",
    "CLIs": [
        "qos-local-id { qos-local-id | route-policy <route-policy-name> }",
        "undo qos-local-id"
    ],
    "ParentView": [
        "BGP-VPN instance IPv6 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "qos-local-id",
            "Info": "Specifies a value for the QoS local ID.\nThe value is an integer ranging from 1 to 255."
        },
        {
            "Parameters": "route-policy route-policy-name",
            "Info": "Specifies the name of a route-policy.\nThe name is a string of 1 to 200 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vrf1",
            "[*HUAWEI-vpn-instance-vrf1] ipv6-family",
            "[*HUAWEI-vpn-instance-vrf1-af-ipv6] quit",
            "[*HUAWEI-vpn-instance-vrf1] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv6-family vpn-instance vrf1",
            "[*HUAWEI-bgp-6-vrf1] qos-local-id 10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo set a value for the QoS local ID, run the qos-local-id command. The set QoS local ID is delivered to the FIB. During forwarding, the system implements QoS policies based on the QoS local IDs in the FIB. Alternatively, you can use a route-policy to set a value for the QoS local ID.\nPrecautions\nTo set a QoS local ID for the routes to be imported, you can configure one using the qos-local-id command. Alternatively, you can configure a QoS local ID in a route-policy using the apply qos-local-id command and then set the route-policy as an import policy. If different QoS local IDs are configured using the two methods, the one configured using the second method takes effect."
}