{
    "PageTitle": "ip extcommunity-list encapsulation advanced",
    "FuncDef": "The ip extcommunity-list encapsulation advanced command configures an advanced encapsulation extended community filter.\nThe undo ip extcommunity-list encapsulation advanced command deletes an advanced encapsulation extended community filter.\nBy default, no advanced encapsulation extended community filter is configured.",
    "CLIs": [
        "ip extcommunity-list encapsulation advanced <encapsulation-name> [ index <index-value> ] <matchMode> <regular>",
        "undo ip extcommunity-list encapsulation advanced <encapsulation-name> [ index <index-value> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "encapsulation-name",
            "Info": "Specifies the name of an advanced encapsulation extended community filter.\nThe value is a string of 1 to 51 case-sensitive characters. It cannot be comprised of only digits. If spaces are used, the string must start and end with double quotation marks (\")."
        },
        {
            "Parameters": "index index-value",
            "Info": "Specifies the index of an advanced encapsulation extended community filter.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "matchMode",
            "Info": "Sets the matching mode of the advanced encapsulation extended community filter.\nThe value is an enumerated type:\npermit: Indicates the permit matching mode.deny: Indicates the deny matching mode."
        },
        {
            "Parameters": "regular",
            "Info": "Specifies a regular expression to match the advanced encapsulation extended community attribute.\nThe value is a string of 1 to 1024 characters. It can contain spaces."
        },
        {
            "Parameters": "advanced",
            "Info": "Indicates the advanced encapsulation extended community attribute.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip extcommunity-list encapsulation advanced aaa permit 0:*"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure an encapsulation extended community filter, run the ip extcommunity-list encapsulation command. The filter can then be used to filter BGP EVPN routes that carry the encapsulation extended community attribute.\nThe filter can be configured as a matching condition for a route-policy using a command, such as the if-match extcommunity-list encapsulation aaa command.\nThe undo ip extcommunity-list encapsulation command deletes the encapsulation extended community filter of a specified node.\nConfiguration Impact\nAfter the command is run, routes that do not match any rules of the filter are filtered out."
}