{
    "PageTitle": "ip extcommunity-list segmented-nh advanced",
    "FuncDef": "The ip extcommunity-list segmented-nh advanced command configures a segmented-nh attribute, which is an advanced extended community attribute.\nThe undo ip extcommunity-list segmented-nh advanced command deletes a segmented-nh attribute.\nBy default, no segmented-nh attribute is configured.",
    "CLIs": [
        "ip extcommunity-list segmented-nh advanced <segmented-nh-name> [ index <index-value> ] <matchMode> <regular>",
        "undo ip extcommunity-list segmented-nh advanced <segmented-nh-name> [ index <index-value> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "segmented-nh-name",
            "Info": "Sets a name for a segmented-nh attribute list.\nThe value is a string of 1 to 51 characters."
        },
        {
            "Parameters": "index index-value",
            "Info": "Specifies a sequence number.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "matchMode",
            "Info": "Sets the matching mode of the extended community filter.\nThe value is an enumerated type:\npermit: Indicates the permit match mode.deny: Indicates the deny match mode."
        },
        {
            "Parameters": "regular",
            "Info": "Sets a regular expression for a segmented-nh attribute.\nThe value is a string of 1 to 1024 characters, in the text format."
        },
        {
            "Parameters": "advanced",
            "Info": "Indicates an advanced extended community attribute.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip extcommunity-list segmented-nh advanced bb deny 0755:*"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn an NG MVPN scenario using segmented tunnels, to configure a segmented-nh (with the full name being segmented next-hop) attribute for intra-AS I-PMSI A-D routes, run the ip extcommunity-list segmented-nh command.\nPrecautions\nThe name of a basic segmented-nh extended community attribute and that of an advanced segmented-nh extended community attribute are mutually exclusive.\nFor an advanced segmented-nh extended community filter, if the segmented-nh attribute is set to be in the format of 4-byte AS number:2-byte user-defined number, the filtering rule that uses the segmented-nh-based regular expression is affected by the as-notation plain command:\nIf the as-notation plain command is run, route matching can succeed only after the regular expression is set to be in the format of integral 4-byte AS number:2-byte user-defined number.If the as-notation plain command is not run, route matching can succeed only after the regular expression is set to be in the format of 4-byte AS number in dotted notation:2-byte user-defined number.If the as-notation plain command is run after the regular expression is configured, you need to reconfigure the regular expression; otherwise, route matching may fail against an import or export route-policy, causing a network fault."
}