{
    "PageTitle": "apply large-community-list",
    "FuncDef": "The apply large-community-list command applies a BGP Large-Community list.\nThe undo apply large-community-list command cancels the configuration.\nBy default, the BGP Large-Community list is not set.",
    "CLIs": [
        "apply large-community-list <large-community-list-name> { additive | overwrite | delete }",
        "undo apply large-community-list [ <large-community-list-name> ]"
    ],
    "ParentView": [
        "Route-policy view"
    ],
    "ParaDef": [
        {
            "Parameters": "additive",
            "Info": "Adds a value to the Large Community attribute carried in routes.\n-"
        },
        {
            "Parameters": "overwrite",
            "Info": "Overwrites the existing values of the Large-Community attribute.\n-"
        },
        {
            "Parameters": "delete",
            "Info": "Deletes the values of the Large-Community attribute carried in the matched routes.\n-"
        },
        {
            "Parameters": "large-community-list large-community-list-name",
            "Info": "Specifies the name of a BGP Large-Community list.\nThe value is a string of 1 to 63 case-sensitive characters. Spaces are allowed only when the string is enclosed in double quotation marks (\" \")."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip large-community-list largecommunity1",
            "[*HUAWEI-large-community-list-largecommunity1] quit",
            "[*HUAWEI] ip as-path-filter 8 permit ^2",
            "[*HUAWEI] route-policy setlargecommunity permit node 16",
            "[*HUAWEI-route-policy] if-match as-path-filter 8",
            "[*HUAWEI-route-policy] apply large-community-list largecommunity1 overwrite"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe Large-Community attribute is a private attribute of BGP and can be flexibly applied to route-policies. To modify or set values of the Large-Community attribute in BGP routes, run the apply large-community-list command.\nConfiguration Impact\nIf the apply large-community-list command is run in a route-policy, the values of the Large-Community attribute in the BGP routes filtered by the route-policy will be changed to the value in the route-policy.\nPrecautions\nIf the apply large-community-list command is run more than once, the latest configuration overrides the previous one."
}