{
    "PageTitle": "apply large-community",
    "FuncDef": "The apply large-community command sets a value for the BGP Large-Community attribute.\nThe undo apply large-community command deletes the value set for the BGP Large-Community attribute.\nBy default, the BGP Large-Community attribute is not set.",
    "CLIs": [
        "apply large-community { <aa:bb:cc> } &<1-16> { additive | overwrite | delete }",
        "apply large-community none",
        "undo apply large-community"
    ],
    "ParentView": [
        "Route-policy view"
    ],
    "ParaDef": [
        {
            "Parameters": "aa:bb:cc",
            "Info": "Specifies a value of the Large-Community attribute.\nThe value is in the format of aa:bb:cc. The values of aa, bb, and cc are integers ranging from 0 to 4294967295."
        },
        {
            "Parameters": "additive",
            "Info": "Adds a value to the Large Community attribute carried in routes.\n-"
        },
        {
            "Parameters": "overwrite",
            "Info": "Overwrites the existing values of the Large-Community attribute.\n-"
        },
        {
            "Parameters": "delete",
            "Info": "Deletes the values of the Large-Community attribute carried in the matched routes.\n-"
        },
        {
            "Parameters": "none",
            "Info": "Deletes all the Large-Community values set for the BGP routes to be imported.If the parameter is applied to BGP, it takes effect on the routes to be imported, not on the routes to be advertised.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip as-path-filter 8 permit ^10_",
            "[*HUAWEI] route-policy setlargecommunity permit node 16",
            "[*HUAWEI-route-policy] if-match as-path-filter 8",
            "[*HUAWEI-route-policy] apply large-community 10:3:20 overwrite"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe Large-Community attribute is a private attribute of BGP and can be flexibly applied to route-policies. To modify or set values of the Large-Community attribute in BGP routes, run the apply large-community command.\nConfiguration Impact\nIf the apply large-community command is run in a route-policy, the values of the Large-Community attribute in the BGP routes filtered by the route-policy will be changed to the value in the route-policy.\nAssume that the Large Community attribute in the original BGP routes is set to 10:3:20 and 10:3:30. For the BGP routes that meet the filtering conditions:\nIf the apply large-community 20:4:30 overwrite command has been run, the values of the Large-Community attribute are changed to 20:4:30.If the apply large-community 10:3:20 delete command has been run, the values of the Large-Community attribute are changed to 10:3:30.If the apply large-community 20:4:30 additive command has been run, the value 20:4:30 is added to the Large-Community attribute list including 10:3:20 and 10:3:30 already.If the apply large-community none command has been run, all the values set for the Large-Community attribute are deleted.\n\nPrecautions\nIf the apply large-community command is run more than once, the latest configuration overrides the previous one."
}