{
    "PageTitle": "apply extcommunity redirect vpn-target",
    "FuncDef": "The apply extcommunity redirect vpn-target command applies a redirection VPN-Target extended community attribute to routes matching specified filtering rules.\nThe undo apply extcommunity redirect vpn-target command restores the default configuration.\nBy default, no redirection VPN-Target extended community attribute is applied to routes matching specified filtering rules.",
    "CLIs": [
        "apply extcommunity redirect vpn-target <extCmntyValue>",
        "undo apply extcommunity redirect vpn-target"
    ],
    "ParentView": [
        "Route-policy view"
    ],
    "ParaDef": [
        {
            "Parameters": "extCmntyValue",
            "Info": "Indicates the value of VPN-Target extended community.\nThe value of VPN-Target extended community can be expressed in any of the following formats:\n2-byte AS number:4-byte user-defined number, for example, 1:3. The AS number ranges from 0 to 65535, and the user-defined number ranges from 0 to 4294967295.IPv4-address:2-byte user-defined number, for example, 192.168.122.15:1. The IP address ranges from 0.0.0.0 to 255.255.255.255, and the user-defined number ranges from 0 to 65535.Integral 4-byte AS number:2-byte user-defined number, for example, 0:3 or 65537:3. An AS number ranges from 65536 to 4294967295. A user-defined number ranges from 0 to 65535.4-byte AS number in dotted notation:2-byte user-defined number, for example, 0.0:3 or 0.1:0. A 4-byte AS number in dotted notation is in the format of x.y, where x and y are integers ranging from 1 to 65535 and from 0 to 65535, respectively. A user-defined number ranges from 0 to 65535."
        },
        {
            "Parameters": "vpn-target",
            "Info": "Indicates the VPN-Target extended community.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] route-policy aaa permit node 10",
            "[*HUAWEI-route-policy] apply extcommunity redirect vpn-target 100:1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo apply a redirection extended community attribute to BGP FlowSpec routes matching specified filtering rules, run the apply extcommunity redirect command. To enable BGP FlowSpec routes to redirect traffic to a VPN instance with RT as-number:nn, specify the vpn-target as-number:nn number to add a VPN target extended community attribute to these routes. Upon receipt of the traffic, the VPN instance will forward the traffic based on its own forwarding table.\nPrerequisites\nA route-policy has been configured.\nConfiguration Impact\nIf a route matches the filtering rules of a specified route-policy, the redirection extended community attribute will be applied to the route."
}