{
    "PageTitle": "apply ipv6 next-hop",
    "FuncDef": "The apply ipv6 next-hop command configures an IPv6 next hop address for a BGP route using a route-policy.\nThe undo apply ipv6 next-hop command cancels the configuration.\nBy default, IPv6 next hop addresses of BGP routes are not configured using a route-policy.",
    "CLIs": [
        "apply ipv6 next-hop { <address> | peer-address | blackhole }",
        "undo apply ipv6 next-hop { <address> | peer-address | blackhole }"
    ],
    "ParentView": [
        "Route-policy view"
    ],
    "ParaDef": [
        {
            "Parameters": "address",
            "Info": "Specifies the IPv6 next hop address.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "peer-address",
            "Info": "If the apply ipv6 next-hop peer-address command is run in a route-policy that is used as an export route-policy on a device, the device sets the next hop address of a route to be advertised to a peer to its own IPv6 address.\nIf the command is run in a route-policy that is used as an import route-policy, the device sets the next hop address of a filtered route that has been received from the peer to the peer's IPv6 address.\n-"
        },
        {
            "Parameters": "blackhole",
            "Info": "Adds a black-hole flag to a route.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] route-policy policy permit node 10",
            "[*HUAWEI-route-policy] apply ipv6 next-hop 2001:db8:2001::1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure an IPv6 next hop address for a BGP route, run the apply ipv6 next-hop command.\nIn BGP, the route-policy can be an import or export policy. Even if the next hop address configured in the route-policy is unreachable, the BGP peers still adds the routes to the BGP routing table, but the routes are invalid and cannot be installed in the IPv6 routing table.\nTo add a black-hole flag to a route, run the apply ipv6 next-hop blackhole command.\nPrerequisites\nA route-policy has been configured using the route-policy command.\nConfiguration Impact\nAfter a BGP route matches a route-policy, the IPv6 next hop address of the BGP route is changed.\nPrecautions\nWhen a route-policy is specified in the import-route and network commands, the apply ipv6 next-hop clause in the route-policy does not take effect."
}