{
    "PageTitle": "apply aigp",
    "FuncDef": "The apply aigp command configures an Accumulated Interior Gateway Protocol metric (AIGP) value for BGP routes.\nThe undo apply aigp command deletes the AIGP value configured for BGP routes.\nBy default, no AIGP value is configured for BGP routes.",
    "CLIs": [
        "apply aigp { <cost> | inherit-cost }",
        "undo apply aigp"
    ],
    "ParentView": [
        "Route-policy view"
    ],
    "ParaDef": [
        {
            "Parameters": "cost",
            "Info": "Specify an AIGP value for BGP routes.\nThe value is an integer ranging from 0 to 4294967295."
        },
        {
            "Parameters": "inherit-cost",
            "Info": "Allows BGP routes to inherit the costs of the routes to which the BGP routes recurse as their AIGP values.\nThe apply aigp cost command is mutually exclusive with the apply aigp inherit-cost command.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] route-policy policy1 permit node 10",
            "[*HUAWEI-route-policy] apply aigp 200"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] route-policy policy2 permit node 10",
            "[*HUAWEI-route-policy] apply aigp inherit-cost"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAn AIGP administrative domain is a set of autonomous systems (ASs) in a common administrative domain. The AIGP attribute is an optional non-transitive BGP route attribute. The IGP metric value accumulates in the AIGP attribute during route transmission. After the AIGP attribute is configured in an AIGP administrative domain, BGP selects paths based on the AIGP value. Therefore, all devices in the AIGP administrative domain use the optimal routes to forward data.\nOnly after an if-match clause is configured in a route-policy and the apply aigp command is run can the AIGP value take effect on routes that match the if-match clause.\nPrerequisites\nA route-policy has been configured using the route-policy command."
}