{
    "PageTitle": "community",
    "FuncDef": "The community command configures community attributes for a BGP community list.\nThe undo community command deletes community attributes from a BGP community list.\nBy default, no community attributes are configured for a BGP community list.",
    "CLIs": [
        "community { <cmntyValue> | <cmntyNum> | internet | no-advertise | no-export | no-export-subconfed } &<1-100>",
        "community { <cmntyValue> | <cmntyNum> | internet | no-advertise | no-export | no-export-subconfed } [ description <description-text> ]",
        "undo community { <cmntyValue> | <cmntyNum> | internet | no-advertise | no-export | no-export-subconfed } &<1-100>",
        "undo community all"
    ],
    "ParentView": [
        "Community attribute list view"
    ],
    "ParaDef": [
        {
            "Parameters": "cmntyValue",
            "Info": "Specifies a community number.\naa and nn are integers, each ranging from 0 to 65535."
        },
        {
            "Parameters": "cmntyNum",
            "Info": "Specifies a community attribute, in the format of aa:nn.\nThe value is an integer ranging from 0 to 4294967295."
        },
        {
            "Parameters": "internet",
            "Info": "Advertises routes to any peer. By default, all routes belong to the Internet community.\n-"
        },
        {
            "Parameters": "no-advertise",
            "Info": "Prevents the device from advertising routes with this attribute to other BGP peers.\n-"
        },
        {
            "Parameters": "no-export",
            "Info": "Prevents the device from advertising routes with this attribute to other ASs.\n-"
        },
        {
            "Parameters": "no-export-subconfed",
            "Info": "Prevents the device from advertising routes with this attribute to other ASs or sub-ASs.\n-"
        },
        {
            "Parameters": "description description-text",
            "Info": "Description of the Community value.\nThe value is a string of 1 to 80 case-sensitive characters, spaces supported."
        },
        {
            "Parameters": "all",
            "Info": "Deletes all community attributes from a BGP community list.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip community-list community1",
            "[~HUAWEI-community-list-community1] community 123"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nCommunity attributes are BGP-specific and are used to simplify routing policy application and network maintenance and management. A community is a set of destination addresses with the same characteristics. These addresses have no physical boundary and are independent of their ASs. They share one or multiple community attributes. To configure community attributes for a BGP community list, run the community command."
}