{
    "PageTitle": "display ip extcommunity-filter",
    "FuncDef": "The display ip extcommunity-filter command displays detailed configurations of the VPN-Target extended community filter.",
    "CLIs": [
        "display ip extcommunity-filter [ <basEcfIndex> | <advEcfIndex> ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "basEcfIndex",
            "Info": "Specifies the basic VPN-Target extended community filter number.\nThe value is an integer that ranges from 1 to 199."
        },
        {
            "Parameters": "advEcfIndex",
            "Info": "Specifies the advanced VPN-Target extended community filter number.\nThe value is an integer that ranges from 200 to 399."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display ip extcommunity-filter",
            "Extended Community filter Number: 10",
            "  index: 10     permit rt 100:10",
            "Extended Community filter Number: 200",
            "  index: 10     permit 650",
            "Extended Community filter basic filter: bas-abc",
            "  index: 10     permit rt 200:10",
            "Extended Community filter advanced filter: adv-abc",
            "  index: 10     deny 1.1.1.1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe extended community attribute is a BGP-specific attribute. An extended community filter is used to filter VPN routes.\nYou can run the display ip extcommunity-filter command to:\nView detailed information about a configured VPN-Target extended community filter.Check whether an VPN-Target extended community filter has been deleted after running the undo ip excommunity-filter command.\n\nPrecautions\nThe display ip extcommunity-filter command:\nDisplays the configuration information about a specified VPN-Target extended community filter if the number or name of the VPN-Target extended community filter is specified.Displays the configuration information about all VPN-Target extended community filters if neither the number nor name of the VPN-Target extended community filter is specified.Does not display any information if the VPN-Target extended community filter does not exist in the system or the VPN-Target extended community filter that is queried does not exist."
}