{
    "PageTitle": "if-match ip route-source ip-prefix",
    "FuncDef": "The if-match ip route-source ip-prefix command configures a filtering rule that is based on IP addresses of the source devices from which routes are received.\nThe undo if-match ip route-source ip-prefix command cancels the configuration.\nBy default, no filtering rule based on IP addresses of the source devices from which routes are received is configured.",
    "CLIs": [
        "if-match ip route-source ip-prefix <ip-prefix-name>",
        "undo if-match ip route-source [ ip-prefix <ip-prefix-name> ]"
    ],
    "ParentView": [
        "Route-policy view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-prefix ip-prefix-name",
            "Info": "Specifies the name of the IP prefix list.\nThe name is a string of 1 to 169 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip ip-prefix p1 permit 10.0.192.0 8 greater-equal 17 less-equal 18",
            "[*HUAWEI] route-policy policy permit node 10",
            "[*HUAWEI-route-policy] if-match ip route-source ip-prefix p1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe if-match ip command is widely applied. The filtering rule configured using this command takes effect only after an IP prefix or an ACL is configured. For example:\nIf the if-match ip next-hop ip-prefix aa command is used but the IP prefix aa is not configured, all routes are permitted. This is the same case when the ACL is used.If the if-match ip next-hop ip-prefix aa command is used after the ip ip-prefix aa permit 1.1.1.1 32 command is used, the routes with the next hop address 1.1.1.1 are permitted. This is the same case when the ACL is used.\n\nPrerequisites\nA route-policy has been configured using the route-policy command.\nAn IP prefix has been configured using the ip ip-prefix command.\nConfiguration Impact\nWhen you filter routes based on the source addresses, the routes that match the filtering rule are permitted and the route that do not match the filtering rule are denied.\nPrecautions\nIf the next hop address or source address of a route to be filtered is 0.0.0.0, by default, the system considers the mask length as 0 and matches the route.\nIf the next hop address or source address of a route to be filtered is not 0.0.0.0, by default, the system considers the mask length as 32 and matches the route."
}