{
    "PageTitle": "ip ip-prefix",
    "FuncDef": "The ip ip-prefix command configures an IP prefix list or one entry in the IP prefix list.\nThe undo ip ip-prefix command deletes an IP prefix list or one entry in the IP prefix list.\nBy default, no IP prefix list is configured.",
    "CLIs": [
        "ip ip-prefix <ip-prefix-name> [ index <index-number> ] <matchMode> <ipv4-address> <masklen> [ match-network ] [ greater-equal <greater-equal-value> ] [ less-equal <less-equal-value> ]",
        "undo ip ip-prefix <ip-prefix-name> [ index <index-number> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-prefix-name",
            "Info": "Specifies the name of an IP prefix list.\nThe name is a string of 1 to 169 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "index index-number",
            "Info": "Specifies the sequence number of the entry in the IP prefix list.\nThe value is an integer ranging from 1 to 4294967295.\nBy default, the sequence number increases with a step of 10 according to the configuration order, and the first number is 10."
        },
        {
            "Parameters": "matchMode",
            "Info": "Specifies the matching mode of the IP prefix list.\nThe value is an enumerated type:\npermit: Specifies the matching mode of the IP prefix list as permit. In permit mode, if the IP address to be filtered is in the defined prefix range, the IP address matches the route-policy and no longer match against the next entry. Otherwise, the IP address continues to match against the next entry.deny: Specifies the matching mode of the IP prefix list as deny. In deny mode, if the IP address to be filtered is in the defined prefix range, the IP address fails to match the route-policy and cannot match against the next entry. Otherwise, the IP address continues to match against the next entry."
        },
        {
            "Parameters": "ipv4-address",
            "Info": "Specifies the IP address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "masklen",
            "Info": "Specifies the mask length.\nThe value is an integer ranging from 0 to 32."
        },
        {
            "Parameters": "match-network",
            "Info": "Specifies to match the network address. match-network is used to filter routes to a specified IP address and can be configured only when ipv4-address is 0.0.0.0. For example, the ip ip-prefix prefix1 permit 0.0.0.0 8 command filters all routes with mask length 8, whereas the ip ip-prefix prefix1 permit 0.0.0.0 8 match-network command filters all routes to the IP address range from 0.0.0.1 to 0.255.255.255.\n-"
        },
        {
            "Parameters": "greater-equal greater-equal-value",
            "Info": "Specifies the minimum value of the mask length range.\nThe value of greater-equal-value is subject to the following rule: masklen<=greater-equal-value<=less-equal-value<=32."
        },
        {
            "Parameters": "less-equal less-equal-value",
            "Info": "Specifies the maximum value of the mask length range.\nThe value of less-equal-value is subject to the following rule: masklen<=greater-equal-value<=less-equal-value<=32."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip ip-prefix p1 permit 10.0.0.0 8 greater-equal 17 less-equal 18"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip ip-prefix p2 permit 0.0.0.0 0 greater-equal 17 less-equal 18"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip ip-prefix p3 index 10 deny 0.0.0.0 8 match-network",
            "[*HUAWEI] ip ip-prefix p3 index 20 permit 0.0.0.0 0 less-equal 32"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAn IP prefix list can be used as a filter or as filtering conditions of a route-policy when it is used with the if-match command.\nEach entry in an IP prefix list can be used as a filtering rule. When a route to be filtered matches an entry, whether the route matches the IP prefix list is determined by the matching mode. A route to be filtered matches an entry or entries based on the following rules:\nSequential matching: The route has to match the entries in the IP prefix list in ascending order of their values. Therefore, specifying in a required sequence is recommended.One-time matching: If a route matches one entry, the route matches the IP prefix list and will not be matched against the next entry.Matching failure by default: If a route fails to match any of the entries, it fails to match the IP prefix list.\nThe following example shows how different IP prefix lists take effect on the routes 1.1.1.0/24, 1.1.1.1/32, 1.1.1.0/26, 2.2.2.0/24, and 1.1.0.0/16.\nCase1:ip ip-prefix aa index 10 permit 1.1.1.0 24\nMatching result: Only the route 1.1.1.0/24 is permitted, and the other routes are denied.This is a single-node accurate matching case, which indicates that only the route whose destination IP address and mask are the same as those specified by the entry meets the filtering conditions. In addition, permit is configured as the matching mode. Therefore, the route 1.1.1.0/24 is permitted, and other routes are denied because they fail to meet the filtering conditions.\nCase2:ip ip-prefix aa index 10 deny 1.1.1.0 24\nMatching result: All routes are denied.This is also a single-node accurate matching case. deny is configured as the matching mode. Therefore, the route 1.1.1.0/24 is denied, and the other routes are denied based on the rule of matching failure by default because they fail to meet the filtering conditions.\nCase3:ip ip-prefix aa index 10 permit 1.1.1.0 24 less-equal 32\nMatching result: The routes 1.1.1.0/24, 1.1.1.1/32, and 1.1.1.0/26 are permitted, and the other routes are denied.This is also a single-node accurate matching case. permit is configured as the matching mode, and less-equal is set to 32. Therefore, the routes with 1.1.1.0 as the prefix and the mask ranging from 24 to 32 can be permitted, and the other routes are denied based on the rule of matching failure by default because they fail to meet the filtering conditions.\nCase4:ip ip-prefix aa index 10 permit 1.1.1.0 24 greater-equal 24 less-equal 32\nMatching result: The routes 1.1.1.0/24, 1.1.1.1/32, and 1.1.1.0/26 are permitted, and the other routes are denied.This is also a single-node accurate matching case. permit is configured as the matching mode, greater-equal is set to 24, and less-equal is set to 32. Therefore, the routes with 1.1.1.0 as the prefix and the mask ranging from 24 to 32 can be permitted, and the other routes are denied based on the rule of matching failure by default because they fail to meet the filtering conditions. This case is similar to case 3 in terms of the matching result.\nCase5:ip ip-prefix aa index 10 permit 1.1.1.0 24 greater-equal 26\nMatching result: The routes 1.1.1.1/32 and 1.1.1.0/26 are permitted, and the other routes are denied.This is also a single-node accurate matching case. permit is configured as the matching mode, and greater-equal is set to 26. Therefore, the routes with 1.1.1.0 as the prefix and the mask ranging from 26 to 32 can be permitted, and the other routes are denied based on the rule of matching failure by default because they fail to meet the filtering conditions.\nCase6:ip ip-prefix aa index 10 permit 1.1.1.0/24 greater-equal 26 less-equal 32\nMatching result: The routes 1.1.1.1/32 and 1.1.1.0/26 are permitted, and the other routes are denied.This is also a single-node accurate matching case. permit is configured as the matching mode, greater-equal is set to 26, and less-equal is set to 32. Therefore, the routes with 1.1.1.0 as the prefix and the mask ranging from 26 to 32 can be permitted, and the other routes are denied based on the rule of matching failure by default because they fail to meet the filtering conditions. This case is similar to case 5 in terms of the matching result.\nCase7:ip ip-prefix aa index 10 deny 1.1.1.0 24\nip ip-prefix aa index 20 permit 1.1.1.1 32\nMatching result: The route 1.1.1.1/32 is permitted, and the other routes are denied.This is a multi-node accurate matching case. deny is configured as the matching mode of the matching entry indexed 10, and therefore the route 1.1.1.0/24 is denied by the matching entry indexed 10 based on the rule of one-time matching. The route 1.1.1.1/32 fails to match the filtering conditions, and it is then matched against the entry indexed 20 for which permit is configured as the matching mode. Consequently, the route 1.1.1.1/32 matches the filtering conditions of the entry indexed 20. The other routes are denied based on the rule of matching failure by default because they fail to meet the filtering conditions.\nIf the IP prefix is 0.0.0.0 and you specify a mask and a mask length range after this IP prefix, all routes with the mask length within the specified mask length range are denied or permitted, regardless of the mask.\nCase8:ip ip-prefix aa index 10 permit 0.0.0.0 8 less-equal 32\nMatching result: The routes 1.1.1.0/24, 1.1.1.1/32, 1.1.1.0/26, 2.2.2.0/24, and 1.1.0.0/16 are all permitted.The mask length range is from 8 to 32, 0.0.0.0 is specified as the IP address, and permit is configured as the matching mode. Therefore, all routes with the mask length within the range are permitted.\nCase9:ip ip-prefix aa index 10 deny 0.0.0.0 24 less-equal 32\nip ip-prefix aa index 20 permit 0.0.0.0 0 less-equal 32\nMatching result: The route 1.1.0.0/16 is permitted, and the other routes are denied.For the entry indexed 10, the mask length range is from 24 to 32, 0.0.0.0 is specified as the IP address, and deny is configured as the matching mode. Therefore, all routes with the mask length within the range are denied, and the route 1.1.0.0/16 that fails to match its filtering conditions is then matched against the entry indexed 20. For the entry indexed 20, the mask length range is from 0 to 32, 0.0.0.0 is specified as the IP address, and permit is configured as the matching mode. Therefore, the route 1.1.0.0/16 is permitted by the entry indexed 20.\nCase10:ip ip-prefix aa index 10 deny 2.2.2.0 24\nip ip-prefix aa index 20 permit 0.0.0.0 0 less-equal 32\nMatching result: All routes except the route 2.2.2.0/24 are permitted.For the entry indexed 10, deny is configured as the matching mode. Therefore, the route 2.2.2.0/24 that matches its filtering conditions is denied, and the other routes that fail to match the filtering conditions are then matched against the entry indexed 20. For the entry indexed 20, the mask length range is from 0 to 32, 0.0.0.0 is specified as the IP address, and permit is configured as the matching mode. Therefore, all routes except the route 2.2.2.0/24 are permitted by the entry indexed 20.\n\n\nConfiguration Impact\nIf you create an entry whose has existed in the same IP prefix list but has different filtering rules, the new entry overwrites the existing one.\nPrecautions\nBecause of the matching failure by default, if one or more than one entry with deny as the matching mode is created, create an entry using the ip ip-prefix ip-prefix-name [ index index-number ] permit 0.0.0.0 0 less-equal 32 command so that all IPv4 routes may match the IP prefix list.\nIf ipv4-address mask-length is specified as 0.0.0.0 0, only default routes are matched.\nIf ipv4-address mask-length is set to 0.0.0.0 0 less-equal 32, all routes are matched.\nThe IP prefix lists in use cannot be deleted.\nAfter a configuration is delivered, the device checks the validity of the parameters in the configuration and processes these parameters. After the processing, the generated configuration is the result of the AND calculation between the specified ipv4-address and mask-length. For example, if the specified ipv4-address and mask-length are 1.1.1.1 and 24, respectively, the generated configuration is 1.1.1.0 24.\nIf the ipv4-address in the generated configuration is 0.0.0.0, the configuration matches all IPv4 addresses. For details about the router filtering rules, see \"Feature Description\" - \"IP Routing\" - \"Routing Policy\" in the product manual."
}