{
    "PageTitle": "ip ipv6-prefix description",
    "FuncDef": "The ip ipv6-prefix description command configures the description information of the IPv6 prefix list.\nThe undo ip ipv6-prefix description command deletes the description information of the IPv6 prefix list.\nBy default, no description information of the IPv6 prefix list is configured.",
    "CLIs": [
        "ip ipv6-prefix <ipv6-prefix-name> description <text>",
        "undo ip ipv6-prefix <ipv6-prefix-name> description [ <text> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv6-prefix-name",
            "Info": "Specifies the name of the IPv6 prefix list.\nThe name is a string of 1 to 169 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "description text",
            "Info": "Specifies the description information of the IPv6 prefix list.\nIt is a string of 1 to 80 characters case-sensitive characters, with spaces supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip ipv6-prefix abc description aaa"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe ip ipv6-prefix command is used to configure an IPv6 prefix list. An IPv6 prefix can be used as a filter by various protocols or used with a route-policy.\nThe ip ipv6-prefix command can be used with the following commands to filter routes to be advertised globally with an IPv6 prefix list as a filtering condition:filter-policy export(OSPFv3)ipv6 filter-policy export(IS-IS)filter-policy export(BGP)\nThe ip ipv6-prefix command can be used with the following commands to filter routes to be accepted globally with an IPv6 prefix list as a filtering condition:filter-policy import(OSPFv3)ipv6 filter-policy import(IS-IS)filter-policy import(BGP)\nThe ip ipv6-prefix command can be used with the following commands to configure a route-policy based on an IPv6 prefix list for a specific peer:peer ip-prefix (BGP)\nThe ipv6 import-route isis level-1 into level-2 filter-policy ipv6-prefix [ tag ] command is used to control the route leaking from a Level-1 area to a Level-2 area.The ipv6 import-route isis level-2 into level-1 filter-policy ipv6-prefix [ tag ] command is used to control route leaking from an IS-IS Level-2 area to an IS-IS Level-1 area.The ip ipv6-prefix command and the if-match ipv6 command can be used to test received or sent routes based on an IPv6 prefix list.\nAn IPv6 prefix list can contain several entries, and each entry specifies an IPv6 prefix range. The relationship between the nodes is \"OR\". That is, if a route matches one entry, the route matches the IPv6 prefix list; if a route does not match any entry, the route fails to match the IPv6 prefix list.\nAn IPv6 prefix range is determined by prefix-length and greater-equal-value, less-equal-value. If mask-length and greater-equal-value, less-equal-value are specified, an IPv6 address must match the prefix range .\n\nPrecautions\nThe IPv6 prefix lists in use cannot be deleted."
}