{
    "PageTitle": "backup hot-standby (SRv6 TE Policy view)",
    "FuncDef": "The backup hot-standby enable command enables hot standby (HSB) for an SRv6 TE Policy.\nThe undo backup hot-standby enable command deletes the preceding configuration.\nThe backup hot-standby disable command disables HSB for an SRv6 TE Policy.\nThe undo backup hot-standby disable command deletes the preceding configuration.\nThe undo backup hot-standby command deletes the HSB configuration of an SRv6 TE Policy and allows a device to inherit the configuration of the srv6-te-policy backup hot-standby enable command run in the Segment Routing IPv6 view.\nBy default, the configuration of the srv6-te-policy backup hot-standby enable command run in the Segment Routing IPv6 view is inherited directly.",
    "CLIs": [
        "backup hot-standby { enable | disable }",
        "undo backup hot-standby [ { enable | disable } ]"
    ],
    "ParentView": [
        "SRv6 TE policy view"
    ],
    "ParaDef": [
        {
            "Parameters": "enable",
            "Info": "Enables HSB for an SRv6 TE Policy.\n-"
        },
        {
            "Parameters": "disable",
            "Info": "Disables HSB for an SRv6 TE Policy. After you run the backup hot-standby disable command, HSB path information about the SRv6 TE Policy is deleted.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] segment-routing ipv6",
            "[*HUAWEI-segment-routing-ipv6] srv6-te policy policy1 endpoint 1::1 color 100",
            "[*HUAWEI-segment-routing-ipv6-policy-policy1] backup hot-standby disable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe srv6-te-policy backup hot-standby enable command enables HSB for all SRv6 TE Policies. However, the backup hot-standby command enables HSB for a single SRv6 TE Policy. If the srv6-te-policy backup hot-standby enable command and the backup hot-standby command are both run for an SRv6 TE Policy, the backup hot-standby command configuration takes precedence."
}