{
    "PageTitle": "pbb i-vsi enable",
    "FuncDef": "The pbb i-vsi enable command enables an I-VSI in PBB VPLS.\nThe undo pbb i-vsi enable command disables an I-VSI in PBB VPLS.\nBy default, an I-VSI in PBB VPLS is disabled.",
    "CLIs": [
        "pbb i-vsi enable",
        "undo pbb i-vsi enable"
    ],
    "ParentView": [
        "VSI--PBBENABLE view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] vsi vsi1",
            "[*HUAWEI-vsi-vsi1] pwsignal ldp",
            "[*HUAWEI-vsi-vsi1-ldp] vsi-id 1",
            "[*HUAWEI-vsi-vsi1-ldp] quit",
            "[*HUAWEI-vsi-vsi1] pbb i-vsi enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nPBB VPLS divides an HVPLS network into an access VPLS domain and a backbone VPLS domain by deploying I-VSIs and B-VSIs on access-, aggregation-, and core-layer devices. In the access VPLS domain, I-VSIs provide VPLS services; in the backbone VPLS domain, B-VSIs provide VPLS services.\nIn PBB VPLS, VSIs are classified as either I-VSIs or B-VSIs. An I-VSI encapsulates packets into PBB frames and is bound to an AC interface to determine a local CE. An I-VSI must be enabled before being configured. To enable an I-VSI, run the pbb i-vsi enable command.\nPrerequisites\nPBB VPLS uses LDP as the signaling protocol. A signaling protocol and a VSI ID have been configured using the pwsignal ldp and vsi-id commands, respectively.\nThe IDs of an I-VSI and a B-VSI on the local end must be different.The I-VSIs on the local and remote ends can have either the same ID or different IDs. The ID of an I-VSI does not participate in PW negotiation and therefore only needs to be locally unique.\n\nConfiguration Impact\nThe undo pbb i-vsi enable command deletes all PBB VPLS configurations of an I-VSI. Therefore, exercise caution when using this command.\nPrecautions\nBoth the pbb i-vsi enable and vsi vsi-name i-vsi commands can enable an I-VSI. You can use either one.Enable I-VSIs and B-VSIs before configuring them. The I-VSIs and B-VSIs can be configured in a random order.If a peer address is configured for a VSI by running the peer command in the VSI-LDP view, the VSI cannot be configured as an I-VSI.An mVSI cannot be configured as an I-VSI.An I-VSI can be bound to an AC interface but cannot be configured with a peer address.Currently, PBB VPLS supports only the P2P service type. This means that an I-VSI can be bound only to one AC interface. If m CEs connecting to a local PE need to communicate with m CEs connecting to n peer PEs, m x n I-VSIs must be enabled."
}