{
    "PageTitle": "pbb b-vsi enable",
    "FuncDef": "The pbb b-vsi enable command enables a B-VSI in PBB VPLS.\nThe undo pbb b-vsi enable command disables a B-VSI in PBB VPLS.\nBy default, no B-VSI is enabled in PBB VPLS.",
    "CLIs": [
        "pbb b-vsi enable",
        "undo pbb b-vsi enable"
    ],
    "ParentView": [
        "VSI--PBBENABLE view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] vsi vsi2",
            "[*HUAWEI-vsi-vsi2] pwsignal ldp",
            "[*HUAWEI-vsi-vsi2-ldp] vsi-id 2",
            "[*HUAWEI-vsi-vsi2-ldp] quit",
            "[*HUAWEI-vsi-vsi2] pbb b-vsi enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nPBB VPLS divides an HVPLS network into an access VPLS domain and a backbone VPLS domain by deploying I-VSIs and B-VSIs on access-, aggregation-, and core-layer devices. In the access VPLS domain, I-VSIs provide VPLS services; in the backbone VPLS domain, B-VSIs provide VPLS services.\nVSIs in PBB VPLS consist of I-VSIs and B-VSIs. A B-VSI processes B-MAC addresses and uses the configured peer address to determine a PW's remote PE. A B-VSI must be enabled before being configured. To enable a B-VSI, run the pbb b-vsi enable command.\nPrerequisites\nPBB VPLS uses LDP as the signaling protocol. A signaling protocol and a VSI ID have been configured using the pwsignal ldp and vsi-id commands, respectively.\nThe IDs of an I-VSI and a B-VSI on the local end must be different.\nConfiguration Impact\nThe undo pbb b-vsi enable command deletes all PBB VPLS configurations of a B-VSI and unbinds I-VSIs from the B-VSI. Therefore, exercise caution when using this command.\nPrecautions\nThe pbb b-vsi enable and vsi vsi-name b-vsi commands can both enable a B-VSI. You can use either one.Enable I-VSIs and B-VSIs before configuring them. The I-VSIs and B-VSIs can be configured in a random order.A VSI bound to an AC interface cannot be configured as a B-VSI.An mVSI cannot be configured as a B-VSI.A B-VSI can be configured with a peer address, but cannot be bound to any AC interface."
}