{
    "PageTitle": "pbb i-tag",
    "FuncDef": "The pbb i-tag command configures an I-tag in PBB VPLS.\nThe undo pbb i-tag command deletes an I-tag in PBB VPLS.\nBy default, no I-tag is configured in PBB-VPLS.",
    "CLIs": [
        "pbb i-tag <i-tag>",
        "undo pbb i-tag",
        "undo pbb i-tag <i-tag>"
    ],
    "ParentView": [
        "VSI-IVSI-P2P view",
        "VSI-IVSI-BEVPNINTERWORK view"
    ],
    "ParaDef": [
        {
            "Parameters": "i-tag",
            "Info": "Specifies an I-tag in PBB VPLS.\nThe value is an integer ranging from 0 to 16777215."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] vsi vsi1",
            "[*HUAWEI-vsi-vsi1] pwsignal ldp",
            "[*HUAWEI-vsi-vsi1-ldp] vsi-id 200",
            "[*HUAWEI-vsi-vsi1-ldp] quit",
            "[*HUAWEI-vsi-vsi1] pbb i-vsi enable",
            "[*HUAWEI-vsi-vsi1] pbb i-tag 2000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter enabling an I-VSI, perform the following configurations for the I-VSI to take effect:\nRun the pbb service-type p2p command to configure the PBB VPLS service type.Run the pbb i-tag command to configure the I-tag.Run the pbb backbone-source-mac command to configure the B-SMAC address.Run the pbb backbone-destination-mac command to configure the B-DMAC address.\nAn I-tag is a field in the MAC header of a public network packet and is defined in 802.1ah. An I-tag uniquely identifies an I-VSI. To configure an I-tag, run the pbb i-tag command.\n\nPrerequisites\nAn I-VSI has been enabled using the pbb i-vsi enable command.\nConfiguration Impact\nIf the pbb i-tag command is run more than once, the latest configuration overrides the previous one.\nAfter an I-VSI is bound to a B-VSI, you must remove the binding before changing the value of an I-tag or running the undo pbb i-tag command.\nPrecautions\nIn a VPLS domain, a pair of I-VSIs must have the same I-tag that is unique on the entire network."
}