{
    "PageTitle": "mstat2",
    "FuncDef": "This command traces a multicast path from a source to a receiver and displays multicast packet rate and loss information.",
    "CLIs": [
        "mstat2 source [ <ip-address> | <dns-name> | <starg> ] group { <ip-address> | <dns-name> } [ destination <ip-address> | <dns-name> ] [ hop <hop> ] [ router <router-instance> | service-name <vprn-service-name> ] [ wait-time <seconds> ]"
    ],
    "ParentView": [
        "<global>"
    ],
    "ParaDef": [
        {
            "Parameters": "source ip-address",
            "Info": "Specifies the ip-address of the multicast capable target router. Values-ipv4-prefix:."
        },
        {
            "Parameters": "dns-name",
            "Info": "Specifies the DNS name (if DNS name resolution is configured), up to 63 characters."
        },
        {
            "Parameters": "starg",
            "Info": "Specifies a static (*,G) entry. This command can only be enabled if no existing source addresses for this source is specified."
        },
        {
            "Parameters": "group ip-address",
            "Info": "Specifies the multicast address or DNS name of the group that resolves to the multicast group address that will be used. If the group is not specified, address 224.2.0.1 (the MBone audio) is used. This will suffice if packet loss statistics for a particular multicast group are not needed. Values-ipv4-prefix:."
        },
        {
            "Parameters": "destination ip-address",
            "Info": "Specifies either the IP address or the DNS name of the unicast destination. If this parameter is omitted the IP address of the system where the command is entered will be used. The receiver parameter can also be used to specify a local interface address as the destination address for sending the trace query. The response is also returned to the address specified as the receiver. Values-ipv4-prefix:."
        },
        {
            "Parameters": "hop",
            "Info": "Specifies the maximum number of hops that will be traced from the receiver back toward the source. Values-1 to 255. ParamDefault: Default- 32"
        },
        {
            "Parameters": "router-instance",
            "Info": "Specifies the router name or service ID used to identify the router instance. Values-router-name: |Base, service-id: |1 to 2147483647. ParamDefault: Default- Base"
        },
        {
            "Parameters": "vprn-service-name",
            "Info": "Specifies the service name up to 64 characters in length."
        },
        {
            "Parameters": "seconds",
            "Info": "Specifies the number of seconds to wait for the response. Values-1 to 60. ParamDefault: Default- 3"
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}