{
    "PageTitle": "{ unknown-multicast | unknown-unicast } discard",
    "FuncDef": "The unknown-multicast discard command disables interfaces in a VLAN from forwarding unknown multicast packets.\nThe undo unknown-multicast discard command restores the default configuration.\nThe unknown-unicast discard command disables interfaces in a VLAN from forwarding unknown unicast packets.\nThe undo unknown-unicast discard command restores the default configuration.\nBy default, interfaces in a VLAN forward unknown multicast, and unknown unicast packets.",
    "CLIs": [
        "unknown-multicast discard",
        "unknown-unicast discard [ mac-learning ]",
        "undo unknown-multicast discard",
        "undo unknown-unicast discard [ mac-learning ]"
    ],
    "ParentView": [
        "VLAN view"
    ],
    "ParaDef": [
        {
            "Parameters": "mac-learning",
            "Info": "Indicates that interfaces in a VLAN learn the source MAC addresses of the received unknown unicast packets when discarding the packets.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] vlan 10",
            "[*HUAWEI-vlan10] unknown-multicast discard"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen interfaces in a VLAN receive unknown unicast packets, or unknown unicast packets, the interfaces broadcast these packets in the VLAN. If the interfaces broadcast a large number of attack packets, the forwarding and security of other packets are threatened.\nTo disable interfaces in a VLAN from forwarding unknown unicast packets, or unknown unicast packets, run this command.\nPrecautions\nTo enable interfaces in a VLAN to learn the source MAC addresses of the received unknown unicast packets when discarding the packets, configure the mac-learning parameter in the command. After the interfaces learn the source MAC addresses of the packets, you can configure a policy to discard the unicast packets carrying these source addresses.\nAfter the unknown-multicast discard command is run for a VLAN in which the VLANIF interface functions as a Layer 3 multicast outbound interface:\nIPv4 Layer 3 multicast protocol messages will be discarded if IGMP snooping is not configured for the VLAN.IPv6 Layer 3 multicast protocol messages will be discarded if MLD snooping is not configured for the VLAN."
}