{
    "PageTitle": "unknown-unicast alarm-threshold",
    "FuncDef": "The unknown-unicast alarm-threshold command enables the alarming function for unknown unicast traffic on a specified interface and sets an alarm threshold.\nThe undo unknown-unicast alarm-threshold command disables the alarming function and deletes the alarm threshold on the interface.\nBy default, the alarming function for unknown unicast traffic is disabled, and the alarm threshold is 100%.",
    "CLIs": [
        "unknown-unicast alarm-threshold <alarm-threshold>",
        "undo unknown-unicast alarm-threshold"
    ],
    "ParentView": [
        "Eth-Trunk sub-interface view",
        "Eth-Trunk interface view",
        "GE optical interface view",
        "Layer 2 Eth-Trunk interface view",
        "Port extension Layer 2 interface view",
        "Port extension interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "alarm-threshold",
            "Info": "Specifies the alarm threshold for unknown unicast traffic, which is the maximum percentage. When the ratio of unknown unicast traffic to the total traffic on an interface reaches or exceeds the specified alarm threshold, an alarm is generated.\nThe value is an integer ranging from 1 to 100."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/1.1",
            "[~HUAWEI-GigabitEthernet1/0/1.1] statistic enable",
            "[*HUAWEI-GigabitEthernet1/0/1.1] statistic mode mac",
            "[*HUAWEI-GigabitEthernet1/0/1.1] unknown-unicast alarm-threshold 15"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nLots of unknown unicast traffic on an interface consumes many network bandwidths, causing network performance deterioration or even a traffic interruption. To enable the alarming function for unknown unicast traffic on a specified interface and set an alarm threshold, run the unknown-unicast alarm-threshold alarm-threshold command. This configuration helps monitor unknown unicast traffic in real time.\nPrerequisites\nThe command takes effect only after the statistic enable command is run to enable statistics collection.\nPrecautions\nIf the VLAN statistics function is not configured, the unknown-unicast alarm-threshold command configuration does not take effect.\nThe unknown-unicast alarm-threshold command can only be run in the statistic mode mac mode."
}