{
    "PageTitle": "display mpls-tp oam meg statistic-type",
    "FuncDef": "The display mpls-tp oam meg statistic-type command displays statistics about MPLS-TP OAM performance.",
    "CLIs": [
        "display mpls-tp oam meg <meg-name> statistic-type { lost-measure { single-ended | dual-ended } | delay-measure { one-way | two-way } }"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "meg-name",
            "Info": "Specifies the name of a MEG.\nThe value is a string of 1 to 14 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "lost-measure",
            "Info": "Displays packet loss statistics.\n-"
        },
        {
            "Parameters": "single-ended",
            "Info": "Displays statistics about single-ended frame LM.\n-"
        },
        {
            "Parameters": "dual-ended",
            "Info": "Displays statistics about dual-ended frame LM.\n-"
        },
        {
            "Parameters": "delay-measure",
            "Info": "Displays delay statistics.\n-"
        },
        {
            "Parameters": "one-way",
            "Info": "Displays statistics about one-way frame DM.\n-"
        },
        {
            "Parameters": "two-way",
            "Info": "Displays statistics about two-way frame DM.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display mpls-tp oam meg te statistic-type lost-measure single-ended",
            "Single-end loss measurement statistics:",
            "Index Near-end lost frames Loss ratio Far-end lost frames Loss ratio",
            " 1   0              0.0000%   97               97.0000% ",
            " 2   0              0.0000%   97               97.0000% ",
            " 3   0              0.0000%   97               97.0000% ",
            " 4   0              0.0000%   97               97.0000% ",
            " 5   0              0.0000%   97               97.0000% ",
            " 6   0              0.0000%   97               97.0000% ",
            " 7   0              0.0000%   97               97.0000% ",
            " 8   0              0.0000%   97               97.0000% ",
            " 9   0              0.0000%   97               97.0000% ",
            ".....",
            "Max near-end lost frames: 0, frame loss ratio: 0.0000%",
            "Min near-end lost frames: 0, frame loss ratio: 0.0000%",
            "Average near-end lost frames: 0, frame loss ratio: 0.0000%",
            "Max far-end lost frames: 97, frame loss ratio: 97.0000%",
            "Min far-end lost frames: 97, frame loss ratio: 97.0000%",
            "Average far-end lost frames: 97, frame loss ratio: 97.0000%",
            "Total near-end lost frames: 0, Total far-end lost frames: 5820"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nMPLS-TP OAM performance monitoring is classified into the following types:\nProactive monitoring: periodically monitors connectivity in a MEG. It detects faults that occur during dual-ended frame LM or one-way frame DM. To view proactive monitoring results, run the display mpls-tp oam meg statistic-type command.On-demand monitoring: monitors connectivity of a MEG at a time. It detects faults that occur during single-ended frame LM or two-way frame DM. On-demand monitoring results are automatically displayed in real time.\nRun the display mpls-tp oam statistic-type command to view statistics in one of the following situations:\nIf the delay-measure one-way command is run on the MEP, DM is performed in the direction from the source end to the destination end. To view DM statistics, run the display mpls-tp oam meg statistic-type delay-measure one-way command on the RMEP.If the delay-measure one-way command is run on the RMEP, DM is performed in the direction from the destination end to the source end. To view DM statistics, run the display mpls-tp oam meg statistic-type delay-measure one-way command on the MEP.If the lost-measure dual-ended enable command is run on the MEP or RMEP, DM is performed bidirectionally. To view DM statistics, run the display mpls-tp oam meg statistic-type lost-measure dual-ended command on the MEP or RMEP.\n\nPrerequisites\nThe ME of the MEG has been bound to a tunnel."
}