{
    "PageTitle": "reset mpls-tp oam meg statistic-type",
    "FuncDef": "The reset mpls-tp oam meg statistic-type command clears MPLS-TP OAM performance statistics.",
    "CLIs": [
        "reset mpls-tp oam meg <meg-name> statistic-type { lost-measure { single-ended | dual-ended } | delay-measure { one-way | two-way } }"
    ],
    "ParentView": [
        "MPLS-OAM view",
        "System view",
        "Maintenance entity group view"
    ],
    "ParaDef": [
        {
            "Parameters": "meg-name",
            "Info": "Specifies the name of a MEG.\nThe value is a string of 1 to 14 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "lost-measure",
            "Info": "Clears statistics about frame loss measurement.\n-"
        },
        {
            "Parameters": "single-ended",
            "Info": "Clears statistics about single-ended frame loss measurement.\n-"
        },
        {
            "Parameters": "dual-ended",
            "Info": "Clears statistics about dual-ended frame loss measurement.\n-"
        },
        {
            "Parameters": "delay-measure",
            "Info": "Clears statistics about frame delay measurement.\n-"
        },
        {
            "Parameters": "one-way",
            "Info": "Clears statistics about one-way frame delay measurement.\n-"
        },
        {
            "Parameters": "two-way",
            "Info": "Clears statistics about two-way frame delay measurement.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset mpls-tp oam meg test statistic-type delay-measure one-way"
        ],
        [
            "<HUAWEI> reset mpls-tp oam meg test statistic-type lost-measure dual-ended"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nMPLS-TP OAM performance monitoring is classified into the following types:\nProactive monitoring: periodically monitors connectivity in a MEG. It detects faults that occur during dual-ended frame LM or one-way frame DM. To view proactive monitoring results, run the display mpls-tp oam meg statistic-type. To clear statistics, run the reset mpls-tp oam meg statistic-type command.On-demand monitoring: monitors connectivity of a MEG at a time. It detects faults that occur during single-ended frame LM or two-way frame DM. On-demand monitoring results are automatically displayed in real time. Statistics will not be saved in the system and therefore the reset mpls-tp oam statistic-type command does not need to be used to clear the statistics.\nRun the reset mpls-tp oam meg statistic-type lost-measure command with either of the following parameters to clear frame loss statistics:\nsingle-ended: clears single-ended frame loss statistics.dual-ended: clears dual-ended frame loss statistics.\nRun the reset mpls-tp oam meg statistic-type delay-measure command with either of the following parameters to clear frame delay statistics:\none-way: clears one-way frame delay statistics.two-way: clears two-way frame delay statistics.\n\nPrerequisites\nThe ME of the MEG has been bound to a tunnel.\nConfiguration Impact\nThe reset mpls-tp oam meg statistic-type command clears statistics about a specified MEG.\nPrecautions\nIf proactive performance statistics are being collected, the reset mpls-tp oam statistic-type command cannot be run."
}