{
    "PageTitle": "delay-measure one-way",
    "FuncDef": "The delay-measure one-way command enables one-way on-demand frame delay measurement (DM).\nBy default, one-way on-demand frame DM is disabled.",
    "CLIs": [
        "delay-measure one-way [ interval { 1000 | 10000 } | count <count-value> | exp <exp-value> ] *"
    ],
    "ParentView": [
        "Maintenance entity group view"
    ],
    "ParaDef": [
        {
            "Parameters": "interval",
            "Info": "Specifies an interval at which delay measurement messages (DMMs) are sent.\nThe value is either 1000 or 10000, in milliseconds. The default value is 1000."
        },
        {
            "Parameters": "count count-value",
            "Info": "Specifies the number of DMMs to be sent.\nThe value is an integer ranging from 1 to 60. The default value is 5."
        },
        {
            "Parameters": "exp exp-value",
            "Info": "Specifies a priority for DMMs.\nThe value is an integer ranging from 0 to 7. A larger value indicates a higher priority. The default value is 7."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] interface GigabitEthernet 1/0/0.1",
            "[*HUAWEI-GigabitEthernet1/0/0.1] vlan-type dot1q 1",
            "[*HUAWEI-GigabitEthernet1/0/0.1] mpls static-l2vc destination 4.4.4.4 400 transmit-vpn-label 100 receive-vpn-label 200",
            "[*HUAWEI-GigabitEthernet1/0/0.1] quit",
            "[*HUAWEI] mpls-tp meg test",
            "[*HUAWEI-mpls-tp-meg-test] me l2vc peer-ip 4.4.4.4 vc-id 400 vc-type vlan mep-id 1 remote-mep-id 2",
            "[*HUAWEI-mpls-tp-meg-test] commit",
            "[~HUAWEI-mpls-tp-meg-test] delay-measure one-way count 10 exp 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nDM is an MPLS-TP performance monitoring function. One-way frame DM and two-way frame DM are supported.\nTo enable on-demand one-way frame DM, run the delay-measure one-way command.To enable on-demand two-way frame DM, run the delay-measure two-way command.\nOne-way frame DM is implemented between two MEPs in a MEG by exchanging DMMs. After the delay-measure one-way command is run, the MEP periodically sends DMMs carrying the T x TimeStampf value. After the RMEP receives a DMM, it subtracts the T x TimeStampf value from the RxTimef value to calculate the delay.\nFrame delay = R x Timef - T x TimeStampf\n\nPrerequisites\nThe ME of the MEG has been bound to a tunnel."
}