{
    "PageTitle": "me mip te bidirectional-lsp",
    "FuncDef": "The me mip te command creates a maintenance entity (ME) instance on a maintenance entity group intermediate point (MIP) and binds the ME instance to a transit node over a static bidirectional co-routed label switched path (LSP).\nThe undo me mip te command deletes an ME instance created on a MIP.\nBy default, no ME instance is created.",
    "CLIs": [
        "me mip te bidirectional-lsp <lsp-name-str_cx> [ mip-id <mip-id-value> ]",
        "undo me mip te bidirectional-lsp <lsp-name-str_cx>"
    ],
    "ParentView": [
        "Maintenance entity group view"
    ],
    "ParaDef": [
        {
            "Parameters": "mip-id mip-id-value",
            "Info": "Specifies the ID of a MIP.\nThe value is an integer ranging from 1 to 8191."
        },
        {
            "Parameters": "lsp-name-str_cx",
            "Info": "Specifies the name of an LSP.\nThe value is a string of 1 to 19 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] bidirectional static-cr-lsp transit abc",
            "[*HUAWEI] mpls-tp meg test",
            "[*HUAWEI-mpls-tp-meg-test] me mip te bidirectional-lsp abc"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTwo P2P label switched paths (LSPs) in opposite directions are established over a bidirectional co-routed transport path in a MEG. This means that there is a single LSP in both directions between a MEP and its RMEP. A single ME operates along this P2P LSP. On an LSP, a maintenance entity group end point (MEP) is configured on the ingress and a remote MEP (RMEP) is configured on the egress. A MIP is configured on the transit node.\nTo monitor the path between the MEP and the MIP using MPLS-TP OAM, create ME instances on both the MEP and MIP. To create an ME instance on the MIP and bind it to a specified LSP, run the me mip te command.\nMPLS-TP OAM supports only the loopback (LB) function to monitor a path from a MEP to a MIP. If a MEP sends a loopback message (LBM), a destination node MIP can be specified. After receiving the LBM, the MIP responds to the MEP with a loopback reply (LBR). This process completes the LB operation.\nPrerequisites\nA transit node exists on a static bidirectional co-routed LSP.\nConfiguration Impact\nAfter the me mip te bidirectional-lsp command is run:\nThe MIP responds to the MEP with LBRs and does not initiate the LB detection.The MIP does not support performance statistics.The MIP does not detect the MEG ID on the MEP side and cannot verify the MEG ID."
}