{
    "PageTitle": "lost-measure single-ended proactive",
    "FuncDef": "The lost-measure single-ended proactive command enables proactive single-ended frame loss measurement (LM).\nThe undo lost-measure single-ended proactive command disables proactive single-ended frame LM.\nBy default, proactive single-ended frame LM is disabled.",
    "CLIs": [
        "lost-measure single-ended proactive [ exp <exp-value> | interval { 1000 | 10000 } ] *",
        "undo lost-measure single-ended proactive"
    ],
    "ParentView": [
        "Maintenance entity group view"
    ],
    "ParaDef": [
        {
            "Parameters": "exp exp-value",
            "Info": "Specifies the priority of LMMs.\nThe value is an integer ranging from 0 to 7. A larger value indicates a higher priority. The default value is 7."
        },
        {
            "Parameters": "interval",
            "Info": "Sets the interval at which LMMs are sent.\nThe value is either 1000 or 10000, in milliseconds. The default value is 1000."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] interface GigabitEthernet 1/0/0.1",
            "[*HUAWEI-GigabitEthernet1/0/0.1] vlan-type dot1q 1",
            "[*HUAWEI-GigabitEthernet1/0/0.1] mpls static-l2vc destination 4.4.4.4 400 transmit-vpn-label 100 receive-vpn-label 200",
            "[*HUAWEI-GigabitEthernet1/0/0.1] quit",
            "[*HUAWEI] mpls-tp meg test",
            "[*HUAWEI-mpls-tp-meg-test] me l2vc peer-ip 4.4.4.4 vc-id 400 vc-type vlan mep-id 1 remote-mep-id 2",
            "[*HUAWEI-mpls-tp-meg-test] lost-measure single-ended proactive interval 10000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nFrame loss measurement is a performance monitoring function provided by MPLS-TP OAM. Single-ended frame LM is implemented on two MEPs of an LSP. Measurement results include the following data:\nNear-end frame loss data: indicates the number and percentage of dropped frames that are sent from an RMEP to a MEP.Far-end frame loss data: indicates the number and percentage of dropped frames that are sent from a MEP to an RMEP.\nThe number of lost frames is the difference between the number of frames sent by the ingress and the number of frames received by the egress on a point-to-point LSP.\n\nPrerequisites\nThe ME of the MEG has been bound to a tunnel.\nThe RMEP has been enabled to receive LMMs using the lost-measure single-ended receive enable command.\nPrecautions\nSingle-ended frame loss measurement and dual-ended frame loss measurement cannot be enabled together on a MEG."
}