{
    "PageTitle": "active nat session-table size",
    "FuncDef": "The active nat session-table size command sets the number of session tables that can be established on the CPUs of VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-Ss.\nThe undo active nat session-table size command deletes the number of session tables that can be established on the CPUs of VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-Ss.\nThe default number of session tables that can be established on the CPUs of VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S is 0, and services are unavailable.",
    "CLIs": [
        "active nat session-table size <table-size> slot <slot-id> { engine <engine-id> | card <card-id> }",
        "undo active nat session-table size [ <table-size> ] slot <slot-id> { engine <engine-id> | card <card-id> }",
        "undo active nat session-table size slot <slot-id>"
    ],
    "ParentView": [
        "License view"
    ],
    "ParaDef": [
        {
            "Parameters": "table-size",
            "Info": "Specifies the maximum number of NAT session tables that can be created.\nThe value is an enumerated integer type. The value range is 2 to 32. The value is an integer multiple of two. The unit is M (M = 1024 x 1024).\nIf the license resources are sufficient, setting the size of a NAT session table to 32M is recommended."
        },
        {
            "Parameters": "slot slot-id",
            "Info": "Specifies the slot ID of a service board.\nThe value is a string of 1 to 15 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "engine engine-id",
            "Info": "Specifies the base-board CPU ID of a service board. This parameter takes effect only on a VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S.\nThe value is an integer equal 0 for VSUF-80.\nThe value is an integer that ranges from 0 to 1 for VSUF-160,VSUI-160-E,VSUI-400A/VSUI-400.\nThe value is an integer that ranges from 0 to 3 for VSUI-400A-E/VSUI-400-E.\nThe value is an integer equal 0 for VSUI-400-S/VSUI-400A-S."
        },
        {
            "Parameters": "card card-id",
            "Info": "Specifies a CPU ID of a subcard.\nThe value is an integer ranging from 0 to 1."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] license",
            "[~HUAWEI-license] active nat session-table size 2 slot 1 engine 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA license file controls the maximum number of sessions that can be created on VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S. After you load and activate a CGN license file, the device assigns session table resources to CPUs of service boards based on the active nat session-table size command.\nPrecautions\nThe active nat session-table size command takes effect only on VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S.On VSUF-80s and VSUF-160s, the value can be 2 to 16. The value is an integer multiple of two. The unit is M.On VSUI-160-Es,  VSUI-400A/VSUI-400s and  VSUI-400A-E/VSUI-400-Es, the value can be 2 to 32. The value is an integer multiple of two. The unit is M.In this command, M indicates 1024 x 1024. For example, if the maximum number of sessions that can be created is set to 2M, a maximum of 2 x 1024 x 1024 sessions can be created."
}