{
    "PageTitle": "active nat bandwidth-enhance",
    "FuncDef": "The active nat bandwidth-enhance command increases the bandwidth of a base-board or subcard CPU on a NAT service board.\nThe undo active nat bandwidth-enhance command restores the default bandwidth configuration.\nThe default bandwidth of a base-board CPU on a VSUF-80/VSUF-160/VSUI-160-E is 20 Gbit/s,subcard CPU on a VSUF-80/VSUF-160 is 40 Gbit/s,VSUI-400A/VSUI-400/VSUI-400A-E/VSUI-400-E is 0 Gbit/s.",
    "CLIs": [
        "active nat bandwidth-enhance slot <slot-id> engine <engine-id>",
        "active nat bandwidth-enhance slot <slot-id> <card> <card-id>",
        "active nat bandwidth-enhance <bandwidth> slot <slot-id>",
        "undo active nat bandwidth-enhance slot <slot-id> [ engine <engine-id> ]",
        "undo active nat bandwidth-enhance slot <slot-id> [ <card> <card-id> ]",
        "undo active nat bandwidth-enhance <bandwidth> slot <slot-id>"
    ],
    "ParentView": [
        "License view"
    ],
    "ParaDef": [
        {
            "Parameters": "engine engine-id",
            "Info": "Specifies the base-board CPU ID of a service board. This parameter takes effect only on a VSUF-80/VSUF-160/VSUI-160-E.\nThe value is an integer ranging from 0 to 1."
        },
        {
            "Parameters": "slot slot-id",
            "Info": "Specifies the slot ID of a service board.\nThe value is a string of 1 to 15 case-sensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "card",
            "Info": "Specifies a subcard. This parameter takes effect only on a VSUI-160-E.\nThe value can be:\ncard"
        },
        {
            "Parameters": "card-id",
            "Info": "Specifies a CPU ID of a subcard. This parameter takes effect only on a VSUI-160-E.\nThe value is an integer ranging from 0 to 1."
        },
        {
            "Parameters": "bandwidth",
            "Info": "Specifies the enhanced board bandwidth. This parameter is supported only on the VSUI-400/VSUI-400-E service board.\nThe value is an integer that ranges from 20 to 600."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] license",
            "[~HUAWEI-license] active nat bandwidth-enhance slot 1 engine 0"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] license",
            "[~HUAWEI-license] active nat bandwidth-enhance slot 1 card 0"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] license",
            "[~HUAWEI-license] active nat bandwidth-enhance 100 slot 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe default base-board CPU bandwidth on a VSUF-80/VSUF-160/VSUI-160-E is 20 Gbit/s. The default subcard CPU bandwidth on a VSUF-80/VSUF-160 is 40 Gbit/s. (Subcard bandwidth enhancement is not supported.) The default subcard CPU bandwidth on a VSUI-160-E is 20 Gbit/s. If you have purchased a license, you can run the active nat bandwidth-enhance command to increase the base-board or subcard CPU bandwidth on a service board to 40 Gbit/s.The following provides an example for enhancing the base-board CPU bandwidth on a VSUF-160-E.\nA VSUF-160-E is equipped with two base-board CPUs and two subcard CPUs. The default bandwidth of each CPU is 20 Gbit/s, and the default bandwidth of the VSUF-160-E is 4 x 20 Gbit/s. After purchasing a license, you can run the active nat bandwidth-enhance command to increase the base-board CPU bandwidth to 40 Gbit/s. If the bandwidth is increased to 40 Gbit/s for both base-board CPUs using the preceding command, the bandwidth of the VSUF-160-E becomes 2 x 40 Gbit/s + 2 x 20 Gbit/s. Assume that the VSUF-160-E is installed in slot 1. You need to run the active nat bandwidth-enhance slot 1 engine 0 and active nat bandwidth-enhance slot 1 engine 1 commands respectively to increase the bandwidth of the two base-board CPUs on the VSUF-160-E.\nThe following provides an example for enhancing the subcard CPU bandwidth on a VSUF-160-E.\nAfter purchasing a license, you can run the active nat bandwidth-enhance command to increase the subcard CPU bandwidth to 40 Gbit/s. If the bandwidth of the two base-board CPUs and two subcard CPUs is all increased to 40 Gbit/s using the preceding command, the bandwidth of the VSUF-160-E becomes 2 x 40 Gbit/s + 2 x 40 Gbit/s. Assume that the VSUF-160-E is installed in slot 1. You need to run the active nat bandwidth-enhance slot 1 card 0 and active nat bandwidth-enhance slot 1 card 1 commands respectively to increase the bandwidth of the two subcard CPUs on the VSUF-160-E.\nThe default bandwidth of a VSUI-400A/VSUI-400/VSUI-400A-E/VSUI-400-E is 0 Gbit/s. If you have purchased a license, you can run the active nat bandwidth-enhance command to increase the bandwidth of the VSUI-400/VSUI-400-E.\nThe following provides an example for enhancing the bandwidth of a VSUI-400-E.\nThe default bandwidth of a VSUI-400-E is 0 Gbit/s. After purchasing a license, you can run the active nat bandwidth-enhance command to increase the bandwidth of the VSUI400E. Assume that the VSUI-400-E is installed in slot 1. After you run the active nat bandwidth-enhance 40 slot 1 command to increase the bandwidth by 40 Gbit/s, the bandwidth of the VSUI400E becomes 40 Gbit/s.\n\nPrerequisites\nThe license file that defines bandwidth resources has been activated."
}