{
    "PageTitle": "authentication-name (Global CGN address pool view)",
    "FuncDef": "The authentication-name command configures a username and a password for a RADIUS server group used by a dynamic CGN global address pool.\nThe undo authentication-name command cancels the configuration.\nBy default, no username or password is configured for a RADIUS server group used by a dynamic CGN global address pool.",
    "CLIs": [
        "authentication-name <authentication-name> password cipher password",
        "undo authentication-name [ authentication-name [ password cipher [ password ] ] ]"
    ],
    "ParentView": [
        "Global CGN address pool view"
    ],
    "ParaDef": [
        {
            "Parameters": "authentication-name",
            "Info": "Specifies an authentication username.\nThe value is a string of 1 to 253 case-sensitive characters."
        },
        {
            "Parameters": "password",
            "Info": "Specifies an authentication password.\n-"
        },
        {
            "Parameters": "cipher password",
            "Info": "Specifies an authentication password.\nThe value can be a simple text password ranging from 1 to 16 characters or a ciphertext password of 48 characters. The encryption mode is AES256."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat ip-pool pool1 dynamic",
            "[*HUAWEI-nat-ip-pool-pool1] radius-server group rd1",
            "[*HUAWEI-nat-ip-pool-pool1] authentication-name user1 password cipher 123456"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen the address usage of a dynamic global address pool reaches the upper threshold, the CGN device requests address segments from a RADIUS server. In this case, a username and a password must be configured for the CGN device to access a RADIUS server in a RADIUS server group.\nPrerequisites\nThe RADIUS server group already exists.\nConfiguration Impact\nAfter the configuration, the CGN device checks whether address segments are contained in a dynamic address pool. If no address segment is detected, the CGN device applies for an address segment. If a local address segment exists, it cannot be deleted, and only a password can be modified.\nPrecautions\nThe authentication username and password cannot be deleted if a dynamic address segment exists locally or when a device is applying for an address segment."
}