{
    "PageTitle": "cut access-user nat-ip-address",
    "FuncDef": "The cut access-user nat-ip-address command enables a CGN device to log out users based on public IP addresses.",
    "CLIs": [
        "cut access-user nat-ip-address <ip-address> [ <end-ip-address> ] [ vpn-instance <vpn-instance-name> ]"
    ],
    "ParentView": [
        "AAA view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address",
            "Info": "Specifies the IP address of a user to be logged out.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "end-ip-address",
            "Info": "Specifies the end IP address of a user to be logged out.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies the name of a VPN instance to which a user to be logged out belongs.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[*HUAWEI-aaa] cut access-user nat-ip-address 10.10.10.10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S fails, CGN users cannot access the Internet using private IP addresses. To address this problem, CGN users are allowed to access the Internet using public IP addresses. After the VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S is restored, the CGN public network users can be logged out and access the Internet again using private IP addresses. By default, a manual user cutback is performed. To enable the automatic user cutback function, run the cut access-user nat-ip-address command to log out users based on public IP addresses.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}