{
    "PageTitle": "display nat statistics port-usage distribute",
    "FuncDef": "The display nat statistics port-usage distribute command displays statistics about the users for which ports in specified ranges have been allocated.",
    "CLIs": [
        "display nat statistics port-usage distribute [ start <start> step <step> [ interval-count <interval-count> ] ] nat-instance [ <instance-name> ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "start start",
            "Info": "Displays the number of users assigned a port range with a specified start port number.\nThe value is an integer ranging from 0 to 65535. The default value is 0."
        },
        {
            "Parameters": "step step",
            "Info": "Displays the number of users assigned a port range with a specified port number step.\nThe value is an integer ranging from 64 to 2048."
        },
        {
            "Parameters": "interval-count interval-count",
            "Info": "Specifies the number of port ranges.\nThe value is an integer ranging from 1 to 10. The default value is 10. If this value is not specified, value 10 takes effect."
        },
        {
            "Parameters": "nat-instance instance-name",
            "Info": "Specifies the name of a NAT instance. If no instance name is specified, all NAT instances are queried.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display nat statistics port-usage distribute start 0 step 1024 interval-count 10 nat-instance nat1",
            "This operation will take a few minutes. Press 'Ctrl+C' to break ...             ",
            "instance-name:  nat1                ",
            "interval-count: 10           ",
            "port-count-range              user-count                                        ",
            "---------------------------------------------------------------------------     ",
            "0     - 1023                  0                      ",
            "1024  - 2047                  0                                                 ",
            "2048  - 3071                  0                                                 ",
            "3072  - 4095                  0                                                 ",
            "4096  - 5119                  0                                                 ",
            "5120  - 6143                  0                                                 ",
            "6144  - 7167                  0                                                 ",
            "7168  - 8191                  0                                                 ",
            "8192  - 9215                  0                                                 ",
            "9216  - 10239                 0                                                 ",
            "---------------------------------------------------------------------------"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter a public network port range is configured for a user in the NAT instance view, the port range is allocated for the user when the user goes online and used only by this user. To check the number of the users for which ports in specified ranges have been allocated and determine whether the port distribution meets requirements, run the display nat statistics port-usage distribute command. You can adjust the port-range configuration based on the command output.\nPrecautions\nIf the display nat statistics port-usage distribute command without start, step, or interval-count configured is run, user information in a default number of 10 port ranges is displayed. The ranges are  [0, 127], [128, 255], [256, 511], [512, 1023], [1024, 2047], [2048, 4095], [4096, 6143], [6144, 8191], [8192, 10239], and greater than or equal to 10240.\nThis command queries statistics about PAT users, not no-PAT users based on port ranges. The statistics excluding the number of backup users and NAT internal servers.The display nat statistics port-usage distribute command takes effect only on the VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S.\nThe display nat statistics port-usage distribute command takes effect only on the VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S."
}