{
    "PageTitle": "display nat flow-defend",
    "FuncDef": "The display nat flow-defend command displays the configured rate at which the first packet is sent to create a flow on a NAT device.",
    "CLIs": [
        "display nat flow-defend { forward | reverse | fragment } rate slot <slot-id> [ engine <engine-id> | card <card-id> ]",
        "display nat flow-defend { forward | reverse | fragment } rate slot <slot-id>"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "forward",
            "Info": "Displays the rate at which the first user-to-network packet is sent to create a flow on a NAT device.\n-"
        },
        {
            "Parameters": "reverse",
            "Info": "Displays the rate at which the first network-to-user packet is sent to create a flow on a NAT device.\n-"
        },
        {
            "Parameters": "fragment",
            "Info": "Displays the rate at which the first fragment is sent to create a flow on a NAT device.\n-"
        },
        {
            "Parameters": "rate",
            "Info": "Indicates the rate (kpps) at which the first packet or fragment is sent to create a flow on a NAT device.\n-"
        },
        {
            "Parameters": "slot slot-id",
            "Info": "Specifies the slot ID of a service board.\nThe value is a string of 1 to 15 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "engine engine-id",
            "Info": "Specifies the CPU ID of a service board. This parameter takes effect only on a VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S.\nThe value is an integer equal 0 for VSUF-80.\nThe value is an integer that ranges from 0 to 1 for VSUF-160,VSUI-160-E,VSUI-400A/VSUI-400.\nThe value is an integer that ranges from 0 to 3 for VSUI-400A-E/VSUI-400-E."
        },
        {
            "Parameters": "card card-id",
            "Info": "Specifies the CPU ID of a subcard on a service board.\nThe value is an integer that ranges from 0 to 1."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display nat flow-defend forward rate slot 1 engine 0",
            "Slot: 1 Engine: 0",
            " nat flow-defend forward rate 2000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo view the configured rate at which the first packet or fragment is sent to create a flow on a NAT device, run the display nat flow-defend command on a specified service board.\nFollow-up Procedure\nIf the displayed rate delays the establishment of a NAT session table, run the nat flow-defend command to increase the rate.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}