{
    "PageTitle": "location slot (NAT instance view)",
    "FuncDef": "The location slot command configures information about the CPU or the master or slave main control board in a simplified NAT instance so that the instance is bound to the CPU.\nThe undo location slot command deletes information about the CPU or the master or slave main control board in a simplified NAT instance.\nBy default, no information about the CPU or the master or slave main control board is configured in a simplified NAT instance.",
    "CLIs": [
        "location slot <slot-id> [ backup slot <slot-id> ]",
        "undo location slot <slot-id> [ backup slot <slot-id> ]"
    ],
    "ParentView": [
        "NAT instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "backup",
            "Info": "Specifies the slot ID of the slave main control board.\n-"
        },
        {
            "Parameters": "slot slot-id",
            "Info": "Specifies the slot ID of the master main control board.\nThe value is a string of 1 to 15 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat instance cpe2 id 1 simple-configuration",
            "[*HUAWEI-nat-instance-cpe2] location slot 1 backup slot 2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter the nat instance command is run to create a simplified NAT instance, a device automatically generates a service-instance-group service instance group named _default_ and binds it to the NAT instance. Then the location slot command is run in the NAT instance so that the device automatically generates a service-location backup group and binds it to the instance group named _default_. Consequently, NAT configuration is simplified by eliminating manual configurations.\nThe location slot command is only used to direct traffic to a service board.\nPrecautions\nThis command is supported only on the admin VS.\nThe location slot command takes effect only on the LPUF-51-E/LPUI-51-E/LPUI-51-S."
}