{
    "PageTitle": "nat-instance subnet length",
    "FuncDef": "The nat-instance subnet length command configures the mask length/mask of the initial and extended address segments in a global address pool.\nThe undo nat-instance subnet length command deletes the configured mask length/mask of the initial and extended address segments in a global address pool.\nThe default lengths of the initial and extended address segments for a global address pool are 27 respectively.",
    "CLIs": [
        "nat-instance subnet length initial { <mask-length> | <mask> } [ extend { <mask-length> | <mask> } ]",
        "undo nat-instance subnet length [ initial { <mask-length> | <mask> } [ extend { <mask-length> | <mask> } ] ]"
    ],
    "ParentView": [
        "Global CGN address pool view"
    ],
    "ParaDef": [
        {
            "Parameters": "extend mask-length",
            "Info": "Specifies the mask length of the extended address segments in a global address pool.\nIn PAT mode, the value is an integer ranging from 22 to 32. In No-PAT mode, the value is an integer ranging from 20 to 27."
        },
        {
            "Parameters": "extend mask",
            "Info": "Sets the mask of the extended address segment for a global address pool.\nThe value is in dotted decimal notation. The value range of this parameter is the same as that of the extend mask-length parameter."
        },
        {
            "Parameters": "initial mask-length",
            "Info": "Sets the mask length of the initial address segment for a global address pool.\nIn PAT mode, the value is an integer ranging from 22 to 32. In No-PAT mode, the value is an integer ranging from 20 to 27."
        },
        {
            "Parameters": "initial mask",
            "Info": "Sets the mask of the initial address segment for a global address pool.\nThe value is in dotted decimal notation. The value range of this parameter is the same as that of the initial mask-length parameter."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat ip-pool pool1",
            "[*HUAWEI-nat-ip-pool-pool1] nat-instance subnet length initial 25 extend 27"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA CGN address pool can be used to configure multiple public IP addresses and flexibly expand or delete public IP addresses. Address allocation involves the following settings:\nMask length of the initial address segment (initial address segment)Mask length of the allocated address segment (extended address segment) that is added after the initial address segment is exhausted\nThe nat-instance subnet length command define the mask length of the initial address segment and the mask length of the allocated address segment.\n\nPrecautions\nThis command is supported only on the admin VS.\nThis command is applicable only to the VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S.\nThe addresses in the address segment that the nat-instance subnet length comamnd applies for from a NAT IP address pool are dynamically allocated to CPUs. An extended address segment is added only when the number of allocated addresses reaches the address usage threshold of the initial address segment. Users can use only the allocated public addresses, not all public addresses in the address pool. If network-side load balancing is performed based on IP addresses, user traffic is all related to the allocated public IP addresses, and no traffic exists for other public IP addresses.\nWhen a global DAP is configured, the subnet length initial command is used to apply for address segments from a DAP server. The nat-instance subnet length command is used by a NAT instance to apply for address segments from a CGN global address pool."
}