{
    "PageTitle": "nat-instance ip used-threshold",
    "FuncDef": "The nat-instance ip used-threshold command configures the upper limit and lower limit of an address segment in a global address pool.\nThe undo nat-instance ip used-threshold command restores the default configuration.\nBy default, the upper limit is 80% and the lower limit is 20% for an address segment in a global address pool.",
    "CLIs": [
        "nat-instance ip used-threshold upper-limit <upper-value> lower-limit <lower-value>",
        "undo nat-instance ip used-threshold [ upper-limit <upper-value> lower-limit <lower-value> ]"
    ],
    "ParentView": [
        "Global CGN address pool view"
    ],
    "ParaDef": [
        {
            "Parameters": "lower-limit lower-value",
            "Info": "Sets a lower threshold for address usage, which is used to apply for extended address segments in a global address pool.\nThe value is an integer ranging from 0 to 99, in percentage. The default value is 20."
        },
        {
            "Parameters": "upper-limit upper-value",
            "Info": "Sets an upper threshold for address usage, which is used to apply for extended address segments in a global address pool.\nThe value is an integer ranging from 1 to 100, in percentage. The default value is 80. The upper limit must be greater than the lower limit."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat ip-pool pool1",
            "[*HUAWEI-nat-ip-pool-pool1] nat-instance ip used-threshold upper-limit 90 lower-limit 20"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen the address usage of the dynamic address pool of a NAT instance reaches the upper limit, extended address segments need to be requested from the global address pool. When the address usage of the dynamic address pool of a NAT instance falls below the lower limit, idle extended address segments need to be released from the global address pool.\nPrecautions\nUsing the default upper limit and lower limit of an address segment in a global address pool is recommended, and the difference between and must be over 60. For example, nat-instance ip used-threshold upper-limit 90 lower-limit 20.\nThis command is applicable only to the VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S.\nThis command is supported only by the admin-VS."
}