{
    "PageTitle": "nat log user enable",
    "FuncDef": "The nat log user enable command enables the NAT user log function.\nThe undo nat log user enable command disables the NAT user log function.\nBy default, the NAT user log function is disabled.",
    "CLIs": [
        "nat log user enable [ syslog | netstream ]",
        "undo nat log user enable [ syslog | netstream ]"
    ],
    "ParentView": [
        "NAT instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "syslog",
            "Info": "Indicates NAT user logs in the syslog format.\n-"
        },
        {
            "Parameters": "netstream",
            "Info": "Indicates NAT user logs in the NetStream format.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat instance cpe1 id 1",
            "[*HUAWEI-nat-instance-cpe1] nat log user enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo enable the NAT log function, run the nat log user enable command. The log function helps record intranet users' access to external networks in real time, enhancing network maintainability. Running the nat log user enable command is a prerequisite for configuring NAT user logs.\nPrecautions\nAfter running the nat log user enable command, run the nat log host command to configure a log host to parse user logs.\nWhen the nat log user enable command without a format configured is run, the syslog flow log format is used by default for NAT user logs.\nIf this command is run on a device on which the port range mode is configured, the device sends user logs when users get online, get offline, are assigned ports, and release ports. If this command is run on a device on which a non-port range mode is configured, the device sends user logs when a no-PAT address pool is used and users get online and offline.\nThis command is applicable only to the VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S."
}