{
    "PageTitle": "nat centralized-backup redirect-ip",
    "FuncDef": "The nat centralized-backup redirect-ip command configures a redirection IP address for centralized backup of distributed NAT.\nThe undo nat centralized-backup redirect-ip command restores the default configuration.\nBy default, the redirection IP address for centralized backup of distributed NAT is not configured.",
    "CLIs": [
        "nat centralized-backup redirect-ip <ip-addr> [ vpn-instance <vpn-instance-name> ]",
        "undo nat centralized-backup redirect-ip <ip-addr> [ vpn-instance <vpn-instance-name> ]"
    ],
    "ParentView": [
        "NAT instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-addr",
            "Info": "Specifies the redirection IP address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "[~HUAWEI] nat instance cpe1 id 1",
            "[*HUAWEI-nat-instance-cpe1] nat centralized-backup enable",
            "[*HUAWEI-nat-instance-cpe1] nat centralized-backup redirect-ip 10.1.1.1 vpn-instance vpna"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe centralized NAT cold backup function improves the reliability of NAT devices. After a redirection route is configured, user traffic is switched to centralized NAT devices and forwarded to the specified backup CR based on the redirection IP address. If the redirection IP address carries VPN information, user traffic is forwarded to centralized NAT devices based on the IP address and VPN information.\nTo configure a redirection IP address for centralized backup of distributed NAT, run the nat centralized-backup redirect-ip command.\nPrerequisites\nThe automatic switching and switchback function for centralized backup of distributed NAT has been enabled using the nat centralized-backup enable command.\nConfiguration Impact\nIf the redirection IP address for centralized backup of distributed NAT is unreachable, user traffic is discarded after being switched to centralized NAT devices.\nPrecautions\nWhen the redirection IP address is set to an IP address ranging from 127.0.0.0 to 127.255.255.255 or from 224.0.0.0 to 255.255.255.255 (loopback address segment, multicast address segment, and broadcast address segment), user traffic is switched to centralized NAT devices and user packets are discarded. Therefore, exercise caution when you set the redirection IP address to be within the preceding address segments.\nThe redirection VPN instance name for centralized backup of distributed NAT must be the same as that configured for the centralized NAT device and CR.\nThis command is applicable only to the VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S."
}