{
    "PageTitle": "nat flow-defend",
    "FuncDef": "The nat flow-defend command sets the rate at which the first packet is sent to create a flow on a service board.\nThe undo nat flow-defend command restores the default rate at which the first packet is sent to create a flow on a service board.\nBy default, the rates at which the first forward, fragment, and reverse packets are sent to create a flow are 512 kbit/s, 200 kbit/s, and 64 kbit/s, respectively on a VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S and are 10 kbit/s, 4 kbit/s, and 1 kbit/s, respectively on an LPUF-51-E/LPUI-51-E/LPUI-51-S.",
    "CLIs": [
        "nat flow-defend { forward | reverse | fragment } rate <rate-number> slot <slot-id> { engine <engine-id> | card <card-id> }",
        "nat flow-defend { forward | reverse | fragment } rate <rate-number> slot <slot-id>",
        "undo nat flow-defend { forward | reverse | fragment } rate [ <rate-number> ] slot <slot-id> { engine <engine-id> | card <card-id> }",
        "undo nat flow-defend { forward | reverse | fragment } rate [ <rate-number> ] slot <slot-id>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "forward",
            "Info": "Indicates the first user-to-network packet used to create a flow.\n-"
        },
        {
            "Parameters": "reverse",
            "Info": "Indicates the first network-to-user packet used to create a flow.\n-"
        },
        {
            "Parameters": "fragment",
            "Info": "Indicates the first fragment used to create a flow.\n-"
        },
        {
            "Parameters": "rate rate-number",
            "Info": "Specifies the rate at which packets are sent.\nThe value is an integer ranging from 0 to 3000, in kpps. Value 0 indicates traffic is not allowed to pass."
        },
        {
            "Parameters": "slot slot-id",
            "Info": "Specifies the slot ID of a service board.\nThe value is a string of 1 to 15 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "engine engine-id",
            "Info": "Specifies the CPU ID of a service board. This parameter takes effect only on a VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S.\nThe value is an integer ranging from 0 to 1."
        },
        {
            "Parameters": "card card-id",
            "Info": "Specifies the CPU ID of a subcard on a service board.\nThe value is an integer ranging from 0 to 1."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat flow-defend forward rate 20 slot 1 engine 0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo set the rate at which the first packet is sent to create a flow on a service board, run the nat flow-defend command. The command helps prevent first-packet-based attacks from consuming a large number of CPU resources, which minimizes the impact on services. The rates at which the first user-to-network packet, the first fragment, and the first network-to-user packet are sent can be flexibly set.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}