{
    "PageTitle": "nat flow-defend reverse-blacklist detect-threshold",
    "FuncDef": "The nat flow-defend reverse-blacklist detect-threshold ip-level high-threshold command sets the address-level rate threshold for a device. If traffic exceeds the rate, its IP address is added to a NAT blacklist.\nThe nat flow-defend reverse-blacklist detect-threshold ip-port-level high-threshold command sets a port-level rate threshold for a device. If traffic exceeds the rate, its port number is added to a NAT blacklist.\nThe undo nat flow-defend reverse-blacklist detect-threshold ip-level high-threshold command restores the default address-level rate threshold for a device.\nThe undo nat flow-defend reverse-blacklist detect-threshold ip-port-level high-threshold command restores the default port-level rate threshold for a device.\nThe default address-level rate threshold is 128 kpps on a VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-Sand 64 kpps on a LPUF-51-E/LPUI-51-E/LPUI-51-S.The default port-level rate threshold is 64 kpps on a VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S and 32 kpps on a LPUF-51-E/LPUI-51-E/LPUI-51-S.",
    "CLIs": [
        "nat flow-defend reverse-blacklist detect-threshold ip-level high-threshold <ip-level-high-threshold-value>",
        "nat flow-defend reverse-blacklist detect-threshold ip-port-level high-threshold <ip-port-level-high-threshold-value>",
        "undo nat flow-defend reverse-blacklist detect-threshold ip-level high-threshold [ <ip-level-high-threshold-value> ]",
        "undo nat flow-defend reverse-blacklist detect-threshold ip-port-level high-threshold [ <ip-port-level-high-threshold-value> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "high-threshold ip-level-high-threshold-value",
            "Info": "Sets an address-level threshold.\nThe value is an integer that ranges from 33 to 2048."
        },
        {
            "Parameters": "high-threshold ip-port-level-high-threshold-value",
            "Info": "Sets a port-level threshold.\nThe value is an integer that ranges from 32 to 2047."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat flow-defend reverse-blacklist detect-threshold ip-level high-threshold 40"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat flow-defend reverse-blacklist detect-threshold ip-port-level high-threshold 100"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf no internal server is configured or if no session table entries can be found on the NAT device for public network traffic, the NAT device considers public network-to-private network traffic reaching a specified rate threshold as attack traffic. The NAT device sends such traffic to a NAT blacklist. The reverse first-packet blacklist prevents public-to-private first packets that trigger the creation of a session table from attacking a specific public IP address, public port number, protocol ID. Such attacks adversely affect the forwarding of normal traffic. To monitor the rate at which network attack traffics matching IP addresses in a NAT blacklist, run the nat flow-defend reverse-blacklist detect-threshold ip-level high-threshold command to set an IP address-level rate threshold. To monitor the rate at which network attack traffics matching an IP address, port number, or protocol ID in a NAT blacklist, run the nat flow-defend reverse-blacklist detect-threshold ip-port-level\nhigh-threshold command to set a port-level rate threshold.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}