{
    "PageTitle": "nat external-host",
    "FuncDef": "The nat external-host command enables an external host to access a CPE.\nThe undo nat external-host command disables an external host from accessing a CPE.\nBy default, an external host that needs to return to the CPE is not configured.",
    "CLIs": [
        "nat external-host { tcp | udp | any } destination-ip <ip-address> [ destination-port <port-number> ]",
        "undo nat external-host { tcp | udp | any } destination-ip <ip-address> [ destination-port <port-number> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "tcp",
            "Info": "Indicates TCP protocol packets.\n-"
        },
        {
            "Parameters": "udp",
            "Info": "Indicates UDP protocol packets.\n-"
        },
        {
            "Parameters": "any",
            "Info": "Includes TCP and UDP packets.\n-"
        },
        {
            "Parameters": "destination-ip ip-address",
            "Info": "Specifies a destination IP address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "destination-port port-number",
            "Info": "Specifies a destination port number.\nThe value is an integer ranging from 1 to 65535."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat external-host udp destination 1.1.1.1 destination-port 3000"
        ]
    ],
    "ExtraInfo": "In some scenarios, after a CPE gets online and accesses some hosts, the hosts need the ability of accessing the online CPE. Typically, an NMS host manages a CPE. After the CPE gets online, it registers with the NMS host. The CGN device performs NAT on the registration packets and creates the mapping between the public and private IP addresses. After the NMS host receives the registration packets that contain the public IP address and port number, the NMS host can use the public network information to access the CPE. When the NMS host' IP address and port number are specified in the nat external-host command, entries in the NAT mapping table do not age when the CPE is online so that the NMS host keeps accessing the CPE.\nA maximum of nine external hosts can be specified for a device."
}