{
    "PageTitle": "nat statistics enable",
    "FuncDef": "The nat statistics enable command enables a device to collect NAT statistics.\nThe undo nat statistics enable command disables a device from collecting NAT statistics.\nBy default, a device is disabled from collecting NAT statistics.",
    "CLIs": [
        "nat statistics address-pool-usage enable",
        "nat statistics session-usage enable",
        "nat statistics port-usage enable",
        "undo nat statistics address-pool-usage enable",
        "undo nat statistics session-usage enable",
        "undo nat statistics port-usage enable"
    ],
    "ParentView": [
        "NAT instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "session-usage",
            "Info": "Enables a device to collect statistics about the average and maximum number of sessions in each instance.\n-"
        },
        {
            "Parameters": "port-usage",
            "Info": "Enables a device to collect statistics about the average and maximum port usage in each instance.\n-"
        },
        {
            "Parameters": "address-pool-usage",
            "Info": "Enables a device to collect statistics about the average and maximum usage of IP addresses in an address pool.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat instance cpe1 id 1",
            "[*HUAWEI-nat-instance-cpe1] nat statistics address-pool-usage enable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat instance cpe1 id 1",
            "[*HUAWEI-nat-instance-cpe1] nat statistics session-usage enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA device can be enabled to collect NAT statistics, including IP address usage of an address pool on the device and the number of ports used in each NAT instance. After a device is enabled to collect NAT statistics, the device collects information every 10 minutes and stores sampled data within the last 72 hours. You can run the display nat statistics command to view the collected information. If you run the nat statistics { port-usage | session-usage | address-pool-usage } enable command for the first time, you need to wait for at least 10 minutes before querying the collected NAT statistics.\nPrecautions\nThe nat statistics address-pool-usage enable and nat bind static-mapping commands are mutually exclusive."
}