{
    "PageTitle": "nat alg (NAT instance view)",
    "FuncDef": "The nat alg command enables the NAT application level gateway (ALG) function to monitor specified application protocols.\nThe undo nat alg command disables NAT ALG from monitoring application protocols.\nBy default, NAT ALG for ICMP is enabled.",
    "CLIs": [
        "nat alg { dns | ftp [ rate-threshold <rate-threshold-value> ] | pptp | rtsp | sip | all | sip separate-translation }",
        "nat alg { ftp [ rate-threshold <rate-threshold-value> ] | pptp | rtsp | sip | all | sip separate-translation }",
        "undo nat alg { dns | ftp [ rate-threshold [ <rate-threshold-value> ] ] | pptp | rtsp | sip | all | sip separate-translation }",
        "undo nat alg { ftp [ rate-threshold [ <rate-threshold-value> ] ] | pptp | rtsp | sip | all | sip separate-translation }"
    ],
    "ParentView": [
        "NAT instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "dns",
            "Info": "Enables NAT ALG for DNS.\n-"
        },
        {
            "Parameters": "ftp",
            "Info": "Sets the NAT ALG rate at which FTP packets are sent.\n-"
        },
        {
            "Parameters": "rate-threshold rate-threshold-value",
            "Info": "Enables NAT ALG for FTP. NAT ALG does not support SFTP or FTPS.\nThe value is an integer ranging from 64 to 15000, in packets/second."
        },
        {
            "Parameters": "pptp",
            "Info": "Enables NAT ALG for PPTP.\n-"
        },
        {
            "Parameters": "rtsp",
            "Info": "Enables NAT ALG for RTSP.\n-"
        },
        {
            "Parameters": "sip",
            "Info": "Enables NAT ALG for SIP.\n-"
        },
        {
            "Parameters": "all",
            "Info": "Enables NAT ALG for all protocols.\n-"
        },
        {
            "Parameters": "separate-translation",
            "Info": "Specifies that the SIP control channel and data channel match an address-based NAT server separately in the NAT instance view for NAT.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat instance cpe1 id 1",
            "[*HUAWEI-nat-instance-cpe1] nat alg ftp rate-threshold 64"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nNAT can be used to translate only the IP addresses contained in user data packets and the port information in the TCP/UDP headers of the data packets. For special protocols, such as FTP, the Data field in a packet can contain IP address or port information. Inconsistency occurs and errors are caused if the IP address or port information in the Data field of a packet is not translated. A good way to solve the NAT issue for these special protocols is to use the ALG function. As a special conversion agent for application protocols, the ALG interacts with the NAT device to establish states. It uses NAT state information to change the specific data in the Data field of IP packets and to complete other necessary work, so that application protocols can run across internal and external networks.\nConfiguration Impact\nAfter ALG is enabled in the NAT instance view, traffic of the specified application protocols in a specified NAT instance can be processed by ALG."
}