{
    "PageTitle": "nat address-group bind-over-load",
    "FuncDef": "The nat address-group bind-over-load command binds a common address pool to an overloaded address pool in a NAT instance.\nThe undo nat address-group bind-over-load command deletes the binding between a common address pool and an overloaded address pool in a NAT instance.\nBy default, no common address pool is bound to an overloaded address pool in a NAT instance.",
    "CLIs": [
        "nat address-group <address-group-name> bind-over-load <address-group-name>",
        "undo nat address-group <address-group-name> bind-over-load <address-group-name>"
    ],
    "ParentView": [
        "NAT instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "address-group-name",
            "Info": "Specifies the name of a public IP address pool or an overloaded address pool.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat instance cpe1 id 1",
            "[*HUAWEI-nat-instance-cpe1] nat address-group groupnormal group-id 1",
            "[*HUAWEI-nat-instance-cpe1] nat address-group groupoverload group-id 2 over-load",
            "[*HUAWEI-nat-instance-cpe1] nat address-group groupnormal bind-over-load groupoverload"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter public IP addresses in a NAT address pool are used up, traffic of new users is dropped because no IP addresses are available. To prevent traffic loss, the overloaded IP address pool function is used to assign IP addresses to new users for NAT forwarding in the preceding situation. To bind a common address pool to an overloaded address pool in a NAT instance, run the nat address-group bind-over-load command. After addresses in the non-overloaded address pool are used up, addresses in the overloaded address pool can be used to perform NAT.\nPrerequisites\nAn overloaded address pool has been configured.\nPrecautions\nAfter a common address pool is bound to an overloaded address pool, the binding is mutually exclusive with the nat address-group exclude-ip-address and section exclude-ip-address commands.\nThe NAT instance in which the binding is configured cannot be configured as a load-balancing instance group.\nMultiple public address pools in the same NAT instance can be bound to a single overloaded address pool.\nThe nat address-group bind-over-load command takes effect only on the VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S."
}