{
    "PageTitle": "nat log session enable",
    "FuncDef": "The nat log session enable command enables the NAT log function.\nThe undo nat log session enable command disables the NAT log function.\nThis NAT log function is disabled by default.",
    "CLIs": [
        "nat log session enable [ elog | syslog | netstream ]",
        "undo nat log session enable [ elog | syslog | netstream ]"
    ],
    "ParentView": [
        "NAT instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "elog",
            "Info": "Indicates NAT session logs in the elog format.\n-"
        },
        {
            "Parameters": "syslog",
            "Info": "Indicates NAT session logs in the syslog format.\n-"
        },
        {
            "Parameters": "netstream",
            "Info": "Indicates NAT session logs in the NetStream format.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat instance cpe1 id 1",
            "[*HUAWEI-nat-instance-cpe1] nat log session enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen users access the Internet through a NAT device, the NAT device is difficult to locate which host initiates an access request based on the source IP address because the NAT device has translated the private address to a public address, which reduces network security.\nTo enable the NAT log function, run the nat log session enable command. NAT flow logs record information about NAT flows so that administrators can obtain addresses before NAT translation is performed to query network activities and operations. This improves network availability and security.\nFollow-up Procedure\nRun the nat log host command to set the log host's IP address, port number, and name so that a NAT device can send NAT logs evenly to multiple log hosts.\nPrecautions\nThe NAT session logging function must be used together with a log host. To ensure that the NAT logging function takes effect, run the nat log session enable command and configure a log host.\nWhen the nat log session enable command without a format configured is run, the elog flow log format is used by default for NAT flow logs."
}