{
    "PageTitle": "nat instance",
    "FuncDef": "The nat instance command creates a NAT instance and displays the NAT instance view.\nThe undo nat instance command deletes a NAT instance.\nBy default, no NAT instance is configured.",
    "CLIs": [
        "nat instance <instance-name> [ id <id> [ simple-configuration ] ]",
        "undo nat instance <instance-name> [ id <id> [ simple-configuration ] ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "instance-name",
            "Info": "Specifies the name of a NAT instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "id id",
            "Info": "Specifies the ID of a NAT instance.\nThe value is an integer ranging from 1 to 4095."
        },
        {
            "Parameters": "simple-configuration",
            "Info": "Indicates a simplified NAT instance.\nAfter the simple-configuration parameter is configured, a device automatically generates a service-instance-group service instance group named _default_ and binds the instance group to the backup group and the NAT instance to the instance group. Consequently, the NAT configuration is simplified by eliminating manual configurations.\nA device supports only a single simplified NAT instance.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat instance cpe1 id 1",
            "[*HUAWEI-nat-instance-cpe1]"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo create a NAT instance and enter the NAT instance view, run the nat instance command. A NAT instance allows you to configure NAT attributes. NAT configurations, such as configuring a NAT address pool and the NAT ALG function, can only be performed in the NAT instance view. If a NAT instance is to be created for the first time, a NAT instance ID must be specified in the nat instance command. If a NAT instance exists, running this command displays the view of the existing NAT instance.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}