{
    "PageTitle": "nat log host detect udp",
    "FuncDef": "The nat log host detect udp command sets the UDP detection interval and the maximum number of allowed failed detection attempts.\nThe undo nat log host detect udp command restores the default UDP detection interval and the default maximum number of allowed failed detection attempts.\nBy default, the UDP detection interval is 20s, and the maximum number of allowed failed detection attempts is 3 after heartbeat detection is enabled for log servers.",
    "CLIs": [
        "nat log host detect udp { interval <interval-value> | recovery-times <recovery-times-value> | interval <interval-value> recovery-times <recovery-times-value> }",
        "undo nat log host detect udp { interval <interval-value> | recovery-times <recovery-times-value> | interval <interval-value> recovery-times <recovery-times-value> }"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "interval interval-value",
            "Info": "Specifies a UDP detection interval.\nThe value is an integer that ranges from 1 to 60, in seconds. The default value is 20."
        },
        {
            "Parameters": "recovery-times recovery-times-value",
            "Info": "Specifies the maximum number of allowed failed detection attempts.\nThe value is an integer ranging from 1 to 10. The default value is 3."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat log host detect udp interval 5 recovery-times 3"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA device needs to deliver log server information based on the log server status. After heartbeat detection is enabled for log servers, to set the UDP detection interval and the maximum number of allowed failed detection attempts, run the nat log host detect udp command. If the maximum number of allowed failed detection attempts is reached, the device considers the log server unavailable.\nPrecautions\nThe nat log host detect udp command takes effect on UDP log servers, not TCP log servers."
}