{
    "PageTitle": "nat time",
    "FuncDef": "The nat time command sets the start time, end time, or timestamp in NAT syslogs to the local time or UTC time.\nThe undo nat time command deletes the setting of the local or UTC time for the start time, end time, or timestamp.\nBy default, a device displays the UTC time in flexible NAT syslogs.",
    "CLIs": [
        "nat time { endtime-second-dec | endtime-second-hex | starttime-second-dec | starttime-second-hex | starttime } { local | utc }",
        "nat time { timestamp-second-dec | timestamp-second-hex | timestamp } { local | utc }",
        "undo nat time { endtime-second-dec | endtime-second-hex | starttime-second-dec | starttime-second-hex | starttime } { local | utc }",
        "undo nat time { timestamp-second-dec | timestamp-second-hex | timestamp } { local | utc }"
    ],
    "ParentView": [
        "Flexible log template view"
    ],
    "ParaDef": [
        {
            "Parameters": "endtime-second-dec",
            "Info": "Indicates the end seconds expressed in decimal notation included in a log.\n-"
        },
        {
            "Parameters": "endtime-second-hex",
            "Info": "Indicates the end seconds expressed in hexadecimal notation included in a log.\n-"
        },
        {
            "Parameters": "starttime-second-dec",
            "Info": "Indicates the start seconds expressed in decimal notation included in a log.\n-"
        },
        {
            "Parameters": "starttime-second-hex",
            "Info": "Indicates the start seconds expressed in hexadecimal notation included in a log.\n-"
        },
        {
            "Parameters": "starttime",
            "Info": "Indicates the start time, including the year, month, day, hour, minute, and second.\n-"
        },
        {
            "Parameters": "local",
            "Info": "Indicates the local time.\n-"
        },
        {
            "Parameters": "utc",
            "Info": "Indicates the UTC time.\n-"
        },
        {
            "Parameters": "timestamp-second-dec",
            "Info": "Indicates the seconds expressed in decimal notation of a timestamp.\n-"
        },
        {
            "Parameters": "timestamp-second-hex",
            "Info": "Indicates the seconds expressed in hexadecimal notation of a timestamp.\n-"
        },
        {
            "Parameters": "timestamp",
            "Info": "Indicates the timestamp, including the year, month, day, hour, minute, and second.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat syslog flexible template session",
            "[~HUAWEI-nat-syslog-template-user] nat time starttime-second-dec utc"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe format of NAT syslog information can be flexibly configured. To configure a device to display the local time in NAT syslogs, run the nat time local command.\nPrerequisites\nA flexible NAT syslog template has been created, and the flexible log template view is displayed.\nPrecautions\nThe time format configured using the nat time command takes precedence over that configured using the nat time local command in the flexible log template view. If the nat time command is run, the time format of the end time, start time, or timestamp takes effect according to the configured format. If the nat time command is not run, the nat time local command takes effect. If neither the nat time command nor the nat time local command is run, the default UTC time takes effect."
}