{
    "PageTitle": "nat flow-defend reverse-blacklist lock-ip-address manual-unlock",
    "FuncDef": "The nat flow-defend reverse-blacklist lock-ip-address manual-unlock command specifies an IP addresses to be locked and VPN instance information.\nThe function is disabled by default.",
    "CLIs": [
        "nat flow-defend reverse-blacklist lock-ip-address <lockip-address> [ vpn-instance <vpn-instance-name> ] manual-unlock"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "lockip-address",
            "Info": "Specifies an IP address to be locked in NAT defense.\nThe value is an IPv4 address in dotted decimal notation (X.X.X.X), for example, 10.1.1.1."
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies the name of a VPN instance in NAT defense.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat flow-defend reverse-blacklist lock-ip-address 10.1.1.1 manual-unlock"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf an IP address of NAT attack traffic is not locked, attack traffic keeps being sent to a NAT device, which adversely affects user traffic's bandwidth. To address this problem, run the nat flow-defend reverse-blacklist lock-ip-address manual-unlock command to manually lock an IP address so that a blackhole route to the IP address is generated and an interface board drops traffic destined for this IP address without sending the traffic to the NAT device.\nConfiguration Impact\nAfter the nat flow-defend reverse-blacklist lock-ip-address manual-unlock command is run to lock an IP address and information about the user assigned this IP address is deleted, the IP address is no longer assigned to the other users and a blackhole route to this IP address is generated.\nPrecautions\nThe IP address to be manually locked must be a public IP address in a configured NAT address pool, not in a blacklist.\nThis command is mutually exclusive with the nat flow-defend reverse-blacklist auto-lock enable command.\nThe nat flow-defend reverse-blacklist lock-ip-address manual-unlock command takes effect only on the VSUF-80/VSUF-160/VSUI-160-E."
}