{
    "PageTitle": "nat exchange user public-ip",
    "FuncDef": "The nat exchange user public-ip command configures the update time of public IP addresses.\nThe undo nat exchange user public-ip command restores the default configuration.\nBy default, the update time for public IP addresses is not configured.",
    "CLIs": [
        "nat exchange user public-ip at <time-value>",
        "undo nat exchange user public-ip [ at <time-value> ]"
    ],
    "ParentView": [
        "NAT instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "time-value",
            "Info": "Specifies the update time for public IP addresses.\nThe format is hh:mm:ss, where hh ranges from 0 to 23, mm ranges from 0 to 59, and ss ranges from 0 to 59."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat instance cpe1 id 1",
            "[*HUAWEI-nat-instance-cpe1] nat exchange user public-ip at 12:00:00",
            "Warning: Packet loss may occur for a while during user IP address update, and this may affect the performance. [Y/N]: Y"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe log tracing server cannot identify users based on the port range. In response, a new method of identifying attack users based on log tracing is introduced. Specifically, the mapping between the public and private IP addresses is updated on a regular basis. Based on the intersection of private IP addresses identified at each public IP address update, the filtered private IP addresses are considered the IP addresses of users who are prone to illegitimate behavior.\nPrecautions\nThe forcible and periodic change in public IP addresses assigned to private network users is mutually exclusive with the NAT server, NAT server mode, port-forwarding, port-single function, and overloaded address pool function.\nAfter a device is enabled to forcibly and periodically change public IP addresses assigned to private network users, user services are interrupted and flows must be reestablished during the public IP address change.\nThis command is applicable only to the VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S."
}