{
    "PageTitle": "nat no-pat enhance",
    "FuncDef": "The nat no-pat enhance command enables no-PAT conversion for all IP packets.\nThe undo nat no-pat enhance command restores the default configuration.\nBy default, no-PAT conversion is enabled for packets of TCP/UDP/PPTP ALG for GRE/ICMP and disabled for the other IP packets.",
    "CLIs": [
        "nat no-pat enhance",
        "undo nat no-pat enhance"
    ],
    "ParentView": [
        "NAT instance view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat instance nat1 id 1",
            "[*HUAWEI-nat-instance-nat1] nat no-pat enhance"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nNo-PAT conversion takes effect only on packets of TCP, UDP, ICMP, and PPTP ALG for GRE. To enable no-PAT conversion for all IP packets, run the nat no-pat enhance command.\nConfiguration Impact\nAfter this command is run, the no-PAT conversion mode is supported only in this instance, and the PAT and no-PAT address pools cannot be simultaneously configured.\nPrecautions\nThe nat no-pat enhance command can be run only in NAT444 instances.\nIf the nat pure-ip-packet drop command is run in the system view and the nat no-pat enhance command is run in the NAT444 instance view, the nat pure-ip-packet drop command does not take effect.The\nnat no-pat enhance command is mutually exclusive with the following commands in NAT444 instances:\nexclude-portl2-aware enablenat address-group over-loadnat address-group unnumbered interfacenat address-group bind-ip-poolnat alarm port-number user enablenat bind static-mappingnat ip access-user limitnat port-limit enablenat statistics port-usage enableport-forwarding address-groupport-rangeport-single enablenat port-usage load-balance enablenat server-mode enablenat server protocol unnumbered interfacenat server protocol (The nat no-pat enhance command is mutually exclusive with this command that only configures the interface-level internal server function.)\nAfter the nat no-pat enhance command is run, the following commands can be run but do not take effect:\nnat alarm port-number address-group disablenat alarm address-group port-number thresholdnat alarm user port-number thresholdnat port-limit"
}