{
    "PageTitle": "nat port-limit",
    "FuncDef": "The nat port-limit command sets the maximum number of ports for a user.\nThe undo nat port-limit command restores the default configuration.\nBy default, the maximum number of TCP or UDP ports is 10240, the maximum number of ICMP ports is 512, and the total number of TCP, UDP, and ICMP ports is 20992.",
    "CLIs": [
        "nat port-limit { tcp | udp | icmp | total } <limit-value>",
        "undo nat port-limit { tcp | udp | icmp | total } [ <limit-value> ]"
    ],
    "ParentView": [
        "NAT instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "tcp",
            "Info": "Specifies the maximum number of available TCP ports.\n-"
        },
        {
            "Parameters": "udp",
            "Info": "Specifies the maximum number of available UDP ports.\n-"
        },
        {
            "Parameters": "icmp",
            "Info": "Specifies the maximum number of available ICMP ports.\n-"
        },
        {
            "Parameters": "total",
            "Info": "Specifies the maximum number of available ports.\nIf the total number of TCP, UDP, and ICMP ports used for NAT has exceeded the maximum, NAT cannot be performed even if the number of TCP, UDP, or ICMP ports used for NAT has not reached the maximum.\n-"
        },
        {
            "Parameters": "limit-value",
            "Info": "Sets a limit on the number of ports.\nThe value is an integer ranging from 50 to 65535."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat instance cpe1 id 1",
            "[*HUAWEI-nat-instance-cpe1] nat port-limit tcp 20000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nSome unauthorized users may consume a lot of port resources to attack devices. As a result, there is a possibility that no port can be assigned to authorized users for NAT. To limit the maximum number of ports for a user, run the nat port-limit command.\nConfiguration Impact\nAfter this command is executed in the NAT instance view, the system limits the number of ports that can be used for each user. When the number of ports used for NAT reaches the upper limit, NAT cannot be performed for subsequent users.\nIf both the nat port-limit and port-range commands have been executed in the NAT instance view, the smaller value is used for the port number limit.\nPrecautions\nThis command does not take effect on the address-based NAT internal server.\nThis command cannot be run after the vsm on-board-mode enable command is run."
}