{
    "PageTitle": "nat alarm address-group port-number threshold",
    "FuncDef": "The nat alarm address-group port-number threshold command configures the port usage alarm threshold for a NAT address pool.\nThe undo nat alarm address-group port-number threshold command restores the default configuration.\nBy default, the alarm threshold of the port usage for a NAT address pool is 80%.",
    "CLIs": [
        "nat alarm address-group port-number threshold <threshold>",
        "undo nat alarm address-group port-number threshold [ threshold ]"
    ],
    "ParentView": [
        "NAT instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "threshold",
            "Info": "Specifies the alarm threshold of the port usage for a NAT address pool.\nThe value is an integer ranging from 60 to 100."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat instance cpe1 id 1",
            "[*HUAWEI-nat-instance-cpe1] nat alarm address-group port-number threshold 85"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure the alarm threshold of the port usage for a NAT address pool, run the nat alarm address-group port-number threshold command. If port usage reaches the specified alarm threshold, an alarm is generated.\nPrerequisites\nThe log and alarm functions for public address pool usage have been enabled. Ensure that the nat alarm port-number address-group disable command has not been run.\nConfiguration Impact\nAfter you run the nat alarm address-group port-number threshold command to configure an alarm threshold, an alarm is reported when the port usage of a NAT address pool reaches the threshold. This alarm is cleared when the port usage of the NAT address pool falls below 87.5% of the threshold.\nPrecautions\nThis command is applicable to all address pools in a specified NAT instance.port usage of a NAT address pool = number of ports used by the public network IP addresses in the NAT address pool/Total number of ports available for the public network addresses in the NAT address pool.This command is applicable only to the NAT address pool in non-easy IP mode.\n\n\nThis command is applicable only to the VSUF-80/VSUF-160/VSUI-160-E."
}