{
    "PageTitle": "nat address-group unnumbered interface",
    "FuncDef": "The nat address-group unnumbered interface command configures the multiplexing relationship between address pools and interface addresses in a simplified NAT instance.\nThe undo nat address-group unnumbered interface command deletes the multiplexing relationship between address pools and interface addresses in a simplified NAT instance.\nBy default, no multiplexing relationship between address pools and interface addresses is configured in a simplified NAT instance.",
    "CLIs": [
        "nat address-group <address-group-name> group-id <id> unnumbered interface { <interface-name> | <interface-type> <interface-number> }",
        "undo nat address-group <address-group-name> group-id <id> unnumbered interface { <interface-name> | <interface-type> <interface-number> }"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "address-group-name",
            "Info": "Specifies the name of an IP address pool.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "group-id id",
            "Info": "Specifies an address pool ID.\nThe value is an integer ranging from 0 to 127."
        },
        {
            "Parameters": "unnumbered",
            "Info": "Borrow the address of an interface.\n-"
        },
        {
            "Parameters": "interface interface-name",
            "Info": "Specifies the name of an interface.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "interface-type",
            "Info": "Specifies the type of an interface.\nThe value can be: Ethernet, GE, Eth-trunk, Vlanif."
        },
        {
            "Parameters": "interface-number",
            "Info": "Specifies the number of an interface.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat instance nat1 id 1 simple-configuration",
            "[*HUAWEI-nat-instance-nat1] commit",
            "[~HUAWEI-nat-instance-nat1] quit",
            "[~HUAWEI] interface GigabitEthernet 1/0/1",
            "[*HUAWEI-GigabitEthernet1/0/1] ip address 1.1.1.1 255.255.255.0",
            "[*HUAWEI-GigabitEthernet1/0/1] quit",
            "[~HUAWEI] nat address-group group1 group-id 1 unnumbered interface GigabitEthernet 1/0/1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn an enterprise network, an interface address must be different from that in a NAT address pool. As public IP addresses are limited, enterprise users have to expand the number of public IP addresses. The NAT address pool can be configured to reuse interface addresses to help the enterprise users to lower the cost in applying for public IP addresses.\nIn easy IP mode, to configure the multiplexing relationship between address pools and interface addresses in a simplified NAT instance, run the nat address-group unnumbered interface command.\nPrecautions\nIP addresses in a NAT address pool cannot be assigned to interfaces.IP addresses in an address pool cannot overlap those in another address pool or those of existing interfaces.Each instance is bound to a single interface, and each interface can be borrowed by a single instance."
}