{
    "PageTitle": "nat ip-pool",
    "FuncDef": "The nat ip-pool command creates a global address pool and displays the global address pool view.\nThe undo nat ip-pool command deletes a global address pool.\nBy default, no global address pool is created.",
    "CLIs": [
        "nat ip-pool <pool-name> [ dynamic ] [ vpn-instance <vpn-instance-name> ] [ no-pat ] [ slave ]",
        "undo nat ip-pool <pool-name> [ dynamic ] [ vpn-instance <vpn-instance-name> ] [ no-pat ] [ slave ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "pool-name",
            "Info": "Specifies the name of an IP address pool.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "dynamic",
            "Info": "Indicates the global dynamic address pool.\n-"
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies the name of a VPN instance.When this parameter is not configured, a global static address pool is created.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "no-pat",
            "Info": "Indicates a global address pool working in no-PAT mode.If this parameter is not configures, a global address pool works in PAT mode.\n-"
        },
        {
            "Parameters": "slave",
            "Info": "Indicates that the global static address pool is a slave chassis address pool.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat ip-pool pool1 dynamic"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat ip-pool pool1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThere are two global address pools, a static global address pool and a dynamic global address pool (DAP).\nGlobal static address pool: is configured by specifying a public IP address range, initial address range, extended address range, and thresholds for applying for and releasing addresses in a NAT instance. Such an address pool enables individual NAT devices to uniformly manage address pools.Global DAP: Users can more flexibly to apply for public IP addresses from an on-demand address pool server. The public IP addresses in the address pool are uniformly managed so that NAT devices share addresses in the same address pool.\n\nFollow-up Procedure\nAfter creating a global address pool, configure the NAT instance dynamic address pool to bind the global address pool and apply for the address segment from the global address pool.\nPrecautions\nWhen the global address pool is bound to an instance that has dynamic load balancing enabled, this global address pool cannot be used by another instance.\nThe slave parameter must be specified when running the nat ip-pool command on the backup device in an inter-chassis backup scenario.\nThis command is applicable only to the VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S."
}