{
    "PageTitle": "nat bind instance",
    "FuncDef": "The nat bind instance command binds a traffic behavior to a NAT instance.\nThe undo nat command removes the binding between a traffic behavior and a NAT instance.\nBy default, no traffic behavior is bound to a NAT instance.",
    "CLIs": [
        "nat bind instance <instance-name>",
        "undo nat [ bind instance <instance-name> ]"
    ],
    "ParentView": [
        "Traffic behavior view"
    ],
    "ParaDef": [
        {
            "Parameters": "instance instance-name",
            "Info": "Specifies the name of a NAT instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat instance cpe1 id 1",
            "[*HUAWEI-nat-instance-cpe1] commit",
            "[~HUAWEI-nat-instance-cpe1] quit",
            "[~HUAWEI] traffic behavior b1",
            "[*HUAWEI-behavior-b1] nat bind instance cpe1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo bind a traffic behavior to a NAT instance, run the nat bind instance command. On a carrier network, NAT must be performed for all user traffic. To meet this requirement, configure a traffic profile and apply it to an inbound interface. A traffic policy must be defined to direct traffic to a VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S for NAT processing. The configuration involves defining ACL rules, traffic classifiers, traffic behaviors, and traffic distribution policies and applying the traffic distribution policies.\nPrerequisites\nACL rules have been configured to match user traffic to be processed by NAT. Traffic classifiers have also been configured.\nFollow-up Procedure\nBind the traffic classifier with the traffic behavior in a traffic policy and apply the traffic policy to an interface or globally.\nPrecautions\nThe nat bind instance and nat bind acl commands are mutually exclusive. That is, NAT inbound and outbound traffic diversion policies cannot both be configured on the same device.\nIn the traffic behavior view, the NAT redirection is mutually exclusive with redirection actions (including the deny action, NAT44 traffic distribution, DS-Litetraffic distribution, NAT64 traffic distribution, DNS redirection action, HTTP redirection action, and redirect action, and redirect-CPU action).\nThe nat bind instance command is used in a policy for directing traffic received by an inbound interface to a nat service board.Binding a nat instance to a traffic behavior is mutually exclusive with The redirection function."
}