{
    "PageTitle": "nat session-limit",
    "FuncDef": "The nat session-limit enable command enables the limitation on the maximum number of user-based NAT sessions that can be established, or sets the maximum number of user-based NAT sessions that can be established.\nThe undo nat session-limit enable command disables the limitation on the maximum number of user-based NAT sessions that can be established, or restores the default maximum number.\n\nThe user-based NAT session number limitation is enabled by default. The default maximum number of user-based NAT sessions for each type of protocols is as follows:\n\n\nTCP or UDP: 10240\n\nICMP: 512\n\nSummation of TCP, UDP and ICMP: 8192. If the maximum number of NAT sessions of all protocols is set, this setting takes preference over the setting for a specific type protocol.",
    "CLIs": [
        "nat session-limit { enable | icmp <session-number> | tcp <session-number> | total <session-number> | udp <session-number> }",
        "undo nat session-limit { enable | { icmp | tcp | total | udp } [ <session-number> ] }"
    ],
    "ParentView": [
        "NAT instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "enable",
            "Info": "Enables the limitation on the maximum number of user-based NAT sessions that can be established.\n-"
        },
        {
            "Parameters": "icmp session-number",
            "Info": "Indicates the maximum number of ICMP sessions for each user.\nThe value is an integer ranging from 1 to 65535."
        },
        {
            "Parameters": "tcp session-number",
            "Info": "Indicates the maximum number of TCP sessions for each user.\nThe value is an integer ranging from 1 to 65535."
        },
        {
            "Parameters": "total session-number",
            "Info": "Indicates the maximum number of all sessions for each user.If the total number of TCP, UDP, and ICMP sessions used for NAT has reached the upper limit, NAT cannot be performed even if the number of TCP, UDP, or ICMP sessions used for NAT has not reached the upper limit.\nThe value is an integer ranging from 1 to 65535."
        },
        {
            "Parameters": "udp session-number",
            "Info": "Indicates the maximum number of UDP sessions for each user.\nThe value is an integer ranging from 1 to 65535."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat instance cpe1 id 1",
            "[*HUAWEI-nat-instance-cpe1] nat session-limit tcp 20000"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat instance nat id 1",
            "[*HUAWEI-nat-instance-cpe1] nat session-limit enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo enable the limitation on the maximum number of user-based NAT sessions that can be established, run the nat session-limit enable command. This command helps prevent a great number of NAT sessions from adversely affecting the transmission of services that NAT processes.\nTo set the maximum number of user-based NAT sessions that can be established, run the nat session-limit command in the NAT instance view.\nPrerequisites\nThe limitation on the maximum number of user-based NAT sessions that can be established has been enabled using the nat session-limit enable command.\nConfiguration Impact\nWhen the number of NAT sessions of a user reaches the upper limit, additional NAT sessions cannot be established. After existing NAT sessions age and the number of established sessions falls below the upper limit, new sessions can be established for the user."
}