{
    "PageTitle": "nat alarm session-number threshold",
    "FuncDef": "The nat alarm session-number threshold command sets the trap and log alarm threshold of the total number of NAT sessions.\nThe undo nat alarm session-number threshold command restores the default trap and log alarm threshold of the total number of NAT sessions.\nThe default trap and log alarm threshold of the total number of NAT sessions is 80%.",
    "CLIs": [
        "nat alarm session-number threshold <threshold-value>",
        "undo nat alarm session-number threshold [ <threshold-value> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "threshold threshold-value",
            "Info": "Sets the alarm threshold for the number of NAT sessions.\nThe value is an integer ranging from 60 to 90, in percentage. The default value is 80."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat alarm session-number threshold 85"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo set the trap and log alarm threshold of the total number of NAT sessions, run the nat alarm session-number threshold command. If NAT session usage reaches the alarm threshold, a service board sends an alarm to the NMS or records a log message locally.\nPrerequisites\nThe device has been configured to generate an alarm in either trap or log mode if the proportion of the number of configured NAT sessions to the maximum number reaches a specified alarm threshold. If the alarm or log mode is disabled, to enable them, run the undo nat alarm session-number { log | trap } disable command.\nConfiguration Impact\nIf NAT session usage reaches the specified alarm threshold, the service board sends an alarm to the NMS or records a log message locally. If NAT session usage exceeds the alarm threshold, the service board does not repeatedly send an alarm or record a log. After NAT session usage falls to 87.5%, the service board sends a clear alarm to the NMS or records a log message locally.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}