{
    "PageTitle": "nat centralized-backup enable",
    "FuncDef": "The nat centralized-backup enable command enables the switching and switchback function for centralized backup of distributed NAT.\nThe undo nat centralized-backup enable command restores the default configuration.\nBy default, user traffic is not automatically switched on distributed NAT devices or switched back on centralized NAT devices in the centralized backup of distributed NAT scenario.",
    "CLIs": [
        "nat centralized-backup enable",
        "undo nat centralized-backup enable"
    ],
    "ParentView": [
        "NAT instance view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat instance cpe1 id 1",
            "[*HUAWEI-nat-instance-cpe1] nat centralized-backup enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo save the carrier's costs, if a NAT service board on a BRAS becomes faulty, user traffic is redirected to the NAT device connected to the CR for NAT implementation, ensuring service continuity and centralized backup of distributed NAT. To enable the switching and switchback function for centralized backup of distributed NAT, run the nat centralized-backup enable command.\nPrerequisites\nThe service-instance-group instance group has been bound to the NAT instance using the nat centralized-backup enable command.\nConfiguration Impact\nAfter centralized backup of distributed NAT is enabled, users do not go offline in case of a VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S fault on the BRAS. Instead, user traffic is distributed to the NAT device connected to the CR configured with centralized NAT for NAT implementation. After the VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S fault on the BRAS is rectified, the BRAS reestablishes the user table, and user traffic is switched back to the BRAS for NAT implementation.\nPrecautions\nThis command is applicable only to the VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S."
}