{
    "PageTitle": "nat address-group unnumbered interface (NAT instance view)",
    "FuncDef": "The nat address-group unnumbered interface command creates a reusing relationship between a NAT address pool and an interface address.\nThe undo nat address-group unnumbered interface command deletes the reusing relationship between a NAT address pool and an interface address.\nBy default, no reusing relationship exists between a NAT address pool and an interface address.",
    "CLIs": [
        "nat address-group <address-group-name> group-id <id> unnumbered interface { <interface-name> | <interface-type> <interface-number> }",
        "undo nat address-group <address-group-name> group-id <id> unnumbered interface { <interface-name> | <interface-type> <interface-number> }"
    ],
    "ParentView": [
        "NAT instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "address-group-name",
            "Info": "Specifies the name of an address pool.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "group-id id",
            "Info": "Specifies the ID of the address pool.\nThe value is an integer ranging from 0 to 127."
        },
        {
            "Parameters": "unnumbered",
            "Info": "Borrow the address of an interface.\n-"
        },
        {
            "Parameters": "interface-name",
            "Info": "Specifies the name of an interface.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "interface-type",
            "Info": "Specifies the type of the interface.\nThe value can be: Ethernet, GE, Eth-trunk, Vlanif."
        },
        {
            "Parameters": "interface-number",
            "Info": "Specifies the number of the interface.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/1",
            "[*HUAWEI-GigabitEthernet1/0/1] ip address 1.1.1.1 255.255.255.0",
            "[*HUAWEI-GigabitEthernet1/0/1] quit",
            "[~HUAWEI] nat instance cpe1 id 1",
            "[*HUAWEI-nat-instance-cpe1] nat address-group group1 group-id 1 unnumbered interface GigabitEthernet 1/0/1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn enterprise network scenarios, IP addresses in a NAT address pool do not overlap with interface addresses, leading to insufficiency of public IP addresses. To expand public IP address for enterprise users, run the nat address-group unnumbered interface command to configure a reusing relationship between a NAT address pool and an interface address.\nPrecautions\nA single interface address can be used in each NAT instance view. Borrowing different interface addresses in a NAT instance is not allowed.The primary IP address, not the secondary IP address, of an interface can be borrowed.A device supports the binding of 16 interfaces to 16 NAT instances in EasyIP scenarios.\n\nThis command applies only to the /LPUF-51-E/LPUI-51-E/LPUI-51-S/ or VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S."
}