{
    "PageTitle": "nat alg (NAT policy View)",
    "FuncDef": "The nat alg command configures the application protocol types that the NAT ALG detects.\nThe undo nat alg command cancels the application protocol types for the NAT ALG to detect.\nBy default, the NAT ALG function is enabled for ICMP.",
    "CLIs": [
        "nat alg { all | ftp | pptp | rtsp | sip }",
        "undo nat alg { all | ftp | pptp | rtsp | sip }"
    ],
    "ParentView": [
        "NAT policy View"
    ],
    "ParaDef": [
        {
            "Parameters": "all",
            "Info": "Applies the NAT ALG to all protocols.\n-"
        },
        {
            "Parameters": "ftp",
            "Info": "Enables NAT ALG for FTP. NAT ALG does not support SFTP or FTPS.\n-"
        },
        {
            "Parameters": "pptp",
            "Info": "Enables NAT ALG for PPTP.\n-"
        },
        {
            "Parameters": "rtsp",
            "Info": "Enables NAT ALG for RTSP.\n-"
        },
        {
            "Parameters": "sip",
            "Info": "Enables NAT ALG for SIP.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat-policy template template1",
            "[*HUAWEI-nat-policy-template1] nat alg ftp"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nNAT can be used to convert only the IP addresses contained in user data packets and the port information in the TCP/UDP headers of the data packets. For special protocols, such as File Transfer Protocol (FTP), the data part in a packet can contain IP address or port information. Inconsistency occurs and errors are caused if the IP address or port information in the data part of a packet is not converted. A good way to solve the NAT issue for these special protocols is to use the ALG function. As a special translation agent for application protocols, the ALG interacts with NAT to establish states. It uses NAT state information to change the specific data in the data part of IP packets, and complete other necessary work, so that application protocols can run across internal and external networks.\nConfiguration Impact\nFor the traffic entering the NAT instance after the ALG function is enabled in the NAT policy template, the ALG operation is performed for the ALG-enabled application protocols.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nNAT ALG does not take effect on protocol packets that match port-level NAT internal server mappings."
}