{
    "PageTitle": "nat syslog flexible template",
    "FuncDef": "The nat syslog flexible template command creates a NAT flexible log template and displays its view.\nThe undo nat syslog flexible template command deletes a NAT flexible log template.\nBy default, no flexible log template is created.",
    "CLIs": [
        "nat syslog flexible template session",
        "nat syslog flexible template { user | session }",
        "undo nat syslog flexible template session",
        "undo nat syslog flexible template { user | session }"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "user",
            "Info": "Indicates user logs. This parameter takes effect only on a VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S.\n-"
        },
        {
            "Parameters": "session",
            "Info": "Indicates flow logs.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat syslog flexible template session",
            "[~HUAWEI-nat-syslog-template]"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo allow a device to output syslog information in a format mapped to a customer log system, run the nat syslog flexible template command\nConfiguration Impact\nIf the centralized board mode is used and no log format is specified in a flexible log template, the default type 3 format takes effect for both user and flow logs. If a log format is specified in a flexible log template for user or flow logs, the user or flow logs are sent in the flexible log template format. If the on-board mode is used and no NAT syslog format is specified in a flexible log template, the default type 3 format takes effect for flow logs. If a log format is specified in a flexible log template, flow logs are sent in the flexible log template format.\nFollow-up Procedure\nAfter the NAT flexible log template view is displayed, run the nat position command or nat position command to configure a NAT flexible log format; run the ds-lite position command or ds-lite position command to configure a DS-Lite flexible log format; run the nat64 position command or nat64 position command to configure a NAT64 flexible log format."
}