{
    "PageTitle": "port-range (NAT instance view)",
    "FuncDef": "The port-range command configures a port range for port pre-allocation.\nThe undo port-range command cancels the configuration.\nBy default, the dynamic port allocation mode is used.",
    "CLIs": [
        "port-range <range-value> [ extended-port-range <range-value> extended-times <times> ]",
        "undo port-range [ <range-value> [ extended-port-range <range-value> extended-times <times> ] ]"
    ],
    "ParentView": [
        "NAT instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "range-value",
            "Info": "Specifies the number of initially allocated ports.\nThe value is an integer multiple of 64, ranging from 64 to 64512."
        },
        {
            "Parameters": "extended-port-range range-value",
            "Info": "Specifies the number of ports that can be incrementally assigned at every port allocation.\nThe value is an integer multiple of 64, ranging from 64 to 8192."
        },
        {
            "Parameters": "extended-times times",
            "Info": "Specifies the number of times that incremental port allocation is supported.\nThe value is an integer ranging from 1 to 3."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat instance cpe1 id 1",
            "[*HUAWEI-nat-instance-cpe1] port-range 1024"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe port-range command configures a port range for port pre-allocation.\nThe undo port-range command cancels the configuration.\nPrecautions\nIf you have configured port-range for both the NAT instance and template, the configurations in the NAT policy template take precedence when the system matches an online user with the policy template issued by the RADIUS server.\nIf the port-range command is run more than once, the latest configuration overrides the previous one.\nIf a NAT instance has had online users, the port allocation mode of the instance cannot be changed to another port allocation mode. If the port pre-allocation mode or incremental port allocation mode has been configured, you can change the port-range parameter values in overriding mode. The change takes effect only for new users.\nIn VS mode, this command is supported only by the admin VS.\nThis command is applicable only to the VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S."
}