{
    "PageTitle": "port-forwarding address-group",
    "FuncDef": "The port-forwarding address-group command configures a NAT address pool and port range for the dynamic association of internal servers.\nThe undo port-forwarding address-group command deletes a NAT address pool and port range configured for the dynamic association of internal servers.\nBy default, no NAT address pool and port range are configured for the dynamic association of internal servers.",
    "CLIs": [
        "port-forwarding address-group <addr-grp-name> port-scope <start-port-value> <end-port-value>",
        "undo port-forwarding address-group <addr-grp-name> [ port-scope <start-port-value> <end-port-value> ]"
    ],
    "ParentView": [
        "NAT instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "addr-grp-name",
            "Info": "Specifies the name of a NAT address pool.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "port-scope start-port-value",
            "Info": "Specifies the start port number of a port range.\nThe value is an integer that ranges from 1 to 65535."
        },
        {
            "Parameters": "port-scope end-port-value",
            "Info": "Specifies the end port number of a port range.\nThe value is an integer that ranges from 1 to 65535."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat instance cpe1 id 1",
            "[*HUAWEI-nat-instance-cpe1] nat address-group group1 group-id 1 10.1.1.1 10.1.1.155",
            "[*HUAWEI-nat-instance-cpe1] port-forwarding address-group group1 port-scope 2000 2020"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe IP addresses of internal servers may frequently change. To avoid frequent manual modification of the configurations of internal NAT servers, you can deploy the port forwarding function to dynamically associate each internal server with a public network IP address and port.\nPrecautions\nA global static address pool does not support the port-forwarding function.\nAfter you run the port-forwarding address-group command, all the ports in the specified port range in the address pool are no longer used as public network ports for NAT.\nThis command configures only the port range of the port forwarding service. The port forwarding rules, however, are issued by the RADIUS server when the user gets online.\nA maximum of 4096 ports can be configured for parameters start-port and end-port in this command.\nIn VS mode, this command is supported only by the admin VS."
}