{
    "PageTitle": "public-address nat enable",
    "FuncDef": "The public-address nat enable command enables the NAT device to process traffic from public network IPv4 address users in distributed CGN scenarios before forwarding it based on the routing table.\nThe undo public-address nat enable command disables the NAT device from processing traffic from public network IPv4 address users before forwarding it based on the routing table.\nBy default, when a NAT instance is bound to a domain, the NAT device processes the traffic from both the public and private network IPv4 address users who get online from the domain before forwarding the traffic based on the routing table.",
    "CLIs": [
        "public-address nat enable",
        "undo public-address nat enable"
    ],
    "ParentView": [
        "AAA domain view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[*HUAWEI-aaa] domain huawei",
            "[*HUAWEI-aaa] commit",
            "[~HUAWEI-aaa-domain-huawei] undo public-address nat enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, when public and private network address users coexist in a domain to which a NAT instance is bound, the NAT device processes the traffic from both the public and private network IPv4 address users who get online from the domain before forwarding the traffic based on the routing table. For public network user traffic, processing it using NAT before forwarding wastes NAT resources, and public network user-related functions outnumber NAT user-related functions. For public network user traffic, NAT processing is unnecessary. After the undo public-address nat enable command is run to disable the NAT processing, traffic from public network address users is forwarded based on the routing table.\nThe Internet Assigned Numbers Authority (IANA) defines private address pools within the segments of 192.168.0.0/16, 10.0.0.0/8, 100.64.0.0/10 and 172.16.0.0/12, and the rest are public IPv4 address pools. If both public and private IPv4 address pools are bound to a domain or delivered by a RADIUS server and the carrier wants user traffic with public IPv4 addresses to bypass the NAT process, run the undo public-address nat enable command.\nConfiguration Impact\nThe command takes effect only on users who get online after the command is run.\nPrecautions\nBy default, the public-address nat enable command is configured.\nThe public-address nat enable command only takes effect on VSUF-80/VSUF-160/VSUI-160-Es."
}