{
    "PageTitle": "redirect ip-nexthop if-match",
    "FuncDef": "The redirect ip-nexthop if-match command enables traffic redirection based on a specified application ID in a service chain instance.\nThe undo redirect ip-nexthop if-match command disables traffic redirection based on a specified application ID in a service chain instance.\nBy default, traffic redirection based on an application ID is not enabled in a service chain instance.",
    "CLIs": [
        "redirect ip-nexthop <ip-address> { forward | reverse } if-match application-id <application-id>",
        "undo redirect ip-nexthop <ip-address> { forward | reverse } if-match application-id <application-id>"
    ],
    "ParentView": [
        "Service chain instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address",
            "Info": "Specifies a next-hop IPv4 address to which traffic is redirected.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "forward",
            "Info": "Indicates redirection of the traffic sent from the private network to the public network.\n-"
        },
        {
            "Parameters": "reverse",
            "Info": "Indicates redirection of the traffic from the public network to the private network.\n-"
        },
        {
            "Parameters": "application-id application-id",
            "Info": "Specifies an application ID.\nThe value is an integer that ranges from 1 to 8."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] service-chain instance test id 1",
            "[~HUAWEI-service-chain-instance-test] redirect ip-nexthop 10.1.1.1 forward if-match application-id 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf traffic that passes through a service chain needs to be redirected, run the redirect ip-nexthop if-match command in the service chain instance.\nPrerequisites\nA service chain instance has been created.\nPrecautions\nRedirecting traffic that matches a specified application ID takes effect only after the next hop of a service chain instance is bound to an SA instance.A maximum of eight redirect ip-nexthop if-match command instances can be run in each service chain instance.All redirect ip-nexthop if-match command instances in a service chain instance must support the same direction specified by either the forward or reverse parameter.When a service chain instance has multiple configurations of redirection for traffic matching application IDs, all application IDs must be unique.Redirection configured in a service chain instance is mutually exclusive with redirection configured in a NAT instance."
}