{
    "PageTitle": "redirect ip-nexthop (Service chain instance view)",
    "FuncDef": "The redirect ip-nexthop command configures traffic redirection for the service chain instance.\nThe undo redirect ip-nexthop command deletes traffic redirection of the service chain instance.\nBy default, traffic redirection of the service chain instance is disabled.",
    "CLIs": [
        "redirect ip-nexthop <ip-address> { forward | reverse }",
        "undo redirect [ ip-nexthop <ip-address> { forward | reverse } ]"
    ],
    "ParentView": [
        "Service chain instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "forward",
            "Info": "Indicates redirection of the traffic from the private network to the public network.\n-"
        },
        {
            "Parameters": "reverse",
            "Info": "Indicates redirection of the traffic from the public network to the private network.\n-"
        },
        {
            "Parameters": "ip-nexthop ip-address",
            "Info": "Specifies the next-hop IPv4 address for redirection.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] service-chain instance test id 1",
            "[*HUAWEI-service-chain-instance-test] redirect ip-nexthop 10.60.60.1 reverse"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the traffic that passes the service chain does not meet requirements of policy-based routing, to redirect the traffic that passes the service chain, run the redirect ip-nexthop command in the service chain instance to\nspecify the traffic direction.\nPrerequisites\nThe service chain instance has been created.\nPrecautions\nOnly redirection on one direction can be configured in the service chain instance, and only one configuration record is supported.If the NAT service is not the last hop on the direction, NAT redirection cannot be configured.If redirection is configured for the service chain instance, redirection cannot be configured for the NAT instance."
}