{
    "PageTitle": "section unnumbered interface",
    "FuncDef": "The section unnumbered interface command creates a reusing relationship between a NAT address pool and an interface address.\nThe undo section unnumbered interface command deletes the configured reusing relationship.\nBy default, no reusing relationship exists between a NAT address pool and an interface address.",
    "CLIs": [
        "section <section-num> unnumbered interface { <interface-name> | <interface-type> <interface-number> }",
        "undo section <section-num> unnumbered interface { <interface-name> | <interface-type> <interface-number> }"
    ],
    "ParentView": [
        "NAT instance address pool view"
    ],
    "ParaDef": [
        {
            "Parameters": "section-num",
            "Info": "Specifies an address segment number.\nThe value is an integer ranging from 0 to 15."
        },
        {
            "Parameters": "interface interface-type interface-number",
            "Info": "Specifies the type and number of an interface.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] ip address 10.1.1.0 255.255.255.0",
            "[~HUAWEI-GigabitEthernet1/0/1] commit",
            "[~HUAWEI-GigabitEthernet1/0/1] quit",
            "[~HUAWEI] nat instance cpe1 id 1",
            "[*HUAWEI-nat-instance-cpe1] nat address-group group1 group-id 0",
            "[*HUAWEI-nat-instance-cpe1-nat-address-group-group1] section 1 unnumbered interface GigabitEthernet 1/0/1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn an enterprise network, an interface address must be different from that in a NAT address pool. As public IP addresses are limited, enterprise users have to expand the number of public IP addresses. The NAT address pool can be configured to reuse interface addresses to help the enterprise users to lower the cost in applying for public IP addresses.\nPrecautions\nA maximum of 16 public address segments can be configured using the section command in the NAT address pool view. A single address segment that borrows interface addresses can be configured in each NAT instance, and the other address segments contain only common addresses.\nAn easy IP scenario (an interface address can be used as an IP address in an address pool or NAT server address) is mutually exclusive with centralized CGN providing cold backup for distributed CGN, global address pool, distributed CGN, inter-chassis hot backup, exclude-IP, and the address lock function.\nIn an easy IP scenario (an interface address can be used as an IP address in an address pool or NAT server address), but the no-PAT address pool is not supported, and an address-level NAT server cannot reuse an interface address.\nIn the NAT address pool view, a maximum of 16 public address sections are supported by the section command. A NAT instance supports a single address section of a multiplexing interface and multiple common address sections.\nThis command applies only to the LPUF-51-E/LPUI-51-E/LPUI-51-S/VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S."
}