{
    "PageTitle": "section (Global CGN address pool view)",
    "FuncDef": "The section command configures an address segment in a CGN global static address pool.\nThe undo section command deletes the configured address segment in a CGN global static address pool.\nBy default, no address segment is configured in a CGN global static address pool.",
    "CLIs": [
        "section <section-id> <start-ip> mask <mask-length>",
        "undo section <section-id> [ <start-ip> mask <mask-length> ]"
    ],
    "ParentView": [
        "Global CGN address pool view"
    ],
    "ParaDef": [
        {
            "Parameters": "section-id",
            "Info": "Sets the ID of an address segment in a global static address pool.\nThe value is an integer ranging from 0 to 255."
        },
        {
            "Parameters": "start-ip",
            "Info": "Specifies the start IP address of an address segment in a global static address pool.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "mask mask-length",
            "Info": "Sets the mask length for an address segment in a global static address pool.\nThe value is an integer ranging from 16 to 32."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat ip-pool pool1",
            "[*HUAWEI-nat-ip-pool-pool1] section 0 10.1.1.1 mask 24"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter a global static address pool is configured, the section command must be run in the global static address pool view to configure an address segment, from which addresses are assigned to private network users.\nPrecautions\nA global static address pool contains up to 256 address segments, with each segment supporting a maximum of 64x1024 unique addresses.\nAddress segments configured in a global static address pool cannot overlap. If address segments overlap, a message is displayed indicating that this address segment overlaps another address segment.\nWhen addresses in the configured address pool are in use, the undo section command cannot be run.\nThis command is applicable only to the VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S."
}