{
    "PageTitle": "section exclude-ip-address(Global CGN address pool view)",
    "FuncDef": "The section exclude-ip-address command excludes an IP address or address segment from an address pool in a specific section.\nThe undo section exclude-ip-address command cancels the exclusion of an IP address or an address segment from an address pool in a specific section.\nBy default, excluding an IP address or an address segment from an address pool in a specific section is prohibited.",
    "CLIs": [
        "section <section-id> exclude-ip-address <start-address> [ <end-address> ]",
        "undo section <section-id> exclude-ip-address <start-address> [ <end-address> ]"
    ],
    "ParentView": [
        "Global CGN address pool view"
    ],
    "ParaDef": [
        {
            "Parameters": "section-id",
            "Info": "Specifies the ID of an IP address segment in an IP address pool.\nThe value is an integer ranging from 0 to 255."
        },
        {
            "Parameters": "start-address",
            "Info": "Specifies the start IP address of an address segment to be excluded from an address pool.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "end-address",
            "Info": "Specifies the end IP address of an address segment.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat ip-pool pool1",
            "[*HUAWEI-nat-ip-pool-pool1] section 1 10.0.0.0 mask 24",
            "[*HUAWEI-nat-ip-pool-pool1] section 1 exclude-ip-address 10.0.0.0 10.0.0.5"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nGenerally, an address pool section (with specified IP addresses or address segments excluded) is broken down into multiple address pools. To exclude an IP address or address segment from an address pool in a specific section, run the section exclude-ip-address command. Then, the configurations on the address pool do not work on the excluded IP address or address segment.\nPrerequisites\nA global static address pool and an address pool section have been configured.\nPrecautions\nThis command is applicable only to the VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S."
}