{
    "PageTitle": "service-chain bind instance",
    "FuncDef": "The service-chain bind instance command binds a service chain instance to a traffic behavior.\nThe undo service-chain bind instance unbinds the service chain instance bound from a traffic behavior.\nBy default, no traffic behavior is bound to the service chain.",
    "CLIs": [
        "service-chain bind instance <service-chain-name> { forward | reverse }",
        "undo service-chain [ bind instance <service-chain-name> { forward | reverse } ]"
    ],
    "ParentView": [
        "Traffic behavior view"
    ],
    "ParaDef": [
        {
            "Parameters": "forward",
            "Info": "Indicates the upstream traffic direction of the service chain, that is, packets are sent from the private network to the public network.\n-"
        },
        {
            "Parameters": "reverse",
            "Info": "Indicates the downstream traffic direction of the service chain, that is, packets are sent from the public network to the private network.\n-"
        },
        {
            "Parameters": "instance service-chain-name",
            "Info": "Specifies the name of a service chain instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] service-chain instance test1 id 1",
            "[*HUAWEI-service-chain-instance-test1] quit",
            "[~HUAWEI] traffic behavior b1",
            "[*HUAWEI-behavior-b1] service-chain bind instance test1 forward"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn service chain instance scenarios, to bind a service chain instance to a traffic behavior, run the service-chain bind instance command on the interface board, so\nthat the traffic is led to the board where the service resides.\nPrerequisites\nYou have completed the following configurations before you run the\nservice-chain bind instance command.\nYou have configured a traffic behavior.You have configured a service chain instance.\n\nPrecautions\nNote the following:\nIf the policy bound to the traffic behavior is configured on the VBDIF interface, the service chain instance cannot be bound to the traffic behavior.If the policy bound to the traffic behavior is configured on the EVC-Ethernet interface, the service chain instance cannot be bound to the traffic behavior.If the policy bound to the traffic behavior is applied to the VSI service, the service chain instance cannot be bound to the traffic behavior.If redirection is configured for the traffic behavior, the service chain instance cannot be bound to the traffic behavior.If the deny action is configured for the traffic behavior, the service chain instance cannot be bound to the traffic behavior.If a service chain instance is bound to the traffic behavior, other service chain instances cannot be bound to the traffic behavior.A service chain instance that is not configured on the device cannot be bound to the traffic behavior."
}