{
    "PageTitle": "subnet length initial (Global CGN address pool view)",
    "FuncDef": "The subnet length initial command sets the lengths and masks of the initial and extended address segments for a global dynamic address pool.\nThe undo subnet length initial command deletes the lengths and masks of the initial and extended address segments for a global dynamic address pool.\nBy default, the lengths and masks of the initial and extended address segments are not set for a global dynamic address pool.",
    "CLIs": [
        "subnet length initial { <initial-mask-length> | <initial-mask> } [ extend { <extend-mask-length> | <extend-mask> } ]",
        "undo subnet length [ initial { <initial-mask-length> | <initial-mask> } [ extend { <extend-mask-length> | <extend-mask> } ] ]"
    ],
    "ParentView": [
        "Global CGN address pool view"
    ],
    "ParaDef": [
        {
            "Parameters": "initial-mask-length",
            "Info": "Specifies the mask length of the initial address segments in a global address pool.\nThe value can be 0 or an integer ranging from 16 to 32 in PAT mode. The value can be 0 or an integer ranging from 16 to 27 in NoPAT mode. If the value is set to 0, the mask length of an address segment is delivered by a RADIUS server."
        },
        {
            "Parameters": "initial-mask",
            "Info": "Specifies the mask of the initial address segments in a global address pool.\nThe value is in dotted decimal notation, for example, 255.255.0.0."
        },
        {
            "Parameters": "extend extend-mask-length",
            "Info": "Specifies the mask length of the extended address segments in a global address pool.\nThe value can be 0 or an integer ranging from 16 to 32 in PAT mode. The value can be 0 or an integer ranging from 16 to 27 in NoPAT mode. If the value is set to 0, the mask length of an address segment is delivered by a RADIUS server."
        },
        {
            "Parameters": "extend extend-mask",
            "Info": "Specifies the mask of the extended address segments in a global address pool.\nThe value is in dotted decimal notation, for example, 255.255.0.0."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat ip-pool huawei dynamic",
            "[*HUAWEI-nat-ip-pool-huawei] subnet length initial 26 extend 26"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo set the lengths and masks of the initial and extended address segments for a global dynamic address pool, run the subnet length initial command.\nConfiguration Impact\nOnce the subnet length initial command is run, a request is sent to apply for an address segment. If a dynamic address pool contains address segments, the mask length of the address segments cannot be modified.\nIf extend parameters are not configured, the mask or mask length of the extended address segment is equal to the mask or mask length of the initial address segment.\nPrecautions\nThis command is supported only on the admin VS."
}