{
    "PageTitle": "track monitor-location-group",
    "FuncDef": "The track monitor-location-group command binds an interface to an HA status monitoring group.\nThe undo track monitor-location-group command deletes the binding relationship between an HA status monitoring group and an interface.\nBy default, no HA status monitoring group is bound to an interface.",
    "CLIs": [
        "track monitor-location-group <group-name>",
        "undo track monitor-location-group [ <group-name> ]"
    ],
    "ParentView": [
        "100GE interface view",
        "400GE interface view",
        "CPOS interface view",
        "Eth-Trunk interface view",
        "Eth-Trunk interface view",
        "GE electrical interface view",
        "IP-Trunk interface view",
        "POS interface view",
        "ServiceIf interface view",
        "XGE interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "group-name",
            "Info": "Specifies an HA status monitoring group.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] monitor-location-group group1",
            "[*HUAWEI-monitor-location-group-group1] quit",
            "[~HUAWEI] interface GigabitEthernet1/0/1",
            "[*HUAWEI-GigabitEthernet1/0/1] track monitor-location-group group1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn a CGN inter-chassis backup scenario, when a CGN service board becomes faulty, services need to be switched to a backup device. To bind an interface to an HA status monitoring group, run the track monitor-location-group command.\nPrerequisites\nAn HA status monitoring group has been created, and an HA backup group has been associated with the HA status monitoring group.\nConfiguration Impact\nAfter this command is run, an interface status change is triggered by the status of the HA backup group bound to the HA status monitoring group.\nPrecautions\nA maximum of 1024 HA status monitoring groups can be associated with an interface, and an HA status monitoring group can monitor a maximum of 256 service-location backup groups."
}