{
    "PageTitle": "user-group bind nat instance",
    "FuncDef": "The user-group bind nat instance command associates a NAT instance with a user group in a AAA domain.\nThe undo user-group command cancels the association between a NAT instance and a user group.\nBy default, no NAT instance is bound to a user group in a domain.",
    "CLIs": [
        "user-group <user-group-name> bind nat instance <instance-name>",
        "undo user-group [ <user-group-name> ]"
    ],
    "ParentView": [
        "AAA domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "user-group-name",
            "Info": "Specifies the name of a user group.\nThe value is a string of 1 to 32 characters."
        },
        {
            "Parameters": "instance-name",
            "Info": "Specifies the name of a NAT instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat instance cpe1 id 1",
            "[*HUAWEI-nat-instance-cpe1] commit",
            "[*HUAWEI-nat-instance-cpe1] quit",
            "[~HUAWEI] user-group group1",
            "[~HUAWEI] aaa",
            "[*HUAWEI-aaa] domain huawei",
            "[*HUAWEI-aaa-domain-huawei] commit",
            "[*HUAWEI-aaa-domain-huawei] user-group group1 bind nat instance cpe1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn distributed NAT scenarios, user groups need to be bound to NAT instances. During user access, the CPU with the least number of users is used for load balancing among NAT instances. To associate a NAT instance in a domain with a user group, run the user-group bind nat instance command.\nPrecautions\nOne user group can be associated with only one NAT instance.A domain can have multiple binding relationships between user groups and NAT instances.For a user group in a domain, the user-group command is mutually exclusive with the user-group bind nat instance command.The user-group bind nat instance command only supports VSUF-80/VSUF-160/VSUI-160-E.In a single domain, multiple user groups can be bound to one or multiple NAT instances that use static source tracing algorithms to implement load balancing."
}