{
    "PageTitle": "vsm alarm cpu-performance threshold",
    "FuncDef": "The vsm alarm cpu-performance threshold command configures an alarm threshold for CPU performance on a VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S.\nThe undo vsm alarm cpu-performance threshold command restores the default alarm threshold for CPU performance on a VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S.\nThe default alarm threshold is 80% for CPU performance on a VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S.",
    "CLIs": [
        "vsm alarm cpu-performance threshold <threshold-value>",
        "undo vsm alarm cpu-performance threshold [ <threshold-value> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "threshold threshold-value",
            "Info": "Configures an alarm threshold for CPU performance.\nThe value is an integer ranging from 40 to 100, in percentage. The default value is 80%."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] undo vsm alarm cpu-performance log disable",
            "[~HUAWEI] vsm alarm cpu-performance threshold 85"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure an alarm threshold for CPU performance on a VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S, run the vsm alarm cpu-performance threshold command. If CPU performance on a VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S reaches a configured alarm threshold, an alarm is generated. After CPU performance exceeds the alarm threshold, the alarm is not reported repeatedly. If CPU performance on a VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S falls below 87.5% of a configured alarm threshold, a clear alarm is generated.\nPrerequisites\nCPU performance log or trap monitoring has been enabled using the undo vsm alarm cpu-performance disable command.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}