{
    "PageTitle": "cpu-protection",
    "FuncDef": "This command assigns an existing CPU protection policy to the associated group interface. The CPU protection policies are configured in theconfig>sys>security>cpu-protection>policycpu-protection-policy-idcontext.",
    "CLIs": [
        "cpu-protection <policy-id> { [ mac-monitoring ] | [ eth-cfm-monitoring [ aggregate ] [ car ] ] | [ ip-src-monitoring ] }",
        "no cpu-protection"
    ],
    "ParentView": [
        "config>service>ies>sub-if>grp-if>sap"
    ],
    "ParaDef": [
        {
            "Parameters": "policy-id",
            "Info": "Specifies an existing CPU protection policy. Values-1 to 255."
        },
        {
            "Parameters": "mac-monitoring",
            "Info": "Enables per SAP + source MAC address rate limiting using the per-source-rate from the associated cpu-protection policy."
        },
        {
            "Parameters": "eth-cfm-monitoring",
            "Info": "Enables Ethernet Connectivity Fault Management monitoring."
        },
        {
            "Parameters": "aggregate",
            "Info": "Applies the rate limit to the sum of the per peer packet rates."
        },
        {
            "Parameters": "car",
            "Info": "(Committed Access Rate) causes Eth-CFM packets to be ignored when enforcing the overall-rate."
        },
        {
            "Parameters": "ip-src-monitoring",
            "Info": "Enables per SAP + IP source address rate limiting for DHCP packets using the per-source-rate from the associated cpu-protection policy. The ip-src-monitoring is useful in subscriber management architectures that have routers between the subscriber and the BNG (router). In Layer 3 aggregation scenarios all packets from all subscribers behind the same aggregation router will arrive with the same source MAC address and as such the mac-monitoring functionality can not differentiate traffic from different subscribers."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: cpu-protection 254 (for access interfaces)cpu-protection 255 (for network interfaces)The configuration of no cpu-protection returns the interface/SAP to the default policies as shown above."
}