{
    "PageTitle": "host",
    "FuncDef": "This command creates a static subscriber host for the SAP. Static subscriber hosts may be used by the system for various purposes. Applications within the system that make use of static host entries include anti-spoof filters and ARP cache population.",
    "CLIs": [
        "[ no ] host ip <ip-address> [ mac <ieee-address> ] [ subscriber <sub-ident-string> ] [ sub-profile <sub-profile-name> ] [ sla-profile <sla-profile-name> ] [ ancp-string <ancp-string> ]",
        "no host { [ ip <ip-address> ] [ mac <ieee-address> ] }",
        "no host all"
    ],
    "ParentView": [
        "config>service>ies>if>sap",
        "config>service>ies>sub-if>grp-if>sap"
    ],
    "ParaDef": [
        {
            "Parameters": "ip ip-address",
            "Info": "Specify this optional parameter when defining a static host. The IP address must be specified for anti-spoof ip, anti-spoof ip-mac and arp-populate. Only one static host may be configured on the SAP with a given IP address."
        },
        {
            "Parameters": "mac mac-address",
            "Info": "Specify this optional parameter when defining a static host. The MAC address must be specified for anti-spoof ip-mac and arp-populate. Multiple static hosts may be configured with the same MAC address given that each definition is distinguished by a unique IP address."
        },
        {
            "Parameters": "subscriber sub-ident-string",
            "Info": "Specify this optional parameter to specify an existing subscriber identification profile to be associated with the static subscriber host. The subscriber identification profile is configured in the config>subscr-mgmt>sub-ident-policy context. The subscriber information is used by the SAP arp-reply-agent to determine the proper handling of received ARP requests from subscribers."
        },
        {
            "Parameters": "sub-profile sub-profile-name",
            "Info": "Specify this optional parameter to specify an existing subscriber profile name to be associated with the static subscriber host. The subscriber profile is configured in the config>subscr-mgmt>sub-profile context."
        },
        {
            "Parameters": "sla-profile sla-profile-name",
            "Info": "Specify this optional parameter to specify an existing SLA profile name to be associated with the static subscriber host. The SLA profile is configured in the config>subscr-mgmt>sla-profile context."
        },
        {
            "Parameters": "ancp-string ancp-string",
            "Info": "Specifies the ASCII string of the DSLAM circuit ID name."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: none"
}