{
    "PageTitle": "vas-if-type",
    "FuncDef": "This command configures the type of a Value Added Service (VAS) facing interface. To change thevas-if-type, theshutdowncommand is required. Thevas-if-typeandloopbackcommands are mutually exclusive.",
    "CLIs": [
        "vas-if-type { to-from-access | to-from-network | to-from-both }",
        "no vas-if-type"
    ],
    "ParentView": [
        "config>service>ies>if"
    ],
    "ParaDef": [
        {
            "Parameters": "to-from-access",
            "Info": "Used when two separate (to-from-access and to-from-network) interfaces are used for VAS connectivity. For service chaining, traffic arriving from access interfaces (upstream) is redirected to a PBR target reachable over this interface for upstream VAS processing. Downstream traffic after VAS processing must arrive on this interface, so that the traffic is subject to regular routing but is not subject to AA divert, nor egress subscriber PBR."
        },
        {
            "Parameters": "to-from-network",
            "Info": "Used when two separate (to-from-access and to-from-network) interfaces are used for VAS connectivity. For service chaining, traffic arriving from network interfaces (downstream) is redirected to a PBR target reachable over this interface for downstream VAS processing. Upstream traffic after VAS processing must arrive on this interface, so that regular routing can be applied."
        },
        {
            "Parameters": "to-from-both",
            "Info": "Used when a single interface is used for VAS connectivity (no local-to-local traffic). For service chaining, both traffic arriving from access interfaces and from network interfaces is redirected to a PBR target reachable over this interface for upstream/downstream VAS processing. Traffic after VAS processing must arrive on this interface, so that the traffic is subject to regular routing but is not subject to AA divert, nor egress subscriber PBR."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: no vas-if-type"
}