{
    "PageTitle": "vrrp",
    "FuncDef": "This command creates or edits a Virtual Router ID (VRID) on the service IP interface. A VRID is internally represented in conjunction with the IP interface name. This allows the VRID to be used on multiple IP interfaces while representing different virtual router instances.",
    "CLIs": [
        "vrrp <virtual-router-id> [ owner ] [ passive ]",
        "no vrrp <virtual-router-id>"
    ],
    "ParentView": [
        "config>service>ies>if",
        "config>service>ies>if>ipv6"
    ],
    "ParaDef": [
        {
            "Parameters": "virtual-router-id",
            "Info": "The virtual-router-id parameter specifies a new virtual router ID or one that can be modified on the IP interface. Values-1 to 255."
        },
        {
            "Parameters": "owner",
            "Info": "Identifies this virtual router instance as owning the virtual router IP addresses. If the owner keyword is not specified at the time of vrid creation, the vrrp backup commands must be specified to define the virtual router IP addresses. The owner keyword is not required when entering the vrid for editing purposes. Once created as owner, a vrid on an IP interface cannot have the owner parameter removed. The vrid must be deleted, and then recreated without the owner keyword, to remove ownership."
        },
        {
            "Parameters": "passive",
            "Info": "Identifies this virtual router instance as passive, and therefore, owning the virtual router IP addresses. A passive vrid does not send or receive VRRP advertisement messages, and is always in either the master state (if the interface is operational-up), or the init state (if the interface is operational-down). The passive keyword is not required when entering the vrid for editing purposes. Once a vrid on an IP interface is created as passive, the parameter cannot be removed from the vrid. The vrid must be deleted, and then recreated without the passive keyword, to remove parameter."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: n/a"
}