{
    "PageTitle": "address",
    "FuncDef": "This command assigns an IP address, IP subnet, and broadcast address format to an IES IP router interface. Only one IP address can be associated with an IP interface.",
    "CLIs": [
        "address { <ip-address/mask> | <ip-address> <netmask> } [ broadcast all-ones | host-ones ] [ track-srrp <srrp-instance> ]",
        "no address [ <ip-address/mask> | <ip-address> <netmask> ]"
    ],
    "ParentView": [
        "config>service>ies>if",
        "config>service>vprn>if"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address",
            "Info": "Specifies the IP address of the IP interface. The ip-address portion of the address command specifies the IP host address that is used by the IP interface within the subnet. This address must be unique within the subnet and specified in dotted decimal notation. Allowed values are IP addresses in the range 1.0.0.0 - 223.255.255.255 (with support of /31 subnets)."
        },
        {
            "Parameters": "/",
            "Info": "Specifies a parameter delimiter and separates the ip-address portion of the IP address from the mask that defines the scope of the local subnet. No spaces are allowed between the ip-address, the \"/\" and the mask-length parameter. If a forward slash is not immediately following the ip-address, a dotted decimal mask must follow the prefix."
        },
        {
            "Parameters": "mask-length",
            "Info": "Specifies the subnet mask length when the IP prefix is specified in CIDR notation. When the IP prefix is specified in CIDR notation, a forward slash (/) separates the ip-address from the mask-length parameter. The mask length parameter indicates the number of bits used for the network portion of the IP address; the remainder of the IP address is used to determine the host portion of the IP address. ParamDefault: Default- 0 to 31"
        },
        {
            "Parameters": "mask",
            "Info": "The subnet mask in dotted decimal notation. When the IP prefix is not specified in CIDR notation, a space separates the ip-address from a traditional dotted decimal mask. The mask parameter indicates the complete mask that is used in a logical  AND  function to derive the local subnet of the IP address. Allowed values are dotted decimal addresses in the range 128.0.0.0 - 255.255.255.252."
        },
        {
            "Parameters": "broadcast",
            "Info": "Overrides the default broadcast address used by the IP interface when sourcing IP broadcasts on the IP interface. If no broadcast format is specified for the IP address, the default value is host-ones which indicates a subnet broadcast address. Use this parameter to change the broadcast address to all-ones or revert back to a broadcast address of host-ones. ParamDefault: Default- host-ones"
        },
        {
            "Parameters": "all-ones",
            "Info": "Specifies the broadcast address used by the IP interface for this IP address is 255.255.255.255, also known as the local broadcast."
        },
        {
            "Parameters": "host-ones",
            "Info": "Specifies that the broadcast address used by the IP interface for this IP address is the subnet broadcast address. This is an IP address that corresponds to the local subnet described by the ip-address and the mask-length or mask with all the host bits set to binary one. This is the default broadcast address used by an IP interface."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}