{
    "PageTitle": "host-connectivity-verify",
    "FuncDef": "This command enables subscriber host connectivity verification for all hosts on this interface. This tool periodically scans all known hosts (from dhcp-state) and perform UC ARP requests. The subscriber host connectivity verification maintains state (connected vs. not-connected) for all hosts.",
    "CLIs": [
        "host-connectivity-verify [ source { vrrp | interface } ] [ interval <interval> ] [ action { remove | alarm } ] [ timeout <retry-timeout> ] [ retry-count <retry-count> ]"
    ],
    "ParentView": [
        "config>service>ies>if",
        "config>service>vprn>if"
    ],
    "ParaDef": [
        {
            "Parameters": "source {vrrp | interface}",
            "Info": "Specifies the source to be used for generation of subscriber host connectivity verification packets. The vrrp keyword specifies that the VRRP state should be used to select proper IP and MAC (active uses VRID, back-up uses interface addresses). The interface keyword forces the use of the interface mac and ip addresses."
        },
        {
            "Parameters": "action {remove | alarm}",
            "Info": "Defines the action taken on a subscriber host connectivity verification failure for a given host. The remove keyword raises an alarm and removes dhcp-state and releases all allocated resources (queues, table entries, and so on). The alarm keyword raises an alarm indicating that the host is disconnected."
        },
        {
            "Parameters": "interval",
            "Info": "Specifies the interval, expressed in minutes, which specifies when all known sources should be verified. The actual rate is then dependent on number of known hosts and interval. Values-1 to 6000."
        },
        {
            "Parameters": "retry-timeout",
            "Info": "Specifies the timeout, in seconds, before a connectivity check retransmission. Values-10 to 60."
        },
        {
            "Parameters": "retry-count",
            "Info": "Specifies the number of connectivity check retransmissions. Values-2 to 29."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}