{
    "PageTitle": "qos",
    "FuncDef": "This command associates a Quality of Service (QoS) policy with an ingress Service Access Point (SAP).",
    "CLIs": [
        "qos <policy-id> [ shared-queuing | multipoint-shared ] [ fp-redirect-group <queue-group-name> instance <instance-id> ]",
        "qos <policy-id> [ shared-queuing | multipoint-shared ]",
        "no qos"
    ],
    "ParentView": [
        "config>service>ies>if>sap>ingress",
        "config>service>vprn>if>sap>ingress"
    ],
    "ParaDef": [
        {
            "Parameters": "policy-id",
            "Info": "The ingress/egress policy ID to associate with SAP or IP interface on ingress/egress. The policy ID must already exist."
        },
        {
            "Parameters": "shared-queuing",
            "Info": "Specifies the ingress shared queue policy used by this SAP. When the value of this object is null it means that the SAP uses individual ingress QoS queues instead of the shared ones."
        },
        {
            "Parameters": "multipoint-shared",
            "Info": "This keyword specifies that this queue-id is for multipoint forwarded traffic only. This queue-id can only be explicitly mapped to the forwarding class multicast, broadcast, or unknown unicast ingress traffic. Attempting to map forwarding class unicast traffic to a multipoint queue generates an error; no changes are made to the current unicast traffic queue mapping. Values-Multipoint or not present.. ParamDefault: Default- Present (the queue is created as non-multipoint)."
        },
        {
            "Parameters": "queue-group-name",
            "Info": "Specifies the name of the queue group template to be instantiated on the forwarding plane of the IOM/IMM/XMA, up to 32 characters. The queue-group-name must correspond to a valid ingress queue group template name, configured in the config>qos>queue-group-templates context."
        },
        {
            "Parameters": "instance-id",
            "Info": "Specifies the instance of the named queue group to be created on the IOM/IMM/XMA ingress forwarding plane."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}