{
    "PageTitle": "sap",
    "FuncDef": "This command creates a Service Access Point (SAP) within a service. A SAP is a combination of port and encapsulation parameters which identifies the service access point on the interface and within the 7450 ESS or 7750 SR. Each SAP must be unique. All SAPs must be explicitly created within a service or on an IP interface.",
    "CLIs": [
        "sap <sap-id> [ split-horizon-group <group-name> ] [ create ] [ <capture-sap> ] [ eth-ring <ring-index> ]",
        "sap <sap-id> [ split-horizon-group <group-name> ] [ create ] [ <capture-sap> ] [ eth-ring <ring-index> ] leaf-ac",
        "sap <sap-id> [ split-horizon-group <group-name> ] [ create ] [ <capture-sap> ] [ eth-ring <ring-index> ] root-leaf-tag leaf-tag <leaf-tag>",
        "no sap <sap-id>"
    ],
    "ParentView": [
        "config>service>vpls"
    ],
    "ParaDef": [
        {
            "Parameters": "sap-id",
            "Info": "Specifies the physical port identifier portion of the SAP definition."
        },
        {
            "Parameters": "port-id",
            "Info": "Specifies the physical port ID in the slot/mda/port format."
        },
        {
            "Parameters": "group-name",
            "Info": "Specifies the name of the split horizon group to which the SAP belongs. This parameter applies to the 7450 ESS or 7750 SR only."
        },
        {
            "Parameters": "capture-sap",
            "Info": "Specifies a capturing SAP in which triggering packets are sent to the CPM. Non-triggering packets captured by the capture SAP are dropped. This parameter applies to the 7450 ESS or 7750 SR only."
        },
        {
            "Parameters": "create",
            "Info": "Keyword used to create a SAP instance. The create keyword requirement can be enabled or disabled in the environment>create context."
        },
        {
            "Parameters": "root-leaf-tag",
            "Info": "Specifies a SAP as a root leaf tag SAP. Only SAPs of the form dot1q (for example, 1/1/1:X) or qinq (for example, 1/1/1:X.Y, 1/1/1:X.*) are supported. The default E-Tree SAP type is a root AC, if root-leaf-tag (or leaf-ac) is not specified at SAP creation. This option is only available when the VPLS is designated as an E-Tree VPLS."
        },
        {
            "Parameters": "leaf-tag-vid",
            "Info": "Specifies to replace the outer SAP-ID for leaf traffic. The leaf tag VID is only significant between peering VPLS but the values must be consistent on each end."
        },
        {
            "Parameters": "leaf-ac",
            "Info": "Specifies a SAP as a leaf access (AC) SAP. The default E-Tree SAP type is root AC if leaf-ac (or root-leaf-tag) is not specified at SAP creation. This option is only available when the VPLS is designated as an E-Tree VPLS."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}