{
    "PageTitle": "secondary",
    "FuncDef": "This command assigns a secondary IP address or IP subnet/broadcast address format to the interface.",
    "CLIs": [
        "secondary { <ip-address/mask> | <ip-address> <netmask> } [ broadcast all-ones | host-ones ] [ igp-inhibit ]",
        "no secondary <ip-address>"
    ],
    "ParentView": [
        "config>service>ies>if"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address",
            "Info": "The IP address of the IP interface. The ip-address portion of the address command specifies the IP host address that is used by the IP interface within the subnet. This address must be unique within the subnet and specified in dotted decimal notation. Allowed values are IP addresses in the range 1.0.0.0 - 223.255.255.255 (with support of /31 subnets)."
        },
        {
            "Parameters": "mask",
            "Info": "The subnet mask in dotted decimal notation. When the IP prefix is not specified in CIDR notation, a space separates the ip-address from a traditional dotted decimal mask. The mask parameter indicates the complete mask that is used in a logical and function to derive the local subnet of the IP address. Allowed values are dotted decimal addresses in the range 128.0.0.0 - 255.255.255.252."
        },
        {
            "Parameters": "netmask",
            "Info": "Specifies a string of 0s and 1s that mask or screen out the network part of an IP address so that only the host computer part of the address remains."
        },
        {
            "Parameters": "broadcast",
            "Info": "Overrides the default broadcast address used by the IP interface when sourcing IP broadcasts on the IP interface. If no broadcast format is specified for the IP address, the default value is host-ones which indicates a subnet broadcast address. Use this parameter to change the broadcast address to all-ones or revert back to a broadcast address of host-ones."
        },
        {
            "Parameters": "all-ones",
            "Info": "Specifies the broadcast address used by the IP interface for this IP address is 255.255.255.255, also known as the local broadcast."
        },
        {
            "Parameters": "host-ones",
            "Info": "Specifies that the broadcast address used by the IP interface for this IP address is the subnet broadcast address. This is an IP address that corresponds to the local subnet described by the ip-address and the mask-length or mask with all the host bits set to binary one. This is the default broadcast address used by an IP interface. \nThe broadcast parameter within the address command does not have a negate feature, which is usually used to revert a parameter to the default value. To change the broadcast type to host-ones after being changed to all-ones, the address command must be executed with the broadcast parameter defined."
        },
        {
            "Parameters": "igp-inhibit",
            "Info": "Signals that the given secondary IP interface should not be recognized as a local interface by the running IGP. For OSPF and IS-IS, this means that the specified secondary IP interfaces are not injected and used as passive interfaces and are not advertised as internal IP interfaces into the IGP s link state database. For RIP, this means that these secondary IP interfaces do not source RIP updates."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}