{
    "PageTitle": "bypass-vxlan (BD EVPN view)",
    "FuncDef": "The bypass-vxlan enable command enables the inter-chassis VXLAN function for an EVPN instance.\nThe undo bypass-vxlan enable command disables the inter-chassis VXLAN function from an EVPN instance.\nThe bypass-vxlan disable command disables the inter-chassis VXLAN function from an EVPN instance.\nThe undo bypass-vxlan disable command enables the inter-chassis VXLAN function for an EVPN instance.\nBy default, if the inter-chassis VXLAN function is enabled both in the global EVPN view and in the EVPN instance view, the configuration in the global EVPN view takes effect.",
    "CLIs": [
        "bypass-vxlan enable",
        "bypass-vxlan disable",
        "undo bypass-vxlan enable",
        "undo bypass-vxlan disable"
    ],
    "ParentView": [
        "BD EVPN view"
    ],
    "ParaDef": [
        {
            "Parameters": "disable",
            "Info": "Disables the current configuration.\n-"
        },
        {
            "Parameters": "enable",
            "Info": "Enables the current configuration.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] evpn vpn-instance evrf1 bd-mode",
            "[*HUAWEI-evpn-instance-evrf1] bypass-vxlan disable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, after the bypass-vxlan enable command is globally configured, a device can be deployed only with the EVPN VXLAN-related functions. If users want to configure EVPN MPLS-related functions for some BD-EVPN instances, run the bypass-vxlan disable command to disable the inter-chassis VXLAN function from these BD-EVPN instances.\nPrecautions\nBy default, if the inter-chassis VXLAN function is enabled both in the global EVPN view and in the BD-EVPN instance view, the configuration in the global EVPN view takes effect. If the inter-chassis VXLAN function is disabled in the BD-EVPN instance view, the configuration in the BD-EVPN instance view takes effect."
}