{
    "PageTitle": "evpn vpn-instance",
    "FuncDef": "The evpn vpn-instance command creates an EVPN instance and enters the EVPN instance view.\nThe undo evpn vpn-instance command deletes an EVPN instance.\nBy default, no EVPN instance is created.",
    "CLIs": [
        "evpn vpn-instance <vpn-instance-name>",
        "evpn vpn-instance <vpn-instance-name> i-evpn",
        "evpn vpn-instance <vpn-instance-name> b-evpn",
        "evpn vpn-instance <vpn-instance-name> bd-mode",
        "evpn vpn-instance <vpn-instance-name> vpws",
        "undo evpn vpn-instance <vpn-instance-name> [ i-evpn | b-evpn | bd-mode | vpws ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance-name",
            "Info": "Specifies the name of an EVPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "i-evpn",
            "Info": "Specifies the EVPN instance as an I-EVPN instance.\n-"
        },
        {
            "Parameters": "b-evpn",
            "Info": "Specifies the EVPN instance as a B-EVPN instance.\n-"
        },
        {
            "Parameters": "bd-mode",
            "Info": "Specifies the EVPN instance as an EVPN in BD mode.\n-"
        },
        {
            "Parameters": "vpws",
            "Info": "Specifies the EVPN instance as an EVPN in VPWS mode.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] evpn vpn-instance vrf1 bd-mode"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] evpn vpn-instance vrf1 b-evpn"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] evpn vpn-instance vrf1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo allow Layer 2 networks to communicate over a public network, use EVPN. EVPN instances must be configured on PEs on the public network before you perform EVPN operations.\nIn PBB-EVPN networking, B-EVPN and I-EVPN instances must be configured on public network PEs.\nA B-EVPN instance provides access to the public network and manages EVPN routes received from other PEs.An I-EVPN instance accesses the user network by being bound to a PE interface connecting to a CE. After an I-EVPN instance receives a data packet from the user network, the I-EVPN instance encapsulates a PBB header into the packet.\nTo create a BD EVPN instance, run the evpn vpn-instance bd-mode command.\n\nConfiguration Impact\nAn EVPN instance functions as a virtual routing table on a PE and consumes resources on the PE.\nAfter the undo evpn vpn-instance command is run to delete an EVPN instance, all configurations of the EVPN instance are deleted.\nFollow-up Procedure\nAfter creating an EVPN instance, perform the following operations in the EVPN instance view:\nRun the route-distinguisher command to configure an RD for the EVPN instance.Run the vpn-target command to configure VPN targets for the EVPN instance.\n\nPrecautions\nA BD EVPN instance can be bound only to BDs. To bind a BD EVPN instance to a BD, run the evpn binding vpn-instance command."
}