{
    "PageTitle": "evpl instance (system view)",
    "FuncDef": "The evpl instance command creates an EVPL instance.\nThe undo evpl instance command deletes an EVPL instance.\nBy default, no EVPL instances exist.",
    "CLIs": [
        "evpl instance <evpl-id> vxlan-mode",
        "evpl instance <evpl-id> mpls-mode",
        "evpl instance <evpl-id> srv6-mode",
        "undo evpl instance <evpl-id> vxlan-mode",
        "undo evpl instance <evpl-id> mpls-mode",
        "undo evpl instance <evpl-id> srv6-mode"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "evpl-id",
            "Info": "Specifies an EVPL instance ID.\nThe value is an integer ranging from 1 to 256000."
        },
        {
            "Parameters": "vxlan-mode",
            "Info": "Specifies to use the VXLAN mode for an EVPL instance.\n-"
        },
        {
            "Parameters": "mpls-mode",
            "Info": "Specifies to use the MPLS mode for an EVPL instance.\n-"
        },
        {
            "Parameters": "srv6-mode",
            "Info": "Specifies to use the SRv6 mode for an EVPL instance.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] evpl instance 1 mpls-mode"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] evpl instance 2 vxlan-mode"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] evpl instance 3 srv6-mode"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn an E-Line scenario, to enable traffic communication between an AC interface and an MPLS tunnel, first run the evpl instance mpls-mode command to create an EVPL instance in MPLS mode. Then, bind the EVPL instance to the AC interface.\nIn a scenario where a VXLAN tunnel is used for user access, a P2P VXLAN tunnel must be created to transmit user packets. To terminate the P2P VXLAN tunnel on a PW-VE interface, the P2P VXLAN tunnel must be associated with the PW-VE interface. To create the association, first run the evpl instance vxlan-mode command to create an EVPL instance in VXLAN mode. Then, bind the EVPL instance to the VNI of the P2P VXLAN tunnel and to the PW-VE interface.\nIn a scenario that EVPN VPWS leased line services are carried over SRv6 tunnels, run the evpl instance srv6-mode command to create an EVPL instance in SRv6 mode. Devices exchange EVI AD routes to generate EVPL instances as well as the forwarding entries associated with the access-side interface, SRv6 tunnel, and EVPL instance on each device to implement EVPN VPWS over SR6 services."
}