{
    "PageTitle": "default-color evpn",
    "FuncDef": "The default-color evpn command configures the default color used by the EVPN L3VPN service when iterating the SR TE Policy or SRv6 TE Policy.\nThe undo default-color evpn command restores the default setting.\nBy default, the default-color function is disabled.",
    "CLIs": [
        "default-color <color-value> evpn",
        "undo default-color <color-value> evpn"
    ],
    "ParentView": [
        "VPN instance IPv4 address family view",
        "VPN instance IPv6 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "color-value",
            "Info": "Set the default color used when the EVPN L3VPN service iterates the SR TE Policy or SRv6 TE Policy tunnel.\nThe value is an integer ranging from 0 to 4294967295."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vrf1",
            "[*HUAWEI-vpn-instance-vrf1] ipv4-family",
            "[*HUAWEI-vpn-instance-vrf1-af-ipv4] route-distinguisher 10:1",
            "[*HUAWEI-vpn-instance-vrf1-af-ipv4] default-color 100 evpn"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vrf1",
            "[*HUAWEI-vpn-instance-vrf1] ipv6-family",
            "[*HUAWEI-vpn-instance-vrf1-af-ipv6] route-distinguisher 20:1",
            "[*HUAWEI-vpn-instance-vrf1-af-ipv6] default-color 200 evpn"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe default-color evpn command takes effect only on the remote cross-routes of EVPN L3VPN services on the local device.\nUse the default-color evpn command to configure the EVPN L3VPN service remote cross-route to iterate the default color of the SR TE Policy or SRv6 TE Policy. After the remote cross-route crosses to the VPN instance, if the route does not carry the color extended community attribute, use The default color value is SR TE Policy or SRv6 TE Policy iteration.\nPrerequisites\nA route distinguisher (RD) has been configured using the route-distinguisher command.\nConfiguration Impact\nIf the default color value has been configured on the device, when the user configures the default color value again, the new default color value will replace the original default color value.\nPrecautions\nThe color value takes effect only when the EVPN L3VPN remote cross-route crosses to the VPN instance and iterates the SR TE Policy or SRv6 TE Policy. It does not take effect when the route is sent out."
}