{
    "PageTitle": "esi dynamic",
    "FuncDef": "The esi dynamic command binds a dynamic ESI instance to an interface.\nThe undo esi dynamic command unbinds a dynamic ESI instance from an interface.\nBy default, a dynamic ESI instance is not bound to an interface.",
    "CLIs": [
        "esi dynamic <esi-name>",
        "undo esi dynamic <esi-name>"
    ],
    "ParentView": [
        "Eth-Trunk interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "esi-name",
            "Info": "Specifies the name of a dynamic ESI instance.\nThe value is a string of 1 to 31 case-sensitive characters starting with a letter, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] evpn",
            "[*HUAWEI-evpn] esi dynamic-name esi1",
            "[*HUAWEI-evpn-esi-dynamic-esi1] evpn redundancy-mode all-active",
            "[*HUAWEI-evpn-esi-dynamic-esi1] quit",
            "[*HUAWEI-evpn] quit",
            "[*HUAWEI] interface Eth-Trunk 10",
            "[*HUAWEI-Eth-Trunk10] esi dynamic esi1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn scenarios where different CEs are dual-homed to PEs, if you want a remote PE to send unicast traffic to different CEs in different modes (load balancing and non-load balancing), you can set a redundancy mode per ESI instance. Before performing this configuration, you need to confirm the ESI generation mode on the access side. If an ESI on the access side is automatically generated, you need to run the esi dynamic-name command in the global EVPN configuration view to configure a dynamic ESI instance, and then run the evpn redundancy-mode command in the dynamic ESI instance view to set a redundancy mode. To allow the configured redundancy mode to take effect, run the esi dynamic command to bind the dynamic ESI instance to an Eth-Trunk interface on the access side.\nPrerequisites\nA dynamic ESI instance has been created using the esi dynamic-name command in the global EVPN configuration view."
}