{
    "PageTitle": "segment-routing ipv6 traffic-engineer",
    "FuncDef": "The segment-routing ipv6 traffic-engineer command enables EVPN VPWS/VPLS services to recurse to an SRv6 TE Policy.\nThe undo segment-routing ipv6 traffic-engineer command restores the default configuration.\nBy default, EVPN VPWS/VPLS services do not recurse to an SRv6 TE Policy.",
    "CLIs": [
        "segment-routing ipv6 traffic-engineer [ best-effort ]",
        "undo segment-routing ipv6 traffic-engineer [ best-effort ]"
    ],
    "ParentView": [
        "BD EVPN view",
        "VPWS-EVPN instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "best-effort",
            "Info": "Indicates that services can use an SRv6 BE tunnel as a best-effort path if an SRv6 TE policy is faulty.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] evpn vpn-instance v1 vpws",
            "[*HUAWEI-vpws-evpn-instance-v1] route-distinguisher 2:2",
            "[*HUAWEI-vpws-evpn-instance-v1] segment-routing ipv6 traffic-engineer"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] evpn vpn-instance v1 bd-mode",
            "[*HUAWEI-evpn-instance-v1] route-distinguisher 2:2",
            "[*HUAWEI-evpn-instance-v1] segment-routing ipv6 traffic-engineer"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn an EVPN VPWS scenario, if you want to use an SRv6 TE Policy to carry service traffic, run the segment-routing ipv6 traffic-engineer command in a specified VPWS EVPN instance. In this way, EVPN routes recurse to the SRv6 TE Policy, and service traffic is forwarded over the SRv6 TE Policy.\nIn an EVPN VPLS scenario, if you want to use an Policy to carry service traffic, run the segment-routing ipv6 traffic-engineer command in a specified BD EVPN instance. In this way, EVPN routes recurse to the SRv6 TE Policy, and service traffic is forwarded over the SRv6 TE Policy.\nTo improve reliability, you can configure the best-effort parameter when an SRv6 BE tunnel exists on the network. With this parameter configured, if the SRv6 TE Policy becomes faulty, services can use the SRv6 BE tunnel as a best-effort path.\nPrerequisites\nAn RD has been configured for an EVPN instance.\nConfiguration Impact\nIf both the segment-routing ipv6 traffic-engineer command and the segment-routing ipv6 best-effort command are run, a later configuration overrides a previous one."
}