{
    "PageTitle": "evpn redundancy-mode",
    "FuncDef": "The evpn redundancy-mode command sets a redundancy mode for an ESI instance.\nThe undo evpn redundancy-mode command cancels the redundancy mode for an ESI instance.\nBy default, if the evpn redundancy-mode single-active command is run in the system view, the redundancy mode of an ESI instance is single-active; if the evpn redundancy-mode single-active command is not run, the redundancy mode of an ESI instance is all-active.",
    "CLIs": [
        "evpn redundancy-mode { single-active | all-active }",
        "undo evpn redundancy-mode { single-active | all-active }"
    ],
    "ParentView": [
        "esi-static view",
        "esi-dynamic view"
    ],
    "ParaDef": [
        {
            "Parameters": "single-active",
            "Info": "Sets an ESI instance to be in single-active mode.\n-"
        },
        {
            "Parameters": "all-active",
            "Info": "Sets an ESI instance to be in all-active mode.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] evpn",
            "[*HUAWEI-evpn] esi 0011.1001.1001.1001.1002",
            "[*HUAWEI-evpn-esi-0011.1001.1001.1001.1002] evpn redundancy-mode single-active"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] evpn",
            "[*HUAWEI-evpn] esi dynamic-name esi1",
            "[*HUAWEI-evpn-esi-dynamic-esi1] evpn redundancy-mode all-active"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn scenarios where different CEs are dual-homed to PEs, if you want a remote PE to send unicast traffic to different CEs in different modes (load balancing and non-load balancing), you can set a redundancy mode per ESI instance. Before performing this configuration, you need to confirm the ESI generation mode on the access side and then create a dynamic or static ESI instance based on the ESI generation mode. Each dynamic or static ESI instance corresponds to a unique ESI on the access side. Therefore, you can run the evpn redundancy-mode { single-active | all-active } command in a dynamic or static ESI instance to set a redundancy mode for the corresponding ESI."
}