{
    "PageTitle": "peer advertise suppressed-detail-route (group)",
    "FuncDef": "The peer advertise suppressed-detail-route command enables the advertisement of locally suppressed specific routes to peers in a specified BGP EVPN peer group.\nThe undo peer advertise suppressed-detail-route command restores the default configuration.\nBy default, the locally suppressed specific routes are not advertised to peers in a specified BGP EVPN peer group.",
    "CLIs": [
        "peer <group-name> advertise suppressed-detail-route",
        "undo peer <group-name> advertise suppressed-detail-route"
    ],
    "ParentView": [
        "BGP-EVPN address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "group-name",
            "Info": "Specifies the name of a BGP EVPN peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] group dcn internal",
            "[*HUAWEI-bgp] peer 10.1.1.9 as-number 100",
            "[*HUAWEI-bgp] l2vpn-family evpn",
            "[*HUAWEI-bgp-af-evpn] peer dcn enable",
            "[*HUAWEI-bgp-af-evpn] peer 10.1.1.9 group dcn",
            "[*HUAWEI-bgp-af-evpn] peer dcn advertise suppressed-detail-route"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nGenerally, route summarization is configured to control the scale of BGP routing tables. If route summarization is configured for a BGP-VPN instance address family, the locally suppressed specific routes are by default not advertised to peers in a BGP EVPN peer group. To enable the advertisement of specific routes to peers in a specified BGP EVPN peer group, run the peer advertise suppressed-detail-route command.\nPrerequisites\nThe specified peer group has been enabled in the BGP-EVPN address family view.\nPrecautions\nThe priority of the peer group configuration method is higher than the priority of the global configuration method but lower than the priority of the peer configuration method."
}