{
    "PageTitle": "evpn binding vpn-instance (Interface view)",
    "FuncDef": "The evpn binding vpn-instance command binds a PE's interface to an EVPN instance.\nThe undo evpn binding vpn-instance command removes the binding relationship between a PE's interface and an EVPN instance.\nBy default, a PE's interface is a public network interface without being bound to any EVPN instance.",
    "CLIs": [
        "evpn binding vpn-instance <vpn-instance-name>",
        "undo evpn binding vpn-instance <vpn-instance-name>"
    ],
    "ParentView": [
        "100ge sub-interface view",
        "100GE interface view",
        "10GE sub-interface view",
        "10GE interface view",
        "25GE sub-interface view",
        "400GE sub-interface view",
        "400GE interface view",
        "40GE sub-interface view",
        "40GE interface view",
        "50GE sub-interface view",
        "Eth-Trunk sub-interface view",
        "Eth-Trunk interface view",
        "GE optical interface view",
        "GE sub-interface view",
        "GE electrical interface view",
        "Global VE sub-interface view",
        "PW-VE sub-interface view",
        "VE sub-interface view",
        "Port extension interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance-name",
            "Info": "Specifies the name of an interface to be bound to an EVPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] evpn vpn-instance evrf1",
            "[*HUAWEI-evpn-instance-evrf1] route-distinguisher 100:1",
            "[*HUAWEI-evpn-instance-evrf1] vpn-target 1:1",
            "[*HUAWEI-evpn-instance-evrf1] quit",
            "[*HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] evpn binding vpn-instance evrf1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter an EVPN instance is created on a PE, the PE's interface connecting to a CE must be bound to the EVPN instance.\nPrerequisites\nA route distinguisher (RD) has been configured in the view of the EVPN instance to be bound.\nConfiguration Impact\nAfter an interface is bound to or removed from an EVPN instance, the Layer 3 configurations will be cleared.\nPrecautions\nAn EVPN instance has been bound to the Eth-Trunk interface. Running the evpn binding vpn-instance command on the Eth-Trunk interface to bind another EVPN instance will overwrite the current binding relationship.\nThe active-active mode of an accessed service depends on both the E-Trunk mode and EVPN instance mode. If the Eth-Trunk interfaces of dual-homed PEs are both added to force-master E-Trunks and the Eth-Trunk interfaces are bound to active-active EVPN instances, services are accessed in active-active mode. If one of the Eth-Trunk interfaces of dual-homed PEs or both of them are not added to force-master E-Trunks and the Eth-Trunk interfaces are bound to single-active EVPN instances, services are accessed in single-active mode. If the modes of E-Trunks to which Eth-Trunk interfaces are added do not match the modes of the EVPN instances bound to the Eth-Trunk interfaces, packet loss may occur in the accessed services."
}