{
    "PageTitle": "filter-policy (EVPN instance view)",
    "FuncDef": "The filter-policy import command configures an EVPN instance to filter received MAC advertisement routes.\nThe undo filter-policy import command cancels the filtering of received MAC advertisement routes.\nThe filter-policy export command configures an EVPN instance to filter MAC advertisement routes to be sent.\nThe undo filter-policy export command cancels the filtering of MAC advertisement routes to be sent.\nBy default, an EVPN instance does not filter MAC routes.",
    "CLIs": [
        "filter-policy { <acl-number> | acl-name <acl-name> } { import | export }",
        "undo filter-policy [ <acl-number> | acl-name <acl-name> ] { import | export }"
    ],
    "ParentView": [
        "BD EVPN view",
        "EVPN instance view",
        "VPWS-EVPN instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "acl-number",
            "Info": "Specifies a Layer 2 ACL number.\nThe value is an integer ranging from 4000 to 4999."
        },
        {
            "Parameters": "acl-name acl-name",
            "Info": "Specifies the name of a named ACL.\nThe value is a string of 1 to 64 case-sensitive characters without spaces. The value must start with a letter (a to z or A to Z, case sensitive)."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl 4000",
            "[*HUAWEI-acl-L2-4000] quit",
            "[*HUAWEI] evpn vpn-instance evpn1",
            "[*HUAWEI-evpn-instance-evpn1] filter-policy 4000 export"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl 4000",
            "[*HUAWEI-acl-L2-4000] quit",
            "[*HUAWEI] evpn vpn-instance evpn1",
            "[*HUAWEI-evpn-instance-evpn1] filter-policy 4000 import"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo allow an EVPN instance to filter MAC advertisement routes received from other PEs, run the filter-policy import command.\nTo allow an EVPN instance to filter MAC advertisement routes to be sent to other PEs, run the filter-policy export command.\nThis helps control and manage MAC advertisement routes.\nConfiguration Impact\nIf the command is run more than once, the latest configuration overrides the previous one."
}