{
    "PageTitle": "peer esad-route-compatible (BGP-EVPN address family view) (group)",
    "FuncDef": "The peer esad-route-compatible command enables all peers of a peer group to send ES AD routes in the standard format defined in relevant standards.\nThe undo peer esad-route-compatible command cancels the standard format in which ES AD routes are sent.\nBy default, a device sends ES AD routes in a non-standard format.",
    "CLIs": [
        "peer <peer-group-name> esad-route-compatible",
        "undo peer <peer-group-name> esad-route-compatible"
    ],
    "ParentView": [
        "BGP-EVPN address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "peer-group-name",
            "Info": "Specifies the name of a BGP EVPN peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] group gp1",
            "[*HUAWEI-bgp] peer 1.1.1.1 as-number 100",
            "[*HUAWEI-bgp] l2vpn-family evpn",
            "[*HUAWEI-bgp-af-evpn] peer gp1 enable",
            "[*HUAWEI-bgp-af-evpn] peer 1.1.1.1 group gp1",
            "[*HUAWEI-bgp-af-evpn] peer gp1 esad-route-compatible"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn an earlier software version, the ESI label of an ES AD route is placed in the MPLS Label field of EVPN NLRI instead of being in the ESI Label extended community attribute according to relevant standards. Therefore, to ensure that the devices running earlier and later software versions can communicate with each other, configure the format in which ES AD routes are to be sent. To send ES AD routes in a standard format, run the peer esad-route-compatible enable command. To send ES AD routes in a non-standard format, run the peer esad-route-compatible disable command.\nPrecautions\nIf the peer group and the specified peer are configured to send ES AD routes in different formats, the specified peer sends ES AD routes in its own configured format."
}