{
    "PageTitle": "peer advertise route-reoriginated (BGP-VPNv4 address family view) (group)",
    "FuncDef": "The peer advertise route-reoriginated command configures a device to send the routes that are regenerated in the EVPN address family to a VPNv4 peer group.\nThe undo peer advertise route-reoriginated command restores the default configuration.\nBy default, a device does not send the routes that are regenerated in the EVPN address family to a VPNv4 peer group.",
    "CLIs": [
        "peer <peerGroupName> advertise route-reoriginated evpn { mac-ip | ip }",
        "undo peer <peerGroupName> advertise route-reoriginated evpn { mac-ip | ip }"
    ],
    "ParentView": [
        "BGP-VPNv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "peerGroupName",
            "Info": "Specifies the name of a VPNv4/VPNv6 peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "evpn",
            "Info": "Re-encapsulates received EVPN routes.\n-"
        },
        {
            "Parameters": "mac-ip",
            "Info": "Re-encapsulates IRB routes in received EVPN routes.\n-"
        },
        {
            "Parameters": "ip",
            "Info": "Re-encapsulates IP prefix routes in received EVPN routes.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 1.1.1.1 as-number 100",
            "[*HUAWEI-bgp] group gp1",
            "[*HUAWEI-bgp] ipv4-family vpnv4",
            "[*HUAWEI-bgp-af-vpnv4] peer gp1 enable",
            "[*HUAWEI-bgp-af-vpnv4] peer 1.1.1.1 group gp1",
            "[*HUAWEI-bgp-af-vpnv4] peer gp1 advertise route-reoriginated evpn mac-ip"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA DCI is a solution for communication between DCs. In the DCI solution, after the EVPN routes that are received from the DC side and carry the VXLAN encapsulation attribute are regenerated on the DCI-PE, the DCI-PE advertises VPNv4 routes that carry the MPLS encapsulation attribute to the VPNv4 peer on the DCI backbone network.\nPrerequisites\nEVPN route regeneration has been enabled using the peer group-name import reoriginate command."
}