{
    "PageTitle": "peer capability-advertise add-path (BGP-EVPN address family view) (group)",
    "FuncDef": "The peer capability-advertise add-path command enables BGP Add-Path function.\nThe undo peer capability-advertise add-path command restores the default setting.\nBy default, the BGP Add-Path function is disabled.",
    "CLIs": [
        "peer <peerGroupName> capability-advertise add-path { both | receive | send }",
        "undo peer <peerGroupName> capability-advertise add-path { both | receive | send }"
    ],
    "ParentView": [
        "BGP-EVPN address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "peerGroupName",
            "Info": "Specifies the name of a peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "both",
            "Info": "Enables the RR to receive Add-Path routes from and send Add-Path routes to a specified IBGP peer.\n-"
        },
        {
            "Parameters": "receive",
            "Info": "Enables the RR to receive Add-Path routes from a specified IBGP peer.\n-"
        },
        {
            "Parameters": "send",
            "Info": "Enables the RR to send Add-Path routes to a specified IBGP peer.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 1.1.1.1 as-number 100",
            "[*HUAWEI-bgp] peer 2.2.2.2 as-number 100",
            "[*HUAWEI-bgp] group gp1",
            "[*HUAWEI-bgp] l2vpn-family evpn",
            "[*HUAWEI-bgp-af-evpn] peer 1.1.1.1 group gp1",
            "[*HUAWEI-bgp-af-evpn] peer 2.2.2.2 group gp1",
            "[*HUAWEI-bgp-af-evpn] peer gp1 enable",
            "[*HUAWEI-bgp-af-evpn] peer gp1 capability-advertise add-path receive"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThere are multiple optional BGP functions when a BGP peer advertises routes to its peer. The optional BGP functions include Add-Path. You can run the peer capability-advertise add-path command to enable or disable Add-Path function based on the needs on the live network.\nPrerequisites\nEnable the peer group in current view using peer enable command.\nConfiguration Impact\nIf you enable or disable the Add-Path function, the BGP peer relationship will be re-established, which can lead to a temporary network interruption. Therefore, exercise caution when running the related commands.\nPrecautions\nIf a peer is specified when the peer capability-advertise add-path command is run, a peer group is specified when the peer advertise best-external command is run, and then the peer is added to the peer group, the peer cannot inherit the configuration of the peer advertise best-external command from the peer group."
}