{
    "PageTitle": "local-remote frr (EVPN instance view)",
    "FuncDef": "The local-remote frr enable command enables fast reroute (FRR) for MAC routes between the local and remote ends in an EVPN instance.\nThe undo local-remote frr enable cancels the enabling of FRR for MAC routes between the local and remote ends in an EVPN instance.\nThe local-remote frr disable command disables FRR for MAC routes between the local and remote ends in an EVPN instance.\nThe undo local-remote frr disable command cancels the disabling of MAC routes between the local and remote ends in an EVPN instance.\nBy default, if FRR for MAC routes between the local and remote ends in an EVPN instance is not configured in an EVPN instance, the global configuration of FRR for MAC routes between the local and remote ends takes effect.",
    "CLIs": [
        "local-remote frr { enable | disable }",
        "undo local-remote frr { enable | disable }"
    ],
    "ParentView": [
        "BD EVPN view",
        "EVPN instance view",
        "VPWS-EVPN instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "enable",
            "Info": "Enables the current configuration.\n-"
        },
        {
            "Parameters": "disable",
            "Info": "Disables the current configuration.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] evpn vpn-instance evpn1",
            "[*HUAWEI-evpn-instance-evpn1] local-remote frr enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn an EVPN VPWS single active, EVPN VPWS active-active, or EVPN VPLS active-active scenario, a CE is dual-homed to PE1 and PE2. If the link between the CE and PE1 fails, to prevent downstream unicast traffic from being lost after reaching PE1, run the local-remote frr command. This configuration allows PE1 to forward traffic to PE2 so that traffic is sent to the CE through the link between PE2 and the CE.\nPrecautions\nBy default, an EVPN instance complies with the global configuration of FRR for MAC routes between the local and remote ends. if FRR for MAC routes between the local and remote ends in an EVPN instance is not configured in an EVPN instance, the global configuration of FRR for MAC routes between the local and remote ends takes effect; if FRR for MAC routes between the local and remote ends is configured in an EVPN instance, the configuration in the EVPN instance takes precedence of the global configuration.  In the common EVPN or BD EVPN instance view, the local-remote frr enable command must be used together with the vlan-extend private enable and vlan-extend redirect enable commands to implement local and remote MAC FRR."
}