{
    "PageTitle": "local-service-id remote-service-id",
    "FuncDef": "The local-service-id remote-service-id command enables a device to send protocol packets with local and remote service IDs.\nThe undo local-service-id remote-service-id command disables a device to send protocol packets with local and remote service IDs.\nBy default, a device sends protocol packets without local and remote service IDs.",
    "CLIs": [
        "local-service-id <service-id> remote-service-id <service-id>",
        "undo local-service-id <service-id> remote-service-id <service-id>"
    ],
    "ParentView": [
        "EVPL SRv6 view",
        "EVPL instance MPLS mode view"
    ],
    "ParaDef": [
        {
            "Parameters": "remote-service-id service-id",
            "Info": "Specifies a remote service ID.\nThe value is an integer ranging from 1 to 16777215."
        },
        {
            "Parameters": "local-service-id service-id",
            "Info": "Specifies a local service ID.\nThe value is an integer ranging from 1 to 16777215."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] evpn vpn-instance evrf1 vpws",
            "[*HUAWEI-vpws-evpn-instance-evrf1] route-distinguisher 100:1",
            "[*HUAWEI-vpws-evpn-instance-evrf1] vpn-target 1:1",
            "[*HUAWEI-vpws-evpn-instance-evrf1] quit",
            "[*HUAWEI] evpl instance 1 mpls-mode",
            "[*HUAWEI-evpl-mpls1] evpn binding vpn-instance evrf1",
            "[*HUAWEI-evpl-mpls1] local-service-id 1 remote-service-id 2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nEVPN VPWS is a P2P L2VPN solution. CEs access PEs through AC interfaces. An MPLS tunnel between the PEs traverses the backbone network. Each AC interface is bound to an EVPL instance, and each EVPL instance is assigned a service ID. The EVPL instance on the local PE maps that on the remote PE. To enable the PEs to exchange protocol packets with local and remote service IDs, run the local-service-id command. This configuration differentiates CE-accessed traffic and allows P2P interworking.\nThe service ID must be unique based on an EVPN instance. It is recommended that you set different local-service-id and remote-service-id values for the EVPN instance."
}