{
    "PageTitle": "mac threshold-alarm",
    "FuncDef": "The mac threshold-alarm command configures MAC address alarm thresholds for an EVPN instance.\nThe undo mac threshold-alarm command restores the default MAC address alarm thresholds.\nBy default, the alarm reporting threshold is 80%, and the alarm clearing threshold is 70%.",
    "CLIs": [
        "mac threshold-alarm upper-limit <upper-limit-value> lower-limit <lower-limit-value>",
        "undo mac threshold-alarm"
    ],
    "ParentView": [
        "BD EVPN view",
        "EVPN instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "lower-limit lower-limit-value",
            "Info": "Specifies the alarm clearing threshold for MAC addresses in an EVPN instance.\nThe value is an integer ranging from 1 to 100, in percent.\nlower-percent must be smaller than upper-percent. If you do not want alarms to be frequently reported and cleared due to route flapping, ensure that lower-percent is smaller than upper-percent by 10 at least."
        },
        {
            "Parameters": "upper-limit upper-limit-value",
            "Info": "Specifies the alarm reporting threshold for MAC addresses in an EVPN instance.\nThe value is an integer ranging from 1 to 100, in percent.\nIt is recommended that you specify a value smaller than 95 for upper-percent."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] evpn vpn-instance evpn1",
            "[*HUAWEI-evpn-instance-evpn1] mac threshold-alarm upper-limit 85 lower-limit 65"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe number of MAC addresses allowed by an EVPN instance is limited. If the number exceeds the maximum limit, services may be interrupted. To address this problem, configure alarm thresholds for MAC addresses in the EVPN instance. You can then check whether exceptions have occurred based on reported alarms and take immediate measures to prevent excess MAC addresses from being learned by the EVPN instance.\nTo adjust alarm reporting and clearing thresholds, run the mac threshold-alarm command.\nPrecautions\nThe mac threshold-alarm command simply configures alarm thresholds for MAC addresses in an EVPN instance. A threshold-crossing alarm can be reported only if the following conditions are met:- The alarm function is enabled using the snmp-agent trap enable feature-name evpn command.- The number of MAC addresses in the EVPN instance exceeds the alarm reporting threshold or falls below the alarm clearing threshold."
}