{
    "PageTitle": "peer graceful-restart static-timer (BGP-EVPN address family view)(IPv6)",
    "FuncDef": "The peer graceful-restart static-timer command sets the maximum duration from the time the local device finds that the peer device is restarted to the time a BGP EVPN session is re-established.\nThe undo peer graceful-restart static-timer command deletes the configuration.\nBy default, the maximum duration from the time the local device finds that the peer device is restarted to the time a BGP EVPN session is re-established is 150s.",
    "CLIs": [
        "peer <peerIpv6Addr> graceful-restart static-timer <restart-time>",
        "undo peer <peerIpv6Addr> graceful-restart static-timer <restart-time>",
        "undo peer <peerIpv6Addr> graceful-restart static-timer"
    ],
    "ParentView": [
        "BGP-EVPN address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "peerIpv6Addr",
            "Info": "Specifies the IPv6 address of a peer.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "restart-time",
            "Info": "Specifies the maximum duration from the time the local device finds that the peer device is restarted to the time a BGP EVPN session is re-established.\nThe value is an integer ranging from 3600 to 2147483647, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] graceful-restart",
            "[*HUAWEI-bgp] peer 1::1 as-number 100",
            "[*HUAWEI-bgp] l2vpn-family evpn",
            "[*HUAWEI-bgp-af-evpn] peer 1::1 enable",
            "[*HUAWEI-bgp-af-evpn] peer 1::1 graceful-restart static-timer 5000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, the maximum duration from the time the local device finds that the peer device is restarted to the time a BGP EVPN session is re-established is 150s. Even if you run the graceful-restart timer restart time command in the BGP view, the maximum wait time can be changed to 3600s at most. If some BGP EVPN sessions take more than 3600s to re-establish due to poor network conditions, you can run the peer graceful-restart static-timer command to set a proper wait time for a specified peer.\nConfiguration Impact\nIf the graceful-restart timer restart command is run in the BGP view and the peer graceful-restart static-timer command is run in any of its views, the latter command takes precedence over the former command.\nPrecautions\nGR has been enabled using the graceful-restart command."
}