{
    "PageTitle": "peer route-policy export (BGP-EVPN address family view)",
    "FuncDef": "The peer route-policy export command specifies a route-policy for filtering routes to be advertised to a peer.\nThe undo peer route-policy export command deletes a specified route-policy.\nBy default, no route-policy is configured for filtering routes to be advertised to a peer.",
    "CLIs": [
        "peer <peerIpv4Addr> route-policy <route-policy-name> export",
        "undo peer <peerIpv4Addr> route-policy <route-policy-name> export"
    ],
    "ParentView": [
        "BGP-EVPN address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "peerIpv4Addr",
            "Info": "Specifies the IPv4 address of a peer.\nIt is in dotted decimal notation."
        },
        {
            "Parameters": "route-policy-name",
            "Info": "Specifies the name of a route-policy.\nThe name is a string of 1 to 200 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] route-policy test-policy permit node 10",
            "[*HUAWEI-route-policy] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 10.1.1.9 as-number 100",
            "[*HUAWEI-bgp] l2vpn-family evpn",
            "[*HUAWEI-bgp-af-evpn] peer 10.1.1.9 enable",
            "[*HUAWEI-bgp-af-evpn] peer 10.1.1.9 route-policy test-policy export"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter a route-policy is created, the peer route-policy export command is used to apply a Route-Policy to a peer group so that the routes advertised to peer group can be controlled. To be specific, only the necessary routes are advertised to the peer group. In this manner, route management is implemented, the scale of the routing table is reduced, and fewer network resources are consumed.\nPrerequisites\nIf the command specifies a route-policy, use the route-policy command to create the specified route-policy first.\nConfiguration Impact\nBinding a route-policy after a BGP peer relationship is established may cause peer flapping."
}