{
    "PageTitle": "peer advertise (BGP-EVPN address family view)",
    "FuncDef": "The peer advertise command enables a device to advertise ND, ARP or IRB routes to a BGP EVPN peer.\nThe undo peer advertise command restores the default configuration.\nBy default, a device does not advertise ND, ARP or IRB routes to a BGP EVPN peer.",
    "CLIs": [
        "peer <ipv4-address> advertise { irb | arp }",
        "peer <ipv4-address> advertise { irbv6 | nd }",
        "undo peer <ipv4-address> advertise { irb | arp }",
        "undo peer <ipv4-address> advertise { irbv6 | nd }"
    ],
    "ParentView": [
        "BGP-EVPN address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv4-address",
            "Info": "Specifies the IPv4 address of a BGP EVPN peer.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "irb",
            "Info": "Configures a device to advertise IRB routes to its BGP EVPN peers.\n-"
        },
        {
            "Parameters": "arp",
            "Info": "Configures a device to advertise ARP routes to its BGP EVPN peers.\n-"
        },
        {
            "Parameters": "irbv6",
            "Info": "Configures a device to advertise IRBv6 routes to its BGP EVPN peers.\n-"
        },
        {
            "Parameters": "nd",
            "Info": "Configures a device to advertise ND routes to its BGP EVPN peers.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 1.1.1.1 as-number 100",
            "[*HUAWEI-bgp] l2vpn-family evpn",
            "[*HUAWEI-bgp-af-evpn] peer 1.1.1.1 enable",
            "[*HUAWEI-bgp-af-evpn] peer 1.1.1.1 advertise arp"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo allow a device to advertise ARP or IRB routes to its BGP EVPN peers, run the peer advertise command. This command allows VTEPs to establish VXLAN tunnels and implements ARP broadcast suppression on networks. If you specify irb, VTEPs can also transmit host routes.\nIf you specify nd or irbv6, the local device can advertise ND or IRBv6 routes to a BGP EVPN peer. After receiving the routes, the BGP EVPN peer generates a proxy table locally. After the BGP EVPN peer receives NS packets, it searches the local proxy table. If an entry is hit, the VXLAN gateway directly performs proxy ND or multicast-to-unicast processing.\nPrecautions\nYou cannot specify both arp and irb in the same BGP-EVPN address family view.\nYou cannot specify both nd and irbv6 in the same BGP-EVPN address family view."
}