{
    "PageTitle": "peer split-group (BGP-EVPN address family view)",
    "FuncDef": "The peer split-group command configures a split horizon group (SHG) to which BGP EVPN peers belong.\nThe undo peer split-group command restores the default configuration.\nBy default, no SHG is configured for BGP EVPN peers.",
    "CLIs": [
        "peer <ipv4-address> split-group <split-group-name>",
        "undo peer <ipv4-address> split-group <split-group-name>"
    ],
    "ParentView": [
        "BGP-EVPN address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv4-address",
            "Info": "Specifies the IPv4 address of a BGP EVPN peer.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "split-group split-group-name",
            "Info": "Specifies the name of the SHG to which BGP EVPN peers belong.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. The string can contain spaces if it is enclosed with double quotation marks (\")."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 10.1.1.9 as-number 200",
            "[*HUAWEI-bgp] l2vpn-family evpn",
            "[*HUAWEI-bgp-af-evpn] peer 10.1.1.9 enable",
            "[*HUAWEI-bgp-af-evpn] peer 10.1.1.9 split-group aa"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn a scenario where segment VXLAN is used to implement Layer 2 interworking between DCs, a VXLAN tunnel is established in BGP EVPN mode between the DCs. To prevent forwarding BUM traffic from causing loops, run the peer split-group command on the transit leaf nodes (edge devices interconnecting the DCs) to configure an SHG to which the BGP EVPN peers (transit leaf nodes) belong. After the configuration is complete, devices within a DC belong to the default SHG, and transit leaf nodes between DCs belong to the specified SHG. In this manner, when a transit leaf node receives BUM traffic, it does not forward traffic to a device belonging to the same SHG, therefore preventing loops.\nPrerequisites\nBGP EVPN peers have been enabled to exchange route information using the peer enable command."
}