{
    "PageTitle": "peer advertise route-reoriginated (BGP-VPNv6 address family view)",
    "FuncDef": "The peer advertise route-reoriginated command configures a device to send the routes that are regenerated in the EVPN address family to a VPNv6 peer.\nThe undo peer advertise route-reoriginated command restores the default configuration.\nBy default, a device does not send the routes that are regenerated in the EVPN address family to a VPNv6 peer.",
    "CLIs": [
        "peer <peerIpv4Addr> advertise route-reoriginated evpn { mac-ipv6 | ipv6 }",
        "undo peer <peerIpv4Addr> advertise route-reoriginated evpn { mac-ipv6 | ipv6 }"
    ],
    "ParentView": [
        "BGP-VPNv6 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "peerIpv4Addr",
            "Info": "Specifies the IPv4 address of a VPNv4/VPNv6 peer.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "evpn",
            "Info": "Re-encapsulates received EVPN routes.\n-"
        },
        {
            "Parameters": "mac-ipv6",
            "Info": "Re-encapsulates IRBv6 routes in received EVPN routes.\n-"
        },
        {
            "Parameters": "ipv6",
            "Info": "Re-encapsulates IPv6 prefix routes in received EVPN routes.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 1.1.1.1 as-number 100",
            "[*HUAWEI-bgp] ipv6-family vpnv6",
            "[*HUAWEI-bgp-af-vpnv6] peer 1.1.1.1 enable",
            "[*HUAWEI-bgp-af-vpnv6] peer 1.1.1.1 advertise route-reoriginated evpn mac-ip"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA DCI is a solution for communication between DCs. In the DCI solution, after the EVPN routes that are received from the DC side and carry the VXLAN encapsulation attribute are regenerated on the DCI-PE, the DCI-PE advertises VPNv6 routes that carry the MPLS encapsulation attribute to the VPNv6 peer on the DCI backbone network.\nPrerequisites\nEVPN route regeneration has been enabled using the peer import reoriginate command."
}