{
    "PageTitle": "remote frr (VPWS-EVPN instance view)",
    "FuncDef": "The remote frr enable command enables fast reroute (FRR) for MAC routes at the remote end.\nThe undo remote frr enable command cancels the configuration of FRR for MAC routes at the remote end.\nThe remote frr disable command disables FRR for MAC routes at the remote end.\nThe undo remote frr disable command cancels the disabling of FRR for MAC routes at the remote end.\nBy default, FRR for MAC routes is not configured at the remote end.",
    "CLIs": [
        "remote frr { enable | disable }",
        "undo remote frr { enable | disable }"
    ],
    "ParentView": [
        "VPWS-EVPN instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "enable",
            "Info": "Enables the current configuration.\n-"
        },
        {
            "Parameters": "disable",
            "Info": "Disables the current configuration.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] evpn vpn-instance evpn1 vpws",
            "[*HUAWEI-vpws-evpn-instance-evpn1] remote frr enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn an EVPN VPWS multi-homing single-active scenario, a CE is dual-homed to PE1 and PE2. Suppose PE1 is the primary PE in this example. In normal conditions, downstream traffic on PE3 is sent to PE1. To prevent traffic loss, run the remote frr enable command on PE3 to enable FRR for MAC routes at the remote end. If PE3 detects a link failure between itself and PE1, this configuration allows PE3 to rapidly switch traffic to PE2, which then sends traffic to CE1.\nPrecautions\nThis command is used in the VPWS-EVPN instance view to enable remote FRR in the current instance. The remote vpws-frr enable command is run in the EVPN global configuration view to enable remote FRR for all VPWS-EVPN instances. By default, the remote vpws-frr enable command is run in the view of the VPWS-EVPN instance. If the remote frr enable or remote frr disable command is run in the view of the VPWS-EVPN instance, the configuration in the instance is used."
}