{
    "PageTitle": "route-distinguisher (EVPN)",
    "FuncDef": "The route-distinguisher command configures an RD for an EVPN instance.\nThe undo route-distinguisher command deletes the RD of an EVPN instance.\nBy default, no RD is configured for an EVPN instance.",
    "CLIs": [
        "route-distinguisher <route-distinguisher>",
        "undo route-distinguisher <route-distinguisher>"
    ],
    "ParentView": [
        "B-EVPN instance view",
        "BD EVPN view",
        "EVPN instance view",
        "VPWS-EVPN instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "route-distinguisher",
            "Info": "Specifies an RD.\nAn RD can be in either of the following formats:\n2-byte AS number: 4-byte user-defined number, such as 1:3. The AS number ranges from 0 to 65535, and the user-defined number ranges from 0 to 4294967295. The AS number and user-defined number cannot be both 0s. Specifically, an RD cannot be 0:0.4-byte AS number: 2-byte user-defined number, such as 65537:3. The AS number ranges from 65536 to 4294967295, and the user-defined number ranges from 0 to 65535.4-byte AS number in dotted notation: 2-byte user-defined number, such as 0.0:3 or 0.1:0. The AS number is in the format of x.y, where x and y are integers ranging from 0 to 65535. The user-defined number also ranges from 0 to 65535. The AS number and user-defined number cannot be both 0s. Specifically, an RD cannot be 0.0:0.4-byte IP address: 2-byte user-defined number, such as 192.168.122.15:1. The IP address ranges from 0.0.0.0 to 255.255.255.255, and the user-defined number ranges from 0 to 65535."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] evpn vpn-instance evpn1",
            "[*HUAWEI-evpn-instance-evpn1] route-distinguisher 22:1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAn RD must be configured for an EVPN instance after the EVPN instance is created. To configure an RD for an EVPN instance, run the route-distinguisher command.\nDifferent EVPN instances may have the same route prefix. To allow a PE to determine to which EVPN instance a route belongs, run the route-distinguisher command to configure an RD for each EVPN instance on the PE. After the configuration, a route sent from an EVPN instance will carry an RD, making the route a globally unique EVPN route.\nPrecautions\nRunning the undo route-distinguisher command in the B-EVPN instance view causes EVPN-related configurations to be deleted."
}