{
    "PageTitle": "vlan-extend redirect enable",
    "FuncDef": "The vlan-extend redirect enable command enables a device to redirect routes carrying the VLAN private extended community attribute.\nThe undo vlan-extend redirect enable command disables a device from redirecting routes carrying the VLAN private extended community attribute.\nBy default, a device does not redirect routes carrying the VLAN private extended community attribute.",
    "CLIs": [
        "vlan-extend redirect enable",
        "undo vlan-extend redirect enable"
    ],
    "ParentView": [
        "Global EVPN configuration view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] evpn",
            "[*HUAWEI-evpn] vlan-extend redirect enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn a CE dual-homing scenario, a CE is dual-homed to PE1 and PE2 through Eth-Trunk interfaces. PE1 learns the CE-side MAC address and advertises the MAC route to PE2 through EVPN. The corresponding MAC forwarding entry is generated on PE2. If the traffic transmitted from a remote device to the CE over PE2 is switched to PE2 due to reasons such as a fault, PE2 forwards traffic to PE1 based on the MAC forwarding entry. The traffic is then forwarded to the CE over PE1. To conserve the link bandwidth between PE1 and PE2, run the vlan-extend redirect enable command. After this command is executed and PE2 learns MAC routes from PE1, PE2 can check whether the ESI information of the MAC routes exists on the local device. If such ESI information exists on the local device, PE1 and PE2 are connected to the same CE. In this case, MAC routes can be redirected to the local interface and the corresponding MAC forwarding entry is generated. After PE2 receives traffic destined for the CE from the remote device, PE2 directly sends the traffic to the CE.\nThe vlan-extend redirect enable command is used together with the local-remote frr enable command. In a CE dual-homing scenario where both the vlan-extend redirect enable and local-remote frr enable commands are configured, after the traffic transmitted from a remote device to the CE over PE1 is switched to PE2 due to reasons such as a fault, traffic is instantly forwarded based on the MAC forwarding entry. This avoids heavy packet loss after a switchover due to the generation of new forwarding entries."
}