{
    "PageTitle": "export route-policy evpn",
    "FuncDef": "The export route-policy evpn command associates the VPN instance IPv4/IPv6 address family of a VPN instance with an export routing policy to filter routes to be advertised to the EVPN.\nThe undo export route-policy evpn command disassociates the VPN instance IPv4/IPv6 address family of a VPN instance with an export routing policy.\nBy default, the VPN instance IPv4/IPv6 address family of a VPN instance is not associated with any export routing policy.",
    "CLIs": [
        "export route-policy <policy-name> evpn",
        "undo export route-policy <policy-name> evpn"
    ],
    "ParentView": [
        "VPN instance IPv4 address family view",
        "VPN instance IPv6 address family view",
        "VPN instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "policy-name",
            "Info": "Specifies the name of a routing policy.\nThe name is a string of 1 to 200 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] route-policy policy-2 permit node 10",
            "[*HUAWEI-route-policy] apply extcommunity color 0:100",
            "[*HUAWEI-route-policy] quit",
            "[*HUAWEI] ip vpn-instance vrf1",
            "[*HUAWEI-vpn-instance-vrf1] ipv4-family",
            "[*HUAWEI-vpn-instance-vrf1-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vrf1-af-ipv4] export route-policy policy-2 evpn"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, the VPN IPv4/IPv6 address family of a VPN instance adds all VPN targets in the export VPN target list to routes to be advertised to the EVPN. To control route export more precisely, run the export route-policy evpn command to associate the VPN IPv4/IPv6 address family with an export routing policy and set attributes for eligible routes.\nPrerequisites\nAn RD has been configured for the VPN instance IPv4/IPv6 address family using the route-distinguisher command.\nConfiguration Impact\nIf the command is run more than once, the latest configuration overrides the previous one.\nThe export routing policy configured using the export route-policy evpn command does not affect the export routing policy applied to the VPN instance using the export route-policy command.\nPrecautions\nIf the specified routing policy does not exist, run the route-policy command to create the routing policy."
}