{
    "PageTitle": "set master-key auto-update",
    "FuncDef": "The set master-key auto-update command enables the automatic update function of the system master key and sets the interval for automatic update.\nThe undo set master-key auto-update command disables the automatic update function of the system master key.\nBy default, the automatic update function is not enabled for the system master key.",
    "CLIs": [
        "set master-key auto-update interval <interval-time>",
        "undo set master-key auto-update [ interval <interval-time> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "interval interval-time",
            "Info": "Specifies an interval for automatic update.\nThe value is an integer that ranges from 1 to 3650, in days."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] set master-key auto-update interval 5",
            "Warning: If automatic master key update is enabled, the system automatically generates a master key and saves the configuration when the master key is updated. Are you sure you want to continue?  [Y/N]:y"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] set master-key auto-update interval 5",
            "Warning: If automatic master key update is enabled, the configured master key will be cleared, and the system will automatically generate a master key. The configuration will be automatically saved when the master key is updated. Are you sure you want to continue? [Y/N]:y"
        ],
        [
            "<HUAWEI> set master-key",
            "Warning: This operation will disable the automatic update of the master key and the configuration will be automatically saved. Are you sure you want to continue? [Y/N]:y",
            "Enter a new master key: ",
            "Confirm the new master key: ",
            "Warning: Keep the new master key well.",
            "Enter the user password: ",
            "Info: Operating, please wait for a moment.....",
            "Info: Operation succeeded."
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe system master key can be the default master key or a manually configured master key.\nIf the default master key is used for a long time, it may be stolen or cracked. The master key that is manually configured needs to be periodically changed and maintained.\nTo reduce manual maintenance workload, run the set master-key auto-update command to enable automatic update of the master key. The system then periodically generates a new master key that is a string of 32 characters.\nTo disable the automatic update function, run the undo set master-key auto-update command. After the automatic update function is disabled, the latest master key of the system is maintained and will not be automatically updated."
}