{
    "PageTitle": "active port-mode-channel",
    "FuncDef": "The active port-mode-channel command activates the licenses for channelized sub-interfaces on a device.\nThe undo active port-mode-channel command deactivates the licenses for channelized sub-interfaces on a device.\nBy default, the licenses for channelized sub-interfaces are not activated.",
    "CLIs": [
        "active port-mode-channel slot <slotid> card <cardid> port <port-list>",
        "undo active port-mode-channel slot <slotid> card <cardid> [ port <port-list> ]"
    ],
    "ParentView": [
        "License view"
    ],
    "ParaDef": [
        {
            "Parameters": "card cardid",
            "Info": "Specifies a subcard ID.\nThe value is an integer that ranges from 0 to 4294967295."
        },
        {
            "Parameters": "port port-list",
            "Info": "Specifies a list of sub-interfaces for which the licenses are to be deactivated on a specific subcard.\nThe value is a string of 1 to 255 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "slot slotid",
            "Info": "Specifies the slot ID of a board.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] License",
            "[~HUAWEI-license] undo active  port-mode-channel slot 1 card 7 port 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBefore enabling channelization on a sub-interface, you need to run the active port-mode-channel command to activate the license for the channelized sub-interface. To deactivate the license for a channelized sub-interface, run the undo active port-mode-channel command. You can deactivate a specified license or the licenses for all the channelized sub-interfaces on a subcard or main interface.\nThere is no need to activate the license for a channelized sub-interface on a GE interface.\nPrerequisites\nBefore deactivating the license for a channelized sub-interface, ensure that channelization has been disabled on the sub-interface using the undo mode channel enable command."
}