{
    "PageTitle": "shutdown interface",
    "FuncDef": "The shutdown interface command shuts down sub-interfaces in a batch.\nThe undo shutdown interface command starts sub-interfaces in a batch.\nBy default, a sub-interface is started.",
    "CLIs": [
        "shutdown interface { <ifname> | <beginIfType> <beginIfNum> } <to> { <endIfname> | <endIfType> <endIfNum> }",
        "undo shutdown interface { <ifname> | <beginIfType> <beginIfNum> } <to> { <endIfname> | <endIfType> <endIfNum> }"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "ifname",
            "Info": "Specifies a start interface name.\n-"
        },
        {
            "Parameters": "beginIfType",
            "Info": "Specifies a start interface type.\nThe interfaces must support sub-interfaces."
        },
        {
            "Parameters": "beginIfNum",
            "Info": "Specifies a start interface number.\n-"
        },
        {
            "Parameters": "to",
            "Info": "The keyword to is used to connect two interfaces, indicating that the interface numbers are all interfaces between two interfaces (including these two interfaces).\n-"
        },
        {
            "Parameters": "endIfname",
            "Info": "Specifies an end interface name.\n-"
        },
        {
            "Parameters": "endIfType",
            "Info": "Specifies an end interface type.\nThe interfaces must support sub-interfaces."
        },
        {
            "Parameters": "endIfNum",
            "Info": "Specifies an end interface number.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/1.1",
            "[*HUAWEI-GigabitEthernet1/0/1.1] quit",
            "[*HUAWEI] interface GigabitEthernet 1/0/1.2",
            "[*HUAWEI-GigabitEthernet1/0/1.2] quit",
            "[*HUAWEI] interface GigabitEthernet 1/0/1.3",
            "[*HUAWEI-GigabitEthernet1/0/1.3] quit",
            "[*HUAWEI] shutdown interface GigabitEthernet 1/0/1.1 to GigabitEthernet 1/0/1.3"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a main interface has a large number of sub-interfaces, to disable these interfaces, run the shutdown command on each sub-interface view. To release workloads, run the shutdown interface command to disable sub-interfaces in a batch. After the shutdown interface command is run, the sub-interface operating state changes to Down. If the sub-interface is in the disabled state, run the undo shutdown interface command to start sub-interfaces in a batch, after the undo shutdown interface command is run, the sub-interface operating state is synchronized with the link status.\nPrerequisites\nThe sub-interfaces to be disabled or started in a batch must exist.\nConfiguration Impact\nRunning the shutdown interface command will interrupt services on the sub-interfaces. Therefore, exercise caution when running this command.\nIf the shutdown interface command is run more than once, the latest configuration overrides the previous one.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nWhen you specify the interface range, note that:\nThe end interface number must be greater than the start interface number.The types of the interfaces to which the end interface number and start interface number correspond must be the sameThe interfaces in the range must exist."
}