{
    "PageTitle": "clock",
    "FuncDef": "The clock command configures the working mode for the clock on a 10G WAN interface or a POS interface.\nThe undo clock command restores the default setting.\nBy default, the clock on a 10GE WAN interface or a POS interface works in master mode.",
    "CLIs": [
        "clock { master | slave }",
        "undo clock"
    ],
    "ParentView": [
        "10G WAN interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "master",
            "Info": "Configures interface to work in master clock mode.\n-"
        },
        {
            "Parameters": "slave",
            "Info": "Configures interface to work in slave clock mode.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] clock slave"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Pos 1/0/0",
            "[~HUAWEI-Pos1/0/0] clock slave"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe clock on a Pos interface can work in either of the following modes:\nMaster: The interface that works in this mode uses internal clock signals.Slave: The interface that works in this mode uses clock signals provided by an external device.\nThe principles for configuring clock modes for POS interfaces in actual networking are as follows:\nClocks modes on the POS interfaces of two directly connected routers must be both set to master, or on one end set to master and the other end set to slave.If two routers are connected over a WDM transmission device, clocks modes on the POS interfaces of the two interconnected devices must be both set to master.If an SDH or SONET device is deployed in the intermediate of two interconnected routers, clock modes on the POS interfaces of the two devices must be both set to slave to trace clock signals of the SDH or SONET device.If the connection mode of two routers is unknown, the clocks of the POS interfaces on the two routers must work in master mode.\nThe clock on a 10GE WAN interface can work in either of the following modes:\nMaster: The interface that works in this mode uses internal clock signals.Slave: The interface that works in this mode uses clock signals provided by an external device.\nPrinciples for configuring clock working modes of 10GE WAN interfaces are as follows:\nOn a backbone network, if two routers are connected directly or through WDM transmission devices, the clock of the 10GE WAN interface on one router must work in master mode and that of the other router must work in slave mode.On a backbone network, if two routers are connected through SDH/SONET transmission devices, the clocks of 10GE WAN interfaces on the two routers both work in slave mode.On an IP RAN, if a router is directly connected to an SDH/SONET transmission device using a 10GE WAN interface, the clock of the 10GE WAN interface on the router usually works in master mode. This is not applicable to a scenario where a BITS clock is directly connected to an SDH network.\nIf the connection mode of two routers is unknown, the clocks of the 10GE WAN interfaces on the two routers must work in master mode.\n\nPrecautions\nLink flapping may occur if the clock works in improper mode. POS interfaces do not support the clock slave command:\nall POS interfaces of CR5D00E8GF73 subcardPOS interfaces 1, 3, 5, and 7 of CR5D00E8GF72 subcard"
}