{
    "PageTitle": "crc-error packet-error-ratio algorithm-parameter (interface view)",
    "FuncDef": "The crc-error packet-error-ratio algorithm-parameter command configures the parameters used in the algorithm to calculate CRC error packet ratio.\nThe crc-error packet-error-ratio algorithm-parameter realtime-factor command specifies the number of the template for factors affecting the algorithm used to calculate the CRC error packet ratio.\nThe undo crc-error packet-error-ratio algorithm-parameter command restores the default parameters used in the algorithm to calculate CRC error packet ratio.\nBy default, the default values of the sample window factors for the parameters sample-window-factor, child-window-max-number, child-window-alarm-number, child-window-resume-number, template-number are 50, 50, 5, 30, and 5, respectively.",
    "CLIs": [
        "crc-error packet-error-ratio algorithm-parameter <sample-window-factor> <child-window-max-number> <child-window-alarm-number> <child-window-resume-number>",
        "crc-error packet-error-ratio algorithm-parameter realtime-factor <template-number>",
        "undo crc-error packet-error-ratio algorithm-parameter",
        "undo crc-error packet-error-ratio algorithm-parameter realtime-factor"
    ],
    "ParentView": [
        "100GE interface view",
        "10G LAN interface view",
        "10G WAN interface view",
        "25GE interface view",
        "400GE interface view",
        "40GE interface view",
        "50GE interface view",
        "50|100GE interface view",
        "FlexE interface view",
        "GE optical interface view",
        "GE electrical interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "sample-window-factor",
            "Info": "Sample window factor.\nThe value is an integer in the range 10 to 100. By default, the value is 50."
        },
        {
            "Parameters": "child-window-max-number",
            "Info": "Maximum number of child windows.\nThe value is an integer in the range 10 to 100. By default, the value is 50."
        },
        {
            "Parameters": "child-window-alarm-number",
            "Info": "Minimum number of child windows to generate an alarm.\nThe value is an integer in the range 1 to 100. By default, the value is 5."
        },
        {
            "Parameters": "child-window-resume-number",
            "Info": "Minimum number of child windows to clear an alarm.\nThe value is an integer in the range 1 to 100. By default, the value is 30."
        },
        {
            "Parameters": "realtime-factor template-number",
            "Info": "Number of the template for factors affecting the algorithm used to calculate the CRC error packet ratio.\nThe value is an integer ranging from 0 to 10. The default value is 5."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] trap-threshold crc-error packet-error-ratio alarm-threshold 1 3 resume-threshold 1 4 trigger-lsp",
            "[*HUAWEI-GigabitEthernet1/0/0] crc-error packet-error-ratio algorithm-parameter 50 50 5 20"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] trap-threshold crc-error packet-error-ratio alarm-threshold 1 3 resume-threshold 1 4 trigger-lsp",
            "[*HUAWEI-GigabitEthernet1/0/0] crc-error packet-error-ratio algorithm-parameter 50 50 5 20",
            "[*HUAWEI-GigabitEthernet1/0/0] crc-error packet-error-ratio algorithm-parameter realtime-factor 5"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter the detection threshold for the CRC packet error ratio alarm is configured, this command can be used to change the four key parameters in the detection algorithm: sample window factor, maximum number of child windows, minimal number of child windows for alarm generating, and number of the template for affecting factors.\nNote that modifying the preceding parameters directly affects the detection algorithm of the CRC packet error ratio alarm. Before running this command, ensure that these parameters are confirmed by Huawei engineers.\nConfiguration Impact\nThe crc-error packet-error-ratio algorithm-parameter command should be used under the guidance of Huawei technical support personnel.\nThe crc-error packet-error-ratio algorithm-parameter realtime-factor command does not support low-speed interface.\nPrecautions\nThe trap-threshold crc-error packet-error-ratio and crc-error packet-error-ratio algorithm-parameter commands must be run before the crc-error packet-error-ratio algorithm-parameter realtime-factor command is configured.If the undo trap-threshold crc-error packet-error-ratio command is run to cancel the CRC error packet rate detection function, the crc-error packet-error-ratio algorithm-parameter and crc-error packet-error-ratio algorithm-parameter realtime-factor commands are also canceled.It is recommended that you use the default parameter settings when running the crc-error packet-error-ratio algorithm-parameter realtime-factor command."
}