{
    "PageTitle": "crc-error packet-error-ratio algorithm-parameter",
    "FuncDef": "The crc-error packet-error-ratio algorithm-parameter command configures the parameters used in the algorithm to calculate CRC error packet ratio.\nThe undo crc-error packet-error-ratio algorithm-parameter command restores the default parameters used in the algorithm to calculate CRC error packet ratio.\nBy default, the default values of the sample window factors for the parameters sample-window-factor, child-window-max-number, child-window-alarm-number, child-window-resume-number are 50, 50, 5, and 30, respectively.",
    "CLIs": [
        "crc-error packet-error-ratio algorithm-parameter <sample-window-factor> <child-window-max-number> <child-window-alarm-number> <child-window-resume-number>",
        "undo crc-error packet-error-ratio algorithm-parameter"
    ],
    "ParentView": [
        "Trunk serial interface view",
        "Serial interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "sample-window-factor",
            "Info": "Sample window factor.\nThe value is an integer in the range 10 to 100. By default, the value is 50."
        },
        {
            "Parameters": "child-window-max-number",
            "Info": "Maximum number of child windows.\nThe value is an integer in the range 10 to 100. By default, the value is 50."
        },
        {
            "Parameters": "child-window-alarm-number",
            "Info": "Minimum number of child windows to generate an alarm.\nThe value is an integer in the range 1 to 100. By default, the value is 5."
        },
        {
            "Parameters": "child-window-resume-number",
            "Info": "Minimum number of child windows to clear an alarm.\nThe value is an integer in the range 1 to 100. By default, the value is 30."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] trap-threshold crc-error packet-error-ratio alarm-threshold 1 3 resume-threshold 1 4 trigger-lsp",
            "[*HUAWEI-GigabitEthernet1/0/0] crc-error packet-error-ratio algorithm-parameter 50 50 5 20"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter you run the trap-threshold crc-error packet-error-ratio command to set the alarm thresholds for the CRC error packet ratio, the system calculates the CRC error packet ratio based on an algorithm. To adjust this algorithm so that the result is more accurate, run the crc-error packet-error-ratio algorithm-parameter command to configure the parameters of this algorithm.\nConfiguration Impact\nThe crc-error packet-error-ratio command should be used under the guidance of Huawei technical support personnel.\nPrecautions\nThe trap-threshold crc-error packet-error-ratio command must be run before the crc-error packet-error-ratio algorithm-parameter command is configured.\nIf the undo trap-threshold crc-error command is run to cancel the CRC error packet rate detection function, the crc-error packet-error-ratio algorithm-parameter and crc-error packet-error-ratio algorithm-parameter realtime-factor commands are also canceled."
}