{
    "PageTitle": "damp-interface enable (interface view)",
    "FuncDef": "The damp-interface enable command enables status flapping suppression on a physical interface.\nThe undo damp-interface enable command disables the suppression function.\nBy default, status flapping suppression on an interface is the same as the global configuration.",
    "CLIs": [
        "damp-interface enable",
        "undo damp-interface enable"
    ],
    "ParentView": [
        "Layer 2 40GE interface view",
        "100GE-Trunk member Layer 2 interface view",
        "FlexE interface view",
        "40GE interface view",
        "GE electrical interface view",
        "Layer 2 10GE interface view",
        "Layer 2 GE interface view",
        "CPOS interface view",
        "400GE interface view",
        "10GE interface view",
        "Layer 2 100GE interface view",
        "Layer 2 50|100GE interface view",
        "40GE-Trunk member interface view",
        "E1/CE1 interface view",
        "25GE-L2 view",
        "400GE-L2 view",
        "E1 interface view",
        "100GE-Trunk member interface view",
        "GE interface view",
        "Layer 2 50GE interface view",
        "100GE interface view",
        "50GE interface view",
        "GE optical interface view",
        "40GE-Trunk member Layer 2 interface view",
        "25GE interface view",
        "POS interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet3/0/0",
            "[~HUAWEI-GigabitEthernet3/0/0] damp-interface enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIntermittent disconnection of an optical fiber connected to a physical interface causes the interface status to alternate frequently between Up and Down. The damp-interface function suppresses a flapping interface at the physical layer, which ensures stability of the entire link layer and network layer. To enable status flapping suppression, run the damp-interface enable command in the user view.\nPrecautions\nAfter the damp-interface enable command is run, configuration of the suppression parameters in the interface view preferentially takes effect over that in the system view.\nThe damp-interface enable command is mutually exclusive with the damp-interface ignore-global command.\nThe actual status of an interface alternates between Up and Down, which is not reported to the upper-layers. Therefore, the upper-layers sense that the interface status is Down during flapping.\nYou can query whether an interface enters or exits the suppression state through the hwIfDampSuppress and hwIfDampResume alarms, respectively."
}