{
    "PageTitle": "display interface brief main non-unicast",
    "FuncDef": "The display interface brief main non-unicast command displays brief information about all interfaces on a device, including the physical status and protocol status of the interfaces, latest inbound and outbound bandwidth usage, and the number of sent and received error packets.",
    "CLIs": [
        "display interface <interface-type> brief main non-unicast"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "interface-type",
            "Info": "Displays brief information about broadcast and multicast of the specified interface.\nCurrently, only Ethernet interfaces are supported."
        },
        {
            "Parameters": "non-unicast",
            "Info": "Displays brief information about broadcast or multicast of the specified interface.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display interface ethernet brief main non-unicast",
            "PHY: Physical",
            "*down: administratively down",
            "^down: standby",
            "(l): loopback",
            "(s): spoofing",
            "(E): E-Trunk down",
            "(b): BFD down",
            "(B): Bit-error-detection down",
            "(e): ETHOAM down",
            "(d): Dampening Suppressed",
            "(p): port alarm down",
            "(ld): loop-detect trigger down",
            "(mf): mac-flapping blocked",
            "(c): CFM down",
            "InUti/OutUti: input utility/output utility",
            "Interface                   PHY   Protocol  InBroad OutBroad   InMulti  OutMulti",
            "GigabitEthernet1/0/0       *down  down            0        0         0         0",
            "GigabitEthernet1/0/1       *down  down            0        0         0         0",
            "GigabitEthernet1/0/2       *down  down            0        0         0         0",
            "GigabitEthernet1/0/3       *down  down            0        0         0         0",
            "GigabitEthernet1/0/4(10G)       *down  down            0        0         0         0",
            "GigabitEthernet1/0/5       *down  down            0        0         0         0",
            "GigabitEthernet2/0/0       *down  down            0        0         0         0",
            "GigabitEthernet3/0/0       *down  down            0        0         0         0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBefore you monitor interface status or locate an interface fault, run the display interface brief main non-unicast command to view the status of and statistics on the interface. The command output helps you diagnose faults.\nCompared with the display interface command, the display interface brief main non-unicast command provides briefer interface information, focusing on the most important information.\nPerform any of following operations based on the interface status and statistics:\nIf the interface is Down, check whether the link connection is correct or whether interface negotiation succeeds.Interface statistics reflect traffic received and sent. If the interface has a lot of error statistics, check whether the interface is attacked or whether the link quality is stable.\n\nFollow-up Procedure\nRun the reset counters interface command to delete interface statistics displayed using the display interface brief command."
}