{
    "PageTitle": "display ipv6 interface",
    "FuncDef": "The display ipv6 interface command displays IPv6 information about an interface.\nThe display ipv6 interface description command displays brief information on and descriptions of IPv6-related interfaces.",
    "CLIs": [
        "display ipv6 interface [ <interface-name> | <interface-type> <interface-number> ]",
        "display ipv6 interface description [ <interface-name> | <interface-type> [ <interface-number> ] | slot <slot-number> [ card <card-number> ] ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "interface-name",
            "Info": "Specifies the interface name. If no interface name is specified, the command displays brief information on and descriptions of all IPv6-related interfaces.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "interface-type",
            "Info": "Specifies the interface type. If no interface type is specified, the command displays brief information on and descriptions of all IPv6-related interfaces.\n-"
        },
        {
            "Parameters": "interface-number",
            "Info": "Specifies the interface number, which is used with interface-type to identify an interface. If no interface number is specified, the command displays brief information on and descriptions of all IPv6-related interfaces of the specified interface type.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "slot slot-number",
            "Info": "Specifies the interface board number. If no interface board number is specified, the command displays brief information and descriptions of all IPv6-related interfaces on the main control boards and interface boards.\nIn VS mode, this parameter is supported only by the admin VS.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "card card-number",
            "Info": "Specifies the interface subcard number. If no interface subcard number is specified, the command displays brief information on and descriptions of all IPv6-related interfaces on the specified interface board.\nIn VS mode, this parameter is supported only by the admin VS.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display ipv6 interface gigabitethernet 1/0/0",
            "GigabitEthernet1/0/0 current state : UP ",
            "IPv6 protocol current state : UP ",
            "IPv6 is enabled, link-local address is FE80::3ABA:1800:324:8801 ",
            "  No global unicast address configured",
            "  Joined group address(es):",
            "    FF02::1",
            "    FF02::2",
            "    FF02::1:FF24:8801",
            "  MTU is 1620 bytes ",
            "  ND DAD is enabled, number of DAD attempts: 1",
            "  ND NUD is enabled, number of NUD attempts: 3",
            "  ND NUD interval is 1000 milliseconds",
            "  ND reachable time is 1200000 milliseconds",
            "  ND stale time is 1200 seconds",
            "  ND retransmit interval is 1000 milliseconds",
            "  ND RAs are halted ",
            "  ND Proxy is disabled"
        ],
        [
            "<HUAWEI> display ipv6 interface description",
            "Codes:",
            "      d(dampened),            D(down),                *D(administratively down),",
            "      !D(FIB overload down),  ^D(standby),            l(loopback),",
            "      s(spoofing),            U(up),                  E(E-Trunk down)",
            "------------------------------------------------------------------------------ ",
            "Number of interfaces whose physical status is Up: 2",
            "Number of interfaces whose physical status is Down: 0",
            "Number of interfaces whose protocol status is Up: 2",
            "Number of interfaces whose protocol status is Down: 0",
            "",
            "Interface                    Physical  Protocol  Description",
            "Eth3/0/0                     U         U         HUAWEI-LINK1",
            "[IPv6 Address] 2001:DB8:1::1",
            "Eth3/0/4                     U         U         HUAWEI-LINK2",
            "[IPv6 Address] 2001:DB8:2::2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf an interface is assigned an IPv6 address, run the display ipv6 interface command to view the IPv6 status and configuration on this interface.\nTo view brief information on and descriptions of IPv6-related interfaces, run the display ipv6 interface description command.\nFollow-up Procedure\nYou can run the display interface description command to view the description of the interface.\nYou can run the display interface command to view detailed information about the operation and statistics of the interface.\nPrecautions\nEnsure that the designated interfaces are assigned IPv6 addresses; otherwise, you cannot view information on the interfaces."
}