{
    "PageTitle": "enable snmp trap physical-updown",
    "FuncDef": "The enable snmp trap physical-updown command enables a device to send a trap message to an NMS when the interface physical status changes.\nThe undo enable snmp trap physical-updown command disables a device from sending a trap message to an NMS when the interface physical status changes.\nBy default, a device automatically sends a trap message to the NMS when the interface physical status changes.",
    "CLIs": [
        "enable snmp trap physical-updown",
        "undo enable snmp trap physical-updown"
    ],
    "ParentView": [
        "100GE interface view",
        "10G LAN interface view",
        "10G WAN interface view",
        "25GE interface view",
        "400GE interface view",
        "40GE interface view",
        "50GE interface view",
        "50|100GE interface view",
        "FlexE-100G interface view",
        "FlexE-50G interface view",
        "FlexE-50|100G interface view",
        "GE optical interface view",
        "GE electrical interface view",
        "POS interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] undo enable snmp trap physical-updown"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo monitor the real-time status of an interface, run the enable snmp trap physical-updown command so that a trap message can be sent to notify the NMS when the interface changes between Up and Down.\nConfiguration Impact\nA device automatically sends a trap message to the NMS when the interface physical status changes. If an interface alternates between Up and Down states, the device will frequently send trap messages to the NMS, which increases the processing load on the NMS. In this situation, you can run the undo enable snmp trap physical-updown command to disable the device from sending a trap message to the NMS to avoid the adverse impact on the NMS."
}