{
    "PageTitle": "laser auto-shutdown-interval (CPOS interface view)",
    "FuncDef": "The laser auto-shutdown-interval command configures intervals at which the optical module laser is disabled or enabled and the system checks for link failures.\nThe undo laser auto-shutdown-interval command restores the default configurations.\nBy default, the interval at which the optical module laser is enabled and the system checks for link failures is 2s, and the interval at which the optical module laser is disabled and the system checks for link failures is 60s.",
    "CLIs": [
        "laser auto-shutdown-interval { open <open-value> | close <close-value> } *",
        "undo laser auto-shutdown-interval"
    ],
    "ParentView": [
        "CPOS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "open open-value",
            "Info": "Specifies the interval at which the optical module laser is enabled and the system checks for link failures.\nThe value is an integer that ranges from 200 to 30000."
        },
        {
            "Parameters": "close close-value",
            "Info": "Specifies the interval at which the optical module laser is disabled and the system checks for link failures.\nThe value is an integer that ranges from 200 to 30000."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] controller cpos 1/0/0",
            "[*HUAWEI-Cpos1/0/0] laser autoshutdown enable",
            "[*HUAWEI-Cpos1/0/0] laser auto-shutdown-interval open 300"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter the laser autoshutdown enable command is run and a links failure occurs, the optical module disables the laser, and the system checks whether the link failure is cleared at two intervals (closetime-interval and opentime-interval). The two intervals can be configured using the laser atuo-shutdown-interval command. In addition, you can configure an interval during which the optical module laser is enabled after the link failure is cleared. closetime-interval and opentime-interval are described as follows:\nclosetime-interval:If an LOS alarm is generated on the interface, the optical module disables the laser automatically, and an alarm is generated, indicating that the optical module laser has been disabled. During closetime-interval, the system checks whether the LOS alarm persists.If the LOS alarm is cleared, the optical module enables the laser automatically, and the opentime-interval timer starts.If the LOS alarm persists, the optical module laser remains disabled.\nopentime-interval:When the closetime-interval timer expires or the LOS alarm is cleared during closetime-interval, the optical module enables the laser automatically, and the opentime-interval timer starts. During opentime-interval, the system keeps checking whether new LOS alarms are generated.If no new LOS alarms are generated, the optical module considers that the link failure has been cleared and goes back to the normal working state, and a clear alarm is generated, indicating that the optical module has recovered.If new LOS alarms are generated, the optical module disables the laser automatically, and the closetime-interval timer starts over.\n\n\nPrerequisites\nThe optical module has been configured to disable the laser automatically using the laser autoshutdown enable command."
}