{
    "PageTitle": "mac accounting enable",
    "FuncDef": "The mac accounting enable command enables the MAC accounting function.\nThe undo mac accounting enable command disables the MAC accounting function.\nBy default, the MAC accounting function is disabled.",
    "CLIs": [
        "mac accounting enable",
        "undo mac accounting enable"
    ],
    "ParentView": [
        "100GE interface view",
        "10GE interface view",
        "25GE interface view",
        "400GE interface view",
        "40GE interface view",
        "50GE interface view",
        "50|100GE interface view",
        "Eth-Trunk interface view",
        "FlexE interface view",
        "GE interface view",
        "XGE interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] mac accounting enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo collect MAC address-based traffic statistics on a physical interface, its sub-interfaces, an Eth-Trunk interface, or Eth-Trunk sub-interfaces, run the mac accounting enable command on the physical interface or Eth-Trunk interface to enable the MAC accounting function. This configuration allows a device to collect service traffic statistics based on an interface and its MAC address.\nThis command can be run only on a main interface and takes effect on the interface and its sub-interfaces.\nMAC accounting can be used in either of the following scenarios:\nWhen a Huawei device on an ISP network functions as an Internet exchange point (IXP), the networks connected to the IXP are provided by other carriers. When the ISP leases the other carriers' networks, for example, Network1 and Network2, they charge the ISP by traffic volume. To check traffic of MAC addresses, run the mac accounting enable command to enable the MAC accounting function on the IXP's interface, so that traffic of the peer routers can be obtained. This facilitates the ISP to verify or analyze traffic.If the IXP is under DDoS attacks, the MAC accounting function helps the ISP to check the traffic of peer routers with specified MAC addresses. If traffic of a specified MAC address is huge, the attack traffic may be from this device with the specified MAC address.\n\nPrecautions\nThe MAC accounting restriction is not supported on the VSUF boards.\nThe MAC accounting restriction is not supported on the LPUF-50/LPUF-50-L/LPUI-21-L/LPUI-51-L/LPUF-51/LPUF-51-B/LPUI-51/LPUI-51-B/LPUS-51/LPUF-101/LPUF-101-B/LPUI-101/LPUI-101-B/LPUS-101."
}