{
    "PageTitle": "monitor enable (Monitoring group view)",
    "FuncDef": "The monitor enable command enables the monitoring function for an interface monitoring group.\nThe undo monitor enable command disables the monitoring function for an interface monitoring group.\nBy default, the monitoring function is disabled for an interface monitoring group.",
    "CLIs": [
        "monitor enable",
        "undo monitor enable"
    ],
    "ParentView": [
        "Monitoring group view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] monitor-group group1",
            "[*HUAWEI-monitor-group-group1] monitor enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo associate an interface monitoring group with track interfaces, run the monitor enable command. The association function allows the track interfaces to change their status based on the down weights of the binding interfaces in the group. Traffic can then be switched between the primary and backup links accordingly.\nBy default, an interface monitoring group is not associated with a track interface. To enable the association, run the monitor enable command.\nPrerequisites\nAn interface monitoring group has been created using the monitor-group command.\nConfiguration Impact\nAfter the undo monitor enable command is run, association between the interface monitoring group and track interface is disabled, but interfaces can still be added to or removed from the interface monitoring group. Moreover, the interface monitoring group can detect the status changes (up/down) of binding interfaces and BFD sessions.\nPrecautions\nThe monitor enable command configuration takes effect immediately each time an interface is added to the interface monitoring group or an interface is configured to track the interface monitoring group.When a large number of interfaces are added to or removed from the monitoring group, the down weights of the binding interfaces are changed frequently, causing the track interfaces to flap. To prevent this issue, you are advised to run the monitor enable command after binding interfaces and track interfaces are specified using the binding interface and track monitor-group commands, respectively.If you have run the monitor enable command before all binding and track interfaces are specified and the preceding issue occurs, you need to run the undo monitor enable command to disable the association function, configure all the required binding and track interfaces, and then run the monitor enable command again."
}