{
    "PageTitle": "ipv6 mtu",
    "FuncDef": "The ipv6 mtu command sets the maximum transfer unit (MTU) value for an interface to send IPv6 packets.\nThe undo ipv6 mtu command restores the default MTU value for an interface to send IPv6 packets.\nBy default, the default value of POS interfaces is 4470 bytes, and the default value of other interfaces is 1500 bytes.",
    "CLIs": [
        "ipv6 mtu <mtu>",
        "undo ipv6 mtu"
    ],
    "ParentView": [
        "PW-VE interface view",
        "Tunnel interface view",
        "PW-VE sub-interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "GE electrical interface view",
        "Port extension interface view",
        "Serial interface view",
        "Eth-Trunk sub-interface view",
        "400GE interface view",
        "50GE sub-interface view",
        "10GE interface view",
        "MP-group interface view",
        "GE sub-interface view",
        "VBDIF interface view",
        "VE sub-interface view",
        "GE interface view",
        "25GE sub-interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "25GE interface view",
        "100ge sub-interface view",
        "40GE sub-interface view",
        "Eth-Trunk interface view",
        "10GE sub-interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "mtu",
            "Info": "Specifies the MTU for an interface to send IPv6 packets.\nEthernet interface and its sub-interface: The MTU value is an integer ranging from 1280 to 1500, in bytes. The default value is 1500.GE interface and its sub-interface: The MTU value is an integer ranging from 1280 to 9600, in bytes. The default value is 1500.Tunnel interface: The MTU value is an integer ranging from 1280 to 9600, in bytes. The default value is 1500."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1/0/1",
            "[*HUAWEI-GigabitEthernet1/0/1] ipv6 enable",
            "[*HUAWEI-GigabitEthernet1/0/1] ipv6 mtu 1400"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface eth-trunk 1",
            "[*HUAWEI-Eth-Trunk1] ipv6 enable",
            "[*HUAWEI-Eth-Trunk1] ipv6 mtu 1400"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the traffic capability on a link between the source and destination ends changes, this ipv6 mtu command is used to set the MTU value for sending IPv6 packets. If the packet length is greater than the IPv6 MTU of the interface, the system fragments the packet based on the set MTU value before forwarding the packet.\nConfiguration Impact\nA dynamic path MTU discovery (PMTU) value is set based on IPv6 MTU values on interfaces.\nThe PMTU mechanism helps the system obtain the smallest value among MTU values on all interfaces on the path between the source and destination ends.\nIf the IPv6 MTU value set using the ipv6 mtu command is smaller than the static PMTU value set using the ipv6 pathmtu command, the system fragments the packet based on the set MTU value before forwarding the packet.\nPrecautions\nThe directly connected interfaces must assigned the same IPv6 MTU value."
}