{
    "PageTitle": "prefec-tca",
    "FuncDef": "The prefec-tca command configures an alarm threshold for FEC bit error ratio detection.\nThe undo prefec-tca command restores the default configuration for FEC bit error ratio detection.\nBy default, FEC bit error ratio detection is enabled.",
    "CLIs": [
        "prefec-tca trigger-threshold <trigger-coefficient> <trigger-power> [ recover-threshold <recover-coefficient> <recover-power> ]",
        "undo prefec-tca [ trigger-threshold <trigger-coefficient> <trigger-power> recover-threshold <recover-coefficient> <recover-power> ]"
    ],
    "ParentView": [
        "100GE interface view",
        "50GE interface view",
        "50|100GE interface view",
        "FlexE-100G interface view",
        "FlexE-50G interface view",
        "FlexE-50|100G interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "trigger-power",
            "Info": "Specifies an alarm association threshold, where:\ntrigger-power: power of the alarm association threshold for an FEC bit error ratio, that is y in xE-y.\ntrigger-power: The value is an integer ranging from 1 to 8."
        },
        {
            "Parameters": "recover-threshold recover-coefficient",
            "Info": "Specifies an alarm clearing threshold, where:\nrecover-coefficient: coefficient of the alarm clearing threshold for an FEC bit error ratio, that is x in xE-y.\nrecover-coefficient: The value is an integer ranging from 1 to 999.  During calculation, the value is divided by 100."
        },
        {
            "Parameters": "recover-power",
            "Info": "Specifies an alarm clearing threshold, where:\nrecover-power: power of the alarm clearing threshold for an FEC bit error ratio, that is y in xE-y.\nrecover-power: The value is an integer ranging from 1 to 9."
        },
        {
            "Parameters": "prefec-tca",
            "Info": "Indicates FEC bit error ratio detection.\n-"
        },
        {
            "Parameters": "trigger-threshold trigger-coefficient",
            "Info": "Specifies an alarm association threshold, where:\ntrigger-coefficient: coefficient of the alarm association threshold for an FEC bit error ratio, that is x in xE-y.\ntrigger-coefficient: The value is an integer ranging from 1 to 999.  During calculation, the value is divided by 100."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/0",
            "[~HUAWEI-100GE1/0/0] prefec-tca trigger-threshold 1 4 recover-threshold 1 6"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure an alarm threshold for FEC bit error ratio detection, run the prefec-tca command. By default, FEC bit error ratio detection is enabled. The default alarm thresholds and detection intervals are used. If the FEC bit error ratio exceeds a specified threshold, the device reports an FEC bit error ratio alarm to the NMS. When the FEC bit error ratio falls below a specified threshold, the device reports an FEC bit error ratio clear alarm to the NMS."
}