{
    "PageTitle": "signal-coding",
    "FuncDef": "The signal-coding command switches the signal modulation mode of an interface.\nThe undo signal-coding command restores the default signal modulation mode of an interface.\nBy default, the signal modulation mode of an interface is differential quadrature phase shift keying (DQPSK).",
    "CLIs": [
        "signal-coding dqpsk",
        "signal-coding qpsk",
        "undo signal-coding"
    ],
    "ParentView": [
        "100GE interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "qpsk",
            "Info": "Switches the signal modulation mode of an interface to quadrature phase shift keying (QPSK).\n-"
        },
        {
            "Parameters": "dqpsk",
            "Info": "Switches the signal modulation mode of an interface to DQPSK.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100gigabitethernet 1/0/0",
            "[~HUAWEI-100GigabitEthernet1/0/0] signal-coding qpsk"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe signal modulation mode of a 100GE interface and that of its connected interface must be the same. If they are different, you can run the signal-coding command to switch the signal modulation mode of the connected interface.\nPrecautions\nThe signal-coding command takes effect only after it is run on an interface with a 100Gbps CFP2 DWDM optical module inserted. If the signal-coding dqpsk/qpsk configuration is delivered to an interface on which another optical module is installed, the device reports the hwOpticalFail alarm. If the signal-coding dqpsk/qpsk configuration is delivered to an interface on which no optical module is installed and another optical module is installed then, the device displays the hwOptCfgNotMatch alarm indicating an unmatched optical module.\nThe signal modulation mode of an interface is related to the interface's FEC mode, which is set using the fec command. The DQPSK signal modulation mode is supported on interfaces in any FEC mode, but the QPSK signal modulation mode is supported only on interfaces in FEC mode of lhaul-sd. Therefore, the signal-coding dqpsk/qpsk command is used and supported only on interfaces whose FEC mode is set to lhaul-sd.\nThe signal-coding dqpsk/qpsk command is used and supported only on interface cards supporting the FEC mode of lhaul-sd."
}