{
    "PageTitle": "ipv6 mtu spread",
    "FuncDef": "The ipv6 mtu spread command sets an MTU value for IPv6 packets to be sent by an interface and applies the MTU value to sub-interfaces created on the interface.\nThe undo ipv6 mtu spread command restores the default MTU value for IPv6 packets to be sent by an interface and deletes the MTU value applied to the sub-interfaces created on the interface.\nBy default, the MTU value is 1500 bytes for non-POS interfaces and 4470 bytes for POS interfaces.",
    "CLIs": [
        "ipv6 mtu <mtu> spread",
        "undo ipv6 mtu spread"
    ],
    "ParentView": [
        "PW-VE interface view",
        "40GE interface view",
        "GE interface view",
        "Port extension interface view",
        "100GE interface view",
        "GE electrical interface view",
        "50GE interface view",
        "400GE interface view",
        "10GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Eth-Trunk interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "mtu",
            "Info": "Specifies a path MTU, that is, the maximum size of IPv6 packets allowed to be sent along the path.\nThe value is an integer ranging from 1280 to 9600, in bytes."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] ipv6 enable",
            "[*HUAWEI-GigabitEthernet1/0/0] ipv6 mtu 1300 spread"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nSub-interfaces can inherit the MTU value of the interface where the sub-interfaces reside. In this situation, you can run the ipv6 mtu spread command to change the MTU value of the interface. The MTU values of sub-interfaces are then changed in batches.\nIf a sub-interface has its own MTU configuration, the MTU value configured using the ipv6 mtu spread command does not take effect for the sub-interface MTU. This command takes effect only after the MTU configuration is deleted from the sub-interface.\nPrecautions\nAfter the MTU value of a POS interface is changed using the ipv6 mtu spread command, the MTU value takes effect only after you run the shutdown and undo shutdown commands in sequence on the POS interface."
}