{
    "PageTitle": "statistic mode",
    "FuncDef": "The statistic mode command switches the statistics collection mode on an interface.\nThe undo statistic mode command restores the default setting.\nBy default, the device collects packet statistics for an interface based on packets' destination MAC addresses.",
    "CLIs": [
        "statistic mode { forward | mac }",
        "undo statistic mode"
    ],
    "ParentView": [
        "100GE interface view",
        "10G LAN interface view",
        "10G WAN interface view",
        "400GE interface view",
        "40GE interface view",
        "Eth-Trunk sub-interface view",
        "Eth-Trunk interface view",
        "GE sub-interface view",
        "GE interface view",
        "GE electrical interface view",
        "IP-Trunk interface view",
        "POS interface view",
        "PW-VE sub-interface view",
        "VBDIF interface view",
        "Port extension interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "forward",
            "Info": "Enables the device to collect packet statistics for an interface based on packets' forwarding modes. That is, statistics for IPv4 and IPv6 packets are collected separately.\n-"
        },
        {
            "Parameters": "mac",
            "Info": "Enables the interface to collect statistics based on the destination MAC address of packets.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "<~HUAWEI> interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] statistic mode forward"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, the device collects packet statistics for an interface based on packets' destination MAC addresses. If you want to modify the packet statistics collection mode, run the statistic mode command. For example, if you want to distinguish between IPv4 and IPv6 packets on an interface, specify the forward parameter in the statistic mode command so that the device will collect packet statistics based on packets' forwarding modes.\nIn MAC mode, statistics are collected based on the destination MAC address of Layer 2 packets. If an interface forwards only IPv4 packets, statistics are collected in MAC mode, and no configuration file is generated.In forward mode, statistics are collected based on the destination IP address of Layer 3 packets. If an interface needs to forward both IPv4 and IPv6 packets, statistics are collected in forward mode, and a configuration file is generated.\n\nConfiguration Impact\nIf a device is enabled to collect packet statistics for an interface based on the packets' forwarding mode, statistics about IPv4 unicast and IPv6 unicast packets are added in the command output after the display interface command is run."
}