{
    "PageTitle": "subinterface traffic-statistics enable",
    "FuncDef": "The subinterface traffic-statistics enable command enables the traffic statistics function on sub-interfaces.\nThe undo subinterface traffic-statistics enable command disables the traffic statistics function on sub-interfaces.\nBy default, the traffic statistics function is disabled on a sub-interface.",
    "CLIs": [
        "subinterface traffic-statistics enable",
        "undo subinterface traffic-statistics enable"
    ],
    "ParentView": [
        "PW-VE interface view",
        "Layer 2 40GE interface view",
        "40GE interface view",
        "Port extension interface view",
        "GE electrical interface view",
        "Port extension Layer 2 interface view",
        "Layer 2 10GE interface view",
        "Layer 2 GE interface view",
        "400GE interface view",
        "10GE interface view",
        "VE interface view",
        "Layer 2 100GE interface view",
        "Layer 2 50|100GE interface view",
        "Global VE interface view",
        "25GE-L2 view",
        "400GE-L2 view",
        "GE interface view",
        "Layer 2 50GE interface view",
        "100GE interface view",
        "50GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Eth-Trunk interface view",
        "POS interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1/0/1.1",
            "[*HUAWEI-GigabitEthernet1/0/1.1] quit",
            "[*HUAWEI] interface GigabitEthernet1/0/1",
            "[*HUAWEI-GigabitEthernet1/0/1] subinterface traffic-statistics enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, the traffic statistics collection function is disabled on Ethernet sub-interfaces. Before checking statistics about sent or received packets on an Ethernet sub-interface, run the statistic enable command in the Ethernet sub-interface view to enable the traffic statistics collection function.\nPrerequisites\nAn Ethernet interface has been specified and sub-interfaces have been configured for the Ethernet interface.\nConfiguration Impact\nIf the subinterface traffic-statistics enable command is run in the system view, the traffic statistics collection function is enabled on all sub-interface of the device.\nFollow-up Procedure\nAfter the rate statistics collection function is enabled on all the sub-interfaces of an Ethernet interface on a device, the device periodically refreshes rate statistics on the sub-interfaces. The display interface command can be used to view rate statistics.\nPrecautions\nEnabling the traffic statistics collection function may consume a lot of system resources. Exercise caution when using the subinterface traffic-statistics enable command.\nUsing the undo subinterface traffic-statistics enable command in the interface view disables traffic statistics collection of only the sub-interfaces on the interface.\nThis command does not take effect on EVC sub-interfaces."
}