{
    "PageTitle": "trap-threshold crc-error high-threshold low-threshold (Trunk serial interface view/Serial interface view)",
    "FuncDef": "The trap-threshold crc-error high-threshold low-threshold command sets an upper threshold, lower threshold, and detection interval for the CRC error alarm.\nThe undo trap-threshold crc-error high-threshold low-threshold command restores the upper threshold, lower threshold, and detection interval of the CRC error alarm to the default values.\nBy default, the upper threshold of the CRC error alarm is 1000, the lower alarm threshold is 100, and the detection interval is 10 seconds.",
    "CLIs": [
        "trap-threshold crc-error high-threshold <high-threshold> low-threshold <low-threshold> interval-second <interval>",
        "undo trap-threshold crc-error"
    ],
    "ParentView": [
        "Trunk serial interface view",
        "Serial interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "high-threshold high-threshold",
            "Info": "Specifies an upper alarm threshold.\nThe value is an integer ranging from 1 to 4294967295. The default value is 1000."
        },
        {
            "Parameters": "low-threshold low-threshold",
            "Info": "Specifies a lower alarm threshold.\nThe value is an integer ranging from 1 to 4294967295. The default value is 100."
        },
        {
            "Parameters": "interval-second interval",
            "Info": "Specifies a detection interval for CRC error frames.\nThe value is an integer ranging from 1 to 65535, in seconds. The default value is 10."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface serial 1/0/0:1",
            "[*HUAWEI-Serial1/0/0:1] trap-threshold crc-error high-threshold 1500 low-threshold 150 interval-second 15"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo set an upper threshold, lower threshold, detection interval for the CRC error alarm, run the trap-threshold crc-error high-threshold low-threshold command. After this configuration is performed, a device generates an alarm and sends it to an NMS only when the number of CRC error frames sent or received by the device reaches the upper threshold for three consecutive detection intervals. The device sends a clear alarm to the NMS only when the number of CRC error frames sent or received by the device falls below the lower threshold for three consecutive detection intervals.\nThe following commands cannot coexist. The most recently run command overwrites the previous one.\ntrap-threshold crc-errortrap-threshold crc-error bit-error-ratiotrap-threshold crc-error high-thresholdtrap-threshold crc-error { mac-fcs-exc | mac-fcs-sd }trap-threshold crc-error percenttrap-threshold crc-error packet-error-ratio"
}