{
    "PageTitle": "trap-threshold pause-frame",
    "FuncDef": "The trap-threshold pause-frame command sets upper and lower thresholds for the number of pause-frame errors and the interval at which pause-frame error alarms are generated.\nThe undo trap-threshold pause-frame command restores the default upper and lower thresholds for the number of pause-frame errors and the default interval at which alarms are generated.\nBy default, upper and lower thresholds for the number of pause-frame errors are 500 and 100, respectively, and pause-frame error alarms are reported every 10 seconds.",
    "CLIs": [
        "trap-threshold pause-frame high-threshold <high-threshold> low-threshold <low-threshold> interval-second <interval>",
        "undo trap-threshold pause-frame [ high-threshold <high-threshold> low-threshold <low-threshold> interval-second <interval> ]"
    ],
    "ParentView": [
        "100GE interface view",
        "10G LAN interface view",
        "10G WAN interface view",
        "25GE interface view",
        "400GE interface view",
        "40GE interface view",
        "50GE interface view",
        "50|100GE interface view",
        "FlexE interface view",
        "GE optical interface view",
        "GE electrical interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "high-threshold high-threshold",
            "Info": "Specifies an upper alarm threshold for the number of pause-frame errors.\nThe value is an integer in the range from 1 to 4294967295. The default value is 500."
        },
        {
            "Parameters": "low-threshold low-threshold",
            "Info": "Specifies a lower alarm threshold for the number of pause-frame errors.\nThe value is an integer in the range from 1 to 4294967295. The default value is 100."
        },
        {
            "Parameters": "interval-second interval",
            "Info": "Specifies an interval at which pause-frame error alarms are generated.\nThe value is an integer in the range from 1 to 65535, in seconds. The default value is 10."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] trap-threshold pause-frame high-threshold 1500 low-threshold 150 interval-second 15"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo set an upper threshold, lower threshold, detection interval for the pause-frame error alarm, run the trap-threshold pause-frame command. After this configuration is performed, a device generates an alarm and sends it to an NMS only when the number of pause-frame error packets sent or received by the device reaches the upper threshold for three consecutive detection intervals. The device sends a clear alarm to the NMS only when the number of pause-frame error packets sent or received by the device falls below the lower threshold for three consecutive detection intervals.\nPrecautions\nThe value of high-threshold must be greater than or equal to that of low-threshold."
}