{
    "PageTitle": "alarm",
    "FuncDef": "The alarm command configures an entry in the RMON-MIB alarmTable. The alarm command controls the monitoring and triggering of threshold crossing events. In order for notification or logging of a threshold crossing event to occur there must be at least one associated rmon>event configured.",
    "CLIs": [
        "alarm <rmon-alarm-id> variable-oid <oid-string> interval <seconds> [ <sample-type> ] [ startup-alarm <alarm-type> ] [ rising-event <rmon-event-id> rising-threshold <threshold> ] [ falling-event <rmon-event-id> falling-threshold <threshold> ] [ owner <owner-string> ]",
        "no alarm <rmon-alarm-id>"
    ],
    "ParentView": [
        "config>system>thresholds>rmon"
    ],
    "ParaDef": [
        {
            "Parameters": "rmon-alarm-id",
            "Info": "Specifies a numerical identifier for the alarm being configured. The number of alarms that can be created is limited to 1200. Values-1 to 65535. ParamDefault: Default- none"
        },
        {
            "Parameters": "oid-string",
            "Info": "Specifies the SNMP object identifier of the particular variable to be sampled. Only SNMP variables that resolve to an ASN.1 primitive type of integer (integer, Integer32, Counter32, Counter64, Gauge, or TimeTicks) may be sampled. The oid-string may be expressed using either the dotted string notation or as object name plus dotted instance identifier. For example, \"1.3.6.1.2.1.2.2.1.10.184582144\" or \"ifInOctets.184582144\". ParamDefault: Default- none"
        },
        {
            "Parameters": "seconds",
            "Info": "Specifies the polling period over which the data is sampled and compared with the rising and falling thresholds. When setting this interval value, care should be taken in the case of  delta  type sampling - the interval should be set short enough that the sampled variable is very unlikely to increase or decrease by more than 2147483647 - 1 during a single sampling interval. Care should also be taken not to set the interval value too low to avoid creating unnecessary processing overhead. Values-1 to 2147483647. ParamDefault: Default- none"
        },
        {
            "Parameters": "sample-type",
            "Info": "Specifies the method of sampling the selected variable and calculating the value to be compared against the thresholds. Values-absolute - Specifies that the value of the selected variable will be compared directly with the thresholds at the end of the sampling interval.. ParamDefault: Default- absolute"
        },
        {
            "Parameters": "alarm-type",
            "Info": "Specifies the alarm that may be sent when this alarm is first created. Values-rising, falling, either. ParamDefault: Default- either"
        },
        {
            "Parameters": "rising-event rmon-event-id",
            "Info": "Specifies the identifier of the rmon>event that specifies the action to be taken when a rising threshold crossing event occurs. Values-0 to 65535. ParamDefault: Default- 0"
        },
        {
            "Parameters": "rising-threshold threshold",
            "Info": "Specifies a threshold for the sampled statistic. When the current sampled value is greater than or equal to this threshold, and the value at the last sampling interval was less than this threshold, a single threshold crossing event will be generated. A single threshold crossing event will also be generated if the first sample taken is greater than or equal to this threshold and the associated startup-alarm is equal to rising or either. Values--2147483648 to 2147483647. ParamDefault: Default- 0"
        },
        {
            "Parameters": "falling-event rmon-event-id",
            "Info": "Specifies the identifier of the rmon>event that specifies the action to be taken when a falling threshold crossing event occurs. If there is no corresponding event configured for the specified rmon-event-id, then no association exists and no action is taken. If the falling-event has a value of zero (0), no associated event exists. Values-0 to 65535. ParamDefault: Default- 0"
        },
        {
            "Parameters": "falling-threshold threshold",
            "Info": "Specifies a threshold for the sampled statistic. When the current sampled value is less than or equal to this threshold, and the value at the last sampling interval was greater than this threshold, a single threshold crossing event will be generated. A single threshold crossing event will also be generated if the first sample taken is less than or equal to this threshold and the associated startup-alarm is equal to falling or either. Values--2147483648 to 2147483647. ParamDefault: Default- 0"
        },
        {
            "Parameters": "owner-string",
            "Info": "Specifies the owner string; the owner identifies the creator of this alarm. It defaults to \"TiMOS CLI\". This parameter is defined primarily to allow entries that have been created in the RMON-MIB alarmTable by remote SNMP managers to be saved and reloaded in a CLI configuration file. The owner will not normally be configured by CLI users and can be a maximum of 80 characters long. ParamDefault: Default- TiMOS CLI"
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}