{
    "PageTitle": "authentication-key",
    "FuncDef": "This command sets the authentication key-id, type and key used to authenticate NTP PDUs sent to or received by other network elements participating in the NTP protocol. For authentication to work, the authentication key-id, type and key value must match.",
    "CLIs": [
        "authentication-key <key-id> key <key> [ hash | hash2 ] type { des | message-digest }",
        "no authentication-key <key-id>"
    ],
    "ParentView": [
        "config>system>time>ntp"
    ],
    "ParaDef": [
        {
            "Parameters": "key-id",
            "Info": "Configures the authentication key-id that will be used by the node when transmitting or receiving Network Time Protocol packets. Values-1 to 255. ParamDefault: Default- None"
        },
        {
            "Parameters": "key",
            "Info": "Specifies the authentication key associated with the configured key-id, the value configured in this parameter is the actual value used by other network elements to authenticate the NTP packet."
        },
        {
            "Parameters": "hash",
            "Info": "Specifies the key is entered in an encrypted form. If the hash or hash2 parameter is not used, the key is assumed to be in an unencrypted, clear text form. For security, all keys are stored in encrypted form in the configuration file with the hash or hash2 parameter specified."
        },
        {
            "Parameters": "hash2",
            "Info": "Specifies the key is entered in a more complex encrypted form that involves more variables than the key value alone, meaning that the hash2 encrypted variable cannot be copied and pasted. If the hash or hash2 parameter is not used, the key is assumed to be in an unencrypted, clear text form. For security, all keys are stored in encrypted form in the configuration file with the hash or hash2 parameter specified."
        },
        {
            "Parameters": "type",
            "Info": "Determines if DES or message-digest authentication is used."
        },
        {
            "Parameters": "des",
            "Info": "Specifies that DES authentication is used for this key. The des option is not permitted in FIPS-140-2 mode."
        },
        {
            "Parameters": "message-digest",
            "Info": "Specifies that MD5 authentication in accordance with RFC 2104 is used for this key."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}