{
    "PageTitle": "broadcast",
    "FuncDef": "This command configures the node to transmit NTP packets on a given interface. Broadcast and multicast messages can easily be spoofed, thus, authentication is strongly recommended.",
    "CLIs": [
        "broadcast [ router <router-name> ] { interface <ip-int-name> } [ key-id <key-id> ] [ version <version> ] [ ttl <ttl> ]",
        "no broadcast [ router <router-name> ] { interface <ip-int-name> }"
    ],
    "ParentView": [
        "config>system>time>ntp"
    ],
    "ParaDef": [
        {
            "Parameters": "router-name",
            "Info": "Specifies the router name used to transmit NTP packets. Base is the default. Select management to use the management port (Ethernet port on the CPM). Note that broadcast server capability can also be enabled on an interface within a VPRN context. Refer to \"NTP Within a VPRN Service\" in the 7450 ESS, 7750 SR, 7950 XRS, and VSR Layer 3 Services Guide: IES and VPRN for more information. Values-Base | Management. ParamDefault: Default- Base"
        },
        {
            "Parameters": "ip-int-name",
            "Info": "Specifies the local interface on which to transmit NTP broadcast packets. If the string contains special characters (#, $, spaces, etc.), the entire string must be enclosed within double quotes. The string may be a maximum of 32 characters."
        },
        {
            "Parameters": "key-id",
            "Info": "Identifies the configured authentication key and authentication type used by this node to receive and transmit NTP packets to and from an NTP server and peers. If an NTP packet is received by this node both authentication key and authentication type must be valid otherwise the packet will be rejected and an event/trap generated. Values-1 to 255. ParamDefault: Default- none"
        },
        {
            "Parameters": "version",
            "Info": "Specifies the NTP version number that is generated by this node. This parameter does not need to be configured when in client mode in which case all versions will be accepted. Values-2 to 4. ParamDefault: Default- 4"
        },
        {
            "Parameters": "ttl",
            "Info": "Specifies the IP Time To Live (TTL) value. Values-1 to 255. ParamDefault: Default- none"
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}