{
    "PageTitle": "cflash-cap-alarm-pct",
    "FuncDef": "This command enables capacity monitoring of the compact flash specified in this command. The usage is monitored as a percentage of the capacity of the compact flash. The severity level is alarm. Both a rising and falling threshold can be specified.",
    "CLIs": [
        "cflash-cap-alarm-pct <cflash-id> rising-threshold <percentage> [ falling-threshold <percentage> ] interval <seconds> [ rmon-event-type <event-type> ] [ startup-alarm <alarm-type> ]",
        "no cflash-cap-alarm-pct <cflash-id>"
    ],
    "ParentView": [
        "config>system>thresholds"
    ],
    "ParaDef": [
        {
            "Parameters": "cflash-id",
            "Info": "The cflash-id specifies the name of the cflash device to be monitored. Values-cf1:, cf1-A:, cf1-B:, cf2:, cf2-A:, cf2-B:, cf3:, cf3-A:, cf3-B:."
        },
        {
            "Parameters": "rising-threshold percentage",
            "Info": "Specifies a threshold for the sampled statistic. When the current sampled value is greater than or equal to this threshold, and the value at the last sampling interval was less than this threshold, a single threshold crossing event will be generated. A single threshold crossing event will also be generated if the first sample taken is greater than or equal to this threshold and the associated startup-alarm is equal to rising or either. Values-0 to 100. ParamDefault: Default- 0"
        },
        {
            "Parameters": "falling-threshold percentage",
            "Info": "Specifies a threshold for the sampled statistic. When the current sampled value is less than or equal to this threshold, and the value at the last sampling interval was greater than this threshold, a single threshold crossing event will be generated. A single threshold crossing event will also be generated if the first sample taken is less than or equal to this threshold and the associated startup-alarm is equal to falling or either. Values-0 to 100. ParamDefault: Default- 0"
        },
        {
            "Parameters": "seconds",
            "Info": "Specifies the polling period, in seconds, over which the data is sampled and compared with the rising and falling thresholds. Values-1 to 2147483647."
        },
        {
            "Parameters": "event-type",
            "Info": "Specifies the type of notification action to be taken when this event occurs. Values-log - An entry is made in the RMON-MIB log table for each event occurrence. This does not create a TiMOS logger entry. The RMON-MIB log table entries can be viewed using the show>system>thresholds CLI command.. ParamDefault: Default- both"
        },
        {
            "Parameters": "alarm-type",
            "Info": "Specifies the alarm that may be sent when this alarm is first created. Values-rising, falling, either. ParamDefault: Default- eitherConfiguration examplecflash-cap-alarm-pct cf1-A: rising-threshold 70 falling-threshold 60 interval 120 rmon-event-type both start-alarm rising"
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}