{
    "PageTitle": "event",
    "FuncDef": "The event command configures an entry in the RMON-MIB event table. The event command controls the generation and notification of threshold crossing events configured with the alarm command. When a threshold crossing event is triggered, thermon>eventconfiguration optionally specifies if an entry in the RMON-MIB log table should be created to record the occurrence of the event. It may also specify that an SNMP notification (trap) should be generated for the event. The RMON-MIB defines two notifications for threshold crossing events: Rising Alarm and Falling Alarm.",
    "CLIs": [
        "event <rmon-event-id> [ <event-type> ] [ description <description-string> ] [ owner <owner-string> ]",
        "no event <rmon-event-id>"
    ],
    "ParentView": [
        "config>system>thresholds>rmon"
    ],
    "ParaDef": [
        {
            "Parameters": "rmon-event-id",
            "Info": "Specifies an identifier for this event. Values-1 to 65535."
        },
        {
            "Parameters": "rmon-event-type",
            "Info": "Specifies the type of notification action to be taken when this event occurs. Values-log - An entry is made in the RMON-MIB log table for each event occurrence.. ParamDefault: Default- both"
        },
        {
            "Parameters": "description-string",
            "Info": "Specifies a user configurable string that can be used to identify the purpose of this event. This is an optional parameter and can be up to 80 characters long. If the string contains special characters (#, $, spaces, and so on), the entire string must be enclosed within double quotes."
        },
        {
            "Parameters": "owner-string",
            "Info": "Specifies the owner string; the owner identifies the creator of this alarm. It defaults to \"TiMOS CLI\". This parameter is defined primarily to allow entries that have been created in the RMON-MIB alarmTable by remote SNMP managers to be saved and reloaded in a CLI configuration file. The owner will not normally be configured by CLI users and can be up 80 characters long. ParamDefault: Default- TiMOS CLI"
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}