{
    "PageTitle": "kb-memory-use-warn",
    "FuncDef": "This command configures memory usage, in kilobytes, for warning thresholds",
    "CLIs": [
        "kb-memory-use-warn rising-threshold <threshold> [ falling-threshold <threshold> ] interval <seconds> [ <rmon-event-type> ] [ startup-alarm <alarm-type> ]",
        "no kb-memory-use-warn"
    ],
    "ParentView": [
        "config>system>thresholds"
    ],
    "ParaDef": [
        {
            "Parameters": "rising-threshold threshold",
            "Info": "Specifies a threshold for the sampled statistic. When the current sampled value is greater than or equal to this threshold, and the value at the last sampling interval was less than this threshold, a single threshold crossing event will be generated. A single threshold crossing event will also be generated if the first sample taken is greater than or equal to this threshold and the associated startup-alarm is equal to rising or either. Values--2147483648 to 2147483647. ParamDefault: Default- 0"
        },
        {
            "Parameters": "falling-threshold threshold",
            "Info": "Specifies a threshold for the sampled statistic. When the current sampled value is less than or equal to this threshold, and the value at the last sampling interval was greater than this threshold, a single threshold crossing event will be generated. A single threshold crossing event will also be generated if the first sample taken is less than or equal to this threshold and the associated startup-alarm is equal to falling or either. Values--2147483648 to 2147483647. ParamDefault: Default- 0"
        },
        {
            "Parameters": "seconds",
            "Info": "Specifies the polling period over which the data is sampled and compared with the rising and falling thresholds. Values-1 to 2147483647."
        },
        {
            "Parameters": "rmon-event-type",
            "Info": "Specifies the type of notification action to be taken when this event occurs. Values-log - An entry is made in the RMON-MIB log table for each event occurrence. This does not create a TiMOS logger entry. The RMON-MIB log table entries can be viewed using the show>system>thresholds CLI command.. ParamDefault: Default- both"
        },
        {
            "Parameters": "alarm-type",
            "Info": "Specifies the alarm that may be sent when this alarm is first created. If the first sample is greater than or equal to the rising threshold value and startup-alarm is equal to rising or either, then a single rising threshold crossing event is generated. If the first sample is less than or equal to the falling threshold value and startup-alarm is equal to falling or either, a single falling threshold crossing event is generated. Values-rising, falling, either. ParamDefault: Default- either"
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}