{
    "PageTitle": "lag",
    "FuncDef": "This command defines a LAG which is forming a redundant-pair for MC-LAG with a LAG configured on the given peer. The same LAG group can be defined only in the scope of 1 peer. \nThe samelacp-key,system-id, andsystem-prioritymust be configured on both nodes of the redundant pair in order to MC-LAG to become operational. In order MC-LAG to become operational, all parameters (lacp-key,system-id,system-priority) must be configured the same on both nodes of the same redundant pair.",
    "CLIs": [
        "lag <lag-id> lacp-key <admin-key> system-id <system-id> [ remote-lag <remote-lag-id> ] system-priority <system-priority> source-bmac-lsb use-lacp-key",
        "lag <lag-id> lacp-key <admin-key> system-id <system-id> [ remote-lag <remote-lag-id> ] system-priority <system-priority> source-bmac-lsb <MAC-Lsb>",
        "lag <lag-id> lacp-key <admin-key> system-id <system-id> [ remote-lag <remote-lag-id> ] system-priority <system-priority>",
        "lag <lag-id> [ remote-lag <remote-lag-id> ]",
        "no lag <lag-id>"
    ],
    "ParentView": [
        "config>redundancy>multi-chassis>peer>mc-lag"
    ],
    "ParaDef": [
        {
            "Parameters": "lag-id",
            "Info": "Specifies the LAG identifier, expressed as a decimal integer. Specifying the lag-id allows the mismatch between lag-id on redundant-pair. If no lag-id is specified it is assumed that neighbor system uses the same lag-id as a part of the given MC-LAG. If no matching MC-LAG group can be found between neighbor systems, the individual LAGs will operate as usual (no MC-LAG operation is established.). Values-1 to 800."
        },
        {
            "Parameters": "admin-key",
            "Info": "Specifies a 16 bit key that needs to be configured in the same manner on both sides of the MC-LAG in order for the MC-LAG to come up. Values-1 to 65535."
        },
        {
            "Parameters": "system-id",
            "Info": "Specifies a 6 byte value expressed in the same notation as MAC address. Values-xx:xx:xx:xx:xx:xx     - xx [00 to FF]."
        },
        {
            "Parameters": "remote-lag-id",
            "Info": "Specifies the LAG ID on the remote system. Values-1 to 800."
        },
        {
            "Parameters": "system-priority",
            "Info": "Specifies the system priority to be used in the context of the MC-LAG. The partner system will consider all ports using the same lacp-key, system-id, and system-priority as part of the same LAG. Values-1 to 65535."
        },
        {
            "Parameters": "MAC-Lsb",
            "Info": "Configures the last 16 bit of the MAC address to be used for all traffic ingressing the MC-LAG link(s) or if use-lacp-key option is used, it only copies the value of lacp-key (redundancy multi-chassis mc-lag lag lacp-key adminkey). Values-1 to 65535 or xx-xx or xx:xx."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}