{
    "PageTitle": "peer",
    "FuncDef": "This command configures symmetric active mode for an NTP peer. It is recommended to configure authentication and to only configure known time servers as peers. Peers may exist within a VPRN service.",
    "CLIs": [
        "peer [ router <router-instance> | service-name <service-name> ] { <ip-address> | <ipv6-address> } [ key-id <key-id> ] [ version <version> ] [ prefer ]",
        "no peer [ router <router-instance> | service-name <service-name> ] { <ip-address> | <ipv6-address> }"
    ],
    "ParentView": [
        "config>system>time>ntp"
    ],
    "ParaDef": [
        {
            "Parameters": "router-instance",
            "Info": "Specifies the routing context that contains the interface in the form of router-name or service-id. Values-router-name -Base | Management. ParamDefault: Default- Base"
        },
        {
            "Parameters": "service name",
            "Info": "Specifies the service name for the VPRN. The name can be up to 64 characters. CPM routing instances are not supported."
        },
        {
            "Parameters": "ip-address",
            "Info": "Configures the IPv4 address of the peer that requires a peering relationship to be set up. Values-a.b.c.d. ParamDefault: Default- None"
        },
        {
            "Parameters": "ipv6-address",
            "Info": "Configures the IPv6 address of the peer that requires a peering relationship to be set up. ParamDefault: Default- None"
        },
        {
            "Parameters": "key-id",
            "Info": "Specifies the key ID. Successful authentication requires that both peers must have the same authentication key-id, type, and key value. Values-1 to 255. ParamDefault: Default- None"
        },
        {
            "Parameters": "version",
            "Info": "Specifies the NTP version number that is generated by this node. This parameter does not need to be configured when in client mode, in which case all versions are accepted. Values-2 to 4. ParamDefault: Default- 4"
        },
        {
            "Parameters": "prefer",
            "Info": "When configuring more than one peer, one remote system can be configured as the preferred peer. When a second peer is configured as preferred, then the new entry overrides the old entry."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}