{
    "PageTitle": "reboot",
    "FuncDef": "This command reboots the router or one CPM and can also be used to force an upgrade of the system boot ROMs.",
    "CLIs": [
        "reboot [ active | standby | upgrade ] [ hold ] [ now ]"
    ],
    "ParentView": [
        "admin"
    ],
    "ParaDef": [
        {
            "Parameters": "active",
            "Info": "Reboots the active CPM. ParamDefault: Default- active"
        },
        {
            "Parameters": "standby",
            "Info": "Reboots the standby CPM. ParamDefault: Default- active"
        },
        {
            "Parameters": "upgrade",
            "Info": "Forces card firmware to be upgraded during chassis reboot. Normally, the SR-series router OS automatically performs firmware upgrades on CPMs and XCM/IOM cards without the need for the upgrade keyword. The automatic upgrade must be enabled in the SR OS7 Command Line Interface (CLI) when rebooting the system."
        },
        {
            "Parameters": "hold",
            "Info": "Administratively holds a rebooted standby SF/CPM from coming back online. Both the control processor (CPM) and the switch fabric (SFM) of the standby SF/CPM are held out of service. This may be useful for troubleshooting purposes (e.g. standby SF/CPM is suspected of causing some system problems). The SF/CPM should not be left offline as the system does not have control or switch fabric redundancy while one SF/CPM is offline. The SF/CPM must be rebooted again (without the hold keyword) to return it to service. This parameter applies only to the SF/CPM3 and SF/CPM4 on the 7450 ESS and 7750 SR platforms. Note that on platforms such as the 7750 SR-12e and 7950 XRS, and on the 7450/7750 SFM5/CPM5, the SFMs are modeled as separate entities and can be administratively disabled by using the configure sfm x shutdown command."
        },
        {
            "Parameters": "now",
            "Info": "Forces a reboot of the router immediately without an interactive confirmation."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}