{
    "PageTitle": "server",
    "FuncDef": "This command configures the node to operate in client mode with the NTP server specified in the address field of this command.",
    "CLIs": [
        "server [ router <router-instance> | service-name <service-name> ] { <ip-address> | <ipv6-address> | ptp } [ key-id <key-id> ] [ version <version> ] [ prefer ]",
        "no server [ router <router-instance> | service-name <service-name> ] { <ip> <address> | <ipv6-address> | ptp }"
    ],
    "ParentView": [
        "config>system>time>ntp"
    ],
    "ParaDef": [
        {
            "Parameters": "router-instance",
            "Info": "Specifies the routing context that contains the interface in the form of router-name or service-id. Values-router-name - Base | Management. ParamDefault: Default- Base"
        },
        {
            "Parameters": "service name",
            "Info": "Specifies the service name for the VPRN. The name can be up to 64 characters. CPM routing instances are not supported."
        },
        {
            "Parameters": "ip-address",
            "Info": "Configures the IPv4 address of an external NTP server. Values-a.b.c.d. ParamDefault: Default- None"
        },
        {
            "Parameters": "ipv6-address",
            "Info": "Configures the IPv6 address of an external NTP server. ParamDefault: Default- None"
        },
        {
            "Parameters": "key-id",
            "Info": "Specifies the key ID that identifies the configured authentication key and authentication type used by this node to transmit NTP packets to an NTP server. If an NTP packet is received by this node, the authentication key-id, type, and key value must be valid, otherwise the packet will be rejected and an event/trap generated. This is an optional parameter. Values-1 to 255."
        },
        {
            "Parameters": "version",
            "Info": "Configures the NTP version number that is expected by this node. This is an optional parameter. Values-2 to 4. ParamDefault: Default- 4"
        },
        {
            "Parameters": "ptp",
            "Info": "Configures the internal PTP process as a time server into the NTP process. Theprefer parameter is mandatory with this server option."
        },
        {
            "Parameters": "prefer",
            "Info": "Specifies that, when configuring more than one peer, one remote system can be configured as the preferred peer. When a second peer is configured as preferred, then the new entry overrides the old entry."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}