{
    "PageTitle": "monitor mac-shift",
    "FuncDef": "The monitor mac-shift command enables MAC flapping-based loop detection association on an interface.\nThe undo monitor mac-shift command disables the function.\nBy default, MAC flapping-based loop detection association is disabled on an interface.",
    "CLIs": [
        "monitor mac-shift",
        "undo monitor mac-shift"
    ],
    "ParentView": [
        "Layer 2 40GE interface view",
        "40GE interface view",
        "GE interface view",
        "Layer 2 50GE interface view",
        "100GE interface view",
        "GE electrical interface view",
        "Port extension interface view",
        "Port extension Layer 2 interface view",
        "Layer 2 10GE interface view",
        "50GE interface view",
        "Layer 2 GE interface view",
        "400GE interface view",
        "10GE interface view",
        "GE optical interface view",
        "Layer 2 100GE interface view",
        "25GE interface view",
        "Layer 2 50|100GE interface view",
        "Eth-Trunk interface view",
        "25GE-L2 view",
        "400GE-L2 view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1/0/1",
            "[*HUAWEI-GigabitEthernet1/0/1] monitor mac-shift"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a loop occurs in the VSI, VLAN or BD bound to a sub-interface, the sub-interface is blocked. However, a loop may also exist in a VSI, a VLAN or a BD bound to another sub-interface. If the loop is not eliminated in time, it will cause traffic congestion or even a network breakdown. To inform the network administrator of loops, run the monitor mac-shift command to configure MAC flapping-based loop detection association on the interface of the sub-interfaces bound to VSIs, VLANs or BDs. In this situation, if a sub-interface bound with a VSI, a VLAN or a BD is blocked due to a loop, its interface is also blocked and an alarm is generated. After that, all the other sub-interfaces bound with VSIs, VLANs or BDs are blocked.\nConfiguration Impact\nSub-interfaces of an interface may be bound to different VSIs, VLANs or BDs. If a loop occurs in one VSI, VLAN or BD, the sub-interface bound to the VSI, VLAN or BD is blocked, and the interface is also blocked. The other sub-interfaces of the interface are also blocked and cannot be trusted.\nPrecautions\nThe monitor mac-shift command can be run on both Layer 2 and Layer 3 interfaces."
}