{
    "PageTitle": "loop-detect eth-loop priority",
    "FuncDef": "The loop-detect eth-loop priority command configures the blocking priority of an interface for MAC flapping-based loop detection.\nThe undo loop-detect eth-loop priority command restores the default setting.\nBy default, the blocking priority of an interface is 1.",
    "CLIs": [
        "loop-detect eth-loop priority <priority>",
        "undo loop-detect eth-loop priority"
    ],
    "ParentView": [
        "Layer 2 40GE interface view",
        "50GE Layer 2 sub-interface view",
        "40GE interface view",
        "Eth-Trunk Layer 2 sub-interface view",
        "GE Layer 2 sub-interface view",
        "GE electrical interface view",
        "Port extension interface view",
        "Layer 2 10GE interface view",
        "Layer 2 GE interface view",
        "400GE interface view",
        "10GE interface view",
        "Layer 2 100GE interface view",
        "Layer 2 50|100GE interface view",
        "25GE-L2 view",
        "400GE-L2 view",
        "Layer 2 sub-interface view",
        "GE interface view",
        "Layer 2 50GE interface view",
        "100GE interface view",
        "Sub-interface view",
        "50GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Eth-Trunk interface view",
        "400GE Layer 2 sub-interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "priority priority",
            "Info": "Specifies the blocking priority of an interface.\nThe value is an integer ranging from 1 to 4.\nIf a loop occurs, the device blocks an interface with a low blocking priority value.  If the value is 4 on an interface or a PW, the interface or PW is never blocked, and the MAC flapping-based loop detection is invalid."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/1",
            "[*HUAWEI-GigabitEthernet1/0/1] loop-detect eth-loop priority 4"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter MAC flapping-based loop detection is configured on devices of a BD (Bridge-Domain), if a device detects a loop, the device blocks an interface based on its blocking priority. To configure the blocking priority of an interface, run the loop-detect eth-loop priority command.\nPrecautions\nIf a loop occurs and the AC-side interfaces have the same blocking priority, the AC-side interfaces are all blocked.\nIf MAC flapping-based loop detection is configured for a BD using the loop-detect eth-loop loop-times loop-times detect-cycle detect-cycle-time cycles cycles command with detect-cycle-time and cycles specified and a blocking priority is configured on an interface bound to the BD using the loop-detect eth-loop priority priority command, the detection cycle is as follows:\nIf priority is 1, the detection cycle is calculated as follows: Detection cycle = 1 x detect-cycle-time x cyclesIf priority is 2, the detection cycle is calculated as follows: Detection cycle = 4 x detect-cycle-time x cyclesIf priority is 3, the detection cycle is calculated as follows: Detection cycle = 8 x detect-cycle-time x cyclesIf priority is 4, the interface is never blocked, and the MAC flapping-based loop detection function does not take effect.\nHigh-priority interfaces have a longer detection time, and low-priority interfaces are preferentially blocked if the MAC flapping based-loop detection function detects a loop."
}