{
    "PageTitle": "loop-detect eth-loop precise-block enable",
    "FuncDef": "The loop-detect eth-loop precise-block enable command enables accurate blocking of MAC flapping-based loop detection and configures a device to block interfaces based on the trusted and untrusted states.\nThe undo loop-detect eth-loop precise-block enable command disables this function.\nBy default, interfaces are blocked based on their blocking priorities.",
    "CLIs": [
        "loop-detect eth-loop precise-block enable",
        "undo loop-detect eth-loop precise-block enable"
    ],
    "ParentView": [
        "VSI-STATIC view",
        "VSI-AUTO view",
        "VSI-BVSI view",
        "VSI-IVSI-P2P view",
        "VSI-DEFAULT view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls lsr-id 1.1.1.1",
            "[*HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] vsi company1",
            "[*HUAWEI-vsi-company1] loop-detect eth-loop precise-block enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter MAC flapping-based loop detection is enabled in the VSI view using the loop-detect eth-loop command, the device blocks an AC-side interface that has MAC address entry flapping occurred based on the blocking priorities of interfaces configured using the loop-detect eth-loop priority. This configuration enables the device to eliminate loops. However, MAC address entries of interfaces without loops may change due to the impact from a remote loop, and traffic over the interfaces with lower blocking priorities is interrupted.\nTo address this problem, run the loop-detect eth-loop precise-block enable command to enable accurate blocking of MAC flapping-based loop detection. Accurate blocking determines trusted and untrusted interfaces by analyzing the frequency of MAC address entry flapping. When a MAC address entry changes repeatedly, accurate blocking can accurately locate and block the interface (untrusted) with a loop."
}