{
    "PageTitle": "tc-notify erps ring",
    "FuncDef": "The tc-notify erps ring command configures an ERPS ring to notify other ERPS rings of its topology change.\nThe undo tc-notify erps ring command disables the topology change notification function.\nBy default, an ERPS ring does not notify other ERPS rings of its topology change.",
    "CLIs": [
        "tc-notify erps ring { <ring-id1> [ to <ring-id2> ] } &<1-10>",
        "undo tc-notify erps ring { <ring-id1> [ to <ring-id2> ] } &<1-10>"
    ],
    "ParentView": [
        "ERPS ring view"
    ],
    "ParaDef": [
        {
            "Parameters": "ring-id1",
            "Info": "Specifies the ID1 of an ERPS ring.\nThe value is an integer ranging from 1 to 255.\nThe value of <ring-id2> must be greater than or equal to <ring-id1>."
        },
        {
            "Parameters": "to ring-id2",
            "Info": "Specifies the ID2 of an ERPS ring.\nThe value is an integer ranging from 1 to 255.\nThe value of <ring-id2> must be greater than or equal to <ring-id1>."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] erps ring 5",
            "[*HUAWEI-erps-ring5] version v2",
            "[*HUAWEI-erps-ring5] tc-notify erps ring 1 to 3"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf an upper-layer Layer 2 network is not notified of the topology change in an ERPS ring, the MAC address entries remain unchanged on the upper-layer network and therefore user traffic is interrupted. To ensure traffic transmission, run the tc-notify erps ring command so that an ERPS ring can notify specific rings of its topology change.\nPrerequisites\nThe version v2 command has been run to specify ERPSv2.\nConfiguration Impact\nAfter the ERPS rings receive the topology change notification from an ERPS ring, they send Flush forwarding database (Flush-FDB) messages on their separate rings to instruct their nodes to update MAC addresses so that user traffic is not interrupted.\nIf the tc-notify erps ring command is run more than once, all configurations take effect.\nPrecautions\nIf an ERPS ring topology changes, the ERPS ring notifies the specified ERPS rings of its topology change. If the ERPS ring that has been specified to receive the topology change notification does not exist, the configuration does not take effect."
}