{
    "PageTitle": "control-vlan",
    "FuncDef": "The control-vlan command configures a control VLAN for an ERPS ring to forward R-APS PDUs.\nThe undo control-vlan command deletes the configured control VLAN.\nBy default, no control VLAN is configured on an ERPS ring.",
    "CLIs": [
        "control-vlan <vlan-id>",
        "undo control-vlan"
    ],
    "ParentView": [
        "ERPS ring view"
    ],
    "ParaDef": [
        {
            "Parameters": "vlan-id",
            "Info": "Specifies the ID of a control VLAN for an ERPS ring.\nThe value is an integer that ranges from 1 to 4094."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] erps ring 1",
            "[*HUAWEI-erps-ring1] control-vlan 5"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter an ERPS ring is created, run the control-vlan command to create a control VLAN. Unlink data VLAN which is used to transmit data packets, the control VLAN is used only to transmit R-APS PDUs in an ERPS ring. This improves ERPS security.\nConfiguration Impact\nERPS control and service VLANs are mutually exclusive.\nAfter a control VLAN is created, the vlan batch command for creating VLANs is automatically displayed in the configuration file.\nAfter a port is added to an ERPS ring that has a control VLAN configured, the port is automatically added to the control VLAN, and the port trunk allow-pass vlan command configuration is automatically generated in the interface view of this port in the configuration file.\nPrecautions\nThe same control VLAN must be configured for all devices on an ERPS ringThe same control VLAN cannot be used by different ERPS rings.The control VLAN must be newly created. It can neither be referenced by Smart Link protocol, nor be used in port trunk, default, VLAN mapping, or VLAN stacking mode.If a port has been added to an ERPS ring, the control VLAN for the ERPS ring cannot be modified. If the configured control VLAN needs to be deleted, run the undo erps ring command in the interface view or the undo port command in the ERPS ring view, and run the undo control-vlan command to delete the control VLAN.If you need to check whether the control VLAN is created or determine which control VLAN is configured to transmit R-APS PDUs, run the display erps command."
}