{
    "PageTitle": "vping ap",
    "FuncDef": "The vping ap command checks the connectivity of a VP or VC between the master device and an AP.",
    "CLIs": [
        "vping [ -c <count> | -exp <exp-value> | -m <time> | -t <timeout> | -g ] * ap { <ap-name> | <ap-address> } [ primary | hot-standby ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "-c count",
            "Info": "Specifies the number of MPLS Echo Request packets to be sent.\nIf network quality is low, increase the value to determine network quality based on the packet loss ratio.\nThe value is an integer ranging from 1 to 4294967295. The default value is 5."
        },
        {
            "Parameters": "-exp exp-value",
            "Info": "Specifies the EXP value in MPLS Echo Request packets to be sent.\nThe value is an integer ranging from 0 to 7. The default value is 0."
        },
        {
            "Parameters": "-m time",
            "Info": "Specifies the waiting period for sending the next MPLS Echo Request packet.\nBy default, if the master device does not receive an MPLS echo reply packet within 2000 ms after it sends an MPLS Echo Request packet to an AP, the master device sends another MPLS Echo Request packet. If network quality is low, setting this parameter greater than or equal to 2000 ms is recommended.\nThe value is an integer ranging from 1 to 10000, in milliseconds. The default value is 2000."
        },
        {
            "Parameters": "-t timeout",
            "Info": "Specifies the waiting period for receiving MPLS Echo Reply packets after all MPLS Echo Request packets are sent.\nThe value is an integer ranging from 0 to 65535, in milliseconds. The default value is 2000."
        },
        {
            "Parameters": "-g",
            "Info": "Performs the test using MPLS fragments.\n-"
        },
        {
            "Parameters": "ap-name",
            "Info": "Specifies the name of the AP to be monitored.\nThe value is a string of 1 to 63 case-sensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "ap-address",
            "Info": "Specifies the management IP address of the AP to be monitored.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "primary",
            "Info": "Indicates the primary VP.\n-"
        },
        {
            "Parameters": "hot-standby",
            "Info": "Indicates the hot standby VP.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> vping ap 10 primary",
            "",
            "  LSP PING FEC: IPV4 PREFIX 1.1.1.9/0/ : 100  data bytes, press CTRL_C to break",
            "    Reply from 2.1.1.2: bytes=100 Sequence=0 time = 50 ms",
            "    Reply from 2.1.1.2: bytes=100 Sequence=1 time = 28 ms",
            "    Reply from 2.1.1.2: bytes=100 Sequence=2 time = 33 ms",
            "    Reply from 2.1.1.2: bytes=100 Sequence=3 time = 52 ms",
            "    Reply from 2.1.1.2: bytes=100 Sequence=4 time = 8 ms",
            " ",
            "--- vping ap 10 statistics ---",
            "    5 packet(s) transmitted",
            "    5 packet(s) received",
            "    0.00% packet loss",
            "    round-trip min/avg/max = 8/34/52 ms"
        ]
    ],
    "ExtraInfo": "If a link within a virtual cluster fails, you can run the vping ap command to check link connectivity and use the vtracert command to locate the specific point of failure."
}