{
    "PageTitle": "tracert lsp (General)",
    "FuncDef": "The tracert lsp command enables the system to trace the gateways along the LSP from the source to the destination.",
    "CLIs": [
        "tracert lsp [ -a <source-ip> | -exp <exp-value> | -h <ttl-value> | -r <reply-mode> | -t <time-out> | -s <packet-size> | -g ] * ip <destination-iphost> <mask-length> [ <ip-address> ] [ nexthop <nexthopAddr> ] [ detail ] [ ddmap ]",
        "tracert lsp [ -a <source-ip> | -exp <exp-value> | -h <ttl-value> | -r <reply-mode> | -t <time-out> | -s <packet-size> | -g ] * te { <tunnelName> | <ifType> <ifNum> } [ hot-standby | primary ] [ compatible-mode ] [ detail ]",
        "tracert lsp [ -a <source-ip> | -exp <exp-value> | -h <ttl-value> | -t <time-out> | -s <packet-size> | -g | -r <reply-mode> ] * segment-routing { { auto-tunnel <srAutoTunnelName> [ version { draft2 | draft4 | rfc8287 } ] } | te { <tunnelName> | <ifType> <ifNum> } [ draft2 | rfc8287 ] } [ hot-standby | primary ] [ detail ]",
        "tracert lsp [ -a <source-ip> | -exp <exp-value> | -h <ttl-value> | -t <time-out> | -g ] * te { auto-tunnel <auto-tunnelname> } [ detail ]",
        "tracert lsp [ -a <source-ip> | -exp <exp-value> | -h <ttl-value> | -s <packet-size> | -t <time-out> | -g ] * general labels [ <mplsLabel1> [ <mplsLabel2> [ <mplsLabel3> [ <mplsLabel4> [ <mplsLabel5> [ <mplsLabel6> [ <mplsLabel7> [ <mplsLabel8> [ <mplsLabel9> [ <mplsLabel10> [ <mplsLabel11> [ <mplsLabel12> [ <mplsLabel13> ] ] ] ] ] ] ] ] ] ] ] ] ] -i { <outIfName> | <outIfType> <outIfNum> } nexthop <nexthopAddr>"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "-a source-ip",
            "Info": "Specifies the source address of an MPLS Echo Request packet to be sent.\nIf no source address is specified, the MPLS LSR-ID through which an MPLS Echo Request packet is sent will be used.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "-exp exp-value",
            "Info": "Specifies the number of times an MPLS Echo Request packet will be sent.\nIn the case of a poor network quality, you can set this parameter to a comparatively large value to test the network quality based on the packet loss percentage.\nThe value is an integer ranging from 0 to 7."
        },
        {
            "Parameters": "-h ttl-value",
            "Info": "Specifies a TTL value.\nIf the TTL value in a packet is reduced to 0 during forwarding, the router that receives the packet sends a timeout packet to the source, indicating that the destination is unreachable.\nThe value is an integer ranging from 1 to 255."
        },
        {
            "Parameters": "-r reply-mode",
            "Info": "Specifies a mode in which the peer sends MPLS Echo Reply packets in response.\nThe value is an integer ranging from 1 to 4.The default value is 2.\n1: no reply\n2: reply with an IPv4 or IPv6 UDP packet\n3: reply with an IPv4 or IPv6 UDP packet carrying the router-alert option\n4: reply through the control channel of the application plane"
        },
        {
            "Parameters": "-t time-out",
            "Info": "Specifies a timeout period for waiting for an MPLS Echo Reply packet after an MPLS Echo Request packet is sent.\nThe value is an integer ranging from 0 to 65535, in milliseconds."
        },
        {
            "Parameters": "-s packet-size",
            "Info": "Specifies a packet payload length, excluding the IP header and UDP header.\nThe value is an integer ranging from 84 to 9600, in bytes."
        },
        {
            "Parameters": "-g",
            "Info": "Performs the test using MPLS fragments.\n-"
        },
        {
            "Parameters": "ip destination-iphost",
            "Info": "Specifies an IPv4 address or host name for the destination.\nIf the value is an IP address, it is in dotted decimal notation. If the value is a host name, it is a string of 1 to 255 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "mask-length",
            "Info": "Specifies a mask length for the destination.\nThe value is an integer ranging from 0 to 32."
        },
        {
            "Parameters": "ip-address",
            "Info": "Specifies the destination address in the IP header of an MPLS tracert packet with the prefix of 127.0.0.0/8.\nThe destination address in the IP header can be changed to trace a test packet.\nBy default, the destination IP address carried in the IP header of an MPLS tracert packet is 127.0.0.1."
        },
        {
            "Parameters": "nexthop nexthopAddr",
            "Info": "Specifies a next hop address. When links implement load balancing, this parameter can be used to locate the next-hop address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "detail",
            "Info": "Specifies that to display detailed information.\n-"
        },
        {
            "Parameters": "ddmap",
            "Info": "Specifies the detailed mapping.\n-"
        },
        {
            "Parameters": "te tunnelName",
            "Info": "Specifies the name of the TE tunnel interface.\n-"
        },
        {
            "Parameters": "ifType",
            "Info": "Specifies the type of the interface.\n-"
        },
        {
            "Parameters": "ifNum",
            "Info": "Specifies the number of the interface.\n-"
        },
        {
            "Parameters": "hot-standby",
            "Info": "Specifies the checking of the hot-standby lsp of the tunnel.\n-"
        },
        {
            "Parameters": "primary",
            "Info": "Specifies the checking of the primary lsp of the tunnel.\n-"
        },
        {
            "Parameters": "compatible-mode",
            "Info": "Specifies the compatible mode of intercommunication.\n-"
        },
        {
            "Parameters": "segment-routing",
            "Info": "Specifies an segment routing tunnel.\n-"
        },
        {
            "Parameters": "auto-tunnel auto-tunnelname",
            "Info": "Specify auto tunnel name.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "auto-tunnel srAutoTunnelName",
            "Info": "Specifies the name of te auto tunnel interface.\nThe value is a string of 1 to 255 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "version",
            "Info": "Specifies the protocol version.\n-"
        },
        {
            "Parameters": "draft2",
            "Info": "Specifies the protocol version being draft2.\n-"
        },
        {
            "Parameters": "draft4",
            "Info": "Specifies the protocol version being draft4.\n-"
        },
        {
            "Parameters": "rfc8287",
            "Info": "Specifies that RFC 8287 is used for measurement.\n-"
        },
        {
            "Parameters": "general",
            "Info": "Specifies a general lsptrace.\n-"
        },
        {
            "Parameters": "labels mplsLabel1",
            "Info": "Specifies an MPLS label.\nThe value is an integer ranging from 0 to 1048575."
        },
        {
            "Parameters": "mplsLabel2",
            "Info": "Specifies an MPLS label.\nThe value is an integer ranging from 0 to 1048575."
        },
        {
            "Parameters": "mplsLabel3",
            "Info": "Specifies an MPLS label.\nThe value is an integer ranging from 0 to 1048575."
        },
        {
            "Parameters": "mplsLabel4",
            "Info": "Specifies an MPLS label.\nThe value is an integer ranging from 0 to 1048575."
        },
        {
            "Parameters": "mplsLabel5",
            "Info": "Specifies an MPLS label.\nThe value is an integer ranging from 0 to 1048575."
        },
        {
            "Parameters": "mplsLabel6",
            "Info": "Specifies an MPLS label.\nThe value is an integer ranging from 0 to 1048575."
        },
        {
            "Parameters": "mplsLabel7",
            "Info": "Specifies an MPLS label.\nThe value is an integer ranging from 0 to 1048575."
        },
        {
            "Parameters": "mplsLabel8",
            "Info": "Specifies an MPLS label.\nThe value is an integer ranging from 0 to 1048575."
        },
        {
            "Parameters": "mplsLabel9",
            "Info": "Specifies an MPLS label.\nThe value is an integer ranging from 0 to 1048575."
        },
        {
            "Parameters": "mplsLabel10",
            "Info": "Specifies an MPLS label.\nThe value is an integer ranging from 0 to 1048575."
        },
        {
            "Parameters": "mplsLabel11",
            "Info": "Specifies an MPLS label.\nThe value is an integer ranging from 0 to 1048575."
        },
        {
            "Parameters": "mplsLabel12",
            "Info": "Specifies an MPLS label.\nThe value is an integer ranging from 0 to 1048575."
        },
        {
            "Parameters": "mplsLabel13",
            "Info": "Specifies an MPLS label.\nThe value is an integer ranging from 0 to 1048575."
        },
        {
            "Parameters": "-i outIfName",
            "Info": "Specifies the name of the interface.\n-"
        },
        {
            "Parameters": "outIfType",
            "Info": "Specifies the type of the interface.\n-"
        },
        {
            "Parameters": "outIfNum",
            "Info": "Specifies the number of the interface.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> tracert lsp ip 4.4.4.9 32",
            "  LSP Trace Route FEC: LDP IPV4 PREFIX 4.4.4.9/32 , press CTRL_C to break.",
            "  TTL   Replier            Time    Type      Downstream",
            "  0                                Ingress   10.1.2.2/[1028 ]",
            "  1     10.1.2.2           94 ms   Transit   10.1.5.2/[3 ]",
            "  2     10.1.5.2           94 ms   Egress"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe ping lsp command can be used to check the connectivity of LSPs on an MPLS network, and the tracert lsp command can be used to locate the faulty node.\nThe tracert lsp command uses MPLS Echo Request packets and MPLS Echo Reply packets to detect the connectivity of LSPs. Both Echo Request and Echo Reply packets are transmitted in the format of UDP packets through port 3503. The receiver distinguishes these two types of packets based on the port number. An MPLS Echo Request packet carries FEC information to be detected, and is sent along the same LSP as other packets carrying the same FEC information. In this manner, the connectivity of the LSP is checked. Echo Request packets are transmitted to the destination using MPLS, whereas MPLS Echo Reply packets are transmitted to the source using IP.\nThe tracert lsp command can be used to check links of the following types:\nLDP LSP: You can run the tracert lsp ip destination-iphost mask-length command to initiate a trace test from the ingress to the egress to check the connectivity of the LSP and locate the faulty node.TE tunnel: If a tunnel exists, you can run the tracert lsp te tunnel interface-number command on the ingress to ping the egress to check the connectivity of the tunnel. If a hot-standby tunnel exists, you can run the tracert lsp te Tunnel interface-number hot-standby command to check the connectivity of the hot-standby tunnel.SR-MPLS TE IPv4: If the type of tunnels to be tested is SR-MPLS TE IPv4:To test an SR-MPLS TE tunnel dynamically created, run the tracert lsp [ -a source-ip | -exp exp-value | -h ttl-value | -t time-out | -s size | -g ] * segment-routing auto-tunnel auto-tunnelname version { draft2 | draft4 } [ hot-standby ] [ detail ] command and specify auto-tunnelname on the ingress to initiate a tracert test to the egress.To test an SR-MPLS TE IPv4 tunnel manually configured, run the tracert lsp [ -a source-ip | -exp exp-value | -h ttl-value | -t time-out | -s size | -g ] * segment-routing te Tunnel tunnel-number [ draft2 ] [ hot-standby ] [ detail ] command and specify tunnel-name tunnel-number on the ingress to initiate a tracert test to the egress.General LSP tracert detection: Specify the outbound interface, next hop, and label information on the ingress, and run the tracert lsp general labels command to detect fault points of LSPs.LDP LSP connected with an SR-MPLS BE tunnel: To locate a fault point on an LDP LSP connected with an SR-MPLS BE tunnel, run the tracert lsp [ -a source-ip | -exp exp-value | -h ttl-value | -r reply-mode | -t time-out | -s size | -g ] * ip destination-iphost mask-length [ ip-address ] [ nexthop nexthop-address ] [ detail ] [ ddmap ] command on the ingress to initiate a tracert test to the egress of the SR-MPLS BE tunnel.LDP LSP connected with an SR-MPLS BE tunnel: If the LDP side does not support interworking, to locate a fault point on an LDP LSP connected with an SR-MPLS BE tunnel, run the tracert lsp ip destination-iphost mask-length command on the ingress to initiate a tracert test to the egress of the SR-MPLS BE tunnel.\nYou must run the lspv echo-reply fec-validation ldp disable command on the SR-MPLS BE side to disable the LSPV response end from checking the LDP FEC.\n\nPrerequisites\nBefore initiating a trace test, ensure that the UDP module of each node works properly.Ensure that the MPLS module of each node is enabled and works properly.Ensure that the ICMP module of each node works properly. Otherwise, a message is returned, indicating the trace test times out.\n\nImplementation Procedure\nThe process of the tracert lsp command is as follows:\nThe source sends an MPLS Echo Request packet with the TTL being 1. After the TTL times out, the first hop sends an MPLS Echo Reply packet to the source.The source sends an MPLS Echo Request packet with the TTL being 2. After the TTL times out, the second hop sends an MPLS Echo Reply packet to the source.The source sends an MPLS Echo Request packet with the TTL being 3. After the TTL times out, the third hop sends an MPLS Echo Reply packet to the source.The preceding process proceeds until an MPLS Echo Request packet reaches the destination.\nIn each probe, when receiving an MPLS Echo Request packet, the device on the last hop replies with an MPLS Echo Reply packet, indicating that the trace test ends. In this manner, the result of each probe is displayed on the source, based on which you can find the path from the source to the destination.\n\nConfiguration Impact\nTo prevent the egress from forwarding a received MPLS Echo Request packet to another node, you can set the destination address in the IP header of the packet to a loopback address with the prefix being 127.0.0.0/8.\nPrecautions\nWhen you run the tracert lsp te Tunnel interface-number command to test a tunnel, if a transit node is not enabled with LDP, a message is returned, indicating that the destination is unreachable."
}