{
    "PageTitle": "lspv mpls-lsp-ping echo enable",
    "FuncDef": "The lspv mpls-lsp-ping echo enable command enables a device to respond to MPLS Echo Request packets.\nThe undo lspv mpls-lsp-ping echo enable command disables a device from responding to MPLS Echo Request packets.\nBy default, a device is enabled to respond to MPLS Echo Request packets.",
    "CLIs": [
        "lspv mpls-lsp-ping echo enable",
        "undo lspv mpls-lsp-ping echo enable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] lspv mpls-lsp-ping echo enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nPing and tracert tests use ICMP packets to locate faulty nodes on a forwarding path. When an LSP fails, IP forwarding-based ICMP packets cannot be used to detect the faulty node.\nIn this case, the ping lsp/tracert lsp command can be used to locate the faulty node on the LSP. The command uses MPLS Echo Request and Reply packets to monitor the connectivity of an LSP. Both MPLS Echo Request and Reply packets are encapsulated into UDP packets and transmitted using port 3503. The receive end distinguishes MPLS Echo Request and Reply packets from other packets based on the port number. An MPLS Echo Request packet carries FEC information to be checked and is sent along the same LSP as other packets with the same FEC information. The connectivity of the LSP is then checked. MPLS Echo Request packets are transmitted to the destination over MPLS LSPs, whereas MPLS Echo Reply packets are transmitted to the source over IP paths.\nFor network security or management, to enable a device to respond to MPLS Echo Request packets, run the lspv mpls-lsp-ping echo enable command. To disable the device from responding to MPLS Echo Request packets, run the undo lspv mpls-lsp-ping echo enable command. Alternatively, you can shut down port 3503 to disable a device from responding to MPLS Echo Request packets.\nAfter you run the ping lsp/tracert lsp command to check the connectivity of an LSP, it is recommended that you run the undo lspv mpls-lsp-ping echo enable command to disable the device from responding to MPLS Echo Request packets to minimize the consumption of system resources.\nPrerequisites\nMPLS has been enabled in the system view using the mpls command.\nConfiguration Impact\nIf you run the undo lspv mpls-lsp-ping echo enable command to disable a device from responding to MPLS Echo Request packets, this device does not respond to the ping lsp/tracert lsp command. As a result, the ping or trace test destined for the device times out."
}