{
    "PageTitle": "lspv mpls-lsp-ping echo enable ipv6",
    "FuncDef": "The lspv mpls-lsp-ping echo enable ipv6 command enables a device to respond to MPLS Echo Request IPv6 packets.\nThe undo lspv mpls-lsp-ping echo enable ipv6 command disables a device from responding to MPLS Echo Request IPv6 packets.\nBy default, a device is enabled from responding to MPLS Echo Request IPv6 packets.",
    "CLIs": [
        "lspv mpls-lsp-ping echo enable ipv6",
        "undo lspv mpls-lsp-ping echo enable ipv6"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[*HUAWEI] lspv mpls-lsp-ping echo enable ipv6"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nICMP-based ping and tracert commands are used to locate forwarding fault points. However, if an LSP link gets faulty, the LSP fault point cannot be located because ICMP packets are forwarded based on IP.\nIn this case, run the ping lsp segment-routing te ipv6 or tracert lsp segment-routing te ipv6 command to detect the LSP fault. The commands test LSP connectivity through MPLS Echo Request IPv6 and MPLS Echo Reply IPv6 packets. Both MPLS Echo Request IPv6 and MPLS Echo Reply IPv6 packets are UDP packets using the well-known UDP port of 3503. The receiver distinguishes MPLS Echo Request and MPLS Echo Reply packets according to the port number. An MPLS Echo Request message carries FEC is sent along the same LSP as common packets with the same FEC to detect the connectivity of the LSP. MPLS Echo Request IPv6 packets are transmitted to the destination through MPLS, whereas MPLS Echo Reply IPv6 packets are transmitted to the source through IP.\nFor management or security purposes, you can run the lspv mpls-lsp-ping echo enable ipv6 command to enable the device to respond to MPLS Echo Request IPv6 packets, or run the undo lspv mpls-lsp-ping echo enable ipv6 command to disable this function. This function is disabled by shutting down port 3503.\nAfter the LSP ping or tracert test is completed, you are advised to run the undo lspv mpls-lsp-ping echo enable ipv6 command to disable the device from responding to MPLS Echo Request IPv6 packets to prevent system resource occupation.\nPrerequisites\nBefore running the command, run the segment-routing ipv6 command in the system view to enable the SRv6 capability.\nConfiguration Impact\nIf the device is disabled from responding to MPLS Echo Request IPv6 packets by running the undo lspv mpls-lsp-ping echo enable ipv6 command, the device does not respond to the ping lsp segment-routing te ipv6 or tracert lsp segment-routing te ipv6 command. As a result, when the device functions as the ping or tracert destination, running the ping lsp segment-routing te ipv6 or tracert lsp segment-routing te ipv6 command times out."
}