{
    "PageTitle": "lspv echo-reply fec-validation",
    "FuncDef": "The lspv echo-reply fec-validation ldp disable command disables a label switched path verification (LSPV) response end from checking the LDP forwarding equivalence class (FEC).\nThe undo lspv echo-reply fec-validation ldp command enables an LSPV response end to check the LDP FEC.\nThe lspv echo-reply fec-validation sr-prefix disable command disables an LSPV response end from checking the SR-prefix FEC.\nThe undo lspv echo-reply fec-validation sr-prefix command enables an LSPV response end to check the SR-prefix FEC.\nBy default, an LSPV response end is enabled to check the LDP FEC and SR-prefix FEC.",
    "CLIs": [
        "lspv echo-reply fec-validation ldp disable",
        "lspv echo-reply fec-validation sr-prefix disable",
        "undo lspv echo-reply fec-validation ldp",
        "undo lspv echo-reply fec-validation sr-prefix"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "sr-prefix",
            "Info": "Indicates the SR-prefix type.\n-"
        },
        {
            "Parameters": "disable",
            "Info": "Disables an LSPV response end from checking the LDP FEC or SR-prefix FEC.\n-"
        },
        {
            "Parameters": "ldp",
            "Info": "Indicates the LDP type.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] lspv echo-reply fec-validation ldp disable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] lspv echo-reply fec-validation sr-prefix disable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn an LDP and SR-MPLS BE interworking scenario, LDP and SR-MPLS BE services are configured on the local and remote devices, respectively. If the local device does not support interworking with the SR-MPLS BE service, the local device initiates LDP diagnosis to the remote device. You must run the lspv echo-reply fec-validation ldp disable command on the remote device to disable FEC check, ensuring normal interworking.In an inter-IGP SR-MPLS BE tunnel scenario, you must run the mpls-passive command to enable a device to passively create a BFD session when dynamic BFD is configured. After receiving an LSP ping request packet carrying the BFD TLV field from the ingress of an SR-MPLS BE tunnel, the egress responds with an LSP ping response packet carrying the BFD TLV field. The two ends then establish a BFD session through negotiation. The FEC field encapsulated in an SR-MPLS BE tunnel carries the protocol number for the SR-MPLS BE tunnel. In an inter-IGP scenario, if IS-IS is used on the ingress and OSPF is used on the egress, the check fails due to different FECs. As a result, packets are discarded and BFD session negotiation fails. To resolve this issue, run the lspv echo-reply fec-validation sr-prefix disable command on the egress to disable FEC check, ensuring successful negotiation."
}