{
    "PageTitle": "ping tcp",
    "FuncDef": "The ping tcp command tests whether the link between the client and TCP server is reachable and checks the speed of setting up a TCP connection through three-way handshake.",
    "CLIs": [
        "ping tcp [ -c <count> | -t <timeout> | -m <interval> | -h <ttl> | -vpn-instance <vrfName> | -passroute | -a <srcAddress> ] * <destAddress> [ <destPort> ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "-c count",
            "Info": "Specifies the number of messages to be sent.\nAfter you run the ping tcp command, the sequence number of an ICMP Echo Request message starts from 1 and is incremented by 1 for each subsequent message. By default, a device sends five ICMP Echo Request messages for a ping operation. You can configure the parameter -c to specify the number of ICMP Echo Request messages to be sent. If the peer is reachable, it sends five ICMP Echo Reply messages with the same sequence numbers as those of the ICMP Echo Request messages.\nIf the network quality is poor, you can increase the parameter value to determine the network quality based on the packet loss rate.\nThe value is an integer ranging from 1 to 4294967295. The default value is 5."
        },
        {
            "Parameters": "-t timeout",
            "Info": "Specifies the length of time to wait for an ICMP Echo Reply message after an ICMP Echo Request message is sent.\nThe value is an integer ranging from 0 to 65535, in milliseconds. The default value is 2000."
        },
        {
            "Parameters": "-m interval",
            "Info": "Specifies an interval at which ICMP Echo Request messages are sent.\nEach time the source sends an ICMP Echo Request message, the source waits a period of time (500 ms by default) before sending the next ICMP Echo Request message. You can set the time to wait before sending the next ICMP Echo Request message. If network quality is poor, setting this parameter to a value greater than or equal to 2000 ms is recommended.\nThe value is an integer ranging from 1 to 10000, in milliseconds. The default value is 500."
        },
        {
            "Parameters": "-h ttl",
            "Info": "Specifies the TTL value.\nThe value is an integer ranging from 1 to 255. The default value is 30."
        },
        {
            "Parameters": "-vpn-instance vrfName",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "-passroute",
            "Info": "Sends packets without searching for the routing table.\n-"
        },
        {
            "Parameters": "-a srcAddress",
            "Info": "Specifies the source IP address for Echo Request packets.\nIf no source IP address is specified, the IP address of the outbound interface is used.\nDotted decimal notation."
        },
        {
            "Parameters": "destAddress",
            "Info": "Specifies the IP address or host name of a remote system.\nIf the value is an IPv4 address, it is in dotted decimal notation.If the value is a host name, it is a string of case-sensitive characters without spaces."
        },
        {
            "Parameters": "destPort",
            "Info": "Specifies the TCP server port.\nThe value is an integer ranging from 1 to 65535. The default value is 7."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> ping tcp 10.1.1.1 3000",
            "  PING TCP 10.1.1.1: 3000, press CTRL_C to break",
            "    Reply from 10.1.1.1: Sequence=1 time=3 ms",
            "    Reply from 10.1.1.1: Sequence=2 time=3 ms",
            "    Reply from 10.1.1.1: Sequence=3 time=3 ms",
            "    Reply from 10.1.1.1: Sequence=4 time=3 ms",
            "    Reply from 10.1.1.1: Sequence=5 time=4 ms",
            "",
            "  --- TCP ping statistics ---",
            "    5 packet(s) transmitted",
            "    5 packet(s) received",
            "    0.00% packet loss",
            "    round-trip min/avg/max = 3/3/4 ms"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo test whether the link between the client and TCP server is reachable and check the speed of setting up a TCP connection through three-way handshake, run the ping tcp command.\nThe command output helps detect the performance indicators such as the network connectivity, packet loss rate, and delay."
}