{
    "PageTitle": "tracert ipv6",
    "FuncDef": "The tracert ipv6 command enables the system to trace gateways that packets pass through from the source to the destination with an IPv6 address.",
    "CLIs": [
        "tracert ipv6 [ -f <first-hop-limit> | -m <max-hop-limit> | -p <port-number> | -q <probes> | -w <timeout> | vpn-instance <vpn-instance-name> | -s <size> | -a <source-ipv6-address> | -name | -v | -nexthop <nextHopAddr> | -passroute | { -tc <tc> | -dscp <dscp> } ] * <host-name> [ -i { <ifName> | <ifType> <ifNum> } ]",
        "tracert ipv6 [ -f <first-hop-limit> | -m <max-hop-limit> | -p <port-number> | -q <probes> | -w <timeout> | { vpn-instance <vpn-instance-name> [ peer <peerIpv6> ] } | -s <size> | -name | -a <source-ipv6-address> | -v | -nexthop <nextHopAddr> | -passroute | { -tc <tc> | -dscp <dscp> } ] * <host-name> [ -i { <ifName> | <ifType> <ifNum> } ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "-f first-hop-limit",
            "Info": "Specifies the initial hop-limit.\nCarried in the IPv6 header, the hop-limit field indicates the lifetime of the IPv6 packet and specifies the maximum number of Routers through which the packet can pass. The hop-limit field in IPv6 packets is similar to the TTL field in IPv4 packets. The hop-limit value is set on the source and reduced by 1 each time the packet passes through one Router. When the hop-limit value is reduced to 0, the packet is discarded. At the same time, an ICMPv6 Timeout packet is sent to the source.\nIf first-hop-limit is specified and the number of hops is less than the specified value, the hop-limit value will be greater than 0 after the packet passes through all the nodes. Therefore, no ICMPv6 Timeout packet is sent to the source.\nIf max-hop-limit is specified, the value of first-hop-limit must be smaller than the value of max-hop-limit.\nThe value is an integer ranging from 1 to 255. The default value is 1."
        },
        {
            "Parameters": "-m max-hop-limit",
            "Info": "Specifies the maximum hop-limit.\nUsually, the maximum hop-limit is set to the number of hops through which packets passes. Use this parameter to change hop-limit.\nIf first-hop-limit is specified, max-hop-limit must be greater than first-hop-limit.\nThe value is an integer ranging from 1 to 255. The default value is 30."
        },
        {
            "Parameters": "-p port-number",
            "Info": "Specifies the UDP port number of the destination.\nIf no UDP port number is specified for the destination, when you run the tracert ipv6 command, a port with the port number greater than 32768 is randomly selected for the destination to receive trace packets.The UDP port number to be specified must not in use. If a used UDP number is specified, the trace test fails.\nThe value is an integer ranging from 1 to 65535. The default value is 33434."
        },
        {
            "Parameters": "-q probes",
            "Info": "Specifies the number of test packets sent in a trace test instance.\nIn the case of poor network qualities, increase value so that a test packet can reach the destination.\nThe value is an integer ranging from 1 to 65535. The default value is 3."
        },
        {
            "Parameters": "-w timeout",
            "Info": "Specifies the period of time for waiting for a response.\nIf a test packet reaches a gateway and times out, an asterisk (*) is displayed.\nIn the case of poor network qualities and a low network transmission rate, increase the timeout period.\nThe value is an integer that ranges from 1 to 65535, in milliseconds. The default value is 5000."
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters."
        },
        {
            "Parameters": "-s size",
            "Info": "Specify the size of packet.\nIt is an integer ranging from 20 to 9600."
        },
        {
            "Parameters": "-name",
            "Info": "Displays the host name of the destination address.\n-"
        },
        {
            "Parameters": "-a source-ipv6-address",
            "Info": "Specifies the source IPv6 address of an ICMPv6 Echo Request packet to be sent.\nIf no source IPv6 address is specified, the IPv6 address of the outbound interface through which ICMPv6 Echo Request packets are sent is used as the source address.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "-v",
            "Info": "Displays packet details, including MPLS label information.\n-"
        },
        {
            "Parameters": "-nexthop nextHopAddr",
            "Info": "Specifies an IPv6 address for the next hop.\nIf you have specified this parameter, the device no longer searches the routing table before sending UDP packets.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X.\nThe specified next hop address must be the next hop address of a directly connected physical interface.When you specify a next hop address, you can configure -i interface-type interface-number to specify an outbound interface. The following conditions must be met to ensure a test success:The specified next hop address must match the outbound interface.The specified outbound interface cannot be a logical interface's member interface.\nIf you have specified a next hop address, you cannot specify a VPN."
        },
        {
            "Parameters": "-passroute",
            "Info": "Sends UDP packets without searching for the routing table.\n-"
        },
        {
            "Parameters": "-tc tc",
            "Info": "Specifies the traffic class for Echo Request packets.\nYou can specify traffic-class-value to control Echo Request traffic.\nThe value is an integer ranging from 0 to 255. The default value is 0."
        },
        {
            "Parameters": "-dscp dscp",
            "Info": "Specifies the DSCP value of an Echo Request packet to be sent.\nThe value is an integer ranging from 0 to 63. The default value is 0."
        },
        {
            "Parameters": "host-name",
            "Info": "Specifies the name or the IPv6 address of a destination host.\nThe value is a string of 1 to 255 characters.\nIf the parameter value is an IP address, set the format of the parameter to X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "-i ifName",
            "Info": "Sets the interface name for sending UDP messages.\n-"
        },
        {
            "Parameters": "ifType",
            "Info": "Sets the interface type for sending UDP messages.\n-"
        },
        {
            "Parameters": "ifNum",
            "Info": "Sets the interface number for sending UDP messages.\n-"
        },
        {
            "Parameters": "peer peerIpv6",
            "Info": "Specifies a peer SID, that is, the address of the last hop in the SRv6 domain, in EVPN L3VPN over SRv6 BE scenarios.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> tracert ipv6 -q 5 -w 8000 2001:db8:100::3",
            "traceroute to 2001:db8:100::3 30 hops max,60 bytes packet",
            "1 2001:db8:200::2 26 ms 23 ms 26 ms 30 ms 29 ms ",
            "2 2001:db8:100::3 3020 ms 3024 ms 4040 ms 6820 ms 5584 ms"
        ],
        [
            "<HUAWEI> tracert ipv6 vpn-instance vsi6 2001:db8:100::3",
            "traceroute to 2001:db8:100::3  30 hops max,60 bytes packet",
            " 1 2001:db8:200::2 26 ms  23 ms  26 ms",
            " 2 2001:db8:100::2 3020 ms  !H 3024 ms  !H 4040 ms  !H"
        ],
        [
            "<HUAWEI> tracert ipv6 -f 2 -m 64 2001:db8:100::3",
            "traceroute to vpn_out 2001:db8:100::3 30 hops max,60 bytes packet",
            " 1 2001:db8:200::2 26 ms  23 ms  26 ms",
            " 2 2001:db8:300::1 47 ms 32 ms 33 ms",
            " 3 2001:db8:400::2 63 ms 46 ms 47 ms",
            " 4 2001:db8:100::3 78 ms 79 ms 62 ms"
        ],
        [
            "<HUAWEI> tracert ipv6 -name -f 1 -m 3 -p 65535 -q 2 www.huawei.com",
            " Resolved Host ( www.huawei.com -> 2001:db8::1 )",
            " traceroute to www.huawei.com (2001:db8::1)  3 hops max,60 bytes packet",
            " 1 2001:db8::1 66 ms  22 ms"
        ],
        [
            "<HUAWEI> tracert ipv6 -name -f 1 -m 3 -p 65535 -q 2 2001:db8::1",
            " traceroute to 2001:db8::1 (www.huawei.com) 3 hops max,60 bytes packet",
            " 1 2001:db8::1 67 ms  14"
        ],
        [
            "<HUAWEI> tracert ipv6 -v 2001:DB8:2::1",
            "traceroute to 2001:DB8:2::1 30 hops max,60 bytes packet",
            "1 2001:DB8:1::2 81 ms 1 ms 1 ms ",
            "2 2001:DB8:10::3[MPLS Label=32830/32829 Exp=0/0 S=0/1 TTL=1/1] 310 ms 1 ms 2 ms ",
            "3 2001:DB8:20::4[MPLS Label=32830/32829 Exp=0/0 S=0/1 TTL=1/1] 118 ms 2 ms 1 ms ",
            "4 2001:DB8:2::2 142 ms 1 ms 2 ms ",
            "5 2001:DB8:2::1 95 ms 2 ms 2 ms"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nYou can run the ping ipv6 command to check the connectivity of the network and then run the tracert ipv6 command to locate the faulty node.\nYou can specify different parameters in the tracert ipv6 command in various test scenarios:\nTo view information about nodes between the source and destination, run the tracert ipv6 host command.To view information about nodes between the source and destination on an L3VPN, run the tracert ipv6 vpn-instance vpn-instance-name host command. On an L3VPN, devices may not have each other's routing information, and you cannot use the tracert ipv6 host command to check whether the peer is reachable. Instead, you can run the tracert ipv6 vpn-instance vpn-instance-name host command to view information about nodes between the source and destination in a specified VPN instance.To view information about nodes between the source and destination on a network of poor qualities, run the tracert ipv6 -q probes -w timeout host command. On an unreliable network, increase -q and -w values to obtain more information.To check the nodes along a specified segment of a path, run the tracert ipv6 -f first-hop-limit -m max-hop-limit host command with the specified initial hop-limit and the maximum hop-limit.To display the label information of a tracert path, run the tracert ipv6 -v command.\n\nPrerequisites\nBefore running the tracert ipv6 command, ensure that the UDP module of each node is working properly.If vpn-instance is configured, ensure that the VPN module of each node is working properly.Ensure that the ICMP module of each node works properly; otherwise, a packet indicating that the trace test times out is returned.\n\nImplementation Procedure\nThe process of the tracert ipv6 command is as follows:\nThe source sends a packet with the hop-limit of 1. After the hop-limit times out, the first hop sends an ICMPv6 Error packet to the source, indicating that the packet cannot be forwarded.The source sends a packet with the hop-limit of 2. After the hop-limit times out, the second hop sends an ICMPv6 Error packet to the source, indicating that the packet cannot be forwarded.The source sends a packet with the hop-limit of 3. After the hop-limit times out, the third hop sends an ICMPv6 Error packet to the source, indicating that the packet cannot be forwarded.The preceding process proceeds until a packet reaches the destination.\nWhen receiving a test IPv6 packet, the destination hop attempts to find the port specified in the IPv6 packet. If no such a port is found, the destination hop sends back an ICMP Port Unreachable packet, indicating that the destination port is unreachable. The trace test then ends. Based on the ICMP Port Unreachable packet sent from each hop, you can obtain information about the path from the source to the destination.\n\nPrecautions\nBy default, the ICMPv6 module is automatically enabled after the IPv6 module is enabled."
}