{
    "PageTitle": "trunk member-port-inspect",
    "FuncDef": "The trunk member-port-inspect command enables a device to monitor Layer 3 trunk member interfaces.\nThe undo trunk member-port-inspect command disables a device from monitoring Layer 3 trunk member interfaces.\nBy default, a device is disabled from monitoring Layer 3 trunk member interfaces.",
    "CLIs": [
        "trunk member-port-inspect",
        "undo trunk member-port-inspect"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] trunk member-port-inspect"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nMultiple physical interfaces can be bundled into a logical interface, which is called a trunk interface. The physical interfaces are the trunk interface's member interfaces. If the ping command is run to test a trunk interface, the local device sends a ping packet to the remote device through a member interface. The remote device may select any member interface to send a reply packet back to the local device. When the quality of services carried on the trunk interface deteriorates greatly, users cannot determine which member interface of the trunk interface fails.\nThe trunk member-port-inspect command can be run on the receive side to ping each trunk member interface to monitor the status of the end-to-end link on each member interface. After the receive side receives a ping packet through the trunk interface, it uses the member interface directly connected to the transmit side to send a reply packet back, monitoring the status of the end-to-end link on a specified member interface and in turn determining the faulty trunk member interface. After this command is run to enable a device to monitor Layer 3 trunk member interfaces, ICMP Echo Reply packets are sent through the inbound interface of ICMP Echo Request packets.\nConfiguration Impact\nThis command takes effect for all Layer 3 trunk interfaces on a virtual system (VS). Therefore, if you only need to test the connectivity of trunk interfaces, disable this function after monitoring the trunk member interfaces. If this function is not disabled, the trunk member-port-inspect command keeps monitoring the trunk member interfaces.\nPrecautions\nThe trunk member-port-inspect command is applicable only to the scenarios where trunk interfaces or Eth-Trunk sub-interfaces are directly connected, and it takes effect only when the fast reply function is disabled."
}