{
    "PageTitle": "vrrp",
    "FuncDef": "This command creates the context to configure a VRRP virtual router instance. A virtual router is defined by its virtual router identifier (VRID) and a set of IP addresses.",
    "CLIs": [
        "vrrp <virtual-router-id> [ owner ] [ passive ]",
        "no vrrp <virtual-router-id>"
    ],
    "ParentView": [
        "config>router>interface",
        "config>router>if>ipv6"
    ],
    "ParaDef": [
        {
            "Parameters": "virtual-router-id",
            "Info": "The virtual router ID for the IP interface expressed as a decimal integer. Values-1 to 255."
        },
        {
            "Parameters": "owner",
            "Info": "Identifies this virtual router instance as owning the virtual router IP addresses. If the owner keyword is not specified at the time of vrid creation, the vrrp backup commands must be specified to define the virtual router IP addresses. The owner keyword is not required when entering the vrid for editing purposes. When created as owner, a vrid on an IP interface cannot have the owner parameter removed. The vrid must be deleted, and then recreated without the owner keyword, to remove ownership."
        },
        {
            "Parameters": "passive",
            "Info": "Identifies this virtual router instance as passive, therefore owning the virtual router IP addresses. A passive vrid does not send or receive VRRP advertisement messages and is always in either the master state (if the interface is operationally up), or the init state (if the interface is operationally down). The passive keyword is not required when entering the vrid for editing purposes. When a vrid on an IP interface is created as passive, the parameter cannot be removed from the vrid. The vrid must be deleted, and then recreated without the passive keyword, to remove the parameter."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: no vrrp - No VRRP virtual router instance is associated with the IP interface."
}