{
    "PageTitle": "port-queue pq (low-speed interface)",
    "FuncDef": "The port-queue pq command configures the priority queuing (PQ) parameters of a queue on a low-speed interface. To configure PQ scheduling parameters for other interfaces, run the port-queue command.\nThe undo port-queue command restores the default configuration.\nBy default, PQ applies to the EF, CS6, and CS7 queues, and the PIR of the EF, CS6, or CS7 queue is the interface bandwidth.",
    "CLIs": [
        "port-queue { af2 | af3 | af4 | ef | cs6 | cs7 } pq shaping pir { <pir-value> | percentage <pir-percent> }"
    ],
    "ParentView": [
        "Global MP-group interface view",
        "MP-group interface view",
        "Trunk serial interface view",
        "Serial interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "af2",
            "Info": "Specifies the service level of a queue as af2.\n-"
        },
        {
            "Parameters": "af3",
            "Info": "Specifies the service level of a queue as af3.\n-"
        },
        {
            "Parameters": "af4",
            "Info": "Specifies the service level of a queue as af4.\n-"
        },
        {
            "Parameters": "ef",
            "Info": "Specifies the service level of a queue as ef.\n-"
        },
        {
            "Parameters": "cs6",
            "Info": "Specifies the service level of a queue as cs6.\n-"
        },
        {
            "Parameters": "cs7",
            "Info": "Specifies the service level of a queue as cs7.\n-"
        },
        {
            "Parameters": "shaping",
            "Info": "Specify shaping parameters.\n-"
        },
        {
            "Parameters": "pir",
            "Info": "Peak information rate.\n-"
        },
        {
            "Parameters": "pir-value",
            "Info": "Specifies the PIR value.\nThe value is an integer ranging from the CIR plus 8 to a non-0 interface bandwidth (not greater than 64000), in kbit/s. The value is 0 if the interface bandwidth is 0."
        },
        {
            "Parameters": "percentage pir-percent",
            "Info": "Specifies the percentage of the PIR in the interface bandwidth.\nThe value is an integer ranging from 1 to 100."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Serial 1/0/0/1:0",
            "[*HUAWEI-Serial1/0/0/1:0] port-queue af2 pq shaping pir 300"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA low-speed interface has a low bandwidth and is prone to traffic congestion. After PQ applies to a low-speed interface, higher-priority services can preempt the bandwidth of other services. Therefore, real-time services are guaranteed sufficient bandwidth when traffic congestion occurs.\nPrecautions\nThe port-queue pq command applies only to the 4-port 155M CPOS interface card and 32-port E1 interface card.If you run the port-queue pq command repeatedly, the latest configuration overrides the previous one."
}