{
    "PageTitle": "port-queue-alarm buffer",
    "FuncDef": "The port-queue-alarm buffer command configures an alarm threshold for the usage of port queues.\nThe undo port-queue-alarm buffer command cancels the configuration.\nBy default, the alarm threshold for the usage of CS6 and CS7 queues is 99, and there are no default alarm thresholds for other queues.",
    "CLIs": [
        "port-queue-alarm <cos-value> buffer percentage <percentage-value>",
        "undo port-queue-alarm <cos-value> buffer"
    ],
    "ParentView": [
        "Eth-Trunk interface view",
        "GE optical interface view",
        "IP-Trunk interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "cos-value",
            "Info": "Specifies the class of service.\nIt is case-insensitive and can be cs7, cs6, ef, af4, af3, af2, af1, and be."
        },
        {
            "Parameters": "percentage percentage-value",
            "Info": "Specifies an alarm threshold for the usage of queues.\nThe value is an integer in the range 0 to 100.\nIf the value is 0, an alarm is generated as long as packets are transmitted."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] port-queue-alarm af1 buffer percentage 60"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo monitor the use of queues, you can run the port-queue-alarm buffer command to configure an alarm threshold for the usage of queues. If the usage of a queue (the ratio of the current queue length to the total queue length) exceeds the alarm threshold, an alarm is sent.The system checks the queue usage every 2s. If the queue usage exceeds the alarm threshold for more than eight times within 16 consecutive checks, the system determines that the alarm condition is met.\nAn alarm threshold for the buffer usage in the port queue can be configured both in the slot view and interface view. Therefore, the conditions for the configurations to take effect are as follows:\nIn the slot view, this configuration takes effect on all interfaces of a slot. If the function is configured both in the slot view and the interface view, the command configuration in the interface view takes precedence over that in the slot view.If the function is configured both in the slot view and the interface view, after the function is deleted in the interface view, the configuration takes effect in the slot view. After the function is deleted in the slot view, the configuration still takes effect in the interface view.\nIn VS mode, this command applies only to the admin VSand cannot be configured in other VSs. This command takes effect on all VSs.\n\nFollow-up Procedure\nIf the usage of a queue exceeds the configured alarm threshold, run the queue-depth command to adjust the size of the queue cache."
}