{
    "PageTitle": "port-queue wfq (low-speed interface)",
    "FuncDef": "The port-queue wfq command configures the weighted fair queuing (WFQ) parameters of a queue on a low-speed interface. To configure WFQ scheduling parameters for other interfaces, run the port-queue command.\nThe undo port-queue command restores the default configuration.\nBy default, WFQ applies to the BE, AF1, AF2, AF3, and AF4 queues. The percentages of the CIRs in the interface bandwidth are respectively 15%, 15%, 20%, 25% and 25%, and the PIR is the interface bandwidth.",
    "CLIs": [
        "port-queue { be | af1 | af2 | af3 | af4 | ef | cs6 } wfq shaping cir { <cir-value> | percentage <cir-percent> } [ pir { <pir-value> | percentage <pir-percent> } ]",
        "undo port-queue { be | af1 | af2 | af3 | af4 | ef | cs6 | cs7 }"
    ],
    "ParentView": [
        "Global MP-group interface view",
        "MP-group interface view",
        "Trunk serial interface view",
        "Serial interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "be",
            "Info": "Specifies the service level of a queue as be.\n-"
        },
        {
            "Parameters": "af1",
            "Info": "Specifies the service level of a queue as af1.\n-"
        },
        {
            "Parameters": "af2",
            "Info": "Specifies the service level of a queue as af2.\n-"
        },
        {
            "Parameters": "af3",
            "Info": "Specifies the service level of a queue as af3.\n-"
        },
        {
            "Parameters": "af4",
            "Info": "Specifies the service level of a queue as af4.\n-"
        },
        {
            "Parameters": "ef",
            "Info": "Specifies the service level of a queue as ef.\n-"
        },
        {
            "Parameters": "cs6",
            "Info": "Specifies the service level of a queue as cs6.\n-"
        },
        {
            "Parameters": "shaping",
            "Info": "Specify shaping parameters.\n-"
        },
        {
            "Parameters": "cir",
            "Info": "Commited information rate.\n-"
        },
        {
            "Parameters": "cir-value",
            "Info": "Specifies the CIR value.\nThe value is an integer ranging from 8 to the interface bandwidth minus 8 (not greater than 64000), in kbit/s. The value is 0 if the interface bandwidth is 0."
        },
        {
            "Parameters": "percentage cir-percent",
            "Info": "Specifies the percentage of the CIR in the interface bandwidth.\nThe value is an integer ranging from the percentage of 8 kbit/s in the interface bandwidth to 100 minus the percentage of 8 kbit/s in the interface bandwidth."
        },
        {
            "Parameters": "percentage pir-percent",
            "Info": "Specifies the percentage of the PIR in the interface bandwidth.\nThe value is an integer ranging from the CIR plus the percentage of 8 kbit/s in the interface bandwidth to 100."
        },
        {
            "Parameters": "pir",
            "Info": "Peak information rate.\n-"
        },
        {
            "Parameters": "pir-value",
            "Info": "Specifies the PIR value.\nThe value is an integer ranging from the CIR plus 8 to a non-0 interface bandwidth (not greater than 64008), in kbit/s. The value is 0 if the interface bandwidth is 0."
        },
        {
            "Parameters": "cs7",
            "Info": "Specifies the service level of a queue as cs7.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Serial 1/0/0/1:0",
            "[*HUAWEI-Serial1/0/0/1:0] port-queue af1 wfq shaping cir percentage 10 pir percentage 20"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA low-speed interface has a low bandwidth and is prone to traffic congestion. After WFQ applies to a queue, higher-priority queues are allocated a higher weight and are guaranteed a higher bandwidth.\nPrecautions\nIf you run the port-queue wfq command repeatedly, the latest configuration overrides the previous one.\nThe sum of queues' CIR percentages (cir-percent) cannot exceed 100%.The port-queue wfq weight and port-queue wfq shaping cir commands are mutually exclusive."
}