{
    "PageTitle": "port-queue queue-limit",
    "FuncDef": "The port-queue queue-limit command configures a buffer time for a queue.\nThe undo port-queue queue-limit command restores the default configuration.\nBy default, the buffer time of a queue is 50 ms.",
    "CLIs": [
        "port-queue { be | af1 | af2 | af3 | af4 | ef | cs6 | cs7 } queue-limit max-buffer-time <time-value>",
        "undo port-queue { be | af1 | af2 | af3 | af4 | ef | cs6 | cs7 } queue-limit"
    ],
    "ParentView": [
        "Global MP-group interface view",
        "MP-group interface view",
        "Trunk serial interface view",
        "Serial interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "be",
            "Info": "Specifies the service level of a queue as be.\n-"
        },
        {
            "Parameters": "af1",
            "Info": "Specifies the service level of a queue as af1.\n-"
        },
        {
            "Parameters": "af2",
            "Info": "Specifies the service level of a queue as af2.\n-"
        },
        {
            "Parameters": "af3",
            "Info": "Specifies the service level of a queue as af3.\n-"
        },
        {
            "Parameters": "af4",
            "Info": "Specifies the service level of a queue as af4.\n-"
        },
        {
            "Parameters": "ef",
            "Info": "Specifies the service level of a queue as ef.\n-"
        },
        {
            "Parameters": "cs6",
            "Info": "Specifies the service level of a queue as cs6.\n-"
        },
        {
            "Parameters": "cs7",
            "Info": "Specifies the service level of a queue as cs7.\n-"
        },
        {
            "Parameters": "max-buffer-time time-value",
            "Info": "Specifies the buffer time of a queue.\nThe value is an integer ranging from 1 to 150, in milliseconds. The default value is 50."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Serial 1/0/0/20:0",
            "[*HUAWEI-Serial1/0/0/20:0] port-queue af1 queue-limit max-buffer-time 100"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen a large volume of traffic keeps being transmitted, traffic congestion occurs and leads to a long delay. You can configure a buffer time for a queue to resolve this problem. Setting a short buffer time speeds up packet forwarding and minimizes delays.\nThe buffer time of a queue is defined based on 64-byte PPP packets.\nPrecautions\nA buffer time can be configured only on Point-to-Point Protocol (PPP)-capable serial interfaces.\nIf you run the port-queue queue-limit command repeatedly, the latest configuration overrides the previous one."
}