{
    "PageTitle": "reset port-queue statistics slot",
    "FuncDef": "The reset port-queue statistics slot command clears the statistics about all or a specified queue on the MTunnel interface of the distributed multicast VPN.",
    "CLIs": [
        "reset port-queue statistics slot <slot-id> [ <cos-value> ] outbound bind mtunnel"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "slot-id",
            "Info": "Specified the slot imbedding the multicast VPN.\n-"
        },
        {
            "Parameters": "cos-value",
            "Info": "Specifies the CoS value of the queue.\nThe value of CoS can be BE, AF1, AF2, AF3, AF4, CS6, CS7 or EF."
        },
        {
            "Parameters": "outbound",
            "Info": "Specifies the outbound direction.\n-"
        },
        {
            "Parameters": "bind",
            "Info": "Bind interface.\n-"
        },
        {
            "Parameters": "mtunnel",
            "Info": "Type of interface.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset port-queue statistics slot 1 outbound bind mtunnel"
        ],
        [
            "<HUAWEI> reset port-queue statistics slot 1 af1 outbound bind mtunnel"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe reset port-queue statistics slot command can be used only on the slots embedding the multicast VPN.\nAfter users configure scheduling parameters for the eight class queues on the MTunnel interface of the distributed multicast VPN using the command port-queue bind mtunnel, the validation of the configured scheduling policy can be checked by executing the command display port-queue statistics slot. But the packet numbers is increasingly bigger if the interface keep traffic on. To monitor the validation of the configured scheduling policy in a certain period, the command reset port-queue statistics slot can be used to clear the statistics about all or a specified queue on the specified MTunnel interface of the distributed multicast VPN. And the statistic can be recounting.\nPrecautions\nThis command is supported only on the admin VS.\nPort queue statistics cannot be restored after being reset.\nIf the parameter is not specified, all the port queue statistics are cleared in the Mtunnel outbound interface which enables distributed multicast VPN."
}