{
    "PageTitle": "reset port-queue statistics",
    "FuncDef": "The reset port-queue statistics command resets statistics about port queues on an outbound interface.",
    "CLIs": [
        "reset port-queue statistics [ slot <slot-id> ] [ <cos-value> ] outbound",
        "reset port-queue statistics interface { <interface-name> | <interface-type> <interface-number> } [ <cos-value> ] outbound"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "cos-value",
            "Info": "Specifies the priority of a port queue.\nThe value is an enumerated type and can be cs7, cs6, ef, af4, af3, af2, af1, and be."
        },
        {
            "Parameters": "outbound",
            "Info": "Displays the configuration for queues in the outbound direction of an interface.\n-"
        },
        {
            "Parameters": "slot slot-id",
            "Info": "Specifies the slot ID of a board.\nIn VS mode, this parameter is supported only by the admin VS.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "interface interface-type interface-number",
            "Info": "Specifies an interface type and interface number.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset port-queue statistics interface GigabitEthernet 1/0/0 outbound"
        ],
        [
            "<HUAWEI> reset port-queue statistics slot 1 outbound"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf you consider at a moment that the previous port queue statistics on an interface to be useless or unreliable, run the reset port-queue statistics command to reset the port queue statistics on the interface.\nConfiguration Impact\nPort queue statistics cannot be restored after being reset.\nIf running the reset port-queue statistics command to reset statistics about port queues on an interface, the user queue statistics is cleared as well.\nIn multi-VS scenarios, after this command is configured on a trunk main interface, the command configuration is also effective for the trunk sub-interfaces that reside in other VSs."
}