{
    "PageTitle": "display logfile list slave",
    "FuncDef": "The display logfile list slave command displays log files generated on the slave main control board in the specified time range.",
    "CLIs": [
        "display logfile [ security | log | diagnose ] list starttime <starttime-value> endtime <endtime-value> slave"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "security",
            "Info": "Displays security log files generated in the specified time range.\n-"
        },
        {
            "Parameters": "log",
            "Info": "Displays user log files generated in the specified time range.\n-"
        },
        {
            "Parameters": "diagnose",
            "Info": "Displays diagnostic log files generated in the specified time range.\nIn VS mode, this parameter is supported only by the admin VS.\n-"
        },
        {
            "Parameters": "list",
            "Info": "Displays diagnostic log files generated in the specified time range.\n-"
        },
        {
            "Parameters": "starttime starttime-value",
            "Info": "Specifies the start time for the query of log files.\nThe value is in the YYYY/MM/DD,HH:MM:SS format.\nYYYY indicates the year and is an integer ranging from 1970 to 9999.MM indicates the month and is an integer ranging from 1 to 12.DD indicates the day and is an integer ranging from 1 to 31.HH indicates the hour and is an integer ranging from 0 to 23.MM indicates the minute and is an integer ranging from 0 to 59.SS indicates the second and is an integer ranging from 0 to 59.If YYYY/MM/DD is not specified, the system year, month, and day are used by default.The value of starttime-value must be earlier than that of endtime-value."
        },
        {
            "Parameters": "endtime endtime-value",
            "Info": "Specifies the end time for the query of log files.\nThe value is in the YYYY/MM/DD,HH:MM:SS format.\nYYYY indicates the year and is an integer ranging from 1970 to 9999.MM indicates the month and is an integer ranging from 1 to 12.DD indicates the day and is an integer ranging from 1 to 31.HH indicates the hour and is an integer ranging from 0 to 23.MM indicates the minute and is an integer ranging from 0 to 59.SS indicates the second and is an integer ranging from 0 to 59.If YYYY/MM/DD is not specified, the system year, month, and day are used by default.The value of endtime-value must be later than that of starttime-value."
        },
        {
            "Parameters": "slave",
            "Info": "Displays log files generated on the slave main control board in the specified time range.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display logfile log list starttime 2020/2/1,08:12:12 endtime 2020/2/2,12:17:43 slave",
            "--------------------------------------------------------------------------------",
            "LogType    LogFilePath                                       ",
            "--------------------------------------------------------------------------------",
            "log        18#cfcard:/logfile/log.log ",
            "log        18#cfcard:/logfile/log_17_20200202061829.log.zip                                              ",
            "--------------------------------------------------------------------------------"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo check device running status, run the display logfile list slave command to display log files generated in the specified time range. If no log file type (log/diagnose) is specified, the command displays all types of log files generated in the specified time range.Log files of the log type are automatically named in the log.log format. You can access the cfcard: directory to view this type of log files. If the size of a log file exceeds the upper threshold, the system automatically saves the file as a historical compression one and changes the file name to log_.log.zip. In the file name, and indicate the slot ID and log generation time, respectively."
}