{
    "PageTitle": "suppression event-name",
    "FuncDef": "The suppression event-name command configures a delay after which a generated event is reported.\nThe undo suppression event-name command restores the default delay.\nBy default, the delay after which a generated event is reported is 0s. That is, event reporting is not delayed.",
    "CLIs": [
        "suppression event-name <event-name> period <seconds>",
        "undo suppression event-name <event-name> period"
    ],
    "ParentView": [
        "Event view"
    ],
    "ParaDef": [
        {
            "Parameters": "event-name",
            "Info": "Specifies the name of an event.\nThe value is a string of 1 to 64 case-insensitive characters, spaces not supported."
        },
        {
            "Parameters": "period seconds",
            "Info": "Specifies a delay.\nThe value is an integer ranging from 0 to 600, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] event",
            "[~HUAWEI-event] delay-suppression enable",
            "[*HUAWEI-event] suppression event-name hwBfdSessDown period 5"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf an event is repeatedly reported, you can enable delayed event reporting by specifying a delay. After receiving the event, the alarm management module suppresses it within the delay and reports it only when the delay expires. If the delay is set to 0s, the alarm management module directly reports the event without suppressing it.\nPrerequisites\nBefore running the suppression event-name command, ensure that delayed event reporting has been enabled.\nConfiguration Impact\nIf a delay is configured for the reporting of an event and the same event is repeatedly generated, the system drops such events generated within the delay. The system reports the event to the NMS only when the delay expires.\nIf the configured delay is modified during event sending, the new delay takes effect for the next and follow-up events."
}