{
    "PageTitle": "info-center loghost domain",
    "FuncDef": "The info-center loghost domain command configures a device to output logs to a syslog server.\nThe undo info-center loghost domain command disables a device from outputting logs to a syslog server.\nA device does not output logs to any syslog server by default.",
    "CLIs": [
        "info-center loghost domain <domain-name> [ { local-time | utc } | channel { <channel-number> | <channel-name> } | { public-net | vpn-instance <vpn-instance-name> } | source-ip <source-ip-address> | facility <local-num> | level <level-num> | port <server-port> | transport { udp | tcp [ ssl-policy <policy-name> [ security ] ] } ] *",
        "undo info-center loghost domain <domain-name> [ vpn-instance <vpn-instance-name> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "local-time",
            "Info": "Indicates the local time.\nThe default value is UTC."
        },
        {
            "Parameters": "utc",
            "Info": "Indicates the Universal Time Coordinated (UTC).\n-"
        },
        {
            "Parameters": "channel",
            "Info": "Indicates the information channel.\n-"
        },
        {
            "Parameters": "channel-number",
            "Info": "Specifies a channel number.\nThe value is an integer ranging from 0 to 9.\n0: console1: monitor2: loghost3: trapbuffer4: logbuffer5: snmpagent6: channel67: channel78: channel89: channel9"
        },
        {
            "Parameters": "channel-name",
            "Info": "Specifies a channel name.\nThe value is a string:\nconsole: Consolemonitor: Remote terminalloghost: Syslog servertrapbuffer: Trap bufferlogbuffer: Log buffersnmpagent: SNMP agentchannel6: Unspecifiedchannel7: Unspecifiedchannel8: Unspecifiedchannel9: Information file"
        },
        {
            "Parameters": "public-net",
            "Info": "Indicates the logs sent to a syslog server over the public network.\n-"
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies name of a virtual private network (VPN) instance of a syslog server.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "source-ip source-ip-address",
            "Info": "Specifies the source IPv4 address of packets to be sent to a syslog server.\nThe value is in dotted decimal format."
        },
        {
            "Parameters": "facility local-num",
            "Info": "Specifies a syslog server facility that is used to identify the log information source. You can use this parameter to plan a local value for the log information of a specified device, so that the syslog server can handle received log information based on the parameter.\nThe value is an enumerated type: local0, local1, local2, local3, local4, local5, local6, or local7. The default value is local7."
        },
        {
            "Parameters": "level level-num",
            "Info": "Specifies a log level.\nThe value is an enumerated type:\nemergencies: an emergency error.alert: an error that needs to be corrected immediatelycritical: a major errorerror: a minor errorwarning: a potential errornotification: information that needs to be noticedinformational: an informational messagedebugging: detailed information for debugging use"
        },
        {
            "Parameters": "port server-port",
            "Info": "Specifies the destination port number of packets to be sent to a syslog server.\nThe value is an integer ranging from 1 to 65535.\nIf UDP is specified as the transport mode, the default port number is 514.If TCP is specified as the transport mode, the default port number is 601.If Secure Sockets Layer (SSL) is specified in the TCP transport mode, the default port number is 6514."
        },
        {
            "Parameters": "transport",
            "Info": "Indicates the information transport mode.\n-"
        },
        {
            "Parameters": "udp",
            "Info": "Indicates that the information transport mode is UDP.\n-"
        },
        {
            "Parameters": "tcp",
            "Info": "Indicates that the information transport mode is TCP.\n-"
        },
        {
            "Parameters": "ssl-policy policy-name",
            "Info": "Specifies the name of a Secure Sockets Layer (SSL) policy when packets are transmitted using TCP.\nSSL encrypted transmission provides high security. If packets are transmitted on insecure networks, configure SSL encrypted transmission by specifying ssl-policy policy-name. If packets are transmitted on secure networks, configure UDP transmission mode by specifying udp or TCP transmission mode by specifying tcp.\nThe value is a string of 1 to 23 case-insensitive characters, spaces not supported."
        },
        {
            "Parameters": "security",
            "Info": "Specifies a security log host.\nIf the security parameter is set, the system sends only security logs to the log host.\n-"
        },
        {
            "Parameters": "domain domain-name",
            "Info": "Specifies the DNS domain name of a log host.\nThe value is a string of 1 to 255 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] info-center loghost domain www.huawei.com vpn-instance vrf1",
            "Warning: There is security risk as this operation enables a non secure syslog protocol."
        ],
        [
            "<HUAWEI> system-view",
            "Enter system view, return user view with return command.",
            "[~HUAWEI] info-center loghost 2.2.2.2 level critical",
            "Warning: The configured loghost level does not take effect on security logs.",
            "[~HUAWEI] info-center loghost domain www.huawei.com level critical",
            "Warning: The configured loghost level does not take effect on security logs."
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure a device to output logs to a syslog server, run the info-center loghost command. The system logs information about device operations in real time. These logs can be output to the syslog servers for storage and query. If a problem occurs, you can check the logs to learn about what happened to the device during device operation and analyze fault causes.\nPrerequisites\nInformation management has been enabled using info-center enable, and the IP address of a syslog server is reachable.\nConfiguration Impact\nLogs record information about users' operations on an existing device (such as command configuration operation) and specific events (such as a network connection failure). After the info-center loghost command is run, an existing device outputs generated logs to the specified syslog server.\nPrecautions\nRules for a single host to select a VPN\nRule 1: If the info-center loghost command is run with vpn-instance specified, the specified VPN is used as the host's VPN. Otherwise, refer to rule 2.Rule 2: If the set net-manager vpn-instance command is run to configure a global VPN, the global VPN is used as the host's VPN. Otherwise, refer to rule 3.Rule 3: The public network is used to send logs."
}