{
    "PageTitle": "info-center max-debugfile-number (System view)",
    "FuncDef": "The info-center max-debugfile-number command configures the maximum number of debugging log files that can be saved to the log directory.\nThe undo info-center max-debugfile-number command restores the default configuration.\nBy default, a maximum of 15 debugging log files can be saved to the log directory.",
    "CLIs": [
        "info-center max-debugfile-number <max-debugfile-number>",
        "undo info-center max-debugfile-number [ max-debugfile-number ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "max-debugfile-number",
            "Info": "Specifies the maximum number of debugging log files that can be saved to the log directory.\nThe value is an integer ranging from 1 to 50."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] info-center max-debugfile-number 50"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe debug.log file that is generated by default is compressed into a debug_*.log.zip file when its size exceeds 8 MB. To configure the maximum number of debugging log files that can be saved to the log directory, run the info-center max-debugfile-number command. When the number of compressed log files exceeds the maximum number configured, the system deletes earliest log files.\nConfiguration Impact\nAfter you configure the maximum number of debugging log files that can be saved to the log directory, the system deletes earliest log files to ensure that the number of compressed log files is less than or equal to the maximum number configured.\nPrecautions\nStoring more than 15 log files in the log directory deteriorates system performance. You need to configure the maximum number of debugging log files that can be saved as needed. Excessive log files can be deleted either manually or automatically. If the system automatically deletes excessive log files, CPU usage may increase within a short period.\nIn VS mode, this command is supported only by the admin VS."
}