{
    "PageTitle": "info-center source channel",
    "FuncDef": "The info-center source channel command sets rules for outputting information through information channels.\nThe undo info-center source channel command deletes the rules for outputting information through information channels.\n\nFor a specified module by default:\n\n\nLogs: The state is on, and the permitted log level is warning.\n\nTraps: The state is on, and the permitted log level is debugging.\n\nDebugging information: The state is off.",
    "CLIs": [
        "info-center source { <module-name> | default } channel { <channel-number> | <channel-name> } [ log { state { off | on } | level <severitylog> } * | trap { state { off | on } | level <severitytrap> } * | debug { state { off | on } | level <severitydbg> } * ] *",
        "undo info-center source { <module-name> | default } channel { <channel-number> | <channel-name> } [ log { state | level } * | trap { state | level } * | debug { state | level } * ] *"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "module-name",
            "Info": "Specifies the name of a module.\nYou can query all the currently supported modules in Log Reference. In this manual, the log format is simplified as module name/log severity/information keyword, such as INFO/4/FILE_DELETE. (INFO indicates the module name.).\nThe value is a string of 1 to 31 case-insensitive characters, spaces not supported."
        },
        {
            "Parameters": "default",
            "Info": "Sets default information records.\n-"
        },
        {
            "Parameters": "channel-number",
            "Info": "Specifies the number of the channel to be set.\nThe value is an integer ranging from 0 to 9."
        },
        {
            "Parameters": "channel-name",
            "Info": "Specifies the name of the channel to be set.\nThe value is a string of 1 to 30 case-insensitive characters. The name cannot contain spaces or special characters, such as hyphens (-), slashes (/), or backslashes (\\)."
        },
        {
            "Parameters": "log",
            "Info": "Indicates logs.\n-"
        },
        {
            "Parameters": "state",
            "Info": "Indicates the state of logs.\n-"
        },
        {
            "Parameters": "off",
            "Info": "Disables logs.\n-"
        },
        {
            "Parameters": "on",
            "Info": "Enables logs.\n-"
        },
        {
            "Parameters": "level severitytrap",
            "Info": "Specifies the severity of the trap information.\nInformation management classifies information by severity or urgency into eight levels:\nemergenciesalertcriticalerrorwarningnotificationinformationaldebugging"
        },
        {
            "Parameters": "level severitydbg",
            "Info": "Specifies the severity of the dbg information.\nInformation management classifies information by severity or urgency into eight levels:\nemergenciesalertcriticalerrorwarningnotificationinformationaldebugging"
        },
        {
            "Parameters": "level severitylog",
            "Info": "Specifies the severity of the log information.\nInformation management classifies information by severity or urgency into eight levels:\nemergenciesalertcriticalerrorwarningnotificationinformationaldebugging"
        },
        {
            "Parameters": "trap",
            "Info": "Indicates traps.\n-"
        },
        {
            "Parameters": "debug",
            "Info": "Indicates debugging information.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] info-center source cli channel snmp log level emergencies"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA default record for each information channel exists. The module name is default, and the module ID is 0xffffffff. The default settings of this record for logs, traps, and debugging information may vary according to information channels. When there is no explicit configuration record for a module in a channel, the default record is used.\nAll logs about command line operations are generated by the IM module. For example, if you run the info-center source IM channel loghost log level informational trap state off debug state off command, information management does not record the logs of information or higher levels generated by any module in the loghost direction. If you run the info-center source im channel loghost log level debugging state on trap state off debug state off command subsequently, information management records the logs of the IM module in the loghost direction only.\nIf a module generates plenty of logs, traps, or debugging information in a short time, specify the following parameters to suppress them:\nlevel severity: adjusts the level of an information channel so that the information whose level is lower than the specified severity is filtered out.state off: disables all information sent by the specified module."
}