{
    "PageTitle": "info-center max-logfile-number",
    "FuncDef": "The info-center max-logfile-number command sets the maximum number of compressed information files to be stored.\nThe undo info-center max-logfile-number command restores the default maximum number of compressed information files to be stored.\nThe default maximum number varies with information file types. The default maximum number is 200 for common log files.",
    "CLIs": [
        "info-center max-logfile-number [ security ] <filenumbers>",
        "undo info-center max-logfile-number [ security ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "security",
            "Info": "Indicates security log files.\n-"
        },
        {
            "Parameters": "filenumbers",
            "Info": "Specifies the maximum number of compressed information files to be stored.\nThe value is an integer ranging from 3 to 500."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] info-center max-logfile-number 100"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe total number of compressed files must be limited in the following cases:\nAn increasing number of compressed files are generated as system actions are taken during system operations, and the excessive compressed files on a device consume plenty of disk space resources.Users want to view only the latest compressed files.\n\nPrecautions\nTo set the maximum number of compressed files that can be stored on a device, run the info-center max-logfile-number command. When the number of compressed files generated in the system exceeds the maximum number that you have configured, the system deletes old compressed files and keeps only a number of compressed files less than or equal to the configured maximum value.\nIf the number of stored compressed files is greater than the default value, system performance is much affected. Therefore, set the maximum value properly as needed. If plenty of compressed files exist, manually delete some of them or wait for the system to automatically delete them when the existing number exceeds the configured maximum value. If you do not manually delete them, CPU usage increases in a short period of time."
}