{
    "PageTitle": "info-center filter-id",
    "FuncDef": "The info-center filter-id command enables the filtering of specified logs or traps.\nThe undo info-center filter-id command disables the filtering of specified logs or traps.\nLogs and traps are not filtered out by default.",
    "CLIs": [
        "info-center filter-id { { filter-id | bymodule-alias <pModName> <pLogName> } bynumber <packetNum> }",
        "info-center filter-id { { filter-id | bymodule-alias <pModName> <pLogName> } bytime <time> }"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "filter-id",
            "Info": "Specifies the ID of logs or traps to be filtered out.This parameter indicates the ID of a log or trap. If this parameter fails to be configured, the log or trap specified by this ID does not exist.\nThe value is an integer ranging from 0 to 4294967295."
        },
        {
            "Parameters": "bymodule-alias pModName",
            "Info": "Specifies the module name of logs or traps to be filtered out.You are advised to use the module name and alias for filtering. The modname value can be obtained by running the display configuration data running table-data ModuleInfo command in the diagnostic view.\nThe value is a string of 1 to 255 case-insensitive characters, spaces not supported."
        },
        {
            "Parameters": "pLogName",
            "Info": "Specifies the alias name of logs or traps to be filtered out.You are advised to use the module name and alias for filtering. The alias value can be displayed after you enter a module name.\nThe value is a string of 1 to 63 case-insensitive characters, spaces not supported."
        },
        {
            "Parameters": "bynumber packetNum",
            "Info": "Specifies number of logs or traps to be filtered out.\nThe value is an integer ranging from 0 to 4294967295."
        },
        {
            "Parameters": "bytime time",
            "Info": "Specifies the time of logs or traps to be filtered out.\nThe value is an integer ranging from 0 to 4294967295."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] info-center filter-id bymodule-alias snmp snmp_mib_set bynumber 100"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf logs or traps with the same ID are repeatedly generated, other logs or traps cannot be recorded. To filter out logs or traps of the specified ID, run the info-center filter-id command. Then logs or traps of the specified ID will not be generated and output to a destination.\nConfiguration Impact\nInformation about the filtered log or trap will be lost.\nPrecautions\nTo add multiple IDs at a time, use a space to separate IDs. The result of each ID is displayed.The system prompts a message when the same ID or alias name is specified repeatedly.If the ID of a log or trap is not registered or the alias name does not exist, the system displays a message indicating that the log or trap is failed to be filtered out.When 50 log IDs have been specified in this command, adding more log IDs is prohibited, and a message is displayed, indicating that the filtering list is full. In this case, you must delete previous IDs before adding new ones.Security logs do not support filtering. This command does not take effect on security logs and an error message is displayed."
}