{
    "PageTitle": "info-center logfile channel",
    "FuncDef": "The info-center logfile channel command configures a channel through which logs are output to a log file.\nThe undo info-center logfile channel command restores the default settings.\nBy default, channel number is 9 and channel name is channel9.",
    "CLIs": [
        "info-center logfile channel { <channel-number> | <channel-name> }",
        "undo info-center logfile channel"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "channel-number",
            "Info": "Specifies the channel number.\nThe value is an integer ranging from 0 to 9, indicating that the system has 10 channels.\nBy default, a device outputs information to various destinations through channels listed in the following table.\nchannel number:0, channel name:console, output destination:console.channel number:1, channel name:monitor, output destination:remote terminal.channel number:2, channel name:loghost, output destination:syslog server.channel number:3, channel name:trapbuffer, output destination:trap buffer.channel number:4, channel name:logbuffer, output destination:log buffer.channel number:5, channel name:snmpagent, output destination:SNMP agent.channel number:6, channel name:channel6, output destination:unspecified.channel number:7, channel name:channel7, output destination:unspecified.channel number:8, channel name:channel8, output destination:unspecified.channel number:9, channel name:channel9, output destination:unspecified."
        },
        {
            "Parameters": "channel-name",
            "Info": "Specifies the name of a channel, which can be the default channel name or a user-defined name.\nThe value is a string of 1 to 30 characters. The first character can be a letter only. The name cannot contain spaces or special characters, such as hyphens (-), slashes (/), or backslashes (\\)."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] info-center logfile channel logbuffer"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo output the same information to destinations or output information from multiple channels to the same destination, run the info-center command to modify configurations about information channels. The following requirements can be met:\nOutputting the same information to destinations. For example, the information recorded by information files and the syslog server can be identical with that recorded by the trap buffer and the SNMP agent.Outputting information through each channel to a specific syslog server. For example, information can be output through channel 7 to a syslog server with IP address 192.168.0.1, but through channel 8 to a syslog server with IP address 192.168.0.2."
}