{
    "PageTitle": "info-center log-severity",
    "FuncDef": "The info-center log-severity command sets the severity of log messages.\nThe undo info-center log-severity command restores the default severity of log messages.\nBy default, the log buffer records log messages of levels 0 through 4.",
    "CLIs": [
        "info-center log-severity bymodule-alias <module-name> <logname> severity <log-level>",
        "undo info-center log-severity bymodule-alias <module-name> <logname> severity"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "logname",
            "Info": "Specifies a log name.\nThe value is a string of 1 to 63 case-insensitive characters, spaces not supported."
        },
        {
            "Parameters": "severity log-level",
            "Info": "Specifies the severity string of log messages.\nThe value is of the enumerated type.\nemergencies: mapped to 0. An error of the urgency level occurs.alert: mapped to 1. An error needs to be corrected immediately.critical: mapped to 2. A serious error occurs.error: mapped to 3. An error occurs.warning: mapped to 4. An error may occur.notification: mapped to 5. An event to be noticed occurs.informational mapped to 6. An event occurs, and no action is required.debugging: mapped to 7. Debugging information is displayed."
        },
        {
            "Parameters": "bymodule-alias module-name",
            "Info": "Specifies the name of a module that generates log messages.\nThe value is a string of 1 to 63 case-insensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] info-center log-severity bymodule-alias cli cmdrecord severity error"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe log buffer records log messages of levels 0 through 4 by default. You can run the\ninfo-center log-severity command to set the log severity as needed:\nSet the severity of log messages to a value ranging 5 through 7 so that the log buffer does not record these log messages.Set the severity of log messages to a value ranging 0 through 4 so that the log buffer records these log messages."
}