{
    "PageTitle": "display logbuffer",
    "FuncDef": "The display logbuffer command displays logs in a log buffer.",
    "CLIs": [
        "display logbuffer [ security ] [ slot <slot-id> | module <module-name> | starttime <starttime-value> [ endtime <endtime-value> ] | level { <severity> | <severityEnum> } | size <value> ] *"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "security",
            "Info": "Indicates the log type as the security log.\n-"
        },
        {
            "Parameters": "slot slot-id",
            "Info": "Specifies the slot number of logs to be displayed.\nThe value is a string of 1 to 23 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "module module-name",
            "Info": "Specifies a module name.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "starttime starttime-value",
            "Info": "Displays logs recorded from the specified start time.\nThe value is in the format of YYYY/MM/DD,HH:MM:SS.\nYYYY-MM-DD indicates the year/month/day. The value of YYYY ranges from 1970 to 9999; the value of MM ranges from 1 to 12; the value of DD ranges from 1 to 31.HH:MM:SS indicates the hour:minute:second. The value of HH ranges from 0 to 23; the value of MM and SS ranges from 0 to 59."
        },
        {
            "Parameters": "endtime endtime-value",
            "Info": "Displays logs recorded by the specified end time.\nThe value is in the format of YYYY/MM/DD,HH:MM:SS.\nYYYY-MM-DD indicates the year/month/day. The value of YYYY ranges from 1970 to 9999; the value of MM ranges from 1 to 12; the value of DD ranges from 1 to 31.HH:MM:SS indicates the hour:minute:second. The value of HH ranges from 0 to 23; the value of MM and SS ranges from 0 to 59."
        },
        {
            "Parameters": "level severity",
            "Info": "Displays logs based on severities.\nThe value is an integer ranging from 0 to 7.\n0: emergencies: an error of urgency level1: alert: an error that needs to be corrected immediately2: critical: a major error3: error: a minor error4: warning: a potential error5: notification: information that should be noticed6: informational: an informational message7: debugging: a debugging message"
        },
        {
            "Parameters": "severityEnum",
            "Info": "Displays logs based severity.\n0: emergencies: an error of urgency level1: alert: an error that needs to be corrected immediately2: critical: a major error3: error: a minor error4: warning: a potential error5: notification: information that should be noticed6: informational: an informational message7: debugging: a debugging message"
        },
        {
            "Parameters": "size value",
            "Info": "Specifies the number of logs to be displayed.\nThe value is an integer ranging from 1 to 10240."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display logbuffer level 4",
            "Logging buffer configuration and contents : enabled",
            "Allowed max buffer size : 10240",
            "Actual buffer size : 512",
            "Channel number : 4, Channel name : logbuffer",
            "Dropped messages : 0",
            "Overwritten messages : 0",
            "Current messages : 372   ",
            "",
            "Apr 23 2020 09:37:53 R27 %%01ISIS/4/ISIS_LDP_SYNC_EVENT(l):CID=0x808604c5;Interface LoopBack0 received LDP event UndoInterfaceIpv4Family, LDP synchronization state Init change to Init(IsisSysInstance=17)."
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo display logs in a log buffer, run the display logbuffer command.\nThe number of logs to be displayed using the display logbuffer command is determined by the number specified using the info-center logbuffer command. If the number of logs in the log buffer is less than that specified using value, all existing logs are displayed.\nThe display logbuffer command can display event logs and logs of other types. For information about event logs and logs of other types, see Log Reference. If a log is mapped to an \"event trap OID\", the log is an event log paired with an event trap. Event logs and the paired event traps have the same contents, and event logs can be queried based on the event trap OIDs.\nPrecautions\nThe log buffer records log messages of levels 0 through 4 by default. You can run the\ninfo-center log-severity command to set the log severity as needed:\nSet the severity of log messages to a value ranging 5 through 7 so that the log buffer does not record these log messages.Set the severity of log messages to a value ranging 0 through 4 so that the log buffer records these log messages.\nIf there are a large number of logs on the device, running the display logbuffer command to display logs based on the start time, end time, log severity, and number of logs to be displayed is recommended. Otherwise, the following problems may occur due to excessive logs:\nThe displayed information is repeatedly refreshed, causing desired information unable to be located.The system does not respond because of long-time information traversing and searching."
}