{
    "PageTitle": "terminal monitor",
    "FuncDef": "The terminal monitor command enables the display of logs, traps, alarm, and debugging information output by information management on the command line terminal.\nThe undo terminal monitor command disables the display of logs, traps, alarm, and debugging information output by information management on the command line terminal.\nThe function of displaying the preceding information is enabled by default for console users and disabled by default for terminal users.",
    "CLIs": [
        "terminal monitor",
        "undo terminal monitor"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> terminal monitor"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo enable the display of logs, traps, and debugging information output by information management on the command line terminal, run the terminal monitor command.\nAfter running the terminal monitor command, perform one of the following operations as needed:\nTo enable the display of log information on the local terminal, run the terminal logging command.To disable the display of log information on the local terminal, run the undo terminal logging command.To enable the display of debugging information on the local terminal, run the terminal debugging command.To disable the display of debugging information on the local terminal, run the undo terminal debugging command.To enable the display of alarm information on the local terminal, run the terminal alarm command.To disable the display of alarm information on the local terminal, run the undo terminal alarm command.To enable the display of traps information on the local terminal, run the terminal trapping command.To disable the display of traps information on the local terminal, run the undo terminal trapping command.\nRunning the undo terminal monitor command is equivalent to running commands undo terminal debugging, undo terminal logging, undo terminal trapping and undo terminal alarm. Then logs, traps, or debugging information are not displayed on the local terminal.\nBy default, terminal debugging is disabled, terminal logging, terminal alarm and terminal trapping is enable."
}