{
    "PageTitle": "bfd bind ldp-lsp",
    "FuncDef": "The bfd bind ldp-lsp command creates a bidirectional forwarding detection (BFD) session for detecting faults in an LDP LSP.\nBy default, no BFD session is created to detect faults in an LDP LSP.",
    "CLIs": [
        "bfd <session-name> bind ldp-lsp peer-ip <ip-address> nexthop <ip-address> [ interface { <interface-name> | <iiftnlType> <iifNum> } ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "session-name",
            "Info": "Specifies the BFD configuration name.\nThe value is a string of 1 to 64 characters, spaces not supported. When quotation marks are used around the string, spaces are allowed in the string.\nWhen the name of a BFD session is configured, the uppercase and lowercase letters in the name must be the same as what you enter.BFD session names are case-insensitive. For example, ABC and abc are regarded as the same BFD session. If you have configured ABC as the name of a BFD session, the ABC BFD session view is directly displayed when you configure abc."
        },
        {
            "Parameters": "peer-ip ip-address",
            "Info": "Specifies the LSR ID of the egress on a dynamic LSP to which a BFD session is bound.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "nexthop ip-address",
            "Info": "Specifies the next-hop IP address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "interface iiftnlType interface-number",
            "Info": "Specifies the outbound interface to which a BFD session is bound.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bfd",
            "[*HUAWEI-bfd] quit",
            "[*HUAWEI] bfd 1to4 bind ldp-lsp peer-ip 4.4.4.4 nexthop 10.1.1.2 interface GigabitEthernet 1/0/0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter a BFD session is established for an LDP LSP, the BFD mechanism rapidly detects LDP LSP faults to provide E2E protection.\nPrecautions\nThe bfd bind ldp-lsp command can only be run on The ingress of an LSP.If The IP address of The outbound interface on The monitored lsp is lent or borrowed, The outbound interface type and number must be specified.If an ldp lsp is deleted but The ldp session for The lsp is not deleted, The bfd session bound to The ldp session goes Down but is not deleted.After an ldp session is deleted, The system deletes configurations of The bfd session bound to The ldp session.The undo bfd sessname-value command deletes a created BFD session."
}