{
    "PageTitle": "mpls ldp timer igp-sync-delay",
    "FuncDef": "The mpls ldp timer igp-sync-delay command sets the interval during which an LSP is being set up after an LDP session is created.\nThe undo mpls ldp timer igp-sync-delay command restores the default interval.\nThe default interval is 10 seconds.\nIf the igp-sync-delay timer command is run in the MPLS-LDP view to change the default value, the default value configured in the remote MPLS-LDP peer view is also changed to the updated value in the MPLS-LDP view.\nIf the mpls ldp timer igp-sync-delay command is not run in the remote MPLS-LDP peer view, the display this command does not display the default value. If the mpls ldp timer igp-sync-delay command is run in the remote MPLS-LDP peer view, the display this command displays the existing setting, no matter whether the default value is used.\nThe default interval is 10 seconds.",
    "CLIs": [
        "mpls ldp timer igp-sync-delay <value>",
        "undo mpls ldp timer igp-sync-delay"
    ],
    "ParentView": [
        "Remote MPLS LDP peer view"
    ],
    "ParaDef": [
        {
            "Parameters": "value",
            "Info": "Specifies the interval, during which an LSP is being set up after an LDP session is created.\nThe value is an integer ranging from 0 to 65535, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls ldp",
            "[*HUAWEI-mpls-ldp] quit",
            "[*HUAWEI] mpls ldp remote-peer rta",
            "[*HUAWEI--mpls-ldp-remote-rta] mpls ldp timer igp-sync-delay 15"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter an LDP session is reestablished on a faulty link, LDP starts the igp-sync-delay timer to wait for the establishment of an LSP. To set the igp-sync-delay timer value, run the mpls ldp timer igp-sync-delay command.\nAfter the igp-sync-delay timer times out, LDP informs the IGP that synchronization is complete."
}