{
    "PageTitle": "bit-error-detection level threshold",
    "FuncDef": "The bit-error-detection level threshold command sets the level for the bit error rate threshold.\nThe undo bit-error-detection level command deletes the level for the bit error rate threshold.\nNo level for the bit error rate threshold is set by default.",
    "CLIs": [
        "bit-error-detection level <level-number> threshold switch <switch-coe> <switch-pow> resume <resume-coe> <resume-pow>",
        "undo bit-error-detection level <level-number>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "level-number",
            "Info": "Specifies the level for the bit error rate threshold.\nThe value is an integer ranging from 1 to 3."
        },
        {
            "Parameters": "switch",
            "Info": "Specifies a bit error rate threshold for triggering a service switchover.\nSwitchover threshold = switch-coe x 10-switch-pow.\nThe switch-coe parameter specifies the protection switchover coefficient, and the switch-pow parameter specifies the protection switchover power.\n-"
        },
        {
            "Parameters": "switch-coe",
            "Info": "The switch-coe parameter specifies the protection switchover coefficient.\nThe value is an integer ranging from 1 to 9."
        },
        {
            "Parameters": "switch-pow",
            "Info": "The switch-coe parameter specifies the protection switchover power.\nThe value is an integer ranging from 1 to 7."
        },
        {
            "Parameters": "resume",
            "Info": "Specifies a bit error rate threshold for triggering a service switchback. Switchback threshold = resume-coe x 10-resume-pow.\nThe switchback threshold must be less than or equal to the switchover threshold.\n-"
        },
        {
            "Parameters": "resume-coe",
            "Info": "The resume-coe parameter specifies the protection switchback coefficient.\nThe value is an integer ranging from 1 to 9."
        },
        {
            "Parameters": "resume-pow",
            "Info": "The resume-pow parameter specifies the protection switchback power.\nThe value is an integer ranging from 1 to 7."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bit-error-detection level 1 threshold switch 8 2 resume 4 2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn a bit error detection or bit error-triggered switching scenario, to control bit error sensitivity in an attempt to more efficiently control the bit error-triggered switching, run the bit-error-detection level command to set the switchover and switchback thresholds.\nThe configured thresholds can be used in multiple bit error detection techniques, for example, LDP bit error detection."
}