{
    "PageTitle": "mpls ldp timer keepalive-send (Interface view)",
    "FuncDef": "The mpls ldp timer keepalive-send command sets the value of the Keepalive send timer.\nThe undo mpls ldp timer keepalive-send command restores the default value of the Keepalive send timer.\nBy default, the value of the Keepalive send timer is one third of the Keepalive hold timer value.",
    "CLIs": [
        "mpls ldp timer keepalive-send <interval>",
        "undo mpls ldp timer keepalive-send"
    ],
    "ParentView": [
        "FlexE interface view",
        "XGE interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "100GE interface view",
        "GE electrical interface view",
        "VLANIF interface view",
        "50GE interface view",
        "GMPLS-UNI interface view",
        "400GE interface view",
        "10GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Eth-Trunk interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "interval",
            "Info": "Specifies the value of the Keepalive send timer.\nThe value is an integer ranging from 1 to 65535, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls ldp",
            "[*HUAWEI-mpls-ldp] quit",
            "[*HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] mpls",
            "[*HUAWEI-GigabitEthernet1/0/0] mpls ldp",
            "[*HUAWEI-GigabitEthernet1/0/0] mpls ldp timer keepalive-send 20"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter an LDP session is established, the LSRs on the two ends of the LDP session start the Keepalive send timer and periodically send Keepalive packets to maintain the LDP session.\nThe default value of the timer is recommended. On a network that is not in good situation, you can reduce the value of the Keepalive send timer properly. This enables the network to recover as soon as possible if a fault occurs.\nThere are two types of Keepalive send timers:\nKeepalive send timer of the local LDP session: used to control the interval at which Keepalive packets are sent to the peer end of the local session. You can run the mpls ldp timer keepalive-send command in the interface view to set the timer value.Keepalive send timer of the remote LDP session: used to control the interval at which Keepalive packets are sent to the peer end of the remote session. You can run the mpls ldp timer keepalive-send command in the remote MPLS LDP peer view to set the timer value.\nIf the Keepalive send timer value is greater than one third of the Keepalive hold timer value, the Keepalive send timer value that actually takes effect is equal to one third of the Keepalive hold timer value.\n\nPrerequisites\nMPLS LDP must be enabled on the associated interface.\nConfiguration Impact\nThe Keepalive send timer value that actually takes effect is not necessarily the same as the set value. If the Keepalive send timer value is greater than one third of the Keepalive hold timer value, the Keepalive send timer value that actually takes effect is equal to one third of the Keepalive hold timer value."
}