{
    "PageTitle": "mpls bfd-tunnel",
    "FuncDef": "The mpls bfd-tunnel command sets dynamic BFD for tunnel parameters.\nThe undo mpls bfd-tunnel command deletes dynamic BFD for tunnel parameters.\nBy default, the minimum interval at which BFD packets are sent is 10 ms, the minimum interval at which BFD packets are received is 10 ms, the local BFD detection multiplier is 3.",
    "CLIs": [
        "mpls bfd-tunnel { min-tx-interval <min-tx-interval-value> | min-rx-interval <min-rx-interval-value> | detect-multiplier <detect-multiplier-value> } *",
        "undo mpls bfd-tunnel { min-tx-interval | min-rx-interval | detect-multiplier } *"
    ],
    "ParentView": [
        "MPLS view"
    ],
    "ParaDef": [
        {
            "Parameters": "min-tx-interval min-tx-interval-value",
            "Info": "Specifies the minimum interval at which BFD packets are sent.\nThe value is an integer ranging from 3 to 20000, in milliseconds."
        },
        {
            "Parameters": "min-rx-interval min-rx-interval-value",
            "Info": "Specifies the minimum interval at which BFD packets are received.\nThe value is an integer ranging from 3 to 20000, in milliseconds."
        },
        {
            "Parameters": "detect-multiplier detect-multiplier-value",
            "Info": "Specifies a local BFD detection multiplier.\nThe value is an integer ranging from 3 to 50."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls bfd-tunnel min-tx-interval 200"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo set BFD for tunnel parameters, run the\nmpls bfd-tunnel command. The parameters include the minimum interval at which BFD packets are sent, the minimum interval at which BFD packets are received, and the BFD detection multiplier.\nEffective local interval at which BFD packets are sent = MAX { Locally configured interval at which BFD packets are sent, Remotely configured interval at which BFD packets are received }Effective local interval at which BFD packets are received = MAX { Remotely configured interval at which BFD packets are sent, Locally configured interval at which BFD packets are received }Local BFD detection period = Effective local interval at which BFD packets are received x Remotely configured BFD detection multiplier\nThe detection multiplier is the maximum number of BFD packets dropped consecutively before a BFD peer is declared Down.\n\nPrerequisites\nThe MPLS view has been displayed using the mpls command.\nPrecautions\nIf both the mpls bfd-tunnel and mpls bfd commands are run, parameters configured using the mpls bfd-tunnel command take precedence."
}