{
    "PageTitle": "static-lsp egress",
    "FuncDef": "The static-lsp egress command configures the egress of a static LSP.\nThe undo static-lsp egress command deletes the configuration.\nBy default, no egress of a static CR-LSP is configured.",
    "CLIs": [
        "static-lsp egress <lsp-name> [ incoming-interface { <in-interface-name> | { <in-interface-type> <in-interface-number> } } ] in-label <in-label>",
        "undo static-lsp egress <lsp-name>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "lsp-name",
            "Info": "Specifies the name of a static LSP.\nThe value is a string of 1 to 19 case-sensitive characters. It cannot contain spaces. The string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "incoming-interface",
            "Info": "Indicates an inbound interface.\n-"
        },
        {
            "Parameters": "in-interface-name",
            "Info": "Specifies the name of an inbound interface.\n-"
        },
        {
            "Parameters": "in-interface-type in-interface-number",
            "Info": "Specifies the type and number of an inbound interface.\n-"
        },
        {
            "Parameters": "in-label in-label",
            "Info": "Specifies the value of an incoming label.\nThe value is an integer ranging from 16 to 1048575."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] static-lsp egress bj-sh incoming-interface GigabitEthernet1/0/0 in-label 233"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe establishment of static LSPs does not require a label distribution protocol or any control packets. The static LSPs consume a few resources and are applicable to small-scale networks with simple and stable topology. To configure the egress of a static LSP, run the static-lsp egress command.\nTo modify the inbound interface name or incoming label value, run the static-lsp egress command to set a new value, but there is no need to run the undo static-lsp egress command before changing a setting."
}