{
    "PageTitle": "outbound peer all split-horizon",
    "FuncDef": "The outbound peer all split-horizon command enables LDP split horizon to restrain an LSR from distributing labels to all downstream LDP peers.\nThe undo outbound peer all split-horizon command disables LDP split horizon.\nBy default, LDP split horizon is disabled. An LSR distributes labels to both upstream and downstream LDP peers.",
    "CLIs": [
        "outbound peer all split-horizon",
        "undo outbound peer all split-horizon"
    ],
    "ParentView": [
        "MPLS-LDP view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls ldp",
            "[*HUAWEI-mpls-ldp] outbound peer all split-horizon"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAn LSR usually distributes labels to both upstream and downstream LDP peers, speeding up LDP LSP convergence. On DSLAMs with low performance deployed on an MPLS network, LDP distributes labels to all LDP peers, which leads to the establishment of a large number of LSPs and exposes a heavy burden on the DSLAMs. To help reduce the number of LSPs and save memory, run the outbound peer all split-horizon command on LSRs to configure split horizon.\nPrerequisites\nMPLS LDP has been enabled globally using the mpls ldp command in the system view.\nConfiguration Impact\nAfter the outbound peer split-horizon command is run, either of the following situations occurs:\nIf LDP sessions have been established, the local LSR withdraws labels distributed to a specified or all downstream LDP peers.If LDP sessions are being established, the local LSR does not distribute labels to a specified or all downstream LDP peers.\n\nPrecautions\nThe all parameter takes preference over the peer-id parameter. For example, the outbound peer all split-horizon and then outbound peer 2.2.2.2 split-horizon commands are run, the outbound peer all split-horizon command can be saved in the configuration file and take effect, not the outbound peer 2.2.2.2 split-horizon command."
}