{
    "PageTitle": "mpls bfd-option-tlv ip-prefix",
    "FuncDef": "The mpls bfd-option-tlv ip-prefix command sets an IP prefix list that is used to trigger the establishment of LDP BFD sessions working in compatible mode.\nThe undo mpls bfd-option-tlv command deletes an IP prefix list that is used to trigger the establishment of LDP BFD sessions working in compatible mode.\nBy default, no IP prefix list is configured to trigger the establishment of LDP BFD sessions working in compatible mode.",
    "CLIs": [
        "mpls bfd-option-tlv ip-prefix <ip-prefix-name>",
        "undo mpls bfd-option-tlv"
    ],
    "ParentView": [
        "MPLS view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-prefix-name",
            "Info": "Specifies the name of an IP prefix list used to trigger the establishment of LDP BFD sessions working in compatible mode.\nThe value is a string of 1 to 169 case-insensitive characters. It cannot contain spaces."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip ip-prefix 1 permit 0.0.0.0 0 greater-equal 17 less-equal 18",
            "[*HUAWEI] bfd",
            "[*HUAWEI-bfd] mpls",
            "[*HUAWEI-mpls] mpls bfd-trigger host",
            "[*HUAWEI-mpls] mpls bfd-option-tlv ip-prefix 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf LDP BFD is configured to working in compatible mode on a Huawei device, the device sends BFD packets carrying the Option field in the IP header to communicate with a non-Huawei device. To communicate with a specified range of non-Huawei devices that match a specified IP prefix list, run the mpls bfd-option-tlv ip-prefix command to set an IP prefix list used to trigger the establishment of LDP BFD sessions working in compatible mode.\nPrerequisites\nBFD has been enabled using the bfd command, and MPLS has been enabled using the mpls command.\nFollow-up Procedure\nConfigure parameters used by a dynamic BFD session to monitor LDP LSPs.\nPrecautions\nIf the mpls bfd-trigger command has been run to configure the BFD compatible mode globally, the mpls bfd-option-tlv ip-prefix command does not take effect after being run."
}