{
    "PageTitle": "lsp-trigger bgp-label-route",
    "FuncDef": "The lsp-trigger bgp-label-route command enables LDP to allocate labels for labeled BGP public network routes with 32-bits mask-length.\nThe undo lsp-trigger bgp-label-route command restores the default configuration.\nBy default, LDP does not allocate labels for labeled BGP public network routes.",
    "CLIs": [
        "lsp-trigger bgp-label-route [ ip-prefix <ip-prefix-name> ]",
        "lsp-trigger bgp-label-route [ ip-prefix <ip-prefix-name> ] not-only-host",
        "undo lsp-trigger bgp-label-route"
    ],
    "ParentView": [
        "MPLS view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-prefix ip-prefix-name",
            "Info": "Specifies the name of an IP prefix list. An LDP LSP is established for the labeled BGP public network routes that are filtered based on the IP prefix list.\nThe name is a string of 1 to 169 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "not-only-host",
            "Info": "Enables LDP to allocate labels to labeled public network BGP routes with either 32-bit or non-32-bit masks. If not-only-host is not specified, LDP can allocate labels to labeled public network BGP routes with 32-bit masks only.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] lsp-trigger bgp-label-route"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] lsp-trigger bgp-label-route not-only-host"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBoth the lsp-trigger bgp-label-route and lsp-trigger commands can be used to configure policies to trigger the establishment of LDP LSPs. The first command is used for labeled BGP public network routes, and the second command is used for static routes and IGP routes.\nChanges to the LSP-triggering policy made during the LDP GR period do not take effect.\nPrecautions\nTo prevent LDP from allocating labels to a large number of unwanted labeled public network BGP routes, you are advised to specify an IP prefix list when running the command."
}