{
    "PageTitle": "remote-ip",
    "FuncDef": "The remote-ip command assigns an IP address to a remote LDP peer.\nThe undo remote-ip command deletes an IP address of a remote LDP peer.\nThe clear remote-ip pwe3 command deletes the explicit configuration of enabling or disabling the ability to distribute LDP labels to a specified remote LDP peer.\nBy default, no IP address is assigned to a remote LDP peer.",
    "CLIs": [
        "remote-ip <ip-address>",
        "clear remote-ip pwe3",
        "undo remote-ip"
    ],
    "ParentView": [
        "Remote MPLS LDP peer view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address",
            "Info": "Specifies the IPv4 address of a remote peer.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls ldp",
            "[*HUAWEI-mpls-ldp] quit",
            "[*HUAWEI] mpls ldp remote-peer BJI",
            "[*HUAWEI-mpls-ldp-remote-BJI] remote-ip 3.3.3.3"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls ldp",
            "[*HUAWEI-mpls-ldp] quit",
            "[*HUAWEI] mpls ldp remote-peer rtq",
            "[*HUAWEI-mpls-ldp-remote-rtq] remote-ip 10.1.1.9",
            "[*HUAWEI-mpls-ldp-remote-rtq] clear remote-ip pwe3"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter a remote LDP peer is configured, to assign an IP address to the remote LDP peer, you can run the remote-ip command in the remote MPLS LDP peer view.\nThe IP address must be the LSR ID of the remote LDP peer. When the LDP LSR ID and the MPLS LSR ID are different, the LDP LSR ID takes effect.\nThe remote peer uses the LSR ID as the transport address to create a TCP connection.\nPrerequisites\nRun the command mpls ldp remote-peer to configure remote LDP peer.\nConfiguration Impact\nAfter the clear remote-ip pwe3 command is run, whether a local end distributes labels to remote peers is determined by the remote-peer pwe3 command run in the MPLS-LDP view.\nPrecautions\nModifying or deleting the configured IP address of a remote peer leads to the deletion of a remote LDP session. Before the configured IP address of a remote peer is changed, the undo remote-ip command must be run to delete the existing configuration."
}