{
    "PageTitle": "label distribution control-mode",
    "FuncDef": "The label distribution control-mode command configures an LDP label distribution control mode.\nThe undo label-type command restores the default LDP label distribution control mode.\nThe default LDP label distribution control mode is ordered.\nThe default LDP label distribution control mode is ordered.",
    "CLIs": [
        "label distribution control-mode { ordered | independent }",
        "undo label distribution control-mode"
    ],
    "ParentView": [
        "MPLS-LDP view"
    ],
    "ParaDef": [
        {
            "Parameters": "ordered",
            "Info": "Sets the LDP label distribution control mode to ordered.\n-"
        },
        {
            "Parameters": "independent",
            "Info": "Sets the LDP label distribution control mode to independent.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls ldp",
            "[*HUAWEI-mpls-ldp] label distribution control-mode independent"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA label distribution control mode is a policy used by an LSR when it distributes labels during the setup of an LSP.\nEither of the following label distribution control modes can be used:\nIndependent\nAn LSR independently binds a label to a FEC and distributes this label to an upstream LSR, without waiting for a label assigned by a downstream LSR.\nIf the label distribution mode is DU and the distribution control mode is independent, an LSR directly distributes a label to its upstream LSR without waiting for a label assigned by a downstream LSR.If label distribution mode is DoD and the distribution control mode is independent, a local LSR distributes a label to its upstream LSR after the upstream LSR sends a label request. The local LSR does not need to wait for a label assigned by a downstream LSR.Ordered\nA local LSR advertises a mapping between a label and a FEC to its upstream LSR only when the local LSR is the outbound node for the FEC or when it receives a label mapping message associated with the next hop for the FEC.\nIf the label distribution mode is DU and the distribution control mode is ordered, a local LSR distributes a label to its upstream LSR only after the local LSR receives a Label Mapping message sent by a downstream LSR.If the label distribution mode is DoD and the distribution control mode is ordered, a local LSR distributes a label to its upstream LSR only after the local LSR receives a Label Mapping message sent by a downstream LSR.\nThe default LDP label distribution control mode (ordered) is recommended.\n\nPrerequisites\nMPLS LDP has been enabled globally using the mpls ldp command in the system view.\nPrecautions\nIf the label distribution control-mode command is run more than once, the latest configuration overrides the previous one."
}