{
    "PageTitle": "accept target-hello",
    "FuncDef": "The accept target-hello command enables a local device to automatically establish a remote LDP session with a remote LDP peer after the local device receives a Targeted Hello message sent by the remote LDP peer.\nThe undo accept target-hello command disables a local device from automatically establishing a remote LDP session with a remote LDP peer after the local device receives a Targeted Hello message sent by the remote LDP peer.\nBy default, a local device is disabled from automatically establishing a remote LDP session with a remote LDP peer after the local device receives a Targeted Hello message sent by the remote LDP peer.",
    "CLIs": [
        "accept target-hello peer-group ip-prefix <ip-prefix-name>",
        "accept target-hello all",
        "undo accept target-hello"
    ],
    "ParentView": [
        "MPLS-LDP view"
    ],
    "ParaDef": [
        {
            "Parameters": "all",
            "Info": "Enables a local device to establish remote LDP sessions based on all received Targeted Hello messages.\n-"
        },
        {
            "Parameters": "peer-group",
            "Info": "Specifies a peer group.\n-"
        },
        {
            "Parameters": "ip-prefix ip-prefix-name",
            "Info": "Enables a local device to establish remote LDP sessions based on Targeted Hello messages sent by LDP peers that meet a specified IP prefix list. The ip-prefix-name value is set using the ip ip-prefix command.\nThe value is a string of 1 to 169 case-sensitive characters. It cannot contain spaces. The string can contain spaces if it is enclosed with double quotation marks (\")."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] commit",
            "[~HUAWEI-mpls] quit",
            "[~HUAWEI] mpls ldp",
            "[*HUAWEI-mpls-ldp] accept target-hello all"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, two ends must be configured to establish a remote LDP session. In some scenarios, a local device needs to automatically establish remote LDP sessions with its peers. For example, in a Remote LFA FRR scenario, after an ingress uses the Remote LFA algorithm to calculate a PQ node, the ingress needs to run LDP to automatically establish a remote LDP session with the destination IP address set to the PQ node's IP address. To enable a device to implement this function, run the accept target-hello command.\nPrerequisites\nIf ip-prefix is to be used, an IP prefix list must have been created using the ip ip-prefix command."
}