{
    "PageTitle": "mpls ldp-lsp-number threshold-alarm",
    "FuncDef": "The mpls ldp-lsp-number threshold-alarm command configures the alarm threshold for LDP label switched path (LSP) usage.\nThe undo mpls ldp-lsp-number threshold-alarm command restores the default setting.\nThe default upper limit of the alarm threshold for LDP LSP usage is 80%. The default lower limit of the clear alarm threshold for LDP LSP usage is 75%.\nThe default upper limit of the alarm threshold for LDP LSP usage is 80%. The default lower limit of the clear alarm threshold for LDP LSP usage is 75%.",
    "CLIs": [
        "mpls ldp-lsp-number threshold-alarm upper-limit <upper-limit-value> lower-limit <lower-limit-value>",
        "undo mpls ldp-lsp-number threshold-alarm"
    ],
    "ParentView": [
        "MPLS view"
    ],
    "ParaDef": [
        {
            "Parameters": "lower-limit lower-limit-value",
            "Info": "Specifies the lower limit of the clear alarm threshold for LDP LSP usage.\nThe value is an integer ranging from 1 to 100, represented in percentage. The value must be smaller than the value of upper limit. Using the default value of 75 is recommended."
        },
        {
            "Parameters": "upper-limit upper-limit-value",
            "Info": "Specifies the upper limit of the alarm threshold for LDP LSP usage.\nThe value is an integer ranging from 1 to 100, represented in percentage. Using a value larger than 95 is not recommended. Using the default value of 80 is recommended."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[~HUAWEI-mpls] mpls ldp-lsp-number threshold-alarm upper-limit 90 lower-limit 60"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the number of LDP LSPs in the system reaches a specific limit, establishing additional LDP LSPs may fail because of insufficient resources. To facilitate user operation and maintenance, enable an alarm to be generated when the number of LDP LSPs reaches the specific limit. To configure the alarm threshold for LDP LSP usage, run the mpls ldp-lsp-number threshold-alarm command. The parameters in this command are described as follows:\nWhen the LDP LSP usage increases to upper-limit-value, an alarm for LDP LSPs is generated.When the LDP LSP usage falls below lower-limit-value, a clear alarm for LDP LSPs is generated.\n\nPrecautions\nIf the mpls ldp-lsp-number threshold-alarm command is run more than once, the latest configuration overrides the previous one.This command configures the alarm threshold for LDP LSP usage. The alarm that the number of LSPs reached the upper threshold is generated only when the command snmp-agent trap enable feature-name mpls_lspm trap-name hwmplslspthresholdexceed is configured, and the actual LDP LSP usage reaches the upper limit of the alarm threshold. The alarm that the number of LSPs fell below the lower threshold is generated only when the command snmp-agent trap enable feature-name mpls_lspm trap-name hwmplslspthresholdexceedclear is configured, and the actual LDP LSP usage falls below the lower limit of the clear alarm threshold."
}