{
    "PageTitle": "mpls mldp-tree-number threshold-alarm",
    "FuncDef": "The mpls mldp-tree-number threshold-alarm command sets the upper and lower alarm thresholds for the number of mLDP LSPs.\nThe undo mpls mldp-tree-number threshold-alarm command restores the default upper and lower alarm thresholds for the number of mLDP LSPs.\nBy default, the upper alarm threshold is 80%, and the lower alarm threshold is 75%.",
    "CLIs": [
        "mpls mldp-tree-number threshold-alarm upper-limit <upper-limit-value> lower-limit <lower-limit-value>",
        "undo mpls mldp-tree-number threshold-alarm"
    ],
    "ParentView": [
        "MPLS view"
    ],
    "ParaDef": [
        {
            "Parameters": "lower-limit lower-limit-value",
            "Info": "Specifies the lower alarm threshold for the number of mLDP LSPs.\nThe value is a percent integer ranging from 1 to 100."
        },
        {
            "Parameters": "upper-limit upper-limit-value",
            "Info": "Specifies the upper alarm threshold for the number of mLDP LSPs.\nThe value is a percent integer ranging from 1 to 100."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls mldp-tree-number threshold-alarm upper-limit 40 lower-limit 30"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the number of established mLDP LSPs reaches a specified upper limit, no more mLDP LSPs can be established due to a failure to apply for related resources. If the number of used mLDP LSP resources reaches a specified threshold, a device displays an alarm. To set the upper and lower alarm thresholds for the number of mLDP LSPs, run the mpls mldp-tree-number threshold-alarm command.\nIf mLDP LSP usage on a device reaches upper limit, an alarm is generated.If mLDP LSP usage on a device falls below lower limit, a clear alarm is generated.\n\nPrecautions\nIf the mpls mldp-tree-number threshold-alarm command is run more than once, the latest configuration overrides the previous one.The mpls mldp-tree-number threshold-alarm command only configures the trigger conditions for alarms and clear alarms. Although trigger conditions are met, an alarm and its clear alarm can be generated only after the snmp-agent trap enable feature-name command is run to enable the device to generate an MPLS resource insufficiency alarm and its clear alarm."
}