{
    "PageTitle": "mpls bfd",
    "FuncDef": "The mpls bfd command sets BFD parameters for monitoring LDP LSPs.\nThe undo mpls bfd command deletes BFD parameters.\nBy default, BFD sessions use default parameter values.",
    "CLIs": [
        "mpls bfd { min-tx-interval <min-tx-interval-value> | min-rx-interval <min-rx-interval-value> | detect-multiplier <detect-multiplier-value> } *",
        "undo mpls bfd { min-tx-interval | min-rx-interval | detect-multiplier } *"
    ],
    "ParentView": [
        "MPLS view"
    ],
    "ParaDef": [
        {
            "Parameters": "min-tx-interval min-tx-interval-value",
            "Info": "Specifies the minimum interval at which BFD packets are sent.\nThe value is an integer ranging from 3 to 20000, in milliseconds. The default value is 10."
        },
        {
            "Parameters": "min-rx-interval min-rx-interval-value",
            "Info": "Specifies the minimum interval at which BFD packets are received.\nThe value is an integer ranging from 3 to 20000, in milliseconds. The default value is 10."
        },
        {
            "Parameters": "detect-multiplier detect-multiplier-value",
            "Info": "Specifies a BFD detection multiplier.\nThe value is an integer ranging from 3 to 50. The default value is 3."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls bfd min-tx-interval 200",
            "[*HUAWEI-mpls] commit",
            "[~HUAWEI-mpls] quit"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo set BFD parameters, run the\nmpls bfd command. The parameters include the minimum interval at which BFD packets are sent, the minimum interval at which BFD packets are received, and BFD detection multiplier.\nEffective local interval at which BFD packets are sent = MAX { Locally configured interval at which BFD packets are sent, Remotely configured interval at which BFD packets are received }Effective local interval at which BFD packets are received = MAX { Remotely configured interval at which BFD packets are sent, Locally configured interval at which BFD packets are received }Local BFD detection period = Effective local interval at which BFD packets are received x Remotely configured BFD detection multiplierBy default, the minimum interval at which BFD packets are sent and the minimum interval at which BFD packets are received are 10 ms, and the detection multiplier is 3 on the ingress. By default, the minimum interval at which BFD packets are sent and the minimum interval at which BFD packets are received are 10 ms, and the detection multiplier is 3 on the egress.\nThe detection multiplier is the maximum number of BFD packets dropped before a BFD peer is declared Down.\n\nPrerequisites\nThe MPLS view is displayed using the mpls command."
}