{
    "PageTitle": "remote-peer pwe3",
    "FuncDef": "The remote-peer pwe3 command prevents an LSR from distributing labels to all remote peers for LDP services.\nThe undo remote-peer pwe3 command restores the default label distribution policy.\nThis command varies in transport and router modes. For detailed differences, see Differences Between Commands in Transport and Router Modes. This topic describes the command configuration in router mode.\nBy default, an LSR is permitted to distribute labels to all remote peers for LDP services.",
    "CLIs": [
        "remote-peer pwe3",
        "undo remote-peer pwe3"
    ],
    "ParentView": [
        "MPLS-LDP view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls ldp",
            "[*HUAWEI-mpls-ldp] remote-peer pwe3",
            "Warning: The operation will affect all the remote peers on which the attribute is not manually configured. Continue? [Y/N]: y"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen a remote LDP session transmits LDP services, you can run one of the following commands to prevent an LSR from distributing labels to a remote peer or all remote peers to save system resources. remote-peer pwe3: prevents an LSR from distributing labels to remote peers.\nSpecifically, after this function is configured, the device can still use LDP to distribute labels to L2VPN peers.\nPrerequisites\nMPLS and MPLS LDP have been enabled globally.\nProcedure\nAfter the remote-peer pwe3 command is run, a message is displayed to indicate that this command will take effect all remote LDP peers on which the attribute is not manually configured.\nWarning: The operation will affect all the remote peers on which the attribute is not manually configured. Continue? [Y/N]:\nTo confirm the configuration, enter y.\nImplementation Procedure\nAfter the remote-peer pwe3 command is run, a message is displayed to indicate that this command will take effect all remote LDP peers on which the attribute is not manually configured.\nWarning: The operation will affect all the remote peers on which the attribute is not manually configured. Continue? [Y/N]:\nTo confirm the configuration, enter y.\nConfiguration Impact\nThe remote-peer pwe3 command takes effect only on remote LDP peers that have no explicit label distribution configuration. That is, no pwe3 configuration exists or the clear remote-ip pwe3 command exists in the remote MPLS-LDP peer view.\nThe remote-peer pwe3 command does not take effect on remote LDP sessions established using the accept target-hello, remote-lfa (OSPF), or remote-lfa command.\nPrecautions\nRunning the remote-peer pwe3 command disables all remote LDP sessions from distributing labels to remote peers, except for the remote peers that have the explicit configuration of enabling label distribution. Exercise caution when performing this operation.\nThe remote-peer pwe3 command takes effect also on existing remote LDP peers, except for the remote LDP peers that have the explicit configuration of enabling label distribution.\nWhen a backbone network is deployed with TE services, that is, in the LDP over TE scenario, you cannot perform the configuration to prevent an LSR from distributing labels to remote peers."
}