{
    "PageTitle": "session-state-trap",
    "FuncDef": "The session-state-trap public-only command enables a device to generate trap messages only for public LDP sessions.\nThe undo session-state-trap public-only command enables a device to generate trap messages for both public and private LDP sessions.\nThe session-state-trap remote-lfa-disable command disables a device from generating traps when LDP sessions go down due to RLFA route deletion.\nThe undo session-state-trap remote-lfa-disable command enables a device to generate traps when LDP sessions go down due to RLFA route deletion.\nBy?default,?the?device?is?enabled?to?generate?trap?messages?for?both?public?and?private?LDP?sessions.",
    "CLIs": [
        "session-state-trap public-only",
        "session-state-trap remote-lfa-disable",
        "undo session-state-trap public-only",
        "undo session-state-trap remote-lfa-disable"
    ],
    "ParentView": [
        "MPLS-LDP view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls ldp",
            "[*HUAWEI-mpls-ldp] session-state-trap public-only"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls ldp",
            "[*HUAWEI-mpls-ldp] session-state-trap remote-lfa-disable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn an LDP multi-instance scenario, multiple LDP instances contain sessions of the same ID. Since trap messages do not contain VPN instance information, these trap messages carrying the same session ID cannot be differentiated based on VPN instances. To distinguish traps for public and private sessions with the same ID in public and private instances, run the session-state-trap public-only command to enable a device to generate trap messages only for public LDP sessions.\nIn an RLFA FRR scenario, after an ingress uses the RLFA algorithm to calculate a PQ node, the ingress runs LDP to automatically establish a remote LDP session with the destination IP address set to the PQ node's IP address. After the corresponding RLFA route is deleted, the LDP session will go down. If you want the device to generate traps when LDP sessions go down due to RLFA route deletion, run the session-state-trap remote-lfa-disable command."
}