{
    "PageTitle": "mpls bfd-trigger",
    "FuncDef": "The mpls bfd-trigger command configures a policy for establishing a BFD session and binding the BFD session to an LSP.\nThe undo mpls bfd-trigger command deletes a policy for establishing a BFD session and binding the BFD session to an LSP.\nBy default, no policy for establishing a BFD session and binding the BFD session to an LSP is configured.",
    "CLIs": [
        "mpls bfd-trigger { host [ nexthop <next-hop-address> | outgoing-interface { <interface-name> | <interface-type> <interface-number> } ] * | fec-list <list-name> } [ option-tlv ]",
        "undo mpls bfd-trigger"
    ],
    "ParentView": [
        "MPLS view"
    ],
    "ParaDef": [
        {
            "Parameters": "host",
            "Info": "Indicates that all host addresses are used to create LDP BFD sessions.\n-"
        },
        {
            "Parameters": "nexthop next-hop-address",
            "Info": "Specifies the next-hop address on an LSP.\nExpressed in dotted decimal notation."
        },
        {
            "Parameters": "outgoing-interface",
            "Info": "Specifies the outbound interface.\n-"
        },
        {
            "Parameters": "interface-type",
            "Info": "Specifies the type of an outbound interface.\n-"
        },
        {
            "Parameters": "interface-number",
            "Info": "Specifies the number of an outbound interface.\n-"
        },
        {
            "Parameters": "fec-list list-name",
            "Info": "Specifies the name of a FEC list, by which the creation of an LDP BFD session is triggered.\nThe value is a string of 1 to 31 characters, spaces not supported.When quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "option-tlv",
            "Info": "Specifies that the LDP BFD session is globally enabled.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bfd",
            "[*HUAWEI-bfd] quit",
            "[*HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls bfd-trigger host"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bfd",
            "[*HUAWEI-bfd] quit",
            "[*HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls bfd-trigger host option-tlv"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nEither of the following trigger policies can be used to establish BFD sessions and bind the BFD sessions to LSPs:\nHost address trigger policy: used when all host addresses can be used to trigger the creation of BFD sessions. You can also specify a next-hop address and an outbound interface of a specific LSP to be monitored by BFD.FEC list trigger policy: used when only some host addresses can be used to establish BFD sessions. The FEC list contains specified host addresses.\nThe\nmpls bfd-trigger command is run on the node that initiates a BFD session.\nWhen a globally enabled LDP BFD session is triggered in the compatibility mode, the BFD session IP header encapsulates the Option field.\n\nFollow-up Procedure\nConfigure parameters used by a dynamic BFD session to monitor LDP LSPs.\nPrecautions\nBefore a FEC list policy is used to trigger dynamic BFD that monitors LDP LSPs, the fec-list command must be run to create a FEC list."
}