{
    "PageTitle": "auto-frr lsp-trigger (MPLS-LDP-IPv4 view)",
    "FuncDef": "The auto-frr lsp-trigger command configures a policy for establishing backup LDP label switched paths (LSPs) over backup routes.\nThe undo auto-frr lsp-trigger command restores the default policy.\nBy default, LDP uses backup routes with 32-bit addresses to establish backup LSPs.",
    "CLIs": [
        "auto-frr lsp-trigger { none | host | all | ip-prefix <ip-prefix-name> }",
        "undo auto-frr lsp-trigger"
    ],
    "ParentView": [
        "MPLS-LDP-IPv4 view",
        "MPLS-LDP-VPN-IPv4 view"
    ],
    "ParaDef": [
        {
            "Parameters": "none",
            "Info": "Uses none of the backup routes to establish backup LDP LSPs.\n-"
        },
        {
            "Parameters": "host",
            "Info": "Uses backup routes with 32-bit addresses to establish backup LDP LSPs.\n-"
        },
        {
            "Parameters": "all",
            "Info": "Uses all backup routes to establish backup LDP LSPs.\n-"
        },
        {
            "Parameters": "ip-prefix ip-prefix-name",
            "Info": "Uses backup routes with a specified IP address prefix to establish backup LDP LSPs.\nThe name is a string of 1 to 169 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls ldp",
            "[*HUAWEI-mpls-ldp] ipv4-family",
            "[*HUAWEI-mpls-ldp-ipv4] auto-frr lsp-trigger none"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nLDP Auto fast reroute (FRR) depends on Interior Gateway Protocol (IGP) Auto FRR or static route FRR. LDP Auto FRR will be automatically enabled after IGP Auto FRR is enabled using the frr (IS-IS) command in the IS-IS view or the frr (OSPF) command in the OSPF view, or after static route FRR is enabled using the ip route-static frr command. To configure or change a policy for triggering LDP LSP establishment, run the auto-frr lsp-trigger command.\nPrerequisites\nMPLS LDP has been enabled globally using the mpls ldp command in the system view.\nIf ip-prefix is to be used, an IP prefix list must have been created using the ip ip-prefix command.\nPrecautions\nIf both the auto-frr lsp-trigger command and the lsp-trigger command are run, the established backup LSPs are controlled by the intersection part of the policy for triggering LDP LSP establishment and the policy for triggering backup LDP LSP establishment. For example, if the policies are set to \"none\" and \"all\", the \"none\" policy takes effect.\nThe auto-frr lsp-trigger command takes effect in either the MPLS-LDP view or MPLS LDP IPv4 view. If the command is configured in both views, only the latter configuration takes effect."
}