{
    "PageTitle": "mpls ldp timer hello-send",
    "FuncDef": "The mpls ldp timer hello-send command sets the value of the Hello send timer.\nThe undo mpls ldp timer hello-send command restores the default value of the Hello send timer.\nBy default, the value of the Hello send timer is one third of the value of the Hello hold timer.",
    "CLIs": [
        "mpls ldp timer hello-send <interval>",
        "undo mpls ldp timer hello-send"
    ],
    "ParentView": [
        "Remote MPLS LDP peer view"
    ],
    "ParaDef": [
        {
            "Parameters": "interval",
            "Info": "Specifies the value of the Hello send timer.\nThe value is an integer ranging from 1 to 65535, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls ldp",
            "[*HUAWEI-mpls-ldp] quit",
            "[*HUAWEI] mpls ldp remote-peer bji",
            "[*HUAWEI-mpls-ldp-remote-bji] mpls ldp timer hello-send 60"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAn LSR periodically sends Hello packets according to the Hello send timer value to the neighboring LSR to advertise its presence on the network and sets up a Hello adjacency.\nThe default timer value is recommended. On a network that is not in good situation, you can reduce the Hello send timer value properly. This enables the network to recover as soon as possible if a fault occurs.\nThere are two types of Hello send timers:\nLink-Hello send timer: used to maintain the local adjacency. You can run the mpls ldp timer hello-send command in the interface view to set the timer value.Target-Hello send timer: used to maintain the remote adjacency. You can run the mpls ldp timer hello-send command in the remote MPLS LDP peer view to set the timer value.\nIf the Hello send timer value is greater than one third of the Hello hold timer value, the Hello send timer value that takes effect is equal to one third of the Hello hold timer value.\n\nPrerequisites\nThe remote LDP peer must be configured.\nConfiguration Impact\nThe Hello send timer value that takes effect is not necessarily the same as the set value. If the Hello send timer value is greater than one third of the Hello hold timer value, the Hello send timer value that takes effect is equal to one third of the link-Hello hold timer value."
}