{
    "PageTitle": "mpls outsegment-number threshold-alarm",
    "FuncDef": "The mpls outsegment-number threshold-alarm command configures the alarm threshold for the LDP OutSegment number.\nThe undo mpls outsegment-number threshold-alarm command restores the default setting.\nThe default upper limit of the alarm threshold for the LDP OutSegment number is 80%. The default lower limit of the clear alarm threshold for the LDP OutSegment number is 75%.\nThe default upper limit of the alarm threshold for the LDP OutSegment number is 80%. The default lower limit of the clear alarm threshold for the LDP OutSegment number is 75%.",
    "CLIs": [
        "mpls outsegment-number threshold-alarm upper-limit <upper-limit-value> lower-limit <lower-limit-value>",
        "undo mpls outsegment-number threshold-alarm"
    ],
    "ParentView": [
        "MPLS view"
    ],
    "ParaDef": [
        {
            "Parameters": "lower-limit lower-limit-value",
            "Info": "Specifies the clear alarm lower threshold for LDP OutSegment number.\nThe value is an integer ranging from 1 to 100, represented in percentage. The value must be smaller than upper limit. Using the default value of 75 is recommended."
        },
        {
            "Parameters": "upper-limit upper-limit-value",
            "Info": "Specifies the alarm upper threshold for LDP OutSegment number.\nThe value is an integer ranging from 1 to 100, represented in percentage. Using a value larger than 95 is not recommended. Using the default value of 80 is recommended."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[~HUAWEI-mpls] mpls outsegment-number threshold-alarm upper-limit 90 lower-limit 60"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the number of LDP OutSegments in the system reaches a specific limit, establishing additional LDP LSPs may fail because of insufficient resources. To facilitate user operation and maintenance, enable an alarm to be generated when the number of LDP OutSegments reaches the specific limit. To configure the alarm threshold for LDP OutSegment number, run the mpls outsegment-number threshold-alarm command. The parameters in this command are described as follows:\nWhen the LDP OutSegment number increases to the value of upper-limit-value, an alarm for LDP OutSegments is generated.When the LDP OutSegment number falls below the value of lower-limit-value, a clear alarm for LDP OutSegments is generated.\n\nPrecautions\nIf the mpls outsegment-number threshold-alarm command is run more than once, the latest configuration overrides the previous one.This command only configures the trigger conditions for an alarm and its clear alarm. Although trigger conditions are met, the alarm and its clear alarm can be generated only after the snmp-agent trap enable feature-name mpls_lspm trap-name { hwmplsresourcethresholdexceed | hwmplsresourcethresholdexceedclear } command is run to enable the device to generate an MPLS resource insufficiency alarm and its clear alarm. The alarms can be generated only when the number of LDP OutSegments reaches a specified threshold."
}