{
    "PageTitle": "mpls ldp advertisement",
    "FuncDef": "The mpls ldp advertisement command configures the label advertisement mode.\nThe undo mpls ldp advertisement command restores the default label advertisement mode.\nThe downstream unsolicited (DU) label advertisement mode is used by default.",
    "CLIs": [
        "mpls ldp advertisement { du | dod }",
        "undo mpls ldp advertisement"
    ],
    "ParentView": [
        "Remote MPLS LDP peer view"
    ],
    "ParaDef": [
        {
            "Parameters": "du",
            "Info": "Indicates the DU mode. Without a request, a downstream node voluntarily sends a Label Mapping message to the upstream node.\n-"
        },
        {
            "Parameters": "dod",
            "Info": "Indicates the downstream on demand (DoD) mode. After an upstream node requests its downstream node for a label, the downstream node sends a Label Mapping message to the upstream node.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls ldp",
            "[*HUAWEI-mpls-ldp] quit",
            "[*HUAWEI] mpls ldp remote-peer abc",
            "[*HUAWEI-mpls-ldp-remote-abc] mpls ldp advertisement dod"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, downstream LSRs unsolicitedly send Label Mapping messages to upstream LSRs. Establishing a great number of LSPs burdens an LSR, such as a DSLAM (a low-performance access device) deployed on an MPLS network. On a large network, run the mpls ldp advertisement dod command. This setting allows a DSLAM to send Label Mapping messages to upstream LSRs only after receiving label requests. This setting helps minimize the number of unwanted MPLS forwarding entries forwarded by the DSLAM.\nPrerequisites\nMPLS and MPLS LDP have been enabled globally.\nPrecautions\nWhen there are multiple links between neighbors, all interfaces must use the same label advertisement mode.Modifying the label advertisement mode causes LDP sessions to be reestablished."
}