{
    "PageTitle": "mldp make-before-break p2mp traffic-detect",
    "FuncDef": "The mldp make-before-break p2mp traffic-detect command enables a device to monitor traffic with new mLDP make-before-break (MBB) incoming labels.\nThe undo mldp make-before-break p2mp traffic-detect command restores the default configuration.\nBy default, a device does not monitor traffic with new mLDP MBB incoming labels.",
    "CLIs": [
        "mldp make-before-break p2mp traffic-detect",
        "undo mldp make-before-break p2mp traffic-detect"
    ],
    "ParentView": [
        "MPLS-LDP view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls ldp",
            "[*HUAWEI-mpls-ldp] mldp p2mp",
            "[*HUAWEI-mpls-ldp] mldp make-before-break",
            "[*HUAWEI-mpls-ldp] mldp make-before-break p2mp traffic-detect"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn a network with mLDP MBB enabled, if the primary path for which mLDP FRR is enabled fails, an upstream node sends traffic to a local device through a backup path. In this situation, a local downstream device detects the change in the route destined for the root node and undergoes the MBB process. In addition, traffic is also sent through the new primary path. Two copies of traffic coexist during the MBB process. Because the delayed switching timer for MBB LSPs is set on the downstream node, the new path keeps transmitting two copies of multicast traffic during the MBB switching delay period, which poses the risk of bandwidth overload.\nIf no protection is provided for the network, the upstream node cannot use the existing label to forward traffic to the downstream node after the primary path fails. In addition, the delayed switching timer for MBB LSPs causes the device to fail to receive packets, which prolongs the packet loss time.\nIn the preceding situation, run the mldp make-before-break p2mp traffic-detect command to enable the device to monitor the traffic with new mLDP MBB incoming labels, which helps rapidly implement the MBB switching and minimize packet loss.\nPrerequisites\nmLDP P2MP has been enabled globally using the mldp p2mp command."
}