{
    "PageTitle": "mpls ldp remote-peer",
    "FuncDef": "The mpls ldp remote-peer command creates a remote peer and displays the remote peer view.\nThe undo mpls ldp remote-peer command deletes a remote peer.\nBy default, no remote peer is created.",
    "CLIs": [
        "mpls ldp remote-peer <remote-peer-name>",
        "undo mpls ldp remote-peer <remote-peer-name>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "remote-peer-name",
            "Info": "Specifies the name of a remote peer.\nThe name is a string of 1 to 32 case-sensitive characters, spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls ldp",
            "[*HUAWEI-mpls-ldp] quit",
            "[*HUAWEI] mpls ldp remote-peer BJI"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA remote LDP session is applicable to the following scenarios:\nAllocating inner labels on an L2VPN\nIf a VLL or a VPLS network is established between two LSRs in LDP mode, an LDP session (a remote LDP session in most cases) must be set up between the two LSRs before they assign inner labels to each other.\nLDP over TE\nIf the core devices on an MPLS network support TE whereas edge devices use LDP, configure a remote LDP session between two edge LSRs. After LDP over TE is configured, the TE tunnel is regarded as a hop of the entire LDP LSP.\nA remote LDP can be established either between two indirectly connected LSRs or between two directly connected LSRs.\nA local LDP session and an LDP remote session can coexist. Two LSRs can establish a local LDP session and a remote LDP session simultaneously.\n\nPrerequisites\nMPLS LDP has been enabled globally using the mpls ldp command in the system view.\nConfiguration Impact\nAfter the mpls ldp remote-peer command is run, a remote peer is created and the view of the remote peer is displayed.\nFollow-up Procedure\nYou can configure the IP address of the remote peer.\nPrecautions\nWhen configuring a remote LDP peer, run the mpls ldp remote-peer command on the local LDP and remote LDP peer. When the undo mpls ldp remote-peer command is run to attempt to delete a nonexistent remote peer, a message indicating that the peer is not configured is displayed."
}