{
    "PageTitle": "mldp make-before-break timer wait-ack",
    "FuncDef": "The mldp make-before-break timer wait-ack command sets the timer for a downstream node to wait for an MBB Notification message sent by an upstream node.\nThe undo mldp make-before-break timer wait-ack command restores the default timer value.\nThe default timer is 60s.\nThe default timer is 60s.",
    "CLIs": [
        "mldp make-before-break timer wait-ack <wait-ack-time-value>",
        "undo mldp make-before-break timer wait-ack [ <wait-ack-time-value> ]"
    ],
    "ParentView": [
        "MPLS-LDP view"
    ],
    "ParaDef": [
        {
            "Parameters": "wait-ack-time-value",
            "Info": "Sets the timer for a downstream node to wait for an MBB Notification message sent by an upstream node.\nThe value is an integer ranging from 1 to 600, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls ldp",
            "[*HUAWEI-mpls-ldp] mldp p2mp",
            "[*HUAWEI-mpls-ldp] mldp make-before-break",
            "[*HUAWEI-mpls-ldp] mldp make-before-break timer wait-ack 24"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn an mLDP P2MP network, after a downstream node sends an MBB Mapping message to an upstream node, a branch LSP can be successfully established only after the downstream node receives an MBB Notification message replied by the upstream node. To set the timer for a downstream node to wait for an MBB Notification message sent by an upstream node, run the mldp make-before-break timer wait-ack command.\nPrerequisites\nMBB has been enabled using the mldp make-before-break command in the MPLS-LDP view.\nPrecautions\nIn network deployment, the timer for a downstream node to wait for an MBB Notification message sent by an upstream node configured using the mldp make-before-break timer wait-ack command on a local node must be longer than the sum of timers for delaying the MBB LSP switching configured using the mldp make-before-break timer switch-delay command on all devices existing between the root node and the local device."
}