{
    "PageTitle": "mldp make-before-break timer switch-delay",
    "FuncDef": "The mldp make-before-break timer switch-delay command sets the timer for delaying the MBB LSP switching.\nThe undo mldp make-before-breaktimer switch-delay command restores the default delay timer.\nThe default timer is 100 ms.\nThe default timer is 100 ms.",
    "CLIs": [
        "mldp make-before-break timer switch-delay <switch-delay-time-value>",
        "undo mldp make-before-break timer switch-delay [ <switch-delay-time-value> ]"
    ],
    "ParentView": [
        "MPLS-LDP view"
    ],
    "ParaDef": [
        {
            "Parameters": "switch-delay-time-value",
            "Info": "Sets the timer for delaying an MBB LSP switchover.\nThe value is an integer ranging from 100 to 600000, in ms."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls ldp",
            "[*HUAWEI-mpls-ldp] mldp p2mp",
            "[*HUAWEI-mpls-ldp] mldp make-before-break",
            "[*HUAWEI-mpls-ldp] mldp make-before-break timer switch-delay 240"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn an mLDP P2MP network, an MBB LSP is established on the control plane before a downstream node sends forwarding entries to the forwarding lane. To ensure traffic switching, the downstream node needs to delay the process on the control plane to ensure that the forwarding plane receives forwarding entries mapped to the MBB LSP. To set the delay timer, run the mldp make-before-break timer switch-delay command.\nPrerequisites\nMBB has been enabled using the mldp make-before-break command in the MPLS-LDP view.\nPrecautions\nIn network deployment, the timer for delaying the MBB LSP switching configured using the mldp make-before-break timer wait-ack command on a local node must be longer than the sum of such timers configured on all devices existing between the root node and the local device."
}