{
    "PageTitle": "graceful-restart timer neighbor-liveness",
    "FuncDef": "The graceful-restart timer neighbor-liveness command sets the value of the neighbor-liveness timer.\nThe undo graceful-restart timer neighbor-liveness command restores the default neighbor-liveness timer value.\nThe default value of the neighbor-liveness timer is 600s.\nThe default value of the neighbor-liveness timer is 600s.",
    "CLIs": [
        "graceful-restart timer neighbor-liveness <time>",
        "undo graceful-restart timer neighbor-liveness"
    ],
    "ParentView": [
        "MPLS-LDP view"
    ],
    "ParaDef": [
        {
            "Parameters": "time",
            "Info": "Specifies the value of the neighbor-liveness timer.\nThe value is an integer ranging from 3 to 259200, in seconds. The default value (600s) is recommended."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls ldp",
            "[*HUAWEI-mpls-ldp] graceful-restart",
            "[*HUAWEI-mpls-ldp] graceful-restart timer neighbor-liveness 45",
            "Warning: All the related sessions will be deleted if the operation is performed! Continue? [Y/N]: y"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe neighbor-liveness timer defines the LDP GR period.\nDuring LDP GR, the reestablishment time of the LDP session is negotiated as the smaller value between the value of the neighbor-liveness timer on the GR helper and the value of the Reconnect timer on the GR restarter.\nThe default value of the timer is recommended. When the number of LSPs on a network is small, set a smaller value for the neighbor-liveness timer to shorten the GR period.\nPrerequisites\nMPLS and MPLS LDP have been enabled globally.\nLDP GR has been enabled globally.\nImplementation Procedure\nWhen the graceful-restart timer neighbor-liveness command is run, the system displays the following message:\nWarning: All the related sessions will be deleted if the operation is performed! Continue? [Y/N]:\nTo confirm to run the command, enter y.\nConfiguration Impact\nAfter the graceful-restart timer neighbor-liveness command is run, the reestablishment time of the LDP session is equal to the smaller value between the value of the neighbor-liveness timer on the GR helper and the value of the Reconnect timer on the GR restarter.\nPrecautions\nChanging the value of the neighbor-liveness timer causes the reestablishment of all the LDP sessions."
}