{
    "PageTitle": "whitelist session-car (LDP)",
    "FuncDef": "The whitelist session-car command sets parameters for LDP whitelist session CAR.\nThe undo whitelist session-car command restores the default parameters for LDP whitelist session CAR.\nBy default, the tcp parameters are cir=1, cbs=188, pir=4000, and pbs=160000;the udp-local parameters are cir=1, cbs=188, pir=4, and pbs=750;the udp-remote parameters are cir=1, cbs=188, pir=4, and pbs=750.",
    "CLIs": [
        "whitelist session-car { ldp-tcp | ldp-udp-local | ldp-udp-remote } { cir <cir-value> | cbs <cbs-value> | pir <pir-value> | pbs <pbs-value> } *",
        "undo whitelist session-car { ldp-tcp | ldp-udp-local | ldp-udp-remote } [ { cir <cir-value> | cbs <cbs-value> | pir <pir-value> | pbs <pbs-value> } * ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "ldp-tcp",
            "Info": "Indicates TCP signaling packets received from an LDP session.\n-"
        },
        {
            "Parameters": "ldp-udp-local",
            "Info": "Indicates UDP signaling packets received from a local LDP adjacency.\n-"
        },
        {
            "Parameters": "ldp-udp-remote",
            "Info": "Indicates UDP signaling packets received from a remote LDP adjacency.\n-"
        },
        {
            "Parameters": "cir cir-value",
            "Info": "Specifies a committed information rate (CIR), that is, the average rate at which packets can be transmitted or forwarded.\nThe value ranges from 1 to 1000000, in kbit/s."
        },
        {
            "Parameters": "cbs cbs-value",
            "Info": "Specifies a committed burst size (CBS), which limits the maximum number of bytes available for a burst of packets in a short interval to remain within CIR.\nThe value ranges from 1 to 9000000, in bytes."
        },
        {
            "Parameters": "pir pir-value",
            "Info": "Specifies a peak information rate (PIR), that is, the highest rate at which packets can be transmitted or forwarded.\nThe value ranges from 1 to 1000000, in kbit/s."
        },
        {
            "Parameters": "pbs pbs-value",
            "Info": "Specifies a peak burst size (PBS), which limits the maximum number of bytes available for a burst of packets in a short interval to remain within PIR.\nThe value ranges from 1 to 9000000, in bytes."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] whitelist session-car ldp-tcp cir 100 cbs 500000 pir 2000 pbs 900000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo adjust the packet channel bandwidth for LDP session CAR on a device, run the whitelist session-car ldp command. This configuration ensures that the LDP packets that match the LDP whitelist (session CAR) can be sent to LDP properly if the device receives a large number of such packets.\nThe PIR must be greater than or equal to the CIR, and the PBS must be greater than or equal to the CBS.\nConfiguration Impact\nIf a session CAR parameter in an LDP whitelist is set to an excessively large or small value, the involved LDP neighbor relationships may be disconnected or flap.\nPrecautions\nYou are advised not to change the values of session CAR parameters in LDP whitelists, except under exceptional circumstances. Use the default values for these parameters instead."
}