{
    "PageTitle": "mpls poison-reverse enable",
    "FuncDef": "The mpls poison-reverse enable command enables MPLS poison reverse.\nThe undo mpls poison-reverse enable command disables MPLS poison reverse.\nBy default, MPLS poison reverse is disabled.",
    "CLIs": [
        "mpls poison-reverse enable",
        "undo mpls poison-reverse enable"
    ],
    "ParentView": [
        "Eth-Trunk sub-interface view",
        "Eth-Trunk interface view",
        "FlexE interface view",
        "GE sub-interface view",
        "GE interface view",
        "IP-Trunk interface view",
        "POS interface view",
        "XGE interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet3/0/0",
            "[*HUAWEI-GigabitEthernet3/0/0] mpls poison-reverse enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn an LDP/SR-MPLS BE ring network with FRR/TILFA configured, if the primary LDP LSP fails, the ingress switches traffic from the primary LSP to the backup LSP. If routes are not converged before the LSP switchover is complete, the transit node sends traffic back to the ingress. As a result, a loop occurs. To resolve this issue, run the mpls poison-reverse enable command to enable MPLS poison reverse on the traffic inbound interface of the transit node. With this function enabled, the transit node rapidly switches traffic to the backup LSP after learning that the outbound interface is the same as the inbound interface.\nThis command also applies to an LDP/SR-MPLS BE ring network with two ECMP paths configured.\nPrecautions\nFor Eth-Trunk sub-interface and GE sub-interface views, this command is supported only by Eth-Trunk and GE sub-interfaces for dot1q VLAN tag termination.\nThis command takes effect on Layer 3 interfaces, not Layer 2 interfaces.\nDo not configure the LDP poison reverse function on nodes where traffic may be sent and received by the same interface, which helps prevent a device from incorrectly determining that a loop occurs. The node can be the egress of a protection LDP LSP, such as an LDP FRR LSP, LDP RLFA LSP, or backup LDP LSP in LDP over TE."
}