{
    "PageTitle": "mpls ldp-srbe convergence enhance",
    "FuncDef": "The mpls ldp-srbe convergence enhance command decouples service next hops from LDP and SR-MPLS BE.\nThe undo mpls ldp-srbe convergence enhance command disables the decoupling between service next hops and LDP and SR-MPLS BE.\nBy default, the decoupling function is disabled.",
    "CLIs": [
        "mpls ldp-srbe convergence enhance",
        "undo mpls ldp-srbe convergence enhance"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls ldp-srbe convergence enhance",
            "Info:This command will take effect when reboot the chassis next time."
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen private and public network separation services recurse to an LDP or SR-MPLS BE tunnel, packets may be dropped due to a change in the outbound interface of the LDP or SR-MPLS BE tunnel. To reduce the packet loss rate and improve link change-induced convergence performance, decouple next hops from the LDP or SR-MPLS BE.\nPrecautions\nThis command takes effect only after the device is restarted.\nIf this decoupling mode is not enabled when mixed tunnel load balancing is used, note the following issues:\nEach LDP and SR-MPLS BE next hop carries traffic that is balanced.\nWhen this decoupling mode is enabled, note the following:\nEach LDP and SR-MPLS BE FEC carries traffic that is balanced.\nWhen LDP or SR-MPLS BE tunnel decoupling is enabled, the load balancing effect changes as follows:\nAssume that LDP (two next-hop outbound interfaces in a FEC) and an RSVP-TE tunnel form a hybrid ECMP scenario. When the decoupling between LDP and next hops and between SR-MPLS BE and next hops is disabled, each outbound interface of LDP and RSVP TE tunnel shares one third of the traffic. After this function is enabled, each of LDP and RSVP TE tunnels shares half of the traffic based on the FEC. The LDP FEC performs load balancing on the two next-hop outbound interfaces, and each outbound interface shares a quarter of the traffic."
}