{
    "PageTitle": "ospf ldp-sync",
    "FuncDef": "The ospf ldp-sync command enables LDP and OSPF synchronization on an interface.\nThe undo ospf ldp-sync command disables LDP and OSPF synchronization on an interface.\nThe ospf ldp-sync block command blocks LDP and OSPF synchronization on an interface.\nThe undo ospf ldp-sync block command unblocks LDP and OSPF synchronization on an interface.\nBy default, LDP and OSPF synchronization is not enabled on an interface. LDP and OSPF synchronization is not blocked on an interface.",
    "CLIs": [
        "ospf ldp-sync",
        "ospf ldp-sync block",
        "undo ospf ldp-sync",
        "undo ospf ldp-sync block"
    ],
    "ParentView": [
        "Tunnel interface view",
        "FlexE interface view",
        "Cellular channel interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "100GE interface view",
        "GE electrical interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "GMPLS-UNI interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Eth-Trunk interface view",
        "POS interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] ospf ldp-sync block"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] ospf ldp-sync"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy configuring LDP and OSPF synchronization, you can shorten traffic interruption when the traffic is switched from the backup link to the primary link and achieve the millisecond-level switchover.\nThe\nldp-sync enable command is run in the OSPF area view to enable LDP and OSPF synchronization on the following interfaces:\nInterfaces with OSPF neighbors in the Up state on a P2P networkDRs' and non-DR/BDR devices' interfaces with OSPF neighbors in the Up state on a broadcast network\nIf LDP and OSPF synchronization is enabled on an interface that transmits important services, ensure that the interface is not on a standby link. LDP-IGP synchronization can be disabled on a specified interface of the\nVRP.\nYou can block LDP-IGP synchronization on a specified interface of the device.\n\nPrecautions\nThe display ospf ldp-sync interface command can be used to display the synchronization status of an interface configured with LDP and OSPF synchronization."
}