{
    "PageTitle": "mpls dynamic-label-number threshold-alarm",
    "FuncDef": "The mpls dynamic-label-number threshold-alarm command sets alarm thresholds of dynamic label usage.\nThe undo mpls dynamic-label-number threshold-alarm command restores the default alarm thresholds of dynamic label usage.\nBy default, the upper limit is 80%, and the lower limit is 70%.",
    "CLIs": [
        "mpls dynamic-label-number threshold-alarm upper-limit <upper-limit-value> lower-limit <lower-limit-value>",
        "undo mpls dynamic-label-number threshold-alarm"
    ],
    "ParentView": [
        "MPLS view"
    ],
    "ParaDef": [
        {
            "Parameters": "lower-limit lower-limit-value",
            "Info": "Specifies the lower limit of dynamic label usage.\nThe value is a percent integer ranging from 1 to 100. The lower limit must be less than the upper limit. Using the default value 70 is recommended."
        },
        {
            "Parameters": "upper-limit upper-limit-value",
            "Info": "Specifies the upper limit of dynamic label usage.\nThe value is a percent integer ranging from 1 to 100. Using the default value 80 is recommended. The setting value less than 95 is better."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[~HUAWEI-mpls] mpls dynamic-label-number threshold-alarm upper-limit 90 lower-limit 60"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf dynamic labels run out but the system receives new dynamic label requests, the system fails to satisfy the requests because the dynamic labels are insufficient. As a result, the module that fails to be assigned labels works abnormally. To facilitate operation and maintenance, run the mpls dynamic-label-number threshold-alarm command to set alarm thresholds of dynamic label usage. The system can alert users to the issue that dynamic labels will exhaust.\nPrecautions\nIf the mpls dynamic-label-number threshold-alarm command is run more than one time, the last configuration takes effect.\nThis command only configures the trigger conditions for an alarm and its clear alarm. Although trigger conditions are met, the alarm and its clear alarm can be generated only after the snmp-agent trap enable feature-name mpls_lspm trap-name { hwMplsDynamicLabelThresholdExceed | hwMplsDynamicLabelThresholdExceedClear } command is run to enable the device to generate a dynamic label insufficiency alarm and its clear alarm."
}