{
    "PageTitle": "authentication (OSPF virtual link)",
    "FuncDef": "To specify the authentication type for an Open Shortest Path First (OSPF) virtual link, use the authentication command. To remove the authentication type for a virtual link, use the no form of this command.",
    "CLIs": [
        "authentication [ key-chain <key-name> | message-digest | ]",
        "no authentication"
    ],
    "ParentView": [
        "ospf virtual link configuration mode"
    ],
    "ParaDef": [
        {
            "Parameters": "key-chain key-name",
            "Info": "(Optional) Specifies the key-chain to use. The key-name argument can be any alphanumeric string up to 63 characters."
        },
        {
            "Parameters": "message-digest",
            "Info": "(Optional) Specifies to use message-digest authentication."
        },
        {
            "Parameters": "null",
            "Info": "(Optional) Specifies no authentication is used. Disables authentication if configured for an area."
        }
    ],
    "Examples": [
        [
            "switch(config)# router ospf 22",
            "switch(config-router)# area 99 virtual-link 192.0.2.12",
            "switch(config-router-vlink)# authentication message-digest",
            "switch(config-router-vlink)# message-digest key 4 md5 0 abcd"
        ]
    ],
    "ExtraInfo": "Use the authentication command in virtual link configuration mode to configure the authentication method used on the virtual link. Use the message-diges t keyword to configure MD5 message digest authentication and use the message-digest-key command to complete this authentication configuration. Use the key-chain keyword to configure password authentication using key chains and use the key chain command to complete this authentication configuration. Use the authentication command with no keywords to configure a password for the virtual link, and use the authentication-key command to complete this authentication configuration.This command requires the LAN Base Services license.\nCommand Default:Defaults to password authentication if you configure authentication with none of the optional keywords.",
    "HTMLPage": "data/manuals/cisco/cisco_nexus5500/n5500-ucast-cr_n5k-ospf_cmds_a.html",
    "ori_path": "data/cmdcorpus/cisco/cisco_nexus5500/cmd_corpus/n5500-ucast-cr_n5k-ospf_cmds_a/n5500-ucast-cr_n5k-ospf_cmds_a_authentication (OSPF virtual link).json",
    "msg": [
        "Error CLI:authentication [ key-chain <key-name> | message-digest | ]"
    ]
}