{
    "PageTitle": "ip ospf authentication",
    "FuncDef": "To specify the authentication type for an Open Shortest Path First (OSPF) interface, use the ip ospf authentication command. To remove the authentication type for an interface, use the no form of this command.",
    "CLIs": [
        "ip ospf authentication [ key-chain <key-name> | message-digest | ]",
        "no ip ospf authentication"
    ],
    "ParentView": [
        "interface configuration mode"
    ],
    "ParaDef": [
        {
            "Parameters": "key-chain key-name",
            "Info": "(Optional) Specifies a key chain to use for authentication. The key-name argument can be a maximum of 63 alphanumeric characters."
        },
        {
            "Parameters": "message-digest",
            "Info": "(Optional) Specifies that message-digest authentication is used."
        },
        {
            "Parameters": "null",
            "Info": "(Optional) Specifies that no authentication is used. Use this keyword to override any other authentication configured for an area."
        }
    ],
    "Examples": [
        [
            "switch(config)# interface ethernet 2/1",
            "switch(config-if)# no switchport",
            "switch(config-if)# ip ospf authentication message-digest",
            "switch(config-if)# ip ospf message-digest-key 33 md5 0 mypassword",
            "switch(config-if)#"
        ]
    ],
    "ExtraInfo": "Use the ip ospf authentication command to configure the authentication mode for an OSPF interface. If you use this command with no keywords, use the ip ospf authentication-key command to configure the password. If you use the message-digest keyword, use the ip ospf message-digest-key command to configure the message-digest key for the interface.The authentication that you configure on an interface overrides the authentication that you configure for the area.This command requires the LAN Base Services license.\nCommand Default:No authentication",
    "HTMLPage": "data/manuals/cisco/cisco_nexus5500/n5500-ucast-cmd_n5500-ospf_cmds_i.html",
    "ori_path": "data/cmdcorpus/cisco/cisco_nexus5500/cmd_corpus/n5500-ucast-cmd_n5500-ospf_cmds_i/n5500-ucast-cmd_n5500-ospf_cmds_i_ip ospf authentication.json",
    "msg": [
        "Error CLI:ip ospf authentication [ key-chain <key-name> | message-digest | ]"
    ]
}