{
    "PageTitle": "redis tribute (BGP)",
    "FuncDef": "To inject routes from one routing domain into the Border Gateway Protocol (BGP), use the redistribute command. To remove the redistribute command from the configuration file and restore the system to its default condition in which the software does not redistribute routes, use the no form of this command.",
    "CLIs": [
        "redistribute { direct | eigrp <instance-tag> | ospf <instance-tag> | rip <instance-tag> | static } [ route-map <map-name> ]",
        "no redistribute {{ direct | eigrp <instance-tag> | ospf <instance-tag> | rip <instance-tag> | static } [ route-map <map-name> ]"
    ],
    "ParentView": [
        "address family configuration mode"
    ],
    "ParaDef": [
        {
            "Parameters": "direct",
            "Info": "Distributes routes that are directly connected on an interface."
        },
        {
            "Parameters": "eigrp instance-tag",
            "Info": "Specifies the name of an EIGRP instance. The instance-tag can be any case-sensitive, alphanumeric string up to 20 characters."
        },
        {
            "Parameters": "ospf instance-tag",
            "Info": "Distributes routes from the OSPF protocol. This protocol is supported in the IPv4 address family. The instance-tag can be any case-sensitive, alphanumeric string up to 20 characters."
        },
        {
            "Parameters": "rip instance-tag",
            "Info": "Distributes routes from the RIP protocol. The instance-tag can be any case-sensitive, alphanumeric string up to 20 characters."
        },
        {
            "Parameters": "static",
            "Info": "Redistributes IP static routes."
        },
        {
            "Parameters": "route-map map-name",
            "Info": "(Optional) Specifies the identifier of a configured route map. Use a route map to filter which routes are redistributed into EIGRP."
        }
    ],
    "Examples": [
        [
            "switch(config)# router bgp 64496",
            "switch(config-router) address-family ipv4 unicast",
            "switch(config-router-af)# redistribute eigrp 100"
        ]
    ],
    "ExtraInfo": "Use the redistribute command to import routes from other routing protocols into BGP. You should always use a route map to filter these routes to ensure that BGP redistributes only the routes that you intend to redistribute.You must configure a default metric to redistribute routes from another protocol into BGP. You can configure the default metric with the default-metric command or with the route map configured with the redistribute command.This command requires the LAN Enterprise Services license.\nCommand Default:Disabled",
    "HTMLPage": "data/manuals/cisco/cisco_nexus5500/n5500-ucast-cmd_n5500-bgp_cmds_r.html",
    "ori_path": "data/cmdcorpus/cisco/cisco_nexus5500/cmd_corpus/n5500-ucast-cmd_n5500-bgp_cmds_r/n5500-ucast-cmd_n5500-bgp_cmds_r_redis tribute (BGP).json",
    "msg": [
        "Error CLI:no redistribute {{ direct | eigrp <instance-tag> | ospf <instance-tag> | rip <instance-tag> | static } [ route-map <map-name> ]"
    ]
}