{
    "PageTitle": "s tub",
    "FuncDef": "To configure a router as a stub using the Enhanced Interior Gateway Routing Protocol (EIGRP), use the stub command. To disable the EIGRP stub routing feature, use the no form of this command.",
    "CLIs": [
        "stub [ direct | leak-map <map-name> | receive-only | redistributed ]",
        "no stub [ direct | leak-map <map-name> | receive-only | redistributed ]]"
    ],
    "ParentView": [
        "address family configuration mode",
        "router configuration mode",
        "router vrf configuration mode"
    ],
    "ParaDef": [
        {
            "Parameters": "direct",
            "Info": "(Optional) Advertises directly connected routes."
        },
        {
            "Parameters": "leak-map map-name",
            "Info": "(Optional) Allows dynamic prefixes based on the leak map."
        },
        {
            "Parameters": "receive-only",
            "Info": "(Optional) Sets the router as a receive-only neighbor."
        },
        {
            "Parameters": "redistributed",
            "Info": "(Optional) Advertises redistributed routes from other protocols and autonomous systems."
        }
    ],
    "Examples": [
        [
            "switch(config)# router eigrp 1",
            "switch(config-router)# stub receive-only",
            "switch(config-router)#"
        ]
    ],
    "ExtraInfo": "Use the stub command to configure a router as a stub where the router directs all IP traffic to a distribution router.The direct keyword permits EIGRP stub routing to advertise connected routes. This option is enabled by default.The receive-only keyword restricts the router from sharing any of its routes with any other router in that EIGRP autonomous system, and the receive-only keyword does not permit any other option to be specified because it prevents any type of route from being sent.The redistributed keyword permits EIGRP stub routing to send other routing protocols and autonomous systems. Without the configuration of this option, EIGRP does not advertise redistributed routes.If you use any of these four keywords ( direct , leak-map , receive-only , redistributed ) with the stub command, only the route types specified by the particular keyword(s) are advertised.This command requires the LAN Base Services license.\nCommand Default:Disabled",
    "HTMLPage": "data/manuals/cisco/cisco_nexus5500/n5500-ucast-cmd_n5500-eigrp_cmds_s.html",
    "ori_path": "data/cmdcorpus/cisco/cisco_nexus5500/cmd_corpus/n5500-ucast-cmd_n5500-eigrp_cmds_s/n5500-ucast-cmd_n5500-eigrp_cmds_s_s tub.json",
    "msg": [
        "Error CLI:no stub [ direct | leak-map <map-name> | receive-only | redistributed ]]"
    ]
}