{
    "PageTitle": "display efm session",
    "FuncDef": "The display efm session command displays EFM OAM session information on a specified interface or all interfaces.",
    "CLIs": [
        "display efm session { all | interface { <interface-name> | <interface-type> <interface-number> } | master | ap-id <ap-id> }"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "all",
            "Info": "Displays EFM OAM session information on all interfaces with EFM OAM configured.\n-"
        },
        {
            "Parameters": "interface interface-type interface-number",
            "Info": "Displays EFM OAM session information on a specified interface.\n-"
        },
        {
            "Parameters": "master",
            "Info": "Displays EFM OAM session information of all physical interfaces with EFM OAM configured on a master.\n-"
        },
        {
            "Parameters": "ap-id ap-id",
            "Info": "Displays EFM OAM session information of a port-extend interface for a specified AP and with EFM OAM configured on a master.\nThe value is an integer ranging from 1024 to 8191."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display efm session all",
            "  Interface                 EFM State                   Loopback Timeout",
            "  ----------------------------------------------------------------------",
            "  GigabitEthernet1/0/1      loopback(be controlled)     20",
            "  GigabitEthernet1/0/2      detect                          --"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe display efm session command can be used to check whether an EFM session configured on a device is negotiated successfully.\nThe display efm session command output includes:\nEFM OAM protocol stateTimeout period of the loopback test\n\nPrerequisites\nEFM OAM has been globally enabled using the efm enable command in the system view.\nPrecautions\nEFM OAM session information displayed on an interface in active mode is different from that displayed on an interface in passive mode. That is, the EFM OAM protocol state of the interface in active mode is displayed as Loopback(control), whereas the EFM OAM protocol state of the interface in passive mode is displayed as Loopback(be controlled)."
}