{
    "PageTitle": "efm error-frame-second period",
    "FuncDef": "The efm error-frame-second period command configures a period during which errored frame seconds are detected on an interface.\nThe undo efm error-frame-second period command restores the default period.\nBy default, the period is 60 seconds.",
    "CLIs": [
        "efm error-frame-second period <period>",
        "undo efm error-frame-second period"
    ],
    "ParentView": [
        "Layer 2 40GE interface view",
        "40GE interface view",
        "GE interface view",
        "Layer 2 50GE interface view",
        "Port extension interface view",
        "100GE interface view",
        "GE electrical interface view",
        "Port extension Layer 2 interface view",
        "Layer 2 10GE interface view",
        "50GE interface view",
        "Layer 2 GE interface view",
        "400GE interface view",
        "10GE interface view",
        "Layer 2 100GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Layer 2 50|100GE interface view",
        "25GE-L2 view",
        "400GE-L2 view"
    ],
    "ParaDef": [
        {
            "Parameters": "period",
            "Info": "Specifies a period during which errored frame seconds are detected.\nThe value is an integer ranging from 10 to 900, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] efm enable",
            "[*HUAWEI] interface GigabitEthernet1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] efm error-frame-second period 20"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter the efm error-frame-second notification enable command is run, you can run the efm error-frame-second period command to specify a period during which errored frame seconds are detected. When the number of detected errored frame seconds within the period specified by period parameter reaches or exceeds a specified threshold, the local device generates an alarm and notifies the peer device of the alarm event.\nPrerequisites\nEFM OAM has been globally enabled using the efm enable command in the system view.\nConfiguration Impact\nAfter a local interface is enabled to report detected errored frame seconds, the local device generates a threshold-crossing event of errored frame seconds and reports the event to the remote device if the number of errored frame seconds detected on the interface reaches or exceeds the specified threshold.\nPrecautions\nIf the link quality is poor and the period during which errored frame seconds are detected is too short, the local device may frequently send the threshold-crossing event of errored frame seconds to the remote device. If the specified period is too long, link monitoring may be of little effect. Therefore, the period during which errored frame seconds are detected must be set properly based on the link quality."
}