{
    "PageTitle": "efm error-frame-second notification enable",
    "FuncDef": "The efm error-frame-second notification enable command enables EFM OAM to detect and report errored frame seconds on an interface.\nThe undo efm error-frame-second notification enable command disables EFM OAM from detecting and reporting errored frame seconds on an interface.\nBy default, an interface is disabled from reporting and detecting errored frame seconds.",
    "CLIs": [
        "efm error-frame-second notification enable",
        "undo efm error-frame-second notification enable"
    ],
    "ParentView": [
        "Layer 2 40GE interface view",
        "40GE interface view",
        "GE interface view",
        "Layer 2 50GE interface view",
        "Port extension interface view",
        "100GE interface view",
        "GE electrical interface view",
        "Port extension Layer 2 interface view",
        "Layer 2 10GE interface view",
        "50GE interface view",
        "Layer 2 GE interface view",
        "400GE interface view",
        "10GE interface view",
        "Layer 2 100GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Layer 2 50|100GE interface view",
        "25GE-L2 view",
        "400GE-L2 view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] efm enable",
            "[*HUAWEI] interface GigabitEthernet1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] efm enable",
            "[*HUAWEI-GigabitEthernet1/0/0] efm error-frame-second notification enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nFault detection on an Ethernet network is difficult when the physical connection on the network is not closed but network performance deteriorates gradually. Link monitoring is used to detect link layer faults in various environments. After EFM OAM link monitoring is configured, statistics about the physical layer data of the interface management module are queried to monitor the quality of the link connected to the current interface. EFM OAM link monitoring implements the following functions:\nReports an alarm when the number of bit errors detected during a specified detection interval exceeds the specified threshold.Reports an alarm when the number of errored frames detected during a specified detection interval exceeds the specified threshold.Reports an alarm when the number of errored frame seconds detected during a specified interval exceeds the specified threshold.\nTo enable an interface to report detected errored frame seconds, run the efm error-frame-second notification enable command. The local device considers a link faulty if the number of detected errored frame seconds within the period specified by the efm error-frame-second period command reaches or exceeds the threshold specified by the efm error-frame-second threshold command. Then the local device generates an alarm, reports the alarm to the NMS, and sends an OAM PDU to notify the peer device of the link failure.\n\nPrerequisites\nEFM OAM has been globally enabled using the efm enable command in the system view.\nConfiguration Impact\nAfter a local interface is enabled to report detected errored frame seconds, the local device generates a threshold-crossing event of errored frame seconds and reports the event to the remote device if the number of errored frame seconds detected on the interface reaches or exceeds the specified threshold.\nPrecautions\nThe specified threshold and period take effect only after the efm error-frame-second notification enable command is run.\nThe efm error-frame-second notification enable command takes effect only after EFM OAM is enabled on an interface.\nThe efm error-frame-second notification enable command can be used together with the efm error-frame-second period and efm error-frame-second threshold commands for errored frame second detection of a link."
}