{
    "PageTitle": "efm error-frame-period",
    "FuncDef": "The efm error-frame-period period command sets an errored frame detection interval for an interface to use EFM to detect errored frames among a specified number of received frames.\nThe undo efm error-frame-period period command restores the default errored frame detection interval.\nBy default, the errored frame detection interval is 200000 frames.",
    "CLIs": [
        "efm error-frame-period period <period>",
        "undo efm error-frame-period period"
    ],
    "ParentView": [
        "Layer 2 40GE interface view",
        "40GE interface view",
        "GE interface view",
        "Layer 2 50GE interface view",
        "Port extension interface view",
        "100GE interface view",
        "GE electrical interface view",
        "Port extension Layer 2 interface view",
        "Layer 2 10GE interface view",
        "50GE interface view",
        "Layer 2 GE interface view",
        "400GE interface view",
        "10GE interface view",
        "Layer 2 100GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Layer 2 50|100GE interface view",
        "25GE-L2 view",
        "400GE-L2 view"
    ],
    "ParaDef": [
        {
            "Parameters": "period period",
            "Info": "Specifies an errored frame detection interval for an interface to use EFM to detect errored frames among a specified number of received frames.\nThe value is an integer ranging from 1 to 4294967295 , in frames."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] efm enable",
            "[*HUAWEI] interface GigabitEthernet1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] efm enable",
            "[*HUAWEI-GigabitEthernet1/0/0] efm error-frame-period period 300000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter the efm error-frame-period notification enable command is run to enable a device to notify its peer device of errored frames that EFM periodically detects, run the efm error-frame-period command to enable an interface to use EFM to detect errored frames among a specified number of frames that the interface receives. If the number of detected errored frames among the specified number of received frames reaches or exceeds the threshold, the interface generates an alarm and sends a notification to its peer device.\nPrerequisites\nEFM has been enabled on an interface using the efm enable command in the interface view."
}