{
    "PageTitle": "efm error-frame-second threshold",
    "FuncDef": "The efm error-frame-second threshold command sets a threshold for the number of detected errored frame seconds on an interface.\nThe undo efm error-frame-second threshold command restores the default threshold.\nThe default threshold for the number of detected errored frame seconds is 1.",
    "CLIs": [
        "efm error-frame-second threshold <threshold>",
        "undo efm error-frame-second threshold"
    ],
    "ParentView": [
        "Layer 2 40GE interface view",
        "40GE interface view",
        "GE interface view",
        "Layer 2 50GE interface view",
        "100GE interface view",
        "GE electrical interface view",
        "Port extension interface view",
        "Port extension Layer 2 interface view",
        "Layer 2 10GE interface view",
        "50GE interface view",
        "Layer 2 GE interface view",
        "400GE interface view",
        "10GE interface view",
        "GE optical interface view",
        "Layer 2 100GE interface view",
        "25GE interface view",
        "Layer 2 50|100GE interface view",
        "25GE-L2 view",
        "400GE-L2 view"
    ],
    "ParaDef": [
        {
            "Parameters": "threshold",
            "Info": "Specifies a threshold for the number of detected errored frame seconds.\nThe value is an integer ranging from 0 to 900."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] efm enable",
            "[*HUAWEI] interface GigabitEthernet1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] efm error-frame-second threshold 10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter the efm error-frame-second notification enable and efm error-frame-second period period commands are run, you can run the efm error-frame-second threshold threshold command to specify a threshold for the number of detected errored frame seconds. When the number of detected errored frame seconds within the period specified by period reaches or exceeds the threshold specified by threshold, the local device generates an alarm and notifies the peer device of the alarm event.\nPrerequisites\nEFM OAM has been globally enabled using the efm enable command in the system view.\nConfiguration Impact\nAfter a local interface is enabled to report detected errored frame seconds, the local device generates a threshold-crossing event of errored frame seconds and reports the event to the remote device if the number of errored frame seconds detected on the interface reaches or exceeds the specified threshold.\nPrecautions\nIf the link quality is poor and the threshold for the number of detected errored frame seconds is too small, the local device may frequently send the threshold-crossing event of errored frame seconds to the remote device. If the threshold is too large, link monitoring may be of little effect. Therefore, the threshold for the number of detected errored frame seconds must be set properly based on the link quality."
}