{
    "PageTitle": "efm error-frame-period notification enable",
    "FuncDef": "The efm error-frame-period notification enable command enables EFM OAM to detect and notify its peer device of errored frames on an interface.\nThe undo efm error-frame-period notification enable command disables EFM OAM from detecting and notifying its peer device of errored frames on an interface.\nBy default, an interface is disabled from detecting and notifying its peer device of errored frames that EFM periodically detects.",
    "CLIs": [
        "efm error-frame-period notification enable",
        "undo efm error-frame-period notification enable"
    ],
    "ParentView": [
        "Layer 2 40GE interface view",
        "40GE interface view",
        "GE interface view",
        "Layer 2 50GE interface view",
        "100GE interface view",
        "GE electrical interface view",
        "Port extension interface view",
        "Port extension Layer 2 interface view",
        "Layer 2 10GE interface view",
        "50GE interface view",
        "Layer 2 GE interface view",
        "400GE interface view",
        "10GE interface view",
        "GE optical interface view",
        "Layer 2 100GE interface view",
        "25GE interface view",
        "Layer 2 50|100GE interface view",
        "25GE-L2 view",
        "400GE-L2 view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] efm enable",
            "[*HUAWEI] interface GigabitEthernet1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] efm enable",
            "[*HUAWEI-GigabitEthernet1/0/0] efm error-frame-period notification enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nFault detection on an Ethernet network is difficult when the physical connection on the network is not closed but network performance deteriorates gradually. Link monitoring is used to detect link layer faults in various environments. After EFM OAM link monitoring is configured, statistics about the physical layer data of the interface management module are queried to monitor the quality of the link connected to the current interface. EFM OAM link monitoring implements the following functions:\nReports an alarm when the number of bit errors detected during a specified detection interval exceeds the specified threshold.Reports an alarm when the number of errored frames detected during a specified detection interval exceeds the specified threshold.Reports an alarm when the number of errored frame seconds detected during a specified interval exceeds the specified threshold.Reports an alarm when the number of errored frames among a specified number of received frames exceeds the specified threshold.\nTo enable an interface to notify its peer device of errored frames that EFM periodically detects, run the efm error-frame-period notification enable command. The local device considers a link faulty if the number of errored frames among a specified number of frames received by an interface reaches a threshold. Then the local device generates an alarm, reports the alarm to the NMS, and sends an OAM PDU to notify the peer device of the link failure.\n\nPrerequisites\nEFM has been enabled on an interface using the efm enable command in the interface view."
}