{
    "PageTitle": "efm loopback ignore-request",
    "FuncDef": "The efm loopback ignore-request command enables an interface to ignore loopback requests sent by remote interfaces.\nThe undo efm loopback ignore-request command restores the default setting for the loopback function on an interface.\nBy default, an interface supports remote loopback. If an interface receives a loopback request sent by a remote interface, the interface enters the loopback state.",
    "CLIs": [
        "efm loopback ignore-request",
        "undo efm loopback ignore-request"
    ],
    "ParentView": [
        "Layer 2 40GE interface view",
        "40GE interface view",
        "GE interface view",
        "Layer 2 50GE interface view",
        "100GE interface view",
        "GE electrical interface view",
        "Port extension interface view",
        "Port extension Layer 2 interface view",
        "Layer 2 10GE interface view",
        "50GE interface view",
        "Layer 2 GE interface view",
        "400GE interface view",
        "10GE interface view",
        "GE optical interface view",
        "Layer 2 100GE interface view",
        "25GE interface view",
        "Layer 2 50|100GE interface view",
        "25GE-L2 view",
        "400GE-L2 view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] efm enable",
            "[*HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] efm enable",
            "[*HUAWEI-GigabitEthernet1/0/0] commit",
            "[~HUAWEI-GigabitEthernet1/0/0] efm loopback ignore-request"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nRemote loopback is used to monitor link quality and locate link faults. Periodic loopback detection helps detect network faults promptly.\nIf an interface is in the loopback state, the interface loops back all received traffic, causing traffic interruptions and imposing attacks. To prevent the preceding problems, the efm loopback ignore-request command can be used to enable the interface to reject a remote Ethernet OAM loopback request carried in a loopback control OAM PDU sent by a remote interface.\nPrerequisites\nEFM has been enabled on an interface using efm enable, and the interface is not in the loopback state.\nConfiguration Impact\nAfter the efm loopback ignore-request command is run on an interface, the interface will discard an OAM PDU carrying a remote loopback request."
}