{
    "PageTitle": "test-packet start interface",
    "FuncDef": "The test-packet start interface command configures an interface to send testing packets.\nBy default, no testing packets is sent.",
    "CLIs": [
        "test-packet start interface { <interface-name> | <interface-type> <interface-number> } [ -c <count> | -p <speed> | -s <size> ] *"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "interface-type",
            "Info": "Specifies the type of an outbound interface that sends testing packets.\nThe value can be Ethernet or GE."
        },
        {
            "Parameters": "interface-number",
            "Info": "Specifies the number of an outbound interface that sends testing packets.\n-"
        },
        {
            "Parameters": "-c count",
            "Info": "Specifies the number of sent testing packets.\nThe value is an integer ranging from 1 to 65535. The default value is 5."
        },
        {
            "Parameters": "-p speed",
            "Info": "Specifies the rate at which testing packets are sent.\nThe value is an integer ranging from 1 to 5, in Mbit/s. The default value is 1 Mbit/s."
        },
        {
            "Parameters": "-s size",
            "Info": "Specifies the size of a testing packet.\nThe value is an integer ranging from 64 to 1518, in bytes. The default value is 64 bytes."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] efm enable",
            "[*HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] efm enable",
            "[*HUAWEI-GigabitEthernet1/0/0] com",
            "[~HUAWEI-GigabitEthernet1/0/0] efm loopback start",
            "[~HUAWEI-GigabitEthernet1/0/0] quit",
            "[~HUAWEI] test-packet start interface GigabitEthernet1/0/0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter remote loopback is enabled on a device, the test-packet start interface command can be used to configure the interface in the active mode to send testing packets. Based on returned testing packets, you can evaluate the connectivity and performance of the link.\nPrerequisites\nRemote loopback has been enabled on an interface.\nConfiguration Impact\nThe test results are invalid if a master/slave main control board switchover occurs or an interface board is offline when testing packets are being sent.\nFollow-up Procedure\nTo stop sending testing packets, press Ctrl+C.\nAfter running the test-packet start interface command to send testing packets, you can run the display test-packet result command to view the test results.\nPrecautions\nTesting packets sent by an interface with the test-packet start interface command configured are a type of Ethernet packets constructed to test link quality. This command is used together with EFM OAM remote loopback to test packet loss ratios over links.During test packet transmission, no testing packet parameter can be modified."
}