{
    "PageTitle": "efm trigger if-down",
    "FuncDef": "The efm trigger if-down command associates EFM OAM with an interface.\nThe undo efm trigger if-down command disassociates EFM OAM from an interface.\nBy default, EFM OAM is not associated with an interface.",
    "CLIs": [
        "efm trigger if-down",
        "undo efm trigger if-down"
    ],
    "ParentView": [
        "Layer 2 40GE interface view",
        "40GE interface view",
        "GE interface view",
        "Layer 2 50GE interface view",
        "100GE interface view",
        "GE electrical interface view",
        "Port extension interface view",
        "Port extension Layer 2 interface view",
        "Layer 2 10GE interface view",
        "50GE interface view",
        "Layer 2 GE interface view",
        "400GE interface view",
        "10GE interface view",
        "GE optical interface view",
        "Layer 2 100GE interface view",
        "25GE interface view",
        "Layer 2 50|100GE interface view",
        "25GE-L2 view",
        "400GE-L2 view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] efm enable",
            "[*HUAWEI] interface GigabitEthernet1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] efm enable",
            "[*HUAWEI-GigabitEthernet1/0/0] efm trigger if-down"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nEFM OAM can be associated with interfaces. In a scenario with primary and backup links, if EFM OAM detects a fault in the primary link, it will set the protocol status of the associated interface to ETHOAM Down, speeding up routing protocol convergence. This enables traffic to be quickly switched to the backup link.\nPrerequisites\nEFM OAM has been enabled globally and on an interface and is in the detect state.\nConfiguration Impact\nIf EFM OAM is associated with an interface and detects a link fault, the status of the interface becomes ETHOAM Down, and no packet except EFM OAM protocol packets can be forwarded by the interface. As a result, Layer 2 and Layer 3 services are blocked. Therefore, associating EFM OAM with an interface greatly affects services. When the interface detects link recovery using EFM OAM, the interface can forward all packets and unblocks Layer 2 and Layer 3 services.\nPrecautions\nIf Layer 2 and Layer 3 services are blocked due to a misoperation, run the undo efm trigger if-down command in the interface view to restore services.\nIf the protocol state of the associated main interface is set to ETHOAM Down, the state of the sub-interface is not affected."
}