{
    "PageTitle": "efm timeout",
    "FuncDef": "The efm timeout command sets a timeout period for waiting for EFM OAM PDUs.\nThe undo efm timeout command restores the default setting.\nBy default, the timeout period for waiting for EFM OAM PDUs is 5000 milliseconds.",
    "CLIs": [
        "efm timeout <timeout-value>",
        "undo efm timeout"
    ],
    "ParentView": [
        "Layer 2 40GE interface view",
        "40GE interface view",
        "GE interface view",
        "Layer 2 50GE interface view",
        "Port extension interface view",
        "100GE interface view",
        "GE electrical interface view",
        "Port extension Layer 2 interface view",
        "Layer 2 10GE interface view",
        "50GE interface view",
        "Layer 2 GE interface view",
        "400GE interface view",
        "10GE interface view",
        "Layer 2 100GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Layer 2 50|100GE interface view",
        "25GE-L2 view",
        "400GE-L2 view"
    ],
    "ParaDef": [
        {
            "Parameters": "timeout-value",
            "Info": "Specifies a timeout period for waiting for OAM PDUs.\nThe value is an integer ranging from 300 to 30000, in milliseconds. The step is 100 milliseconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] efm enable",
            "[*HUAWEI] interface GigabitEthernet1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] efm timeout 3000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy setting a timeout period for waiting for EFM OAM PDUs, you can change the time required for connectivity fault detection. The timeout period specified by the efm timeout command is usually used together with the interval at which OAM PDUs are sent. The timeout period set for the local interface must be three times the interval at which the remote interface sends OAM PDUs or even longer.\nPrerequisites\nEFM OAM has been globally enabled using the efm enable command in the system view.\nConfiguration Impact\nThe shorter the timeout period for waiting for EFM OAM PDUs, the shorter the time required for connectivity fault detection.The longer the timeout period for waiting for EFM OAM PDUs, the longer the time required for connectivity fault detection.\n\nPrecautions\nAfter the timeout period for waiting for EFM OAM PDUs expires, the EFM session state returns to discovery. When setting a timeout period for waiting for EFM OAM PDUs, ensure that the same timeout period is set for interfaces on both ends of a link. Otherwise, EFM session negotiation may fail, or the EFM session may flap.\nThe configured timeout period for waiting for EFM OAM PDUs must be greater than the interval at which EFM OAM PDUs are sent. Otherwise, EFM session negotiation may fail, or the EFM session may flap."
}