{
    "PageTitle": "mpls oam bidirectional-tunnel loss-measure oam-packet loss-ratio",
    "FuncDef": "The mpls oam bidirectional-tunnel loss-measure oam-packet loss-ratio command configures alarm thresholds on a bidirectional-tunnel for the OAM packet loss ratio.\nBy default, the alarm threshold for the OAM packet loss ratio on a bidirectional LSP is zero.",
    "CLIs": [
        "mpls oam bidirectional-tunnel loss-measure oam-packet loss-ratio threshold1 <threshold1-value> threshold2 <threshold2-value> { <tunnel-type> <tunnel-number> | <tunnel-name> }",
        "mpls oam bidirectional-tunnel loss-measure oam-packet loss-ratio { threshold1 <threshold1-value> | threshold2 <threshold2-value> } { <tunnel-type> <tunnel-number> | <tunnel-name> }"
    ],
    "ParentView": [
        "MPLS-OAM view"
    ],
    "ParaDef": [
        {
            "Parameters": "threshold2 threshold2-value",
            "Info": "Configures alarm threshold 2.\nThe value is an integer ranging from 0 to 100, in percentage."
        },
        {
            "Parameters": "tunnel-type tunnel-number",
            "Info": "Specifies the tunnel type and number.\n-"
        },
        {
            "Parameters": "tunnel-name",
            "Info": "Specifies the tunnel name.\n-"
        },
        {
            "Parameters": "threshold1 threshold1-value",
            "Info": "Configures alarm threshold 1.\nThe value is an integer ranging from 0 to 100, in percentage."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] mpls oam",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] interface tunnel 10",
            "[*HUAWEI-Tunnel10] tunnel-protocol mpls te",
            "[*HUAWEI-Tunnel10] mpls te signal-protocol cr-static",
            "[*HUAWEI-Tunnel10] mpls te bidirectional",
            "[*HUAWEI-Tunnel10] quit",
            "[*HUAWEI] mpls-oam",
            "[*HUAWEI-mpls-oam] mpls oam bidirectional-tunnel Tunnel 10 type cv auto-protocol overtime 30",
            "[*HUAWEI-mpls-oam] mpls oam bidirectional-tunnel loss-measure oam-packet loss-ratio threshold2 50 Tunnel 10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen configuring OAM packet loss ratio detection on a bidirectional-tunnel, you can run the mpls oam bidirectional-tunnel loss-measure oam-packet loss-ratio command to configure alarm thresholds. If the detected packet loss ratio exceeds a specified alarm threshold, an alarm is reported.\nTwo alarm thresholds can be configured. If the packet loss ratio exceeds alarm threshold 1 but does not reach alarm threshold 2, alarms are reported based on alarm threshold 1. If the packet loss ratio exceeds alarm threshold 2, alarms are reported based on both alarm thresholds 1 and 2.\nAlarm threshold 1 can be set to a small value, and its associated alarms are informational only.\nAlarm threshold 2 must be set to a value greater than alarm threshold 1, and its associated alarms must be cleared.\nConfiguration Impact\nAfter the mpls oam bidirectional-tunnel loss-measure oam-packet loss-ratio command is run, the system detects the packet loss ratio. If the packet loss ratio exceeds a specified alarm threshold, SD1-NEAR or SD2-NEAR alarms are reported. When an alarm is generated, APS is triggered on the protection ring. After the alarm is cleared, an APS switchback is triggered.\nPrecautions\nYou must configure alarm thresholds based on the actual link status."
}