{
    "PageTitle": "mpls oam bidirectional-tunnel lost-measure single-ended proactive",
    "FuncDef": "The mpls oam bidirectional-tunnel lost-measure single-ended proactive command enables proactive single-ended frame loss measurement (LM) for a bidirectional LSP.\nThe undo mpls oam bidirectional-tunnel lost-measure single-ended proactive command deletes the configuration.\nBy default, proactive single-ended frame LM is disabled for a bidirectional LSP.",
    "CLIs": [
        "mpls oam bidirectional-tunnel lost-measure single-ended proactive [ exp <exp-value> ] { <tunnel-type> <tunnel-number> | <tunnel-name> }",
        "undo mpls oam bidirectional-tunnel lost-measure single-ended proactive { <tunnel-type> <tunnel-number> | <tunnel-name> }"
    ],
    "ParentView": [
        "MPLS-OAM view"
    ],
    "ParaDef": [
        {
            "Parameters": "exp exp-value",
            "Info": "Specifies a priority for LMMs.\nThe value is an integer ranging from 0 to 7. A larger value indicates a higher priority. The default value is 7."
        },
        {
            "Parameters": "tunnel-type tunnel-number",
            "Info": "Specifies the tunnel type and number.\n-"
        },
        {
            "Parameters": "tunnel-name",
            "Info": "Specifies the tunnel name.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[*HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] mpls oam",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] interface tunnel 10",
            "[*HUAWEI-Tunnel10] tunnel-protocol mpls te",
            "[*HUAWEI-Tunnel10] mpls te signal-protocol cr-static",
            "[*HUAWEI-Tunnel10] mpls te bidirectional",
            "[*HUAWEI-Tunnel10] quit",
            "[*HUAWEI] mpls-oam",
            "[*HUAWEI-mpls-oam] mpls oam bidirectional-tunnel Tunnel 10 type ffd frequency 3",
            "[*HUAWEI-mpls-oam] mpls oam bidirectional-tunnel lost-measure single-ended proactive exp 1 Tunnel 10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nPacket LM is a performance monitoring function provided by MPLS-TP. Single-ended frame LM is implemented on two MEPs over an LSP. The measurement results include the following data:\nNear-end frame loss: indicates the number and percentage of dropped frames that are sent from an RMEP to a MEP.Far-end frame loss: indicates the number and percentage of dropped frames that are sent from a MEP to an RMEP.\n\nPrerequisites\nMPLS and MPLS OAM have been enabled globally.The LSP that MPLS OAM monitors has been established.\n\nPrecautions\nThis function must be enabled on both the local and remote ends to display correct statistics about proactive single-ended frame loss measurement on the local end.The system can display a maximum of 60 proactive single-ended frame LM records. If the number of proactive single-ended frame LM records exceeds 60, the earlier records are overwritten."
}