{
    "PageTitle": "reset mpls oam statistic-type l2vc",
    "FuncDef": "The reset mpls oam statistic-type l2vc command clears MPLS OAM performance statistics for a PW.",
    "CLIs": [
        "reset mpls oam statistic-type { lost-measure single-ended | delay-measure two-way } l2vc peer-ip <peer-ip-value> vc-id <vc-id-value> vc-type <vc-type-value>"
    ],
    "ParentView": [
        "MPLS-OAM view",
        "System view",
        "Maintenance entity group view"
    ],
    "ParaDef": [
        {
            "Parameters": "lost-measure",
            "Info": "Clears statistics about frame loss measurement.\n-"
        },
        {
            "Parameters": "single-ended",
            "Info": "Clears statistics about single-ended frame loss measurement.\n-"
        },
        {
            "Parameters": "delay-measure",
            "Info": "Clears statistics about frame delay measurement.\n-"
        },
        {
            "Parameters": "two-way",
            "Info": "Clears statistics about two-way frame delay measurement.\n-"
        },
        {
            "Parameters": "peer-ip peer-ip-value",
            "Info": "Specifies the destination IP address of a PW.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "vc-id vc-id-value",
            "Info": "Specifies the PW ID.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "vc-type vc-type-value",
            "Info": "Specifies the type of a remote L2VC.\nEncapsulation types supported:ATM PWE3atm-1to1-vcc: One PW carries the ATM cells of one PVC.atm-1to1-vpc: One PW carries the ATM cells of one PVP.atm-aal5-pdu: One PW carries the AAL5 PDUs of one PVC.atm-aal5-sdu: One PW carries the AAL5 SDUs of one PVC.atm-nto1-vcc: One PW carries the ATM cells of multiple PVCs.atm-nto1-vpc: One PW carries the ATM cells of multiple PVPs.atm-trans-cell: ATM cells are transmitted over PWE3 VCs.\nTDM PWE3cesopsn-basic: CES is sensitive to E1 and T1 frame structures. E1 or T1 signals can be encapsulated into packets based on timeslots.satop-e1: SAToP is insensitive to the E1 frame structure and encapsulates a whole E1 frame into a PW packet.satop-t1: SAToP is insensitive to the T1 frame structure and encapsulates a whole T1 frame into a PW packet.\nOther encapsulation types:cep: This encapsulation type is used for CEP services.ethernet: This encapsulation type is used when Ethernet packets do not carry VLAN information.hdlc: HDLC is a bit-oriented link layer protocol.ip-interworking: This encapsulation type is used for interworking between Huawei devices.ip-layer2: This encapsulation type is used for interworking between Huawei devices and non-Huawei devices.ppp: PPP is a link layer protocol that specifies how to encapsulate and transmit network layer packets over P2P links.vlan: This encapsulation type is used when Ethernet packets carry VLAN information."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] reset mpls oam statistic-type lost-measure single-ended l2vc peer-ip 2.2.2.2 vc-id 11 vc-type vlan"
        ]
    ],
    "ExtraInfo": "To clear statistics about single-ended frame loss measurement, run the reset mpls oam statistic-type lost-measure single-ended l2vc peer-ip peer-ip vc-id vc-id vc-type vc-type command.To clear statistics about two-way frame delay measurement, run the reset mpls oam statistic-type delay-measure two-way l2vc peer-ip peer-ip vc-id vc-id vc-type vc-type command."
}