{
    "PageTitle": "value-added-service quota-out",
    "FuncDef": "The value-added-service quota-out command configures whether the system allows a value added service user to keep online when the applied quota is used up and the response packet from the AAA accounting server carries no quota information.\nThe undo value-added-service quota-out command restores the default configuration.\nBy default, the system allows a value added service user to keep online.",
    "CLIs": [
        "value-added-service quota-out [ diameter-link-down ] { online | offline }",
        "undo value-added-service quota-out [ diameter-link-down ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "diameter-link-down",
            "Info": "The link of diameter is down.\n-"
        },
        {
            "Parameters": "online",
            "Info": "Allows a BOD/DAA user to keep online after the quota is used up.\n-"
        },
        {
            "Parameters": "offline",
            "Info": "Forces a BOD/DAA user to go offline after the quota is used up.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] value-added-service quota-out diameter-link-down online"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] value-added-service quota-out offline"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the value-added-service quota-out online command is configured, the service keeps running and accounting is performed after the quota is used up.\nIf the value-added-service quota-out diameter-link-down online command is run, the quota is used up, and the Diameter link is disconnected, accounting is still performed for services, and traffic is not interrupted.\nIf the value-added-service quota-out diameter-link-down offline command is run, the quota is used up, and the Diameter link is disconnected, the value-added services users go offline .\nPrecautions\nThis command is supported only on the admin VS.\nThis command applies to charged BOD and DAA services .\nIf the value-added-service quota-out offline command is configured, for a DAA service with non-uniform accounting, the service bandwidth is set to 0 and traffic cannot be forwarded after the quota is exhausted, but the service is not deleted; for a DAA service with uniform accounting and for a BOD service, the service with the bandwidth set to 0 is not displayed after the quota is exhausted. When you run the display value-added-service user user-id command to check information about the value-added services of the user, the service number is displayed in disaccord with the information of the service ID table."
}