{
    "PageTitle": "value-added-service account-type(AAA domain view)",
    "FuncDef": "The value-added-service account-type command configures a value-added service accounting mode. default accounting, none accounting, and RADIUS accounting can be adopted for the value-added services.\nThe undo value-added-service account-type command restores the default value-added service accounting mode.\nBy default, the accounting mode is default.",
    "CLIs": [
        "value-added-service account-type { none | radius <radius-server> | default }",
        "undo value-added-service account-type"
    ],
    "ParentView": [
        "AAA domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "none",
            "Info": "Indicates that accounting is not performed.\n-"
        },
        {
            "Parameters": "radius radius-server",
            "Info": "Specifies the name of the RADIUS server group. The server group must be a configured RADIUS server group.\nThe value is a string of 1 to 32 characters."
        },
        {
            "Parameters": "default",
            "Info": "value-added-service account-type(aaa-domain).\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] radius-server group RADIUS",
            "[*HUAWEI-radius-radiu1] commit",
            "[~HUAWEI-radius-radiu1] quit",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] domain huawei",
            "[*HUAWEI-aaa-domain-huawei] commit",
            "[~HUAWEI-aaa-domain-huawei] value-added-service account-type radius RADIUS1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf accounting is required for BOD and DAA services, run the value-added-service account-type command to configure an accounting mode.\nPrecautions\nWhen RADIUS accounting is adopted, the user domain must be bound to a corresponding server group. A maximum of one RADIUS server group for value-added service accounting can be bound to a domain.\nIf radius is specified in the value-added-service account-type command, RADIUS accounting is performed for the value-added service, regardless of whether a value-added service policy is bound to the domain. The accounting server configured by this command, instead of the server bound to the domain, is used for accounting.\nIf none is specified in the command, the system does not perform accounting for the value-added service, regardless of whether a value-added service policy is bound to the domain and the accounting scheme configured in the value-added service policy.\nIf default is specified in the command, the system performs accounting based on the following principles:\nIf the RADIUS server delivers the value-added service policy, the system searches for the local value-added policy matching the policy name delivered by the RADIUS server, and then performs accounting according to the accounting scheme configured in the local value-added service policy.If a value-added service policy is bound to the domain, the system performs accounting according to the accounting scheme configured in the bound value-added service policy. For other value-added services, the server that delivers the value-added service policy functions as the accounting server."
}