{
    "PageTitle": "dhcp snooping alarm threshold",
    "FuncDef": "The dhcp snooping alarm threshold command sets the alarm threshold for discarded DHCP packets.\nThe undo dhcp snooping alarm threshold command restores the default configuration.\nBy default, the alarm threshold is 100.",
    "CLIs": [
        "dhcp snooping alarm threshold <threshold-value>",
        "undo dhcp snooping alarm threshold"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "threshold threshold-value",
            "Info": "Specifies the alarm threshold for discarded DHCP packets.\nThe value is an integer ranging from 1 to 1000, in packets."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dhcp snooping enable",
            "[*HUAWEI] dhcp snooping alarm threshold 200"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter DHCP packet check is enabled, the device checks the validity of received DHCP packets and discards invalid DHCP packets. You can also configure the alarm function for discarded DHCP packets and the alarm threshold for discarded DHCP packets. You can configure the following detection functions of DHCP packets:\nBinding table check for ARP packets: The ARP packets mismatching information in the binding table are dropped.Binding table check for DHCP request packets: The DHCP request packets mismatching information in the binding table are dropped.Binding table check for IP packets: The IP packets mismatching information in the binding table are dropped.CHADDR field check: The DHCP packets with the CHADDR field value mismatching the MAC address in the packet header are dropped.\n\nPrerequisites\nDHCP snooping has been enabled globally by running the dhcp snooping enable command.\nPrecautions\nThis command applies to the system view. The dhcp snooping alarm threshold (BD view), dhcp snooping alarm threshold (interface view) and dhcp snooping alarm threshold (VLAN view) commands apply to the BD view, interface view and VLAN view, respectively. If the dhcp snooping alarm threshold command is not run in the BD, interface or VLAN view, the alarm threshold configured in the system view takes effect in the BD, interface and VLAN view."
}