{
    "PageTitle": "dhcp snooping nni server enable",
    "FuncDef": "The dhcp snooping nni server enable command enables NNIs to send DHCP reply messages to the host in a VSI scenario.\nThe undo dhcp snooping nni server enable command disables NNIs from sending DHCP reply messages to the host in a VSI scenario.\nBy default, NNIs are not enabled to send DHCP reply messages to the host in a VSI scenario.",
    "CLIs": [
        "dhcp snooping nni server enable",
        "undo dhcp snooping nni server enable"
    ],
    "ParentView": [
        "VSI-STATIC view",
        "VSI-BD view",
        "VSI-AUTO view",
        "VSI-BVSI view",
        "VSI-IVSI-MP2MP view",
        "VSI-IVSI-P2P view",
        "VSI-DEFAULT view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] dhcp snooping enable",
            "[*HUAWEI] vsi vsi1",
            "[*HUAWEI-vsi-vsi1] dhcp snooping nni server enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn a VSI scenario, if DHCP snooping needs to be configured for an AC interface when the DHCP server is deployed on the network side, you can run the dhcp snooping nni server enable command to enable NNIs to send DHCP reply messages to the host. After the command is run, binding entries can be generated, and users can go online.\nPrerequisites\nDHCP snooping has been enabled globally using the dhcp snooping enable command.\nFollow-up Procedure\nEnable DHCP snooping on an AC interface using the dhcp snooping enable command.\nPrecautions\nIn a VSI scenario, if dhcp snooping enable and dhcp snooping trusted commands are run on an NNI, and the dhcp snooping nni server enable command is run in the VSI view, the configurations on the NNI take effect. If multiple VSIs share the same NNI, the dhcp snooping nni server enable command takes effect on all VSIs, which may provoke the following problems:VSIs cannot be identified when the NNI sends DHCP reply messages to the host. As a result, DHCP snooping does not take effect, but users can go online.The NNI sends DHCP reply messages to the host even when DHCP snooping is not enabled on some of the VSIs, which increases device load.If a whitelist has been applied when dhcp snooping nni server is enabled, ensure that whitelist rules have been configured for all valid DHCP servers in the whitelist.When the dhcp snooping nni server enable command is configured in a VSI where a whitelist has been applied, the following message is displayed: Info: A whitelist has been applied. Configure complete whitelist rules for valid DHCP servers."
}