{
    "PageTitle": "domain",
    "FuncDef": "This command configures Connectivity Fault Management domain parameters.",
    "CLIs": [
        "domain <md-index> [ format { format } ] [ name <md-name> ] level <level> [ admin-name <admin-name> ]",
        "domain <md-index>",
        "no domain <md-index>"
    ],
    "ParentView": [
        "config>eth-cfm"
    ],
    "ParaDef": [
        {
            "Parameters": "md-index",
            "Info": "Specifies the Maintenance Domain (MD) index value. Values-1 to 4294967295."
        },
        {
            "Parameters": "format format",
            "Info": "Specifies a value that represents the type (format). Values-dns, mac, none, string. ParamDefault: Default- string"
        },
        {
            "Parameters": "name md-name",
            "Info": "Specifies a generic Maintenance Domain (MD) name. Values-1 to 43 characters."
        },
        {
            "Parameters": "level level",
            "Info": "Specifies the integer identifying the maintenance domain level (MD Level). Higher numbers correspond to higher maintenance domains, those with the greatest physical reach, with the highest values for customers' CFM packets. Lower numbers correspond to lower maintenance domains, those with more limited physical reach, with the lowest values for single bridges or physical links. Values-0 to 7."
        },
        {
            "Parameters": "admin-name admin-name",
            "Info": "Specifies a creation time required parameter that allows the operator to assign a name value to the domain container. This is used for information and migration purposes. This value cannot be modified without destroying the domain. If no admin-name exists, the configured md-index value will be converted into a character string to become the admin-name reference. When upgrading from a release that does not include the admin-name configuration option, the md-index will be converted into a character string. Once a value is assigned to this admin-name value it cannot be modified. Values-1 to 64 characters."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}