{
    "PageTitle": "mhf-creation",
    "FuncDef": "This command defines the MIP method of creation. MIP creation mode and other factors are part of the MIP creation authority (associationordefault-domain) logic. The MIP creation algorithm may result in multiple potential MIPs. Only the lowest-level valid MIP is installed. Thestaticcreation mode is the exception to the single MIP installation rule.",
    "CLIs": [
        "mhf-creation { none | default | explicit | static } level <level>",
        "no mhf-creation"
    ],
    "ParentView": [
        "config>eth-cfm>default-domain>bridge-identifier",
        "config>eth-cfm>domain>association>bridge-identifier"
    ],
    "ParaDef": [
        {
            "Parameters": "none",
            "Info": "Specifies that no MHFs (MIPs) can be created for this SAP or spoke SDP."
        },
        {
            "Parameters": "default",
            "Info": "Specifies MHFs (MIPs) can be created for this SAP or spoke SDP without the requirement for a MEP at some lower MA level. If a lower-level MEP exists, the creation method will behave as explicit."
        },
        {
            "Parameters": "explicit",
            "Info": "Specifies that MHFs (MIPs) can be created for this SAP or spoke SDP only if a MEP is created at some lower MD Level. There must be at least one lower MD Level MEP provisioned on the same SAP or spoke SDP."
        },
        {
            "Parameters": "defer",
            "Info": "Defers the MIP creation process to the system-wide read-only values. This parameter is only configurable under the default-domain context."
        },
        {
            "Parameters": "level",
            "Info": "Specifies the requested level of the MIP. This is used by the MIP creation algorithm to determine its validity in comparison to other ETH-CFM MIPs in the same service. If level is configured as \"defer\", the level value will be inherited from the global read-only system values, and \"-1\" will be stored as a MIB value in the table. Values-0 to 7, defer. ParamDefault: Default- defer"
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: config>eth-cfm>default-domain>bridge-identifier>mhf-creation deferconfig>eth-cfm>domain>association>bridge-identifier>mhf-creation none"
}