{
    "PageTitle": "parent",
    "FuncDef": "This command overrides the scheduler s parent weight and CIR weight information. The weights apply to the associated level or cir-level configured in the applied scheduler policy. The scheduler name must exist in the scheduler policy applied to the ingress or egress of the SAP or multi-service site.",
    "CLIs": [
        "parent [ weight <weight> ] [ cir-weight <cir-weight> ]",
        "no parent"
    ],
    "ParentView": [
        "config>service>cust>multi-service-site>ingress>sched-override>scheduler",
        "config>service>cust>multi-service-site>egress>sched-override>scheduler"
    ],
    "ParaDef": [
        {
            "Parameters": "weight",
            "Info": "Defines the relative weight of this scheduler in comparison to other child schedulers and queues at the same strict level defined by the level parameter in the applied scheduler policy. Within the level, all weight values from active children at that level are summed and the ratio of each active child s weight to the total is used to distribute the available bandwidth at that level. A weight is considered to be active when the policer, queue or scheduler the weight pertains to has not reached its maximum rate and still has packets to transmit. \nA 0 (zero) weight value signifies that the child scheduler will receive bandwidth only after bandwidth is distributed to all other non-zero weighted children in the strict level. Values-0 to 100. ParamDefault: Default- 1"
        },
        {
            "Parameters": "cir-weight",
            "Info": "Defines the relative weight of this scheduler in comparison to other child schedulers and queues at the same cir-level defined by the cir-level parameter in the applied scheduler policy. Within the strict cir-level, all cir-weight values from active children at that level are summed and the ratio of each active child s cir-weight to the total is used to distribute the available bandwidth at that level. A cir-weight is considered to be active when the policer, queue or scheduler that the cir-weight pertains to has not reached the CIR and still has packets to transmit.\nA 0 (zero) cir-weight value signifies that the child scheduler will receive bandwidth only after bandwidth is distributed to all other non-zero weighted children in the strict cir-level. Values-0 to 100. ParamDefault: Default- 0"
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: no parent"
}