{
    "PageTitle": "pw-template",
    "FuncDef": "This command configures an SDP template.",
    "CLIs": [
        "pw-template <policy-id> [ use-provisioned-sdp | [ prefer-provisioned-sdp ] [ auto-gre-sdp ] ] [ create ] [ name <name> ]",
        "no pw-template <policy-id>"
    ],
    "ParentView": [
        "config>service"
    ],
    "ParaDef": [
        {
            "Parameters": "policy-id",
            "Info": "Specifies a number that uniquely identifies a template for the creation of an SDP. Values-policy-id: 1 to 2147483647."
        },
        {
            "Parameters": "use-provisioned-sdp",
            "Info": "Specifies whether to use an already provisioned SDP. When specified, the tunnel manager is consulted for an existing active SDP (with a matching far-end address), and the SDP with the lowest metric is chosen. If there are multiple SDPs with the same metric, then the highest SDP identifier that is oper-up is chosen. The choice of SDP can be configured by applying sdp-include/exclude in the PW template together with an sdp-group in the provisioned SDPs. This option, and the auto-gre-sdp option, are mutually exclusive."
        },
        {
            "Parameters": "prefer-provisioned-sdp",
            "Info": "Specifies that if an existing matching SDP that conforms to any restrictions defined in the pw-template is found (for example, sdp-include/exclude group), then it will be used, following the same logic as for the use-provisioned-sdp parameter. Otherwise, the command will automatically create an SDP in the same manner as if the user did not specify any option. This option and the use-provisioned-sdp option are mutually exclusive."
        },
        {
            "Parameters": "auto-gre-sdp",
            "Info": "Specifies that an SDP should automatically be created using a GRE tunnel. This option and the use-provisioned-sdp option are mutually exclusive. The PW template parameters hash-label, entropy-label and sdp-include/exclude are ignored when an GRE SDP is auto-created."
        },
        {
            "Parameters": "auto-mpls-sdp",
            "Info": "Specifies that an SDP should automatically be created using an MPLS tunnel. This is the default."
        },
        {
            "Parameters": "create",
            "Info": "This keyword is required when first creating the configuration context. Once the context is created, it is possible to navigate into the context without the create keyword."
        },
        {
            "Parameters": "name name",
            "Info": "A name of the operator s choice, up to 64 characters. The name is saved as part of the configuration. Values-name: 64 characters maximum."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: auto-mpls-sdp"
}