{
    "PageTitle": "sdp",
    "FuncDef": "This command creates or edits a Service Distribution Point (SDP). SDPs must be explicitly configured.",
    "CLIs": [
        "sdp <sdp-id> [ <delivery-type> ] [ create ]",
        "no sdp <sdp-id>"
    ],
    "ParentView": [
        "config>service"
    ],
    "ParaDef": [
        {
            "Parameters": "sdp-id",
            "Info": "Specifies the SDP identifier. Values-1 to 17407."
        },
        {
            "Parameters": "gre",
            "Info": "Specifies the SDP will use GRE to reach the far-end router. The GRE encapsulation of the MPLS service packet uses the base 4-byte header as per RFC 2890. The optional fields Checksum (plus Reserved field), Key, and Sequence Number are not inserted. Only one GRE SDP can be created to a given destination address. Multiple GRE SDPs to a single destination address serve no purpose as the path taken to reach the far end is determined by the IGP which will be the same for all SDPs to a given destination and there is no bandwidth reservation in GRE tunnels."
        },
        {
            "Parameters": "mpls",
            "Info": "Specifies the SDP will use MPLS encapsulation and one or more LSP tunnels to reach the far-end device. Multiple MPLS SDPs may be created to a given destination device. Multiple MPLS SDPs to a single destination device are helpful when they use divergent paths."
        },
        {
            "Parameters": "l2tpv3",
            "Info": "Specifies the SDP will use L2TPv3-over-IPv6 encapsulation for the 7750 SR or 7950 XRS. One SDP is created per service, regardless of whether the far-end node is common or not. Unique local and far-end addresses are configured for every L2TPv3 SDP type. The local address must exist on the local node."
        },
        {
            "Parameters": "eth-gre-bridged",
            "Info": "Configures the SDP as an L2oGRE tunnel that is terminated on an FPE-based PW port. Only the end-points of such a tunnel (the far-end IPv4/IPv6 address or local-end IPv4/IPv6 address) are allowed to be configured under this SDP."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: none"
}