{
    "PageTitle": "interface l2",
    "FuncDef": "The interface l2 command displays-the-view-of-an-existing-interface or creates a Layer 2 sub-interface and displays the Layer 2 sub-interface view.\nThe undo interface command deletes a Layer 2 sub-interface.\nBy default, this type of port is not created.",
    "CLIs": [
        "interface { <interface-name> | <interface-type> <interface-number> } { <mode> l2 }",
        "undo interface { <interface-name> | <interface-type> <interface-number> }"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "interface-name",
            "Info": "Specifies an interface name.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "interface-type",
            "Info": "Specifies the type of an interface.\n-"
        },
        {
            "Parameters": "interface-number",
            "Info": "Specifies the number of an interface.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0.1 mode l2"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 10GE 1/0/0.1 mode l2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe Ethernet virtual connection (EVC) module defines Layer 2 sub-interfaces as service access points. Only Layer 2 sub-interface provides access services. To create a Layer 2 sub-interface, run the interface l2 command.\nThe Virtual eXtensible Local Area Network (VXLAN) module defines Layer 2 sub-interfaces as service access points. Only Layer 2 sub-interface provide access services. To create a Layer 2 sub-interface, run the interface l2 command.\nPrecautions\nAfter a logical interface is deleted using the undo interface command, all the configurations on the interface are automatically deleted. These configurations cannot be restored even if you create an interface same as the one deleted.\nLayer 2 sub-interfaces can only send access packets to bridge domains, not Layer 3 networks. Each Layer 2 sub-interface can be added to only one BD."
}