{
    "PageTitle": "authentication-order",
    "FuncDef": "This command configures the sequence in which password authentication, authorization, and accounting is attempted among local passwords, RADIUS, TACACS+, and LDAP.",
    "CLIs": [
        "authentication-order [ <method-1> ] [ <method-2> ] [ <method-3> ] [ <method-4> ] [ exit-on-reject ]",
        "no authentication-order"
    ],
    "ParentView": [
        "config>system>security>password"
    ],
    "ParaDef": [
        {
            "Parameters": "method-1",
            "Info": "Specifies the first password authentication method to attempt. Values-local, radius, tacplus, ldap."
        },
        {
            "Parameters": "method-2",
            "Info": "Specifies the second password authentication method to attempt. Values-local, radius, tacplus, ldap."
        },
        {
            "Parameters": "method-3",
            "Info": "Specifies the third password authentication method to attempt. Values-local, radius, tacplus, ldap."
        },
        {
            "Parameters": "method-4",
            "Info": "Specifies the fourth password authentication method to attempt. Values-local, radius, tacplus, ldap."
        },
        {
            "Parameters": "local",
            "Info": "Specifies the password authentication based on the local password database."
        },
        {
            "Parameters": "radius",
            "Info": "Specifies RADIUS authentication."
        },
        {
            "Parameters": "tacplus",
            "Info": "Specifies TACACS+ authentication."
        },
        {
            "Parameters": "ldap",
            "Info": "Specifies LDAP authentication."
        },
        {
            "Parameters": "exit-on-reject",
            "Info": "When enabled and if one of the AAA methods configured in the authentication order sends a reject, then the next method in the order will not be tried. If the exit-on-reject keyword is not specified and if one AAA method sends a reject, the next AAA method will be attempted. If in this process, all the AAA methods are exhausted, it will be considered as a reject."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: authentication-order radius tacplus ldap local - The preferred order for password authentication is 1. local passwords, 2. RADIUS, 3. TACACS+, and 4. LDAP."
}