{
    "PageTitle": "authentication",
    "FuncDef": "This command configures the authentication and encryption method the user must use in order to be validated by the router. SNMP authentication allows the device to validate the managing node that issued the SNMP message and determine if the message has been tampered.",
    "CLIs": [
        "authentication { [ none ] | [ [ hash ] { md5 <key-1> | sha <key-1> } privacy { none | des-key <key-2> | aes-128-cfb-key <key-2> } ] }",
        "no authentication"
    ],
    "ParentView": [
        "config>system>security>user>snmp"
    ],
    "ParaDef": [
        {
            "Parameters": "none",
            "Info": "Do not use authentication. If none is specified, then privacy cannot be configured."
        },
        {
            "Parameters": "hash",
            "Info": "When hash is not specified, then non-encrypted characters can be entered. When hash is configured, then all specified keys are stored in an encrypted format in the configuration file. The key must be entered in encrypted form when the hash parameter is used."
        },
        {
            "Parameters": "md5 key-1",
            "Info": "Use an HMAC-MD5-96 authentication key."
        },
        {
            "Parameters": "sha key-1",
            "Info": "Use an HMAC-SHA-96 authentication key."
        },
        {
            "Parameters": "privacy none",
            "Info": "Do not perform SNMP packet encryption. ParamDefault: Default- privacy none"
        },
        {
            "Parameters": "privacy des-key key-2",
            "Info": "Use DES for SNMP payload encryption and configure the key. The key must be a 32 hex-character string and is stored in an encrypted format."
        },
        {
            "Parameters": "privacy aes-128-cfb-key key-2",
            "Info": "Use 128 bit CFB mode AES for SNMP payload encryption and configure the key. The key must be a 32 hex-character string and is stored in an encrypted format. ParamDefault: Default-  privacy none"
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: no authentication"
}