{
    "PageTitle": "cpu-protection",
    "FuncDef": "Use this command to apply a specific CPU protection policy to the associated msap-policy. The specified cpu-protection policy will automatically be applied to any MSAPs that are create using the msap-policy.",
    "CLIs": [
        "cpu-protection <policy-id> { [ mac-monitoring ] | [ eth-cfm-monitoring [ aggregate ] [ car ] ] | [ ip-src-monitoring ] }",
        "no cpu-protection"
    ],
    "ParentView": [
        "config>service>ies>if>sap",
        "config>service>ies>if>spoke-sdp",
        "config>service>ies>sub-if>grp-if>sap",
        "config>service>vprn>if>sap",
        "config>service>vprn>if>spoke-sdp",
        "config>service>vprn>sub-if>grp-if>sap"
    ],
    "ParaDef": [
        {
            "Parameters": "mac-monitoring",
            "Info": "Enables per SAP + source MAC address rate limiting using the per-source-rate from the associated cpu-protection policy."
        },
        {
            "Parameters": "ip-src-monitoring",
            "Info": "Enables per SAP + IP source address rate limiting for certain protocol packets using the per-source-rate and include-protocols from the associated cpu-protection policy. The ip-src-monitoring is useful in subscriber management architectures that have routers between the subscriber and the BNG (router). In layer-3 aggregation scenarios all packets from all subscribers behind the same aggregation router will arrive with the same source MAC address and as such the mac-monitoring functionality can not differentiate traffic from different subscribers."
        },
        {
            "Parameters": "eth-cfm-monitoring",
            "Info": "Enables the Ethernet Connectivity Fault Management cpu-protection extensions on the associated SAP/SDP/template."
        },
        {
            "Parameters": "aggregate",
            "Info": "applies the rate limit to the sum of the per-peer packet rates."
        },
        {
            "Parameters": "car",
            "Info": "(Committed Access Rate) Ignores Eth-CFM packets when enforcing overall-rate."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: cpu-protection 254 (for access interfaces)cpu-protection 255 (for network interfaces)The configuration of no cpu-protection returns the msap-policy to the default policies as shown above."
}