{
    "PageTitle": "entry",
    "FuncDef": "This command defines a particular key in the keychain. Entries are defined by an entry-id. A keychain must have valid entries for the TCP Enhanced Authentication mechanism to work.",
    "CLIs": [
        "entry <entry-id> [ key <authentication-key> | <hash-key> | <hash2-key> ] [ hash | hash2 ] [ algorithm <algorithm> ]",
        "no entry <entry-id>"
    ],
    "ParentView": [
        "config>system>security>keychain>direction>bi",
        "config>system>security>keychain>direction>uni>receive",
        "config>system>security>keychain>direction>uni>send"
    ],
    "ParaDef": [
        {
            "Parameters": "entry-id",
            "Info": "Specifies an entry that represents a key configuration to be applied to a keychain. Values-0 to 63."
        },
        {
            "Parameters": "key",
            "Info": "Specifies a key ID which is used along with keychain-name and direction to uniquely identify this particular key entry."
        },
        {
            "Parameters": "authentication-key",
            "Info": "Specifies the authentication-key that will be used by the encryption algorithm. The key is used to sign and authenticate a protocol packet. Values-A key must be 160 bits for algorithm hmac-sha-1-96 and must be 128 bits for algorithm aes-128-cmac-96. If the key given with the entry command amounts to less than this number of bits, then it is padded internally with zero bits up to the correct length.."
        },
        {
            "Parameters": "algorithm-algorithm",
            "Info": "Specifies an enumerated integer that indicates the encryption algorithm to be used by the key defined in the keychain. Values-aes-128-cmac-96 - Specifies an algorithm based on the AES standard for TCP authentication.\nhmac-sha-1-96 - Specifies an algorithm based on SHA-1 for RSVP-TE and TCP authentication.\nmessage-digest - MD5 hash used for TCP authentication. \nhmac-md5 - MD5 hash used for IS-IS and RSVP-TE.\npassword - Specifies a simple password authentication for OSPF, IS-IS, and RSVP-TE.\nhmac-sha-1 - Specifies the sha-1 algorithm for OSPF, IS-IS, and RSVP-TE.\nhmac-sha-256 - Specifies the sha-256 algorithm for OSPF and IS-IS.."
        },
        {
            "Parameters": "hash-key | hash2-key",
            "Info": "Specifies the hash key. The key can be any combination of ASCII characters up to 33 for the hash-key and 96 characters for the hash2-key in length (encrypted). If spaces are used in the string, enclose the entire string in quotation marks (\" \")."
        },
        {
            "Parameters": "hash",
            "Info": "Specifies the key is entered in an encrypted form. If the hash or hash2 parameter is not used, the key is assumed to be in an unencrypted, clear text form. For security, all keys are stored in encrypted form in the configuration file with the hash or hash2 parameter specified."
        },
        {
            "Parameters": "hash2",
            "Info": "Specifies the key is entered in a more complex encrypted form that involves more variables than the key value alone, meaning that the hash2 encrypted variable cannot be copied and pasted. If the hash or hash2 parameter is not used, the key is assumed to be in an unencrypted, clear text form. For security, all keys are stored in encrypted form in the configuration file with the hash or hash2 parameter specified."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: There are no default entries."
}