{
    "PageTitle": "server",
    "FuncDef": "This command adds a Dot1x server and configures the Dot1x server IP address, index, and key values.",
    "CLIs": [
        "server <server-index> address <ip-address> secret <key> [ hash | hash2 ] [ auth-port <auth-port> ] [ acct-port <acct-port> ] [ type <server-type> ]"
    ],
    "ParentView": [
        "config>system>security>dot1x>radius-plcy"
    ],
    "ParaDef": [
        {
            "Parameters": "server-index",
            "Info": "Specifies the index for the Dot1x server. The index determines the sequence in which the servers are queried for authentication requests. Servers are queried in order from lowest to highest index. Values-1 to 5."
        },
        {
            "Parameters": "ip-address",
            "Info": "Specifies the IP address of the Dot1x server. Two Dot1x servers cannot have the same IP address. An error message is generated if the server address is a duplicate."
        },
        {
            "Parameters": "key",
            "Info": "Specifies the secret key to access the Dot1x server. This secret key must match the password on the Dot1x server. Values-Up to 128 characters in length.."
        },
        {
            "Parameters": "hash",
            "Info": "Specifies the key is entered in an encrypted form. If the hash or hash2 parameter is not used, the key is assumed to be in an unencrypted, clear text form. For security, all keys are stored in encrypted form in the configuration file with the hash or hash2 parameter specified."
        },
        {
            "Parameters": "hash2",
            "Info": "Specifies the key is entered in a more complex encrypted form that involves more variables than the key value alone, meaning that the hash2 encrypted variable cannot be copied and pasted. If the hash or hash2 parameter is not used, the key is assumed to be in an unencrypted, clear text form. For security, all keys are stored in encrypted form in the configuration file with the hash or hash2 parameter specified."
        },
        {
            "Parameters": "acct-port",
            "Info": "Specifies the UDP port number on which to contact the RADIUS server for accounting requests."
        },
        {
            "Parameters": "auth-port",
            "Info": "Specifies a UDP port number to be used as a match criteria. Values-1 to 65535."
        },
        {
            "Parameters": "server-type",
            "Info": "Specifies the server type. Values-authorization, accounting, combined."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: no server"
}