{
    "PageTitle": "nat64 alg",
    "FuncDef": "The nat64 alg command enables the Network Address Translation IPv6-to-IPv4 (NAT64) application level gateway (ALG) function.\nThe undo nat64 alg command disables the NAT64 ALG function.\nBy default, the NAT64 ALG function is enabled for ICMP, regardless of whether the NAT64 ALG function is configured.",
    "CLIs": [
        "nat64 alg { ftp [ rate-threshold <value> ] | dns | http | all }",
        "undo nat64 alg { ftp [ rate-threshold [ <value> ] ] | dns | http | all }"
    ],
    "ParentView": [
        "NAT64 instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "ftp",
            "Info": "Enables or disables the NAT64 ALG function for the FTP protocol.\n-"
        },
        {
            "Parameters": "rate-threshold value",
            "Info": "Sets the rate limit on FTP packets.\nThe value is an integer ranging from 64 to 10000, in packets/second."
        },
        {
            "Parameters": "dns",
            "Info": "Enables or disables the NAT64 ALG function for the DNS protocol.\n-"
        },
        {
            "Parameters": "http",
            "Info": "Enables or disables the NAT64 ALG function for the HTTP protocol.\n-"
        },
        {
            "Parameters": "all",
            "Info": "Enables or disables the NAT64 ALG function for all application layer protocols.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat64 instance nat1 id 1",
            "[*HUAWEI-nat64-instance-nat1] nat64 alg ftp rate-threshold 4000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe application level gateway (ALG) provides transparent translation for some application layer protocols. For special protocols (for example, FTP) the Data field in a packet contains IP address or port information. NAT64, however, does not take effect on an IP address or port information in the Data field of a packet. As a result, a protocol-specific connection fails to be established. A good way to solve the NAT64 issue for these special protocols is to use the ALG function. Functioning as a special conversion agent for application protocols, the ALG interacts with the NAT64 device to establish states. The ALG uses NAT64 state information to change the specific data in the Data field of IP packets and to complete other necessary work, so that application protocols can run across internal and external networks.\nConfiguration Impact\nAfter the ALG function is enabled in the NAT64 instance view, traffic of specified application protocols in a specified NAT64 instance can be processed by the ALG."
}