{
    "PageTitle": "nat64 log enable",
    "FuncDef": "The nat64 log enable command enables NAT64 session and user log functions.\nThe undo nat64 log enable command disables NAT64 session and user log functions.\nBy default, the NAT64 session and user log functions are disabled.",
    "CLIs": [
        "nat64 log user enable [ syslog ]",
        "nat64 log session enable [ elog | syslog ]",
        "undo nat64 log user enable [ syslog ]",
        "undo nat64 log session enable [ elog | syslog ]"
    ],
    "ParentView": [
        "NAT64 instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "syslog",
            "Info": "Indicates logs in the Syslog format.\n-"
        },
        {
            "Parameters": "session",
            "Info": "Enables or disables the NAT64 session log function.\n-"
        },
        {
            "Parameters": "elog",
            "Info": "Specifies logs in the binary format.\n-"
        },
        {
            "Parameters": "user",
            "Info": "Enables or disables the NAT64 user log function. This parameter is supported only by the VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat64 instance nat1 id 1",
            "[*HUAWEI-nat64-instance-nat1] nat64 log session enable elog"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nNAT64 logs are system information generated by a NAT64 device during NAT64 operation. The log messages contain basic information about users and NAT64 operation information. They record intranet users' access to external networks and external users' access to internal servers. When intranet users access an external network through a NAT64 device, they share an external network address. For this reason, the users accessing the external network cannot be located. The logging function helps trace and record intranet users' access to external networks in real time, enhancing network maintainability.\nPrerequisites\nA log host has been configured in a NAT64 instance.\nFollow-up Procedure\nRun the nat64 log host command to set the log host's IP address, port number.\nPrecautions\nWhen the nat64 log user enable command without a format configured is run, the syslog flow log format is used by default for NAT64 user logs."
}