{
    "PageTitle": "nat64 filter mode full-cone",
    "FuncDef": "The nat64 filter mode full-cone command configures the full-cone (3-tuple) mode used to translate all addresses in a NAT64 instance.\nThe undo nat64 filter mode full-cone command restores the default configuration.\nBy default, the symmetrical (5-tuple) address translation mode is used.",
    "CLIs": [
        "nat64 filter mode full-cone",
        "undo nat64 filter mode full-cone"
    ],
    "ParentView": [
        "NAT64 instance view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat64 instance nat1 id 1",
            "[*HUAWEI-nat64-instance-nat1] nat64 filter mode full-cone"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nNAT64 address translation can be performed in either symmetric or full-cone mode.\nSymmetric mode: also called the 5-tuple mode. A 5-tuple entry contains a source IP address, source port number, protocol type, destination IP address, and destination port number, which is used to translate addresses and filter packets. If packets carrying the same source IP address and port number but different destination IP addresses and port numbers are translated by a device using NAT64, the source IP address and port number in the packets are translated into different external IP addresses and port numbers, respectively. In addition, the device allows only the external network hosts with these destination IP addresses to use the translated IP addresses and port numbers to visit internal network hosts.Full-cone mode: also known as the 3-tuple mode that is not concerned with destination addresses or destination port numbers. In this mode, a NAT64 device assigns IP addresses and filters packets based on source addresses, source port numbers, and protocol type. If packets carrying the same source IP address and port number are translated by a device using NAT64, the source IP address and port number in the packets are translated into the same external IP address and port number, respectively. In addition, the device allows external network hosts to use the translated IP addresses and port numbers to visit internal network hosts.\n\nPrecautions\nThe nat64 filter mode full-cone command takes effect only on VSUF-80/VSUF-160/VSUI-160-E.\nExercise caution when switching a translation mode in the service instance view on a VSUF-80/VSUF-160/VSUI-160-E. Such a mode change causes existing session tables to be reestablished, which may result in a maximum of a 150s traffic interruption.If an instance is bound to a VSUF-80/VSUF-160, the interval at which translation modes are switched is 75s.If an instance is bound to a VSUI-160-E/VSUI-160-E/VSUI-400/VSUI-400-E the interval at which translation modes are switched is 150s."
}