{
    "PageTitle": "nat64 alarm port-number threshold",
    "FuncDef": "The nat64 alarm port-number threshold command sets an alarm threshold for the port usage in a NAT64 address pool or the user-based port usage.\nThe undo nat64 alarm port-number threshold command restores the default alarm thresholds for the port usage in a NAT64 address pool or the user-based port usage.\nThe default port usage in a NAT64 address pool and user-based port usage is 80%.",
    "CLIs": [
        "nat64 alarm address-group port-number threshold <value>",
        "nat64 alarm user port-number threshold <value>",
        "undo nat64 alarm address-group port-number threshold [ <value> ]",
        "undo nat64 alarm user port-number threshold [ <value> ]"
    ],
    "ParentView": [
        "NAT64 instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "value",
            "Info": "Sets the alarm threshold of the usage of the NO-PAT address pool.\nThe value is an integer ranging from 60 to 100, in percentage. The default value is 80%."
        },
        {
            "Parameters": "user",
            "Info": "Indicates the alarm threshold for the user-based port usage.\n-"
        },
        {
            "Parameters": "address-group",
            "Info": "Indicates the alarm threshold for the port usage in a NAT64 address pool.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat64 instance nat1 id 1",
            "[*HUAWEI-nat64-instance-nat1] nat64 alarm address-group port-number threshold 85"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo monitor NAT64 port usage, run the nat64 alarm port-number threshold command to set an alarm threshold for the port usage in a NAT64 address pool or the user-based port usage. If the port usage in a NAT64 address pool or the user-based port usage exceeds the alarm threshold, the system generates an alarm and records a log. After the port usage decreases to 87.5% or lower, the alarm is cleared.\nPrecautions\nThe number of user-specific pre-allocated ports is equal to the number of ports configured in the port-range command run in the NAT64 instance view. Usage of user-specific ports is equal to the number of user-specific ports in use divided by the number of user-specific pre-allocated ports. The nat alarm user port-number threshold command takes effect only after the port-range command is run in the NAT64 instance view. If usage of user-specific ports in use is greater than the alarm threshold threshold-value (80% by default) for usage-specific port usage, an alarm indicating that usage of user-specific ports in use exceeds the threshold is generated."
}