{
    "PageTitle": "nat64 server",
    "FuncDef": "The nat64 server global command specifies an internal server address in a NAT64 instance.\nThe undo nat64 server global command deletes an internal server address from a NAT64 instance.\nBy default, no internal server address is configured in a NAT64 instance.",
    "CLIs": [
        "nat64 server global <global-address> [ vpn-instance <vpn-instance-name> ] inside <host-address> prefix-id <prefix-id>",
        "undo nat64 server global <global-address> [ vpn-instance <vpn-instance-name> ] inside <host-address> prefix-id <prefix-id>"
    ],
    "ParentView": [
        "NAT64 instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies a VPN instance name.\nThe value is a string of 1 to 31 case-sensitive characters. The VPN instance name cannot be _public_. The string can contain spaces only if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "inside host-address",
            "Info": "Specifies the IPv6 address of an internal server.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "prefix-id prefix-id",
            "Info": "Specifies an IPv6 prefix.\nThe value is an integer ranging from 1 to 16."
        },
        {
            "Parameters": "global global-address",
            "Info": "Specifies the IPv4 address of an internal server.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat64 instance nat1 id 1",
            "[~HUAWEI-nat64-instance-nat1] nat64 prefix 64:FF9B:: prefix-length 96 1",
            "[~HUAWEI-nat64-instance-nat1] nat64 server global 10.12.12.12 inside 2001:db8::1 prefix-id 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nNAT64 converts IPv6 addresses into IPv4 addresses and shields the internal network, including hosts on the internal network. If a device on an external network needs to access an internal host, for example, a web server, you can configure the mapping between external IPv4 addresses and the pairs of internal IPv6 addresses and prefixes to implement reverse translation from IPv4 addresses to IPv6 addresses.\nPrecautions\nBefore configuring a NAT64 internal server, configure a NAT64 prefix.\nThe global-address must be different from an existing IP address assigned to a device or its interface, preventing IP address conflicts."
}