{
    "PageTitle": "nat64 session aging-time",
    "FuncDef": "The nat64 session aging-time command sets the aging time for a specific or multiple types of NAT64 sessions.\nThe undo nat64 session aging-time command restores the default aging time for a specific or multiple types of NAT64 sessions.\nThe default aging time for a specific or multiple types of NAT64 sessions is the default aging time.",
    "CLIs": [
        "nat64 session aging-time { tcp | udp | icmp | fragment | fin-rst | syn | ftp | rtsp | sip | pptp } aging-time",
        "undo nat64 session aging-time { tcp | udp | icmp | fragment | fin-rst | syn | ftp | rtsp | sip | pptp } [ aging-time ]"
    ],
    "ParentView": [
        "NAT64 instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "tcp",
            "Info": "Indicates TCP sessions.\n-"
        },
        {
            "Parameters": "udp",
            "Info": "Indicates UDP sessions.\n-"
        },
        {
            "Parameters": "icmp",
            "Info": "Indicates ICMP sessions.\n-"
        },
        {
            "Parameters": "fragment",
            "Info": "Specifies the session table of the fragment type.\n-"
        },
        {
            "Parameters": "fin-rst",
            "Info": "Indicates TCP FIN/RST  sessions.\n-"
        },
        {
            "Parameters": "syn",
            "Info": "Indicates SYN sessions.\n-"
        },
        {
            "Parameters": "ftp",
            "Info": "Indicates FTP sessions.\n-"
        },
        {
            "Parameters": "rtsp",
            "Info": "Indicates RSTP sessions.\n-"
        },
        {
            "Parameters": "sip",
            "Info": "Indicates SIP sessions.\n-"
        },
        {
            "Parameters": "pptp",
            "Info": "Indicates PPTP sessions.\n-"
        },
        {
            "Parameters": "aging-time",
            "Info": "Specifies an aging time.\nFor Fragment sessions, the value ranges from 40 to 4000, in milliseconds.For other types of sessions, the value is an integer ranging from 1 to 40000, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat64 instance nat1 id 1",
            "[*HUAWEI-nat64-instance-nat1] nat64 session aging-time tcp 420"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo set the aging time for a specific or multiple types of NAT sessions, run the nat session aging-time command. The aging time of NAT session entries of different protocols can be set, so that expired NAT session entries age as soon as possible, and system resources can be released.\nThe default aging time of TCP is 240sThe default aging time of UDP is 240sThe default aging time of ICMP is 20sThe default aging time of RTSP is 240sThe default aging time of fragment is 5000msThe default aging time of fin-rst is 5sThe default aging time of syn is 5sThe default aging time of FTP is 600sThe default aging time of SIP is 800sThe default aging time of PPTP is 180s\n\nConfiguration Impact\nAfter an aging time is set for a specified type of NAT session entry, the session entries age after the configured aging time elapses. The changed aging time does not take effect for the generated NAT64 session entries.\nPrecautions\nIf an aging time is set in a NAT64 instance, the aging time takes effect on sessions established in the instance. If no aging time is set in a NAT64 instance, the global aging time takes effect on sessions established in the instance."
}