{
    "PageTitle": "nat64 alg server-address",
    "FuncDef": "The nat64 alg server-address command enables the NAT64 server filter function.\nThe undo nat64 alg server-address command disables the NAT64 server filter function.\nBy default, this function is disabled in the system view.",
    "CLIs": [
        "nat64 alg server-address <server-ip> [ <end-ip> ] protocol { all | dns | ftp | http }",
        "undo nat64 alg server-address <server-ip> [ <end-ip> ] protocol { all | dns | ftp | http }"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "server-ip",
            "Info": "Specifies the IP address of an IPv4 server or a start IP address in an IP address list.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "end-ip",
            "Info": "Specifies an end IP address in an IP address list of IPv4 servers.\nThe value is in dotted decimal notation. An IPv4 server address list is a consecutive address range. The end-ip value must be greater than the start-ip value."
        },
        {
            "Parameters": "protocol",
            "Info": "Specifies the protocol.\n-"
        },
        {
            "Parameters": "all",
            "Info": "Configures IPv4 server address lists for all application layer protocols.\n-"
        },
        {
            "Parameters": "dns",
            "Info": "Configures an IPv4 server address list for the DNS protocol.\n-"
        },
        {
            "Parameters": "ftp",
            "Info": "Configures an IPv4 server address list for the FTP protocol.\n-"
        },
        {
            "Parameters": "http",
            "Info": "Configures an IPv4 server address list for the HTTP protocol.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat64 alg server-address 10.10.10.1 protocol ftp"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure IPv4 server addresses of NAT64 ALG for a specific or all application layer protocols, run the nat64 alg server-address command. You can specify either an IPv4 server address or an IPv4 server address list that is a consecutive address range. If a single ALG server is used, a specific IPv4 server address is configured. If multiple ALG servers are configured and use consecutive addresses, an IPv4 server address range is configured. The device performs NAT64 ALG for packets of an application protocol only if the configured IPv4 server address list contains the IPv4 server address of the application layer protocol.An ALG server address list is configured in the system view. A single address or an address segment that contains consecutive addresses can be specified in the list. After the NAT64 server filter function is enabled, ALG is performed for traffic of the servers that are contained in the list.\nPrecautions\nAfter an IPv4 server address or an IPv4 server address list of NAT64 ALG for a specific or all application layer protocols is configured, the configuration can take effect only if the ALG function for the application layer protocols is enabled in the NAT64 instance view.\nThis restriction does not take effect on traffic that is forwarded using the NAT64 internal server function,can be processed using ALG."
}