{
    "PageTitle": "nat64 session-limit",
    "FuncDef": "The nat64 session-limit enable command enables the NAT64 session number limit function.\nThe nat64 session-limit command sets the maximum number of NAT64 sessions that can be established.\nThe undo nat64 session-limit enable command disables the NAT64 session number limit function.\nThe undo nat64 session-limit command restores the default configuration.\n\nBy default, The NAT64 session number limit function is enabled. The maximum number of user-to-network NAT64 sessions for each user of a specific or all three protocols is as follows:\n\nTCP or UDP: 10240\n\nICMP: 512\n\nTCP, UDP, and ICMP: 8192",
    "CLIs": [
        "nat64 session-limit { icmp | tcp | udp | total } <session-number>",
        "nat64 session-limit enable",
        "undo nat64 session-limit { icmp | tcp | udp | total } [ <session-number> ]",
        "undo nat64 session-limit enable"
    ],
    "ParentView": [
        "NAT64 instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "icmp",
            "Info": "Configures a limit on the number of ICMP NAT64 sessions.\n-"
        },
        {
            "Parameters": "tcp",
            "Info": "Configures a limit on the number of TCP NAT64 sessions.\n-"
        },
        {
            "Parameters": "udp",
            "Info": "Configures a limit on the number of UDP NAT64 sessions.\n-"
        },
        {
            "Parameters": "total",
            "Info": "Configures a limit on the number of NAT64 sessions for all application layer protocols.\n-"
        },
        {
            "Parameters": "session-number",
            "Info": "Sets the maximum number of NAT64 sessions that can be established.\nThe value is an integer ranging from 50 to 65535."
        },
        {
            "Parameters": "enable",
            "Info": "Enables the limitation on the maximum number of user-to-network NAT64 sessions.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat64 instance nat1 id 1",
            "[*HUAWEI-nat64-instance-nat1] nat64 session-limit total 20000"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat64 instance nat1 id 1",
            "[*HUAWEI-nat64-instance-nat1] nat64 session-limit enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo enable the NAT64 session number limit function, run the nat64 session-limit enable command. The limit on the number of NAT64 sessions configured using the nat64 session-limit command takes effect only after the NAT64 session number limit function is enabled.\nTo set the maximum number of user-based NAT sessions that can be established, run the nat64 session-limit command in the NAT64 instance view.\nPrerequisites\nThe limitation on the number of user-specific NAT64 sessions has been enabled using the nat64 session-limit enable command.\nConfiguration Impact\nWhen the number of NAT64 sessions of a user reaches the upper limit, additional NAT64 sessions cannot be established. After existing NAT64 sessions age and the number of established sessions falls below the upper limit, new sessions can be established for the user.\nPrecautions\nThe nat64 session-limit command takes effect only on the VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S."
}