{
    "PageTitle": "nat64 alarm port-number",
    "FuncDef": "The nat64 alarm port-number address-group disable command disables the log and alarm functions of port usage of a NAT64 public IP address pool.\nThe nat64 alarm port-number user enable command enables the log and alarm functions for NAT64 user port usage.\nThe undo nat64 alarm port-number address-group disable command restores the default function.\nThe undo nat64 alarm port-number user enable command disables the log and alarm functions for NAT64 user port usage.\nBy default, the log and alarm functions of port usage of a NAT64 public IP address pool are enabled, the log and alarm functions for NAT64 user port usage are disabled.",
    "CLIs": [
        "nat64 alarm port-number { trap | log } user enable",
        "nat64 alarm port-number { trap | log } address-group disable",
        "undo nat64 alarm port-number { trap | log } user enable",
        "undo nat64 alarm port-number { trap | log } address-group disable"
    ],
    "ParentView": [
        "NAT64 instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "trap",
            "Info": "Enables or disables the alarm function for NAT64 user port usage, or the alarm function of usage of a NO-PAT address pool, or the alarm function of port usage of a NAT64 public IP address pool.\n-"
        },
        {
            "Parameters": "log",
            "Info": "Enables or disables the log function for NAT64 user port usage, or the log function of usage of a NO-PAT address pool, or the log function of port usage of a NAT64 public IP address pool.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat64 instance nat1 id 1",
            "[*HUAWEI-nat64-instance-nat1] nat64 alarm port-number log user enable",
            "[*HUAWEI-nat64-instance-nat1] nat64 alarm port-number trap user enable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat64 instance nat1 id 1",
            "[*HUAWEI-nat64-instance-nat1] nat64 alarm port-number log address-group disable",
            "[*HUAWEI-nat64-instance-nat1] nat64 alarm port-number trap address-group disable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo monitor NAT64 port usage, run the undo nat64 alarm port-number address-group disable command to enable the log and alarm functions of port usage of a NAT64 public IP address pool. If the number of used or pre-allocated ports in a NAT64 address pool exceeds a specified alarm threshold, a device generates an alarm and records a log.\nThe log and alarm functions of port usage of a NAT64 public IP address pool are enabled by default. If you do not need to monitor port usage in a NAT64 address pool, run the nat64 alarm port-number address-group disable command to disable the log and alarm functions of port usage of the NAT64 public IP address pool.\nTo monitor port usage of NAT64 users, run the nat64 alarm port-number user enable command to enable the log and alarm functions for NAT64 user port usage. If the NAT64 user port usage exceeds a specified threshold, a device generates an alarm and records a log."
}