{
    "PageTitle": "nat64 log send-mode",
    "FuncDef": "The nat64 log send-mode command configures the mode of sending NAT64 logs.\nThe undo nat64 log send-mode command restores the default configuration.\nBy default, logs are sent when a NAT64 session is created and when a NAT64 session ages out.",
    "CLIs": [
        "nat64 log send-mode { session-start-only | session-end-only }",
        "undo nat64 log send-mode { session-start-only | session-end-only }"
    ],
    "ParentView": [
        "NAT64 instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "session-start-only",
            "Info": "Indicates that logs are sent only when a NAT64 session is created.\n-"
        },
        {
            "Parameters": "session-end-only",
            "Info": "Indicates that logs are sent only when a NAT64 session ages out.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat64 instance nat64 id 1",
            "[*HUAWEI-nat64-instance-nat64] nat64 log send-mode session-start-only"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, logs are sent when a NAT64 session is created and when a NAT64 session ages out. To allow logs to be sent only when a NAT64 session is created or ages out so that the number of NAT64 logs is reduced, run the nat64 log send-mode command.\nPrecaution\nThis command takes effect only after the NAT64 log function is enabled on a NAT64 instance.\nIf the session-start-only parameter is specified, logs are sent only when a NAT64 session is created. In this case, the NAT64 session aging time cannot be specified after a NAT64 session ages out.\nIf the session-end-only parameter is specified, logs are sent only when a NAT64 session ages out. In this case, information about the NAT64 session is not displayed on the log server before the NAT64 session ages out. If the NAT64 session keeps not aging out (traffic always exists), information about the NAT64 session will never be displayed on the log server. If the board is reset, log tracing fails.\nPrecautions\nThis command takes effect only after the NAT64 log function is enabled on a NAT64 instance.\nIf the session-start-only parameter is specified, logs are sent only when a NAT64 session is created. In this case, the NAT64 session aging time cannot be specified after a NAT64 session ages out.\nIf the session-end-only parameter is specified, logs are sent only when a NAT64 session ages out. In this case, information about the NAT64 session is not displayed on the log server before the NAT64 session ages out. If the NAT64 session keeps not aging out (traffic always exists), information about the NAT64 session will never be displayed on the log server. If the board is reset, log tracing fails."
}