{
    "PageTitle": "nat64 prefix",
    "FuncDef": "The nat64 prefix command configures a NAT64 IPv6 prefix.\nThe undo nat64 prefix command deletes a NAT64 IPv6 prefix.\nNo NAT64 IPv6 prefix is configured by default.",
    "CLIs": [
        "nat64 prefix <ipv6-prefix> prefix-length <prefix-length> <prefix-id> [ no-pat ]",
        "undo nat64 prefix [ <ipv6-prefix> prefix-length <prefix-length> ] <prefix-id> [ no-pat ]"
    ],
    "ParentView": [
        "NAT64 instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv6-prefix",
            "Info": "Specifies a NAT64 IPv6 prefix.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "prefix-length prefix-length",
            "Info": "Specifies the length of a NAT64 IPv6 prefix.\nThe value is an enumerated type and can be 32, 40, 48, 56, 64, or 96."
        },
        {
            "Parameters": "prefix-id",
            "Info": "Specifies a NAT64 IPv6 prefix ID.\nThe value is an integer ranging from 1 to 16."
        },
        {
            "Parameters": "no-pat",
            "Info": "Indicates the no-PAT translation mode.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat64 instance nat1 id 1",
            "[*HUAWEI-nat64-instance-nat1] nat64 prefix 2001:db8::1 prefix-length 96 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nNAT64 prefixes are added before IPv4 addresses to forma IPv6 addresses. The prefixes include network specific prefixes and known prefixes. After a NAT64 prefix is configured, a device runs a routing protocol to advertise a route carrying the prefix to a network. In a NAT64 scenario, NAT64 processes packets only with destination IPv6 address prefixes matching the configured NAT64 prefix.\nThe destination address of IPv6 user data packets sent to a NAT64device is an IPv6 address, regardless of whether the packets are sent to the IPv4 or IPv6 network. To differentiate IPv4 and IPv6 packets, the NAT64 CGN device processes the packets based on the IPv6 prefix.\nIf the prefix of IPv6 packets is the prefix defined by the NAT64 device, packets are forwarded to the IPv4 network after being translated by NAT64 device.If the prefix of IPv6 packets is not the prefix defined by the NAT64 device, packets are directly forwarded to the IPv6 network without being translated by NAT64 device.\n\nPrecautions\nA NAT64 IPv6 prefix must be unique.The prefix of a NAT64 instance must be different from the local address of a DS-Lite tunnel.The prefix of a NAT64 instance must be different from the IPv6 address of an interface.The prefix of a NAT64 instance must be different from the IPv6 address of the BAS module."
}