{
    "PageTitle": "section exclude-ip-address (NAT64 instance address pool view)",
    "FuncDef": "The section exclude-ip-address command excludes a specific IP address or a range of IP addresses from an IP address pool.\nThe undo section exclude-ip-address command restores a specific IP address or a range of IP addresses in an IP address pool.\nBy default, excluding an IP address or an address segment from an address pool in a specific section is prohibited.",
    "CLIs": [
        "section <section-id> exclude-ip-address <start-address> [ <end-address> ]",
        "undo section <section-id> exclude-ip-address <start-address> [ <end-address> ]"
    ],
    "ParentView": [
        "NAT64 instance address pool view"
    ],
    "ParaDef": [
        {
            "Parameters": "section-id",
            "Info": "Specifies the ID of an address range.\nThe value is an integer ranging from 0 to 15."
        },
        {
            "Parameters": "start-address",
            "Info": "Specifies a start IP address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "end-address",
            "Info": "Specifies an end IP address.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat64 instance nat1 id 1",
            "[*HUAWEI-nat64-instance-nat1] nat64 address-group 1 group-id 1",
            "[*HUAWEI-nat64-instance-nat1-nat64-address-group-1] section 1 10.0.0.0 10.0.0.255",
            "[*HUAWEI-nat64-instance-nat1-nat64-address-group-1] section 1 exclude-ip-address 10.0.0.0 10.0.0.5"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a specific IP address or a range of IP addresses is removed from a NAT64 address pool, the address pool has to be divided into multiple sub-pools so that each one contains a continuous range of IP addresses. Then the same configurations or operations have to be repeatedly performed on these pools. To address this problem, run the section exclude-ip-address command to remove a specific IP address or a range of IP addresses from a NAT64 address pool. Then the configurations or operations can be performed once on the address pool that has excluded the specified IP addresses.\nPrerequisites\nA NAT64 instance, its address pool, and address pool sections have been configured.\nPrecautions\nThe section exclude-ip-address command takes effect only on the VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S.\nA NAT64 instance, its address pool, and address pool sections have been configured. Addresses in the NAT64 address pool cannot match an ACL rule used in a NAT64 outbound policy configured using the nat64 outbound command.The section exclude-ip-address command only removes a public IP address or a public IP address segment.A maximum of 10 section exclude-ip-address command instances can be run for each address segment. The excluded address segments cannot overlap.When you restore an IP address or an IP address range in a NAT64 address pool using the undo section exclude-ip-address command, the specified IP address or IP address range must be within the excluded IP address range.If an address pool is configured by specifying mask, the device advertises specific UNRs instead of network segment UNRs after this command is run. If you run this command to exclude some public IP addresses, routes to the public IP addresses may fail to be advertised, and services may be interrupted."
}