{
    "PageTitle": "dhcp reply",
    "FuncDef": "The dhcp reply command configures the broadcast or unicast type of response packets sent by the DHCP server.\nThe undo dhcp reply command restores the default configuration.\nBy default, the DHCP server replies with broadcast or unicast packets based on the broadcast flag carried in request packets.",
    "CLIs": [
        "dhcp reply { unicast-always | broadcast-always }",
        "undo dhcp reply [ unicast-always | broadcast-always ]"
    ],
    "ParentView": [
        "IP address pool view"
    ],
    "ParaDef": [
        {
            "Parameters": "unicast-always",
            "Info": "Indicates that the DHCP server replies with unicast packets.\n-"
        },
        {
            "Parameters": "broadcast-always",
            "Info": "Indicates that the DHCP server replies with broadcast packets.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip pool huawei server",
            "[~HUAWEI-ip-pool-huawei] dhcp reply unicast-always"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAccording to standard protocols, when the DHCP relay and a DHCP client are on the same network segment, the DHCP server checks whether client requests carry the broadcast flag. If so, the DHCP server replies with broadcast packets. If not, the DHCP server replies with unicast packets.\nA DHCP client sends Discover packets, which are broadcast packets, when submitting an online request. The DHCP server replies with Offer packets. Whether the Offer packets are unicast or broadcast depends on the broadcast flag in the Discover packets.The DHCP client sends Request packets, which are also broadcast packets, upon receipt of Offer packets. The DHCP server then replies with Ack or Nak packets.In the case of Ack packets, the DHCP server determines whether to broadcast or unicast packets based on the broadcast flag in the Request packets.In the case of Nak packets, the DHCP server replies with broadcast packets to the DHCP client.\n\nIn either of the preceding conditions, if the dhcp reply has been run on the DHCP server, the DHCP server ignores the broadcast flag in client requests and simply broadcasts or unicasts packets based on parameter settings."
}