{
    "PageTitle": "display dhcp server",
    "FuncDef": "The display dhcp server statistics command displays statistics about a DHCP server.\nThe display dhcp server database command displays storage information of DHCP data.",
    "CLIs": [
        "display dhcp server database",
        "display dhcp server statistics"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> display dhcp server statistics",
            "DHCP Server Statistics:",
            "",
            " Client Request          : 6",
            "   DHCP Discover         : 1",
            "   DHCP Request          : 4",
            "   DHCP Decline          : 0",
            "   DHCP Release          : 1",
            "   DHCP Inform           : 0",
            " Server Reply            : 4",
            "   DHCP Offer            : 1",
            "   DHCP Ack              : 3",
            "   DHCP Nak              : 0",
            "   DHCP Force Renew      : 0",
            " Bad Messages            : 0"
        ],
        [
            "<HUAWEI> display dhcp server database",
            "Status: enable",
            "  Recover from files after reboot: disable",
            "  File saving lease items: home:/dhcp/lease.txt",
            "  File saving conflict items: home:/dhcp/conflict.txt",
            "  Save interval: 300 (seconds)"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo check packet statistics about device functioning as a DHCP server, run the display dhcp server statistics command.\nTo check details about the packets sent and received by the DHCP server, run the display dhcp server statistics command to view DHCP server statistics, including:\nStatistics about various DHCP packets sent by DHCP clients to the DHCP serverStatistics about various DHCP packets sent by the DHCP server to DHCP clientsStatistics about unidentified packets\nTo view storage information of DHCP data, such as the save path and file name, run the display dhcp server database command. The storage information helps you determine:\nWhether the function of storing DHCP data to a storage device is enabled. To enable such function, run the dhcp server database command.Whether the interval for storing DHCP data is qualifiedWhether the function of restoring data from a storage device is enabled after system restart\n\nFollow-up Procedure\nIf some DHCP server statistics are detected to be incorrect, run the reset dhcp server statistics command to clear these statistics and then collect statistics again.\nPrecautions\nIf a DHCP server does not respond to a received packet, the DHCP server is not correctly configured."
}