{
    "PageTitle": "excluded-ip-address (IP address pool view)",
    "FuncDef": "The excluded-ip-address command configures the range of IP addresses that do not take part in automatic address assignment.\nThe undo excluded-ip-address command deletes the configuration.\nBy default, all IP addresses in an address pool take part in automatic address assignment.",
    "CLIs": [
        "excluded-ip-address <start-ip-address> [ <end-ip-address> ]",
        "undo excluded-ip-address <start-ip-address> [ <end-ip-address> ]"
    ],
    "ParentView": [
        "IP address pool view"
    ],
    "ParaDef": [
        {
            "Parameters": "start-ip-address",
            "Info": "Specifies the start IP address of the IP address segment that do not take part in automatic address assignment.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "end-ip-address",
            "Info": "Specifies the end IP address of the IP address segment that do not take part in automatic address assignment.\nThe value is in dotted decimal notation. The values of end-ip-address and start-ip-address must be in the same network segment, but the value of end-ip-address cannot be less than the value of start-ip-address. If end-ip-address is not specified, start-ip-address is the only IP address in the address pool."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip pool huawei server",
            "[*HUAWEI-ip-pool-huawei] gateway 10.1.1.1 255.255.255.0",
            "[*HUAWEI-ip-pool-huawei] section 0 10.1.1.2 10.1.1.253",
            "[*HUAWEI-ip-pool-huawei] commit",
            "[~HUAWEI-ip-pool-huawei] excluded-ip-address 10.1.1.10 10.1.1.20"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nSome IP addresses in an address pool need to be reserved for specific purposes, and some IP addresses have been assigned to specific hosts (such as the DNS and WWW servers) and therefore cannot be automatically assigned. To exclude such IP addresses from automatic address assignment, run the excluded-ip-address command.\nPrerequisites\nBefore running the excluded-ip-address command, perform the following operations:\nRun the ip pool command in the system view to create an address pool on the DHCP server.Run the gateway command in the Server IP address pool view to configure a gateway address and subnet mask for the created address pool.Run the section command in the Server IP address pool view to specify the address segment that can be assigned from the address pool.\n\nPrecautions\nThe excluded IP addresses or IP address segments must be within the local address pool.The excluded IP addresses or IP address segments cannot be automatically allocated in the local address pool.Repeat this command as needed to specify multiple ranges of IP addresses or IP address segments."
}