{
    "PageTitle": "conflict auto-recycle",
    "FuncDef": "The conflict auto-recycle command configures the interval for automatically reclaiming conflicting addresses.\nThe undo conflict auto-recycle command restores the default configuration.\nBy default, conflicting addresses are automatically reclaimed at an interval of 30 minutes.",
    "CLIs": [
        "conflict auto-recycle interval <interval-time>",
        "undo conflict auto-recycle [ interval <interval-time> ]"
    ],
    "ParentView": [
        "IP address pool view"
    ],
    "ParaDef": [
        {
            "Parameters": "interval interval-time",
            "Info": "Specifies an interval at which conflicting addresses are automatically reclaimed.\nThe value is 0 or an integer ranging from 30 to 1440, in minutes. Value 0 indicates that the automatic address reclaim function is disabled."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip pool huawei server",
            "[~HUAWEI-ip-pool-huawei] conflict auto-recycle interval 0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen the DHCP server receives Decline messages from a client or an IP address is allocated to different clients due to an internal processing conflict, the DHCP server sets the status of the IP address to conflicting, and this IP address will not be allocated to clients. To configure the interval for automatically reclaiming conflicting addresses, run the conflict auto-recycle command.\nIf the interval-time value is not 0 and the usage of IP addresses in the address pool exceeds the alarm threshold specified in the warning-threshold command, the server automatically reclaims some conflicting IP addresses and re-assigns them to users when the address conflict time exceeds the interval-time value.If the interval-time value is set to 0, the automatic address reclaim function is disabled, and conflicting addresses will not be assigned to users. In this case, you need to run the reset conflict-ip-address command to reclaim conflicting addresses."
}