{
    "PageTitle": "option force-reply",
    "FuncDef": "The option force-reply command configures a DHCP server to forcibly reply a specified DHCP option to a client.\nThe undo option force-reply command deletes the configuration.\nBy default, the DHCP option forcibly replied to a DHCP client by a DHCP server is not configured in an address pool.",
    "CLIs": [
        "option force-reply { <option-code> } &<1-16>",
        "undo option force-reply [ { <option-code> } &<1-16> ]"
    ],
    "ParentView": [
        "IP address pool view"
    ],
    "ParaDef": [
        {
            "Parameters": "option-code",
            "Info": "Specifies a DHCP option code.\nThe value is an integer ranging from 2 to 254."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip pool huawei server",
            "[~HUAWEI-ip-pool-huawei] option force-reply 3"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe DHCP server does not respond if the DHCP packets received from a DHCP client do not contain some DHCP option information. However, if such option information as option 6 (carrying the DNS server address) is not contained in DHCP packets, the DHCP client fails to be connected. To address the problem, run the option force-reply command to configure the DHCP server to forcibly reply a specified DHCP option to a client.\nConfiguration Impact\nAfter the option force-reply command is executed, the DHCP server sends the DHCP option specified in the command to a client no matter whether this client is requested or not.\nPrecautions\nIf you run the option force-reply command on a DHCP server several times, all the configured DHCP options take effect. A maximum of 16 forcibly replied DHCP options can be configured in an IP address pool.\nInformation about the configured DHCP option code must be supported by the DHCP server. Otherwise, the server cannot forcibly reply the DHCP option to the client.\nIf the option router disable command is used to disable the sending of Option 3 (gateway address) in addition to the option force-reply, the configuration of the option router disable command takes effect preferentially due to a higher priority."
}