{
    "PageTitle": "server identifier ip",
    "FuncDef": "The server identifier ip command configures a DHCP server identifier.\nThe undo server identifier ip command deletes a DHCP server identifier.\nBy default, no identifier is configured for the DHCP server.",
    "CLIs": [
        "server identifier ip <ip-address>",
        "undo server identifier ip [ <ip-address> ]"
    ],
    "ParentView": [
        "IP address pool view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address",
            "Info": "Specifies the IP address used as the identifier of a DHCP server.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip pool huawei server",
            "[*HUAWEI-ip-pool-huawei] server identifier ip 10.1.1.2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn a DHCP server dual-device hot backup scenario, an interface's primary IP address is used as the DHCP server identifier by default. After a primary/secondary DHCP server switchover is performed, user renewal or offline fails. To resolve the problem, run the server identifier ip command to configure the same DHCP server identifier for both the primary and secondary DHCP servers.\nIn a non-DHCP server dual-device hot backup scenario, the server identifier ip command configures a specified IP address as the DHCP server identifier.\nPrecautions\nIf an IP address has been specified as the DHCP server identifier, ensure that routes from the DHCP client to the IP address are reachable so that packets can be properly sent to the DHCP server.\nIn case of DHCP server dual-device hot backup:\nConfigure the virtual IP address of the VRRP backup group on the inbound interfaces of the master and slave DHCP servers as the DHCP server identifier.If an IP address in the current address pool has been specified as the DHCP server identifier, this IP address cannot be assigned to users.\nWhen both the dhcp server identifier dest-ip and server identifier ip commands have been executed to configure a DHCP server identifier, the configuration of the server identifier ip command has a higher priority."
}