{
    "PageTitle": "renewal-time",
    "FuncDef": "The renewal-time command configures the renewal time of IP addresses.\nThe undo renewal-time command restores the default configuration.\nBy default, the renewal time of IP addresses is 50% of the lease of the address pool.",
    "CLIs": [
        "renewal-time <days> [ <hours> [ <minutes> ] ]",
        "undo renewal-time"
    ],
    "ParentView": [
        "IP address pool view"
    ],
    "ParaDef": [
        {
            "Parameters": "days",
            "Info": "Specifies the number of days used for renewing IP addresses.\nThe value is an integer ranging from 0 to 999."
        },
        {
            "Parameters": "hours",
            "Info": "Specifies the number of hours used for renewing IP addresses.\nThe value is an integer ranging from 0 to 23."
        },
        {
            "Parameters": "minutes",
            "Info": "Specifies the number of minutes used for renewing IP addresses.\nThe value is an integer ranging from 0 to 59."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip pool huawei server",
            "[*HUAWEI-ip-pool-huawei] lease 90",
            "[*HUAWEI-ip-pool-huawei] rebinding-time 85",
            "[*HUAWEI-ip-pool-huawei] renewal-time 80"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure the renewal time of IP addresses in an address pool, run the renewal-time command.\nWhen the renewal time elapses, a DHCP client automatically sends a DHCP REQUEST packet to the DHCP server that assigns an IP address. If the IP address is valid, the DHCP server replies with a DHCPACK packet, notifying the DHCP packet that a new IP address lease has been obtained. If the DHCP client receives a DHCPNAK packet from the DHCP server, a new IP address needs to be requested.\nPrecautions\nThe renewal time for an IP address must be less than the address pool lease configured using the lease command and the re-binding time of the IP address configured using the rebinding-time command.\nIf renewal-time has been configured and is reconfigured to 0, this parameter automatically restores to the default value. If renewal-time has not been configured before, the default value is used."
}