{
    "PageTitle": "section",
    "FuncDef": "The section command configures an address segment for an IP address pool.\nThe undo section command deletes the configuration.\nBy default, no address segment is configured for an IP address pool.",
    "CLIs": [
        "section <section-index> <start-ip-address> [ <end-ip-address> ]",
        "undo section <section-index>"
    ],
    "ParentView": [
        "IP address pool view"
    ],
    "ParaDef": [
        {
            "Parameters": "section-index",
            "Info": "Specifies the index of an address segment. The value is an integer ranging from 0 to 255.\nThe value is an integer ranging from 0 to 255."
        },
        {
            "Parameters": "start-ip-address",
            "Info": "Specifies the start IP address of the address segment.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "end-ip-address",
            "Info": "Specifies the end IP address of the address segment. The end IP address must be greater than or equal to the start IP address. If no end IP address is input, the configured address segment contains only the start IP address.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip pool huawei server",
            "[*HUAWEI-ip-pool-huawei] gateway 10.1.1.1 255.255.255.0",
            "[*HUAWEI-ip-pool-huawei] section 1 10.1.1.1 10.1.1.255"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo allow the DHCP server to assign IP addresses to DHCP clients from an address segment, run the section command in the Server IP address pool view to configure an address segment.\nPrerequisites\nPerform the following operations:\nRun the ip pool command in the system view to create an address pool on the DHCP server.Run the gateway command in the Server IP address pool view to configure a gateway address and subnet mask for the created address pool.\n\nPrecautions\nThe IP addresses in the address segment must be within the network segment configured in the gateway command in the Server IP address pool view.\nAn address pool can accommodate a maximum of 256 address segments, with each address segment allowing a maximum of 65536 IP addresses. The IP addresses in an address segment cannot overlap with those in another address segment."
}