{
    "PageTitle": "lease-state",
    "FuncDef": "This command clears DHCP lease state information for this service.",
    "CLIs": [
        "lease-state [ no-dhcp-release ]",
        "lease-state [ port <port-id> ] [ inter-dest-id <intermediate-destination-id> ] [ no-dhcp-release ]",
        "lease-state [ port <port-id> ] no-inter-dest-id [ no-dhcp-release ]",
        "lease-state ip-address <ip-address> [ </mask> ] [ no-dhcp-release ]",
        "lease-state mac <ieee-address> [ no-dhcp-release ]",
        "lease-state sap <sap-id> [ no-dhcp-release ]",
        "lease-state sdp <sdp-id> [ <:vc-id> ] [ no-dhcp-release ]"
    ],
    "ParentView": [
        "clear>service>id>dhcp"
    ],
    "ParaDef": [
        {
            "Parameters": "no-dhcp-release",
            "Info": "Specifies that the node clears the state without sending the DHCP release message."
        },
        {
            "Parameters": "port-id",
            "Info": "Clears DHCP lease state local information that the DHCP lease state is learned by either a SAP or SDP. When the value is SAP, the value indicates the SAP for which this entry contains information."
        },
        {
            "Parameters": "ip-address",
            "Info": "Clears information about the specified IP address of the IP interface. The ip-address portion of the address command specifies the IP host address that is used by the IP interface within the subnet. This address must be unique within the subnet and specified in dotted decimal notation. Allowed values are IP addresses in the range 1.0.0.0 - 223.255.255.255 (with support of /31 subnets)."
        },
        {
            "Parameters": "ieee-address",
            "Info": "Clears information about the 48-bit MAC address for the static ARP in the form aa:bb:cc:dd:ee:ff or aa-bb-cc-dd-ee-ff where aa, bb, cc, dd, ee, and ff are hexadecimal numbers. Allowed values are any non-broadcast, non-multicast MAC and non-IEEE reserved MAC addresses."
        },
        {
            "Parameters": "intermediate-destination-id",
            "Info": "Clears information about the intermediate destination identifier, up to 32 characters, which is encoded in the identification strings."
        },
        {
            "Parameters": "sap-id",
            "Info": "Clears the specified lease state SAP information."
        },
        {
            "Parameters": "sdp-id",
            "Info": "Clears information about the SDP ID. Values-1 to 17407."
        },
        {
            "Parameters": "vc-id",
            "Info": "The virtual circuit ID on the SDP ID to be cleared. Values-1 to 4294967295."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}