{
    "PageTitle": "lease-state",
    "FuncDef": "This command displays DHCP lease state information. Thewholesalerservice-idparameter is applicable only in the VPRN context.",
    "CLIs": [
        "lease-state [ wholesaler <service-id> ] [ sap <sap-id> | sdp <sdp-id:vc-id> | interface <interface-name> | ip-address <ip-address> [ </mask> ] | chaddr <ieee-address> | mac <ieee-address> | { [ port <port-id> ] [ no-inter-dest-id | inter-dest-id <inter-dest-id> ] } ] [ session { none | ipoe } ] [ detail ]"
    ],
    "ParentView": [
        "show>service>id>dhcp"
    ],
    "ParaDef": [
        {
            "Parameters": "service-id",
            "Info": "Specifies the service ID of the wholesaler. When specified in this context, SAP, SDP, interface, IP address and MAC parameters are ignored. This parameter applies only to the 7750 SR. Values-service-id: 1 to 214748364."
        },
        {
            "Parameters": "sap-id",
            "Info": "Specifies the physical port identifier portion of the SAP definition."
        },
        {
            "Parameters": "sdp-id",
            "Info": "Specifies the SDP identifier. Values-1 to 17407."
        },
        {
            "Parameters": "vc-id",
            "Info": "Specifies the virtual circuit identifier. This value is used to validate the VC ID portion of each mesh SDP binding defined in the service. The default value of this object is equal to the service ID. Values-1 - 4294967295."
        },
        {
            "Parameters": "interface-name",
            "Info": "Shows the interface name, up to 32 characters."
        },
        {
            "Parameters": "ip-address[/mask]",
            "Info": "Shows information for the specified IP address and mask."
        },
        {
            "Parameters": "port-id",
            "Info": "Specifies the DHCP lease state local specifies that the DHCP lease state is learned by either a SAP or SDP. When the value is SAP, the value indicates the SAP for which this entry contains information."
        },
        {
            "Parameters": "chaddr",
            "Info": "Specifies the MA address of the DHCP lease state."
        },
        {
            "Parameters": "interface-name",
            "Info": "Shows information for the specified IP interface."
        },
        {
            "Parameters": "detail",
            "Info": "Displays detailed lease state information."
        },
        {
            "Parameters": "inter-dest-id",
            "Info": "Indicates the intermediate destination identifier received from either the DHCP or the RADIUS server or the local user database."
        },
        {
            "Parameters": "session",
            "Info": "Shows DHCPv4 lease states for hosts that are associated with an IPoE session or for hosts that are not associated with an IPoE session. Values-none, ipoe."
        },
        {
            "Parameters": "detail",
            "Info": "Displays detailed information."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}