{
    "PageTitle": "oam-bind cfm md ma bfd-session",
    "FuncDef": "The oam-bind cfm md ma bfd-session command enables bidirectional transmission of fault messages between Ethernet CFM and Bidirectional Forwarding Detection (BFD).\nThe undo oam-bind cfm md ma bfd-session command disables bidirectional transmission of fault messages between Ethernet CFM and BFD.\nBy default, bidirectional transmission of fault messages between Ethernet CFM and BFD is disabled.",
    "CLIs": [
        "oam-bind cfm md <md-name> ma <ma-name> bfd-session <bfd-session-id>",
        "undo oam-bind cfm md <md-name> ma <ma-name> bfd-session <bfd-session-id>"
    ],
    "ParentView": [
        "OAM management view"
    ],
    "ParaDef": [
        {
            "Parameters": "md-name",
            "Info": "Specifies the name of an MD.\nThe value is a string of 1 to 43 case-sensitive characters. Question marks (?), hyphens (-) are not supported."
        },
        {
            "Parameters": "ma-name",
            "Info": "Specifies the name of an MA.\nThe value is a string of 1 to 43 case-sensitive characters. Question marks (?), hyphens (-) are not supported. The total length of MA and MD names must be no greater than 44 characters."
        },
        {
            "Parameters": "bfd-session-id",
            "Info": "Specifies the ID of a BFD session.\nThe value is an integer ranging from 1 to 16384."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bfd",
            "[*HUAWEI-bfd] quit",
            "[*HUAWEI] bfd 1 bind peer-ip 10.10.20.2",
            "[*HUAWEI-bfd-session-session-1] discriminator local 1",
            "[*HUAWEI-bfd-session-session-1] quit",
            "[*HUAWEI] cfm enable",
            "[*HUAWEI] cfm md mdcustomer",
            "[*HUAWEI-md-mdcustomer] ma macustomer",
            "[*HUAWEI-md-mdcustomer-ma-macustomer] oam-mgr",
            "[*HUAWEI-oam-mgr] oam-bind cfm md mdcustomer ma macustomer bfd-session 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf CFM and BFD are configured on two sides of a device, the oam-bind cfm md ma bfd-session command can be used to associate the CFM module with the BFD module to enable bidirectional transmission of fault messages between the two modules.\nThe association functions on a bidirectional link as follows:If the CFM module detects a fault, it notifies the BFD module on the remote end of the fault.If the BFD module detects a fault, it notifies the CFM module on the remote end of the fault.\nThe following commands are used when the CFM module is associated with the BFD module:\noam-bind cfm md ma bfd-sessionoam-bind ingress cfm md ma egress bfd-sessionoam-bind ingress bfd-session egress cfm md ma\n\nPrerequisites\nBFD and CFM have been configured."
}