{
    "PageTitle": "oam-bind cfm md ma efm interface",
    "FuncDef": "The oam-bind cfm md ma efm interface command enables bidirectional transmission of fault messages between EFM and Ethernet CFM.\nThe undo oam-bind cfm md ma efm interface command disables bidirectional transmission of fault messages between EFM and Ethernet CFM.\nBy default, bidirectional transmission of fault messages between EFM and Ethernet CFM is disabled.",
    "CLIs": [
        "oam-bind cfm md <md-name> ma <ma-name> efm interface { <interface-name> | <interface-type> <interface-number> }",
        "undo oam-bind cfm md <md-name> ma <ma-name> efm interface { <interface-name> | <interface-type> <interface-number> }"
    ],
    "ParentView": [
        "OAM management view"
    ],
    "ParaDef": [
        {
            "Parameters": "md-name",
            "Info": "Specifies the name of an MD.\nThe value is a string of 1 to 43 case-sensitive characters. Question marks (?), hyphens (-) are not supported."
        },
        {
            "Parameters": "ma-name",
            "Info": "Specifies the name of an MA.\nThe value is a string of 1 to 43 case-sensitive characters. Question marks (?), hyphens (-) are not supported. The total length of MA and MD names must be no greater than 44 characters."
        },
        {
            "Parameters": "interface-type",
            "Info": "Specifies the type of an interface.\nThe value can be Ethernet or GigabitEthernet."
        },
        {
            "Parameters": "interface-number",
            "Info": "Specifies the number of an interface.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] efm enable",
            "[*HUAWEI] interface GigabitEthernet1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] efm enable",
            "[*HUAWEI-GigabitEthernet1/0/0] quit",
            "[*HUAWEI] cfm enable",
            "[*HUAWEI] cfm md mdcustomer",
            "[*HUAWEI-md-mdcustomer] ma macustomer",
            "[*HUAWEI-md-mdcustomer-ma-macustomer] oam-mgr",
            "[*HUAWEI-oam-mgr] oam-bind cfm md mdcustomer ma macustomer efm interface GigabitEthernet1/0/0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf EFM is deployed on one side of a device and CFM is deployed on the other side of the device, association between EFM and CFM can be configured on the device. This allows EFM and CFM to notify each other of faults and ensures reliable service transmission.\nAssociation between EFM and CFM is bidirectional. The details are as follows:If EFM detects a link fault, it will notify CFM of the fault.If CFM detects a link fault, it will notify EFM of the fault.\nThe following commands are used when EFM is associated with CFM:\noam-bind cfm md ma efm interfaceoam-bind ingress cfm md ma egress efm interfaceoam-bind ingress efm interface egress cfm md ma\n\nPrerequisites\nMDs and MAs have been created and EFM has been enabled on specified interfaces."
}