{
    "PageTitle": "oam-bind ingress vrrp vrid egress cfm md ma",
    "FuncDef": "The oam-bind ingress vrrp vrid egress cfm md ma command enables VRRP to instruct the MGR module to notify CFM of a fault.\nThe undo oam-bind ingress vrrp vrid egress cfm md ma command disables VRRP from instructing the MGR module to notify CFM of a fault.\nBy default, VRRP is disabled from instructing the MGR module to notify CFM of a fault.",
    "CLIs": [
        "oam-bind ingress vrrp vrid <vrid> interface { <interface-name> | <interface-type> <interface-number> } egress cfm md <md-name> ma <ma-name>",
        "undo oam-bind ingress vrrp vrid <vrid> interface { <interface-name> | <interface-type> <interface-number> } egress cfm md <md-name> ma <ma-name>"
    ],
    "ParentView": [
        "OAM management view"
    ],
    "ParaDef": [
        {
            "Parameters": "vrid vrid",
            "Info": "Specifies the ID of a VRRP backup group.\nThe value is an integer ranging from 1 to 255."
        },
        {
            "Parameters": "interface interface-type interface-number",
            "Info": "Specifies the type and number of an interface.\n-"
        },
        {
            "Parameters": "md-name",
            "Info": "Specifies the name of an MD.\nThe value is a string of 1 to 43 case-sensitive characters. Question marks (?), hyphens (-) are not supported."
        },
        {
            "Parameters": "ma-name",
            "Info": "Specifies the name of an MA.\nThe value is a string of 1 to 43 case-sensitive characters. Question marks (?), hyphens (-) are not supported. The total length of MA and MD names must be no greater than 44 characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] ip address 10.1.1.1 255.255.255.0",
            "[*HUAWEI-GigabitEthernet1/0/1] vrrp vrid 1 virtual-ip 10.1.1.111",
            "[*HUAWEI-GigabitEthernet1/0/1] quit",
            "[*HUAWEI] cfm enable",
            "[*HUAWEI] cfm md mdcustomer",
            "[*HUAWEI-md-mdcustomer] ma macustomer",
            "[*HUAWEI-md-mdcustomer-ma-macustomer] oam-mgr",
            "[*HUAWEI-oam-mgr] oam-bind ingress vrrp vrid 1 interface GigabitEthernet1/0/1 egress cfm md mdcustomer ma macustomer"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo improve network reliability, associate CFM with VRRP. With this association, when CFM or VRRP detects a link fault, it instructs the MGR module to notify the other mechanism of the fault.\nThe association between CFM and VRRP can be unidirectional or bidirectional.\nIf the VRRP module detects a link fault, it instructs the CFM module to notify the remote end of the fault.If the CFM module detects a link fault, it instructs the VRRP module to perform a link switchover.\nThe following commands are used when CFM is associated with VRRP:\noam-bind cfm md ma vrrp vridoam-bind ingress cfm md ma egress vrrp vridoam-bind ingress vrrp vrid egress cfm md ma\nTable 1 describes CFM and VRRP association configurations.\n\nTable 1 CFM and VRRP association configurationsScenario\n\nConfiguration Solution 1\n\nConfiguration Solution 2\n\n\n\nBidirectional association between CFM and VRRP\n\nRun the oam-bind cfm md ma vrrp vrid command to configure the bidirectional association between CFM and VRRP.If you have run the oam-bind cfm md ma vrrp vrid command, the configuration file contains the following commands: oam-bind ingress vrrp vrid egress cfm md ma. oam-bind ingress cfm md ma egress vrrp vrid.\n\nPerform the following operations: Run the oam-bind ingress vrrp vrid egress cfm nd ma command to enable VRRP to instruct the MGR module to notify CFM of a fault. Run the oam-bind ingress cfm md ma egress vrrp vrid command to enable CFM to instruct the MGR module to notify VRRP of a fault.\n\n\nUnidirectional association between CFM and VRRP\n\nPerform either of the following operations: Run the oam-bind ingress vrrp vrid egress cfm nd ma command to enable VRRP to instruct the MGR module to notify CFM of a fault.Run the oam-bind ingress cfm md ma egress vrrp vrid command to enable CFM to instruct the MGR module to notify VRRP of a fault.\n\nNone\n\n\n\n\n\nPrerequisites\nCFM and VRRP have been configured."
}