{
    "PageTitle": "oam-bind ingress cfm md ma egress efm interface",
    "FuncDef": "The oam-bind ingress cfm md ma egress efm interface command configures Ethernet CFM to send fault messages to EFM.\nThe undo oam-bind ingress cfm md ma egress efm interface command disables Ethernet CFM from sending fault messages to EFM.\nBy default, Ethernet CFM is disabled from sending fault messages to EFM.",
    "CLIs": [
        "oam-bind ingress cfm md <md-name> ma <ma-name> egress efm interface { <interface-name> | <interface-type> <interface-number> }",
        "undo oam-bind ingress cfm md <md-name> ma <ma-name> egress efm interface { <interface-name> | <interface-type> <interface-number> }"
    ],
    "ParentView": [
        "OAM management view"
    ],
    "ParaDef": [
        {
            "Parameters": "md-name",
            "Info": "Specifies the name of an MD.\nThe value is a string of 1 to 43 case-sensitive characters. Question marks (?), hyphens (-) are not supported."
        },
        {
            "Parameters": "ma-name",
            "Info": "Specifies the name of an MA.\nThe value is a string of 1 to 43 case-sensitive characters. Question marks (?), hyphens (-) are not supported. The total length of MA and MD names must be no greater than 44 characters."
        },
        {
            "Parameters": "interface-type",
            "Info": "Specifies the type of an interface. The interface must be enabled with EFM.\n-"
        },
        {
            "Parameters": "interface-number",
            "Info": "Specifies the number of an interface. The interface must be enabled with EFM.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] efm enable",
            "[*HUAWEI] interface GigabitEthernet3/0/1",
            "[*HUAWEI-GigabitEthernet3/0/1] efm enable",
            "[*HUAWEI-GigabitEthernet3/0/1] quit",
            "[*HUAWEI] cfm enable",
            "[*HUAWEI] cfm md mdcustomer",
            "[*HUAWEI-md-mdcustomer] ma macustomer",
            "[*HUAWEI] oam-mgr",
            "[*HUAWEI-oam-mgr] oam-bind ingress cfm md mdcustomer ma macustomer egress efm interface GigabitEthernet 3/0/1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf EFM is deployed on one side of a device and CFM is deployed on the other side of the device, association between EFM and CFM can be configured on the device. This allows EFM and CFM to notify each other of faults and ensures reliable service transmission.\nAssociation between EFM and CFM is bidirectional. The details are as follows:\nIf EFM detects a link fault, it will notify CFM of the fault.If CFM detects a link fault, it will notify EFM of the fault.\n\nPrerequisites\nMDs and MAs have been created and EFM has been enabled on specified interfaces."
}