{
    "PageTitle": "oam-bind ingress bfd-session egress cfm md ma",
    "FuncDef": "The oam-bind ingress bfd-session egress cfm md ma command configures the BFD module to send fault messages to the Ethernet CFM module.\nThe undo oam-bind ingress bfd-session egress cfm md ma command disables the BFD module from sending fault messages to the Ethernet CFM module.\nBy default, the BFD module is disabled from sending fault messages to the Ethernet CFM module.",
    "CLIs": [
        "oam-bind ingress bfd-session <bfd-session-id> egress cfm md <md-name> ma <ma-name>",
        "undo oam-bind ingress bfd-session <bfd-session-id> egress cfm md <md-name> ma <ma-name>"
    ],
    "ParentView": [
        "OAM management view"
    ],
    "ParaDef": [
        {
            "Parameters": "bfd-session-id",
            "Info": "Specifies the ID of a BFD session.\nThe value is an integer ranging from 1 to 16384."
        },
        {
            "Parameters": "md-name",
            "Info": "Specifies the name of an MD.\nThe value is a string of 1 to 43 case-sensitive characters. Question marks (?), hyphens (-) are not supported."
        },
        {
            "Parameters": "ma-name",
            "Info": "Specifies the name of an MA.\nThe value is a string of 1 to 43 case-sensitive characters. Question marks (?), hyphens (-) are not supported. The total length of MA and MD names must be no greater than 44 characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bfd",
            "[*HUAWEI-bfd] quit",
            "[*HUAWEI] bfd session bind peer-ip 10.10.20.2",
            "[*HUAWEI-bfd-session-session] quit",
            "[*HUAWEI] cfm enable",
            "[*HUAWEI] cfm md mdcustomer",
            "[*HUAWEI-md-mdcustomer] ma macustomer",
            "[*HUAWEI-md-mdcustomer-ma-macustomer] oam-mgr",
            "[*HUAWEI-oam-mgr] oam-bind ingress bfd-session 1 egress cfm md mdcustomer ma macustomer"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf CFM and BFD are configured on two sides of a device, the oam-bind cfm md ma bfd-session command can be used to associate the CFM module with the BFD module to enable bidirectional transmission of fault messages between CFM and BFD modules.\nThe association functions on a bidirectional link as follows:\nIf the CFM module detects a fault, it notifies the BFD module on the remote end of the fault.If the CFM module detects a fault, it notifies the BFD module on the remote end of the fault.\n\nPrerequisites\nBFD and CFM have been configured."
}