{
    "PageTitle": "ma",
    "FuncDef": "The ma command creates an MA and displays the MA view.\nThe undo ma command deletes an MA.\nBy default, no MA is created in MD.",
    "CLIs": [
        "ma <ma-name> [ format { icc-based <iccbased-ma-format-name> | string <ma-format-name> } ]",
        "undo ma [ <ma-name> ]"
    ],
    "ParentView": [
        "MD view"
    ],
    "ParaDef": [
        {
            "Parameters": "ma-name",
            "Info": "Specifies the name of an MA. Different MAs in an MD cannot have the same name.\nThe value is a string of 1 to 43 case-sensitive characters. Question marks (?) are not supported. The total length of MA and MD names must be no greater than 44 characters."
        },
        {
            "Parameters": "format",
            "Info": "Indicates the format of the MA name carried in CCMs to be sent. The default format is string.\n-"
        },
        {
            "Parameters": "icc-based iccbased-ma-format-name",
            "Info": "Specifies an ICC-based MA name carried in CCMs to be sent. ITU carrier codes (ICCs) are assigned to network carriers or service providers and maintained by ITU-T Telecommunication Standardization Bureau (TSB) in compliance with ITU-T M.1400 Recommendation.\nThe value is a string of 1 to 13 case-sensitive characters. Question marks (?) are not supported."
        },
        {
            "Parameters": "string ma-format-name",
            "Info": "Specifies a string-based MA name carried in CCMs to be sent.\nThe value is a string of 1 to 43 case-sensitive characters. Question marks (?) are not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] cfm enable",
            "[*HUAWEI] cfm md md1",
            "[*HUAWEI-md-md1] ma ma1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe ma command can be used to configure an MA. CFM can be configured on devices in the MA to monitor link connectivity when services are deployed based on VLANs or VSIs.\nPrerequisites\nAn MD has been configured using the cfm md command."
}