{
    "PageTitle": "cfm mp-address-model",
    "FuncDef": "The cfm mp-address-model command configures a maintenance point (MP) address model.\nThe undo cfm mp-address-model command restores the default MP address model.\nBy default, the MP address model is bridge.",
    "CLIs": [
        "cfm mp-address-model { bridge | individual }",
        "undo cfm mp-address-model"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "bridge",
            "Info": "Indicates the shared MP address model. All maintenance association end points (MEPs) and maintenance association intermediate points (MIPs) on a device share a bridge MAC address.\n-"
        },
        {
            "Parameters": "individual",
            "Info": "Indicates the individual MP address model. All MEPs and MIPs on a device use their interface MAC addresses.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] cfm mp-address-model individual",
            "Warning: Are you sure to change the MP-address model of CFM?[Y/N]:y"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIEEE Standard 802.1ag-2007 defines the following MP address models:\nShared MP address model: All MEPs and MIPs on a device share a bridge MAC address. This model saves MAC entry storing space.Individual MP address model: All MEPs and MIPs on a device use their interface MAC addresses. This model facilitates fault locating.\nTo configure an MP address model, run the cfm mp-address-model command.\n\nConfiguration Impact\nIf the shared MP address model is configured, MPs on a device use the same bridge MAC address as their own MAC addresses.If the individual MP address model is configured, MPs on a device use interface MAC addresses as their own MAC addresses. (If the interfaces are Layer 2 interfaces switched from Layer 3 interfaces using the portswitch command, the MAC addresses of Layer 3 interfaces are used.)\n\nPrecautions\nIf connectivity fault management (CFM) has been enabled, run the undo cfm enable command to disable it before running the cfm mp-address-model command.\nThe CFM MAC address mode was modified. cfm mp-address-model command deletes all CFM configurations on a device."
}