{
    "PageTitle": "remote-mep mep-id",
    "FuncDef": "The remote-mep mep-id command configures an RMEP in an MA.\nThe undo remote-mep mep-id command deletes an RMEP from an MA.\nBy default, no RMEP is configured in an MA.",
    "CLIs": [
        "remote-mep mep-id <mep-id> [ mac <mac-address> ]",
        "undo remote-mep mep-id <mep-id>"
    ],
    "ParentView": [
        "MA view"
    ],
    "ParaDef": [
        {
            "Parameters": "mep-id",
            "Info": "Specifies the ID of an RMEP.\nThe value is an integer ranging from 1 to 8191."
        },
        {
            "Parameters": "mac mac-address",
            "Info": "Specifies the MAC address of an RMEP.\nThe value is a 12-digit hexadecimal number, in the format of H-H-H. Each H is 4 digits. If an H contains fewer than 4 digits, the left-most digits are padded with zeros. For example, e0 is displayed as 00e0."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] cfm enable",
            "[*HUAWEI] cfm md md1",
            "[*HUAWEI-md-md1] ma ma1",
            "[*HUAWEI-md-md1-ma-ma1] remote-mep mep-id 10 mac 00e0-fc12-7890"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nCFM monitors the connectivity of a link between a MEP and an RMEP. The mep mep-id command configures a local MEP. The remote-mep command configures an RMEP in the same MA as the local MEP.\nThe RMEP configurations supported in various access scenarios are the same as MEP configurations\nPrerequisites\nAn MD and an MA have been configured using the cfm md and ma commands, respectively.\nFollow-up Procedure\nRun the remote-mep ccm-receive enable command to enable the local MEP to receive CCMs from the RMEP.\nPrecautions\nBefore modifying the bridge MAC address of an RMEP, delete the RMEP from an MA and reconfigure the RMEP.\nIf there are multiple MEPs in an MA, an RMEP corresponds to multiple MEPs when the RMEP is configured.If there is a single MEP in an MA, one or more RMEPs correspond to the single MEP when one or more RMEPs are configured.\nThe RMEP ID must be different from the MEP ID configured on a local interface."
}