{
    "PageTitle": "mip create-type (MD view)",
    "FuncDef": "The mip create-type command sets the MIP generation rule in the MD .\nThe undo mip create-type command restores the default MIP generation rule.\nBy default, the MIP generation rule in an MD is none, indicating that no MIPs are generated.",
    "CLIs": [
        "mip create-type { default | explicit | none }",
        "undo mip create-type"
    ],
    "ParentView": [
        "MD view"
    ],
    "ParaDef": [
        {
            "Parameters": "default",
            "Info": "Indicates that MIPs can be generated on the interface without a MEP of a higher level or a MIP of a lower level. Under the default MIP generation rule, MIPs can be generated when no MEPs are configured on an interface.\n-"
        },
        {
            "Parameters": "explicit",
            "Info": "Indicates that MIPs can be generated on the interface with a MEP of a lower level but without a MEP of a higher level or a MIP of a lower level. Under the explicit MIP generation rule, MIPs can be generated only after a MEP of a lower level is configured on an interface.\n-"
        },
        {
            "Parameters": "none",
            "Info": "Indicates that MIPs are not generated automatically.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] cfm enable",
            "[*HUAWEI] cfm md customer level 1",
            "[*HUAWEI-md-customer] mip create-type none"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] cfm enable",
            "[*HUAWEI] cfm default md",
            "[*HUAWEI-default-md] mip create-type default"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nMIPs are located on a link between two MEPs within an MD, facilitating management. The more MIPs there are, the easier it is to manage and control the network. Carriers set up more MIPs for important services than for regular services.\nThe mip create-type command can be used to set the MIP generation rule in an MD . The created MIPs can respond to LBMs or LTMs sent by a non-MEP in the same MA. A device uses the configured rule to automatically create MIPs.\nAfter a creation rule is configured in a specific MD , all interfaces in the MD use the rule to create MIPs.\nThe mip create-type command can be used only on Layer 2 interfaces to which a specific MD belongs.The mip create-type none command must be run on a VLANIF interface that accesses a VPLS network.\n\nPrerequisites\nCFM has been enabled globally using the cfm enable (system view) command."
}