{
    "PageTitle": "remote-mep ccm-receive enable",
    "FuncDef": "The remote-mep ccm-receive enable command enables a MEP in an MA or a MAC tunnel to receive CCMs from an RMEP in the MA or MAC tunnel.\nThe undo remote-mep ccm-receive enable command disables a MEP in an MA or a MAC tunnel from receiving CCMs from an RMEP in the MA or MAC tunnel.\nBy default, a MEP is disabled from receiving CCMs from an RMEP.",
    "CLIs": [
        "remote-mep ccm-receive [ mep-id <mep-id> ] enable",
        "undo remote-mep ccm-receive [ mep-id <mep-id> ] enable"
    ],
    "ParentView": [
        "MA view"
    ],
    "ParaDef": [
        {
            "Parameters": "mep-id mep-id",
            "Info": "Specifies the ID of an RMEP. If this parameter is not specified, a MEP is enabled to receive CCMs or disabled from receiving CCMs from all RMEPs in the MA.\nThe value is an integer ranging from 1 to 8191."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] cfm enable",
            "[*HUAWEI] cfm md md1",
            "[*HUAWEI-md-md1] ma ma1",
            "[*HUAWEI-md-md1] remote-mep mep-id 10",
            "[*HUAWEI-md-md1-ma-ma1] remote-mep ccm-receive mep-id 10 enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nCFM monitors the connectivity of a link between a MEP and an RMEP. After running the remote mep command to configure an RMEP, you can run the remote-mep ccm-receive enable command to enable a MEP to receive CCMs from the RMEP.\nPrerequisites\nAn RMEP has been configured using the remote-mep command.\nPrecautions\nMultiple MAs can be configured on a device. In an MA, if:\nthe mep ccm-send enable command has been run to enable a MEP to send CCMs, orthe remote-mep ccm-receive enable command has been run to enable a MEP to receive CCMs from an RMEP,\nthen the interval at which CCMs are sent or monitored in the MA cannot be modified. To modify the interval at which CCMs are sent or monitored in an MA, you must run the corresponding undo commands to disable the MEP from sending CCMs or receiving CCMs from the RMEP."
}