{
    "PageTitle": "active time",
    "FuncDef": "The active time command sets an RMEP activation time.\nThe undo active time command deletes an RMEP activation time.\nBy default, the RMEP activation time is 0 seconds.",
    "CLIs": [
        "active time <time>",
        "undo active time"
    ],
    "ParentView": [
        "MA view"
    ],
    "ParaDef": [
        {
            "Parameters": "time time",
            "Info": "Specifies an RMEP activation time.\nThe value is an integer ranging from 0 to 600, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] cfm enable",
            "[*HUAWEI] cfm md md1",
            "[*HUAWEI-md-md1] ma ma1",
            "[*HUAWEI-md-md1-ma-ma1] active time 30"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the local MEP does not receive CCMs from its RMEP within a period of 3 times the interval at which CCMs are sent, the local MEP considers the path to the RMEP faulty. CFM considers a link faulty if all of the following conditions are true:\nThe local MEP is physically connected to the RMEP.No MEP is configured on the peer device.CC is performed on the link.\nA link fault alarm is falsely reported. To resolve this issue, run the active time command to set an RMEP activation time.\nThe local MEP with the ability to receive CCMs can accept CCMs only after the configured RMEP activation time elapses, which prevents false alarms.\nAfter the configured RMEP activation time elapses, the local MEP considers the path to the RMEP faulty and reports an RMEP connectivity fault alarm if the local MEP does not receive CCMs from its RMEP within a period of 3.5 times the interval at which CCMs are sent.\nIf the default RMEP activation time is used and the local MEP is enabled to receive CCMs from its RMEP, the local MEP immediately receives CCMs from its RMEP.\n\nPrerequisites\nAn MD and an MA have been configured using the cfm md and ma commands, respectively.\nPrecautions\nThe configured RMEP activation time takes effect only on subsequently configured RMEPs in the MA."
}