{
    "PageTitle": "message-digest-key",
    "FuncDef": "This command configures a message digest key when MD5 authentication is enabled on the interface. Multiple message digest keys can be configured.",
    "CLIs": [
        "message-digest-key <key-id> md5 [ <key> | <hash-key> | <hash2-key> ] [ hash | hash2 ]",
        "no message-digest-key <key-id>"
    ],
    "ParentView": [
        "config>router>ospf>area>interface",
        "config>router>ospf>area>virtual-link"
    ],
    "ParaDef": [
        {
            "Parameters": "key-id",
            "Info": "The keyid is expressed as a decimal integer. Values-1 to 255."
        },
        {
            "Parameters": "key",
            "Info": "Specifies the MD5 key. The key can be any alphanumeric string up to 16 characters in length."
        },
        {
            "Parameters": "hash-key | hash2-key",
            "Info": "The MD5 hash or hash2 key. the hash key. The key can be any combination of ASCII characters up to 32 (hash1-key) or 55 (hash2-key) characters in length (encrypted). If spaces are used in the string, enclose the entire string in quotation marks (\" \")."
        },
        {
            "Parameters": "hash",
            "Info": "Specifies the key is entered in an encrypted form. If the hash or hash2 parameter is not used, the key is assumed to be in an unencrypted, clear text form. For security, all keys are stored in encrypted form in the configuration file with the hash or hash2 parameter specified."
        },
        {
            "Parameters": "hash2",
            "Info": "Specifies the key is entered in a more complex encrypted form that involves more variables than the key value alone, meaning that the hash2 encrypted variable cannot be copied and pasted. If the hash or hash2 parameter is not used, the key is assumed to be in an unencrypted, clear text form. For security, all keys are stored in encrypted form in the configuration file with the hash or hash2 parameter specified."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}