{
    "PageTitle": "vrrp timer-advertise learning enable",
    "FuncDef": "The vrrp timer-advertise learning enable command enables a device to learn the interval at which a VRRP Advertisement packet is sent.\nThe undo vrrp timer-advertise learning enable command disables a device from learning the interval at which a VRRP Advertisement packet is sent.\nBy default, a device is enabled to learn the interval at which a VRRP Advertisement packet is sent.",
    "CLIs": [
        "vrrp timer-advertise learning enable",
        "undo vrrp timer-advertise learning enable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] vrrp timer-advertise learning enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe master device in a VRRP backup group periodically sends VRRP Advertisement packets to the backup devices in the group to notify them of its status. After receiving the VRRP Advertisement packet, each backup device compares the interval between sending VRRP Advertisement packets in the packet with the local configured interval.\nIf the two intervals are the same, the backup device discards the packet, resets the Adver_Timer, and continues monitoring the master device.If the two intervals are different, the backup device discards the packet but does not reset the Adver_Timer. After the Adver_Timer expires, the backup device switches to the Master state. As a result, two master devices coexist. To prevent this situation, run the vrrp timer-advertise learning enable command to enable the backup device to learn the interval at which a VRRP Advertisement packet is sent. After the command is run, the backup device synchronizes its Adver_Timer with the master device to ensure proper VRRP backup group negotiation.\n\nPrecautions\nIf the undo vrrp timer-advertise learning enable command is run to disable a device from sending VRRP Advertisement packets, the vrrp vrid timer advertise command must be run on devices in the same VRRP backup group to set the same interval at which VRRP Advertisement packets are sent. If the intervals are different on devices in a VRRP backup group, VRRP negotiation fails and two master devices coexist.After the undo vrrp timer-advertise learning enable command is run to disable a device from learning the interval at which a VRRP Advertisement packet is sent, GR is disabled."
}