{
    "PageTitle": "dot1q vrrp",
    "FuncDef": "The dot1q vrrp command enables a sub-interface for dot1q VLAN tag termination on a VRRP device to send VRRP packets to specified VLANs.\nThe undo dot1q vrrp command restores the default setting.\nA sub-interface for dot1q VLAN tag termination sends VRRP packets carrying only the minimal inner VLAN ID.",
    "CLIs": [
        "dot1q vrrp vid <vid>",
        "undo dot1q vrrp"
    ],
    "ParentView": [
        "100ge sub-interface view",
        "10GE sub-interface view",
        "25GE sub-interface view",
        "400GE sub-interface view",
        "40GE sub-interface view",
        "50GE sub-interface view",
        "Eth-Trunk sub-interface view",
        "GE sub-interface view",
        "Global VE sub-interface view",
        "VE sub-interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "vid vid",
            "Info": "Specifies a VLAN ID.\nThe value is an integer ranging from 1 to 4094."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] vlan 2",
            "[*HUAWEI-vlan2] quit",
            "[*HUAWEI] interface GigabitEthernet 1/0/1.1",
            "[*HUAWEI-GigabitEthernet1/0/1.1] control-vid 2 dot1q-termination",
            "[*HUAWEI-GigabitEthernet1/0/1.1] dot1q termination vid 100",
            "[*HUAWEI-GigabitEthernet1/0/1.1] dot1q vrrp vid 100"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf VRRP is enabled on a sub-interface for dot1q VLAN tag termination, VRRP packets need to be encapsulated with inner and outer VLAN tags before being transmitted between VLANs on VRRP devices. The dot1q vrrp command enables the sub-interface for dot1q VLAN tag termination to add VLAN tags to VRRP packets or remove VLAN tags from VRRP packets.\nPrerequisites\nThe control-vid and dot1q termination vid commands have been run on the sub-interface for QinQ VLAN tag termination.\nPrecautions\nIf both VRRP and static ARP are configured on a sub-interface for dot1q or QinQ VLAN tag termination or a VLANIF interface, the VRRP virtual address and the IP address mapped to the static ARP entry must be different.\nOtherwise, the device generates incorrect host routes, affecting traffic forwarding."
}