{
    "PageTitle": "vrrp gratuitous-arp",
    "FuncDef": "The vrrp gratuitous-arp enhance enable command enables the enhancement function for a VRRP backup group to send gratuitous ARP packets. After the VRRP backup group switches to the Master state, each virtual IP address sends three gratuitous ARP packets.\nThe vrrp gratuitous-arp timeout disable command disables the master device from sending a gratuitous ARP packet at intervals.\nThe undo vrrp gratuitous-arp enhance enable command restores the default configuration.\nThe vrrp gratuitous-arp timeout command sets the interval at which the master device sends a gratuitous ARP or ND packet.\nThe undo vrrp gratuitous-arp timeout command restores the default value.\nBy default, the status is enable. The master device sends a gratuitous ARP or ND packet every 30 seconds. The enhancement function for a VRRP backup group to send gratuitous ARP packets is disabled. After a VRRP backup group switches to the Master state, the VRRP backup group sends one gratuitous ARP packet through each virtual IP address.",
    "CLIs": [
        "vrrp gratuitous-arp timeout <time>",
        "vrrp gratuitous-arp timeout disable",
        "vrrp gratuitous-arp enhance enable",
        "undo vrrp gratuitous-arp timeout",
        "undo vrrp gratuitous-arp enhance enable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "timeout time",
            "Info": "Specifies the interval at which the master device sends a gratuitous ARP or ND packet.\nThe value is an integer ranging from 30 to 1200, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] vrrp gratuitous-arp timeout 600"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] vrrp gratuitous-arp timeout disable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] vrrp gratuitous-arp enhance enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe master device in a VRRP4 backup group sends gratuitous ARP packets to its connected downstream switch to update the MAC entries on the downstream switch. To ensure that the MAC entries on the downstream switch can be promptly updated, run the vrrp gratuitous-arp timeout command to configure an interval at which the master device sends gratuitous ARP packets and ensure that the interval is less than the aging period of the MAC entries on the downstream switch.\nThe master device in a VRRP6 backup group sends gratuitous ND packets to its connected downstream switch to update the MAC entries on the downstream switch. To ensure that the MAC entries on the downstream switch can be promptly updated, run the vrrp gratuitous-arp timeout command to configure an interval at which the master device sends gratuitous ND packets and ensure that the interval is less than the aging period of the MAC entries on the downstream switch.\nConfiguration Impact\nAfter the vrrp gratuitous-arp enhance enable command is run and the VRRP backup group switches to the Master state, the VRRP backup group sends three gratuitous ARP packets through each virtual IP address.\nAfter the vrrp gratuitous-arp timeout disable command is run, all VRRP backup groups in the master state no longer send gratuitous ARP packets at intervals. A gratuitous ARP packet is sent to downstream switches only when a backup device becomes the master device. The vrrp gratuitous-arp timeout command can be run to reenable the master device to send gratuitous ARP packets at a specified interval.\nPrecautions\nAfter the vrrp gratuitous-arp timeout command is run, running the vrrp gratuitous-arp timeout disable command disables the master device from periodically sending gratuitous ARP packets.\nExercise caution when running the vrrp gratuitous-arp timeout disable command."
}