{
    "PageTitle": "vrrp recover-delay (Interface view)",
    "FuncDef": "The vrrp recover-delay command sets a status recovery delay for all VRRP groups configured on a specified interface.\nThe undo vrrp recover-delay command restores the default setting.\n\nBy default, the status recovery delay is 0 seconds, indicating that VRRP backup group flapping is not suppressed.",
    "CLIs": [
        "vrrp recover-delay <delay-value>",
        "undo vrrp recover-delay"
    ],
    "ParentView": [
        "PW-VE sub-interface view",
        "40GE interface view",
        "GE electrical interface view",
        "Port extension interface view",
        "Eth-Trunk sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "50GE sub-interface view",
        "GE sub-interface view",
        "VBDIF interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "GE interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "25GE interface view",
        "100ge sub-interface view",
        "40GE sub-interface view",
        "Eth-Trunk interface view",
        "10GE sub-interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "delay-value",
            "Info": "Specifies a status recovery delay for all VRRP backup groups.\nThe value is an integer ranging from 0 to 3600, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] vrrp vrid 10 virtual-ip 10.10.10.10",
            "[~HUAWEI-GigabitEthernet1/0/1] vrrp recover-delay 5"
        ]
    ],
    "ExtraInfo": "Usage Scenario\n\nIf the status of the interface on which a VRRP backup group resides frequently changes, the VRRP backup group frequently flaps. To prevent this situation, run the vrrp recover-delay command to set a status recovery delay to suppress VRRP backup group flapping.\n\nConfiguration Impact\n\nAfter a status recovery delay is set for a VRRP backup group, the VRRP backup group responds to a received interface Up event only after the configured status recovery delay elapses, which prevents interface flapping from causing VRRP backup group flapping.\n\nPrecautions\n\nIf the vrrp recover-delay command is run in the interface view on a device, the same status recovery delay is set for all VRRP backup groups on the interface. The vrrp recover-delay command configured in the interface view takes precedence over that configured in the system view."
}