{
    "PageTitle": "reset vrrp statistics",
    "FuncDef": "The reset vrrp statistics command clears statistics about the VRRP Advertisement packets sent and received by a VRRP backup group.",
    "CLIs": [
        "reset vrrp [ interface { <interface-name> | <interface-type> <interface-number> } ] [ vrid <virtual-router-id> ] statistics"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "interface interface-type interface-number",
            "Info": "Specifies the type and number of an interface.\nThe interface type can only be Ethernet."
        },
        {
            "Parameters": "vrid virtual-router-id",
            "Info": "Specifies the ID of a VRRP backup group.\nThe value is an integer ranging from 1 to 255."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset vrrp interface GigabitEthernet 1/0/0 vrid 1 statistics"
        ],
        [
            "<HUAWEI> reset vrrp statistics"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nDuring troubleshooting, you need to run the reset vrrp statistics command to clear previous statistics before collecting statistics about the received and sent VRRP Advertisement packets. When running the reset vrrp statistics command, note the following:\nIf only the ifType and ifNum parameters are specified, statistics about VRRP Advertisement packets of all VRRP backup groups on the specified interface are cleared.If only the vrid-Value parameter is specified, statistics about VRRP Advertisement packets of the specified VRRP backup group on all interfaces are cleared.If none of the ifType, ifNum, or vrid-Value parameter is specified, statistics about VRRP Advertisement packets of all VRRP backup groups on all interfaces are cleared.\n\nConfiguration Impact\nAfter the reset vrrp statistics command is run, statistics about the received and sent VRRP Advertisement packets are cleared.\nPrecautions\nStatistics about VRRP Advertisement packets cannot be restored after being cleared. Therefore, exercise caution when running this command."
}