{
    "PageTitle": "vrrp unicast port",
    "FuncDef": "The vrrp unicast port command configures a UDP port number used for sending or receiving unicast VRRP Advertisement packets.\nThe undo vrrp unicast port command restores the default UDP port number used for sending or receiving unicast VRRP Advertisement packets.\nBy default, the UDP port number is 3077.",
    "CLIs": [
        "vrrp unicast port <portnum>",
        "undo vrrp unicast port"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "portnum",
            "Info": "Specifies a UDP port number used for sending or receiving unicast VRRP Advertisement packets.\nThe value is an integer ranging from 1025 to 65535."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] vrrp unicast port 5000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf UDP port 3077 has been used by another protocol, unicast VRRP Advertisement packets fail to be sent or received. You can run the vrrp unicast port command to configure a UDP port number used for sending or receiving unicast VRRP Advertisement packets.\nConfiguration Impact\nIf unicast VRRP is running and you run the vrrp unicast port command to change the UDP port number used for sending or receiving unicast VRRP Advertisement packets, the backup device in the unicast VRRP backup group may not receive unicast VRRP Advertisement packets from the master device within a specified period. As a result, dual master devices coexist in the unicast VRRP backup group.\nTo prevent this issue, the period during which the UDP port number is changed must be less than the interval at which unicast VRRP Advertisement packets are sent. You can change the interval using the vrrp vrid timer advertise command.\nPrecautions\nTo ensure that two devices in a unicast VRRP backup group can negotiate the master/backup status, you must configure the same UDP port number for the two devices."
}