{
    "PageTitle": "vrrp version-3 send-packet-mode",
    "FuncDef": "The vrrp version-3 send-packet-mode command configures a VRRPv3-enabled device to send Advertisement packets of a specified version in the system view.\nThe undo vrrp version-3 send-packet-mode command restores the default configuration in the system view.\nBy default, a VRRPv3-enabled device sends only VRRPv3 Advertisement packets.",
    "CLIs": [
        "vrrp version-3 send-packet-mode { v2-only | v2v3-both | v3-only }",
        "undo vrrp version-3 send-packet-mode"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "v2-only",
            "Info": "Indicates that a VRRPv3-enabled device sends only VRRPv2 Advertisement packets.\n-"
        },
        {
            "Parameters": "v2v3-both",
            "Info": "Indicates that a VRRPv3-enabled device sends both VRRPv2 and VRRPv3 Advertisement packets.\n-"
        },
        {
            "Parameters": "v3-only",
            "Info": "Indicates that a VRRPv3-enabled device sends only VRRPv3 Advertisement packets.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] vrrp version v3",
            "[*HUAWEI] vrrp version-3 send-packet-mode v2-only"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf different VRRP versions are configured for devices in a VRRP backup group, a VRRPv2-enabled device receives only VRRPv2 Advertisement packets. After the VRRPv2-enabled device receives VRRPv3 Advertisement packets, it discards them. As a result, the devices in the VRRP backup group cannot negotiate their status. To resolve this issue, run the vrrp version-3 send-packet-mode command to configure a VRRPv3-enabled device to send VRRPv2 Advertisement packets so that the VRRPv2- and VRRPv3-enabled devices can negotiate their status.\nPrerequisites\nThe VRRP version number of a device has been configured as 3 using this command.\nConfiguration Impact\nIf both the vrrp version-3 send-packet-mode and vrrp vrid version-3 send-packet-mode commands are run, the vrrp vrid version-3 send-packet-mode command takes precedence over the vrrp version-3 send-packet-mode command.\nPrecautions\nOnly a VRRPv3-enabled device can be configured to send Advertisement packets of a specified version."
}