{
    "PageTitle": "vrrp virtual-ip route-advertise disable",
    "FuncDef": "The vrrp virtual-ip route-advertise disable command disables a dynamic routing protocol from advertising the routes generated by the virtual IP address of a VRRP backup group.\nThe undo vrrp virtual-ip route-advertise disable command enables a dynamic routing protocol to advertise the routes generated by the virtual IP address of a VRRP backup group.\nBy default, a dynamic routing protocol advertises the routes generated by the virtual IP address of a VRRP backup group.",
    "CLIs": [
        "vrrp virtual-ip route-advertise disable",
        "vrrp virtual-ip route-advertise disable { isis | ospf | rip } *",
        "undo vrrp virtual-ip route-advertise disable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "isis",
            "Info": "Disables IS-IS from advertising the routes generated by the virtual IP address of a VRRP backup group.\n-"
        },
        {
            "Parameters": "ospf",
            "Info": "Disables OSPF from advertising the routes generated by the virtual IP address of a VRRP backup group.\n-"
        },
        {
            "Parameters": "rip",
            "Info": "Disables RIP from advertising the routes generated by the virtual IP address of a VRRP backup group.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] vrrp virtual-ip route-advertise disable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe direct routes generated by the virtual IP address of a VRRP backup group can be imported by a dynamic routing protocol. By default, this kind of route can be advertised by an IGP to the neighboring devices. On actual networks, there may be a large number of routes generated by the virtual IP address of a VRRP backup group. If all of the routes are imported and advertised to the neighboring devices by a dynamic routing protocol, heavy loads are imposed on some devices on the networks, which affects network performance. To resolve this issue, run the vrrp virtual-ip route-advertise disable command to disable an IGP from advertising the routes generated by the virtual IP address of the VRRP backup group.\nYou can specify a dynamic routing protocol as required.\nIf you specify isis, a device disables IS-IS from advertising the routes generated by the virtual IP address of a VRRP backup group.If you specify ospf, a device disables OSPF from advertising the routes generated by the virtual IP address of a VRRP backup group.If you specify rip, a device disables RIP from advertising the routes generated by the virtual IP address of a VRRP backup group.\n\nPrerequisites\nA virtual IP address has been configured for a VRRP backup group.The routes generated by the virtual IP address of the VRRP backup group have been imported by a dynamic routing protocol.\n\nConfiguration Impact\nAfter the vrrp virtual-ip route-advertise disable command has been configured, none of the routes generated by the virtual IP address of the VRRP backup group can be advertised by dynamic routing protocols.\nOn a network where MPLS LDP is configured, the peer device cannot generate an LSP to the virtual IP address of the local VRRP backup group because it cannot receive the routes generated by the virtual IP address of the local VRRP backup group.\nPrecautions\nCurrently, the vrrp virtual-ip route-advertise disable command is valid only for OSPF, IS-IS, and RIP.\nIf a dynamic routing protocol needs to advertise the routes generated by the virtual IP address of a VRRP backup group, do not run the vrrp virtual-ip route-advertise disable command."
}