{
    "PageTitle": "vrrp vrid gratuitous-arp copy-to-member",
    "FuncDef": "The vrrp vrid gratuitous-arp copy-to-member command enables replication of gratuitous ARP packets for a VRRP group so that when a backup device in the VRRP group assumes the master role, it replicates each gratuitous ARP packet to be sent to each Eth-Trunk member interface.\nThe undo vrrp vrid gratuitous-arp copy-to-member command restores the default configuration.\nBy default, this function is disabled. In other words, when a backup device in a VRRP group assumes the master role, it sends a gratuitous ARP packet for each virtual IP address to only one Eth-Trunk member interface.",
    "CLIs": [
        "vrrp vrid <virtual-router-id> gratuitous-arp copy-to-member",
        "undo vrrp vrid <virtual-router-id> gratuitous-arp copy-to-member"
    ],
    "ParentView": [
        "100ge sub-interface view",
        "10GE sub-interface view",
        "25GE sub-interface view",
        "400GE sub-interface view",
        "40GE sub-interface view",
        "50GE sub-interface view",
        "Eth-Trunk sub-interface view",
        "Eth-Trunk interface view",
        "GE sub-interface view",
        "Global VE sub-interface view",
        "PW-VE sub-interface view",
        "VE sub-interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "virtual-router-id",
            "Info": "Specifies the ID of a VRRP group.\nThe value is an integer ranging from 1 to 255."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface eth-trunk 1",
            "[*HUAWEI-Eth-Trunk1] vrrp vrid 1 virtual-ip 10.1.1.1",
            "[*HUAWEI-Eth-Trunk1] vrrp vrid 1 track admin-vrrp interface Eth-Trunk 1 vrid 2 unflowdown",
            "[*HUAWEI-Eth-Trunk1] vrrp vrid 1 gratuitous-arp copy-to-member"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn the scenario where a VRRP group is configured on an Eth-Trunk interface or Eth-Trunk sub-interface, when a backup device in the VRRP group assumes the master role, it sends a gratuitous ARP packet for each virtual IP address to only one Eth-Trunk member interface by default. To ensure that the downstream device can receive gratuitous ARP packets in time and improve network convergence performance, run the vrrp vrid gratuitous-arp copy-to-member command to enable replication of gratuitous ARP packets for a VRRP group so that when a backup device in the VRRP group assumes the master role, it replicates each gratuitous ARP packet to be sent to each Eth-Trunk member interface.\nPrerequisites\nA VRRP group has been created and assigned a virtual IP address using the vrrp vrid virtual-router-id virtual-ip virtual-address command.The VRRP group has been bound to an mVRRP group in unflowdown mode using the vrrp vrid virtual-router-id1 track admin-vrrp interface interface-type interface-number vrid virtual-router-id2 unflowdown command."
}