{
    "PageTitle": "backup-id remote-backup-service",
    "FuncDef": "The backup-id remote-backup-service command configures a backup ID for an RBP and associates the RBP with a specified RBS.\nThe undo backup-id remote-backup-service command deletes the backup ID configured for an RBP and removes the association between the RBP and a specified RBS.\nBy default, no backup ID is configured for an RBP and no RBP is associated with an RBS.",
    "CLIs": [
        "backup-id <backup-id> remote-backup-service <service-name>",
        "undo backup-id <backup-id> remote-backup-service <service-name>"
    ],
    "ParentView": [
        "Remote backup profile view"
    ],
    "ParaDef": [
        {
            "Parameters": "backup-id",
            "Info": "Specifies a backup ID for an RBP.\nThe value is an integer ranging from 1 to 4095."
        },
        {
            "Parameters": "service-name",
            "Info": "Specifies the name of an RBS.\nThe value is a string of 1 to 32 case-insensitive characters, spaces not supported.\nWhen double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] remote-backup-service rbs",
            "[*HUAWEI-rm-backup-srv-rbs] peer 2.2.2.2 source 1.1.1.1 port 6006",
            "[*HUAWEI-rm-backup-srv-rbs] quit",
            "[*HUAWEI] remote-backup-profile rpf",
            "[*HUAWEI-rm-backup-prf-rpf] backup-id 10 remote-backup-service rbs"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo enable a device to use a backup ID and RBS to find an RBP, run the backup-id remote-backup-service command to configure the backup ID for the RBP and associates the RBP with the RBS.\nPrerequisites\nAn RBS has been created using the remote-backup-service service-name command.\nPrecautions\nThe backup IDs configured for the same RBP must be the same on the master and backup devices and can no longer be configured for other RBPs."
}