{
    "PageTitle": "peer-ipv6 source-ipv6 port",
    "FuncDef": "The peer-ipv6 source-ipv6 port command sets TCP connection parameters for a remote backup service (RBS).\nThe undo peer-ipv6 source-ipv6 port command deletes a TCP connection for an RBS.\nBy default, no parameters of a TCP connection for the RBS are set.",
    "CLIs": [
        "peer-ipv6 <peer-ipv6-address> source-ipv6 <source-ipv6-address> port <port-id>",
        "undo peer-ipv6 <peer-ipv6-address> [ source-ipv6 <source-ipv6-address> port <port-id> ]"
    ],
    "ParentView": [
        "Remote backup service view"
    ],
    "ParaDef": [
        {
            "Parameters": "peer-ipv6-address",
            "Info": "Specifies an IPv6 address used for the remote backup device to establish a TCP connection.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "source-ipv6-address",
            "Info": "Specifies an IPv6 address used for the local device to establish a TCP connection.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "port-id",
            "Info": "Specifies a TCP port number.\nThe value is an integer ranging from 1024 to 55535."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] remote-backup-service rbs",
            "[*HUAWEI-rm-backup-srv-rbs] peer-ipv6 2001:db8:1::1 source-ipv6 2001:db8:1::2 port 6001"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe remote backup function sends local user information to a remote backup device over a TCP connection. To set TCP connection parameters for an RBS. run the peer-ipv6 source-ipv6 command. The TCP parameters include the IPv6 address of a remote backup device, the IPv6 address of a local device, and a TCP port number.\nPrerequisites\nAn RBS has been created using the remote-backup-service service-name command.\nPrecautions\nThe remote IPv6 address must already exist on the remote backup device's main interface, sub-interface, or logical interface (for example, loopback interface). The local IP address must already exist on the local device's main interface, sub-interface, or logical interface. The local and remote IP addresses must be pinged by each other.\nThe same TCP port number must be set on devices that back up each other."
}