{
    "PageTitle": "e-trunk eth-trunk",
    "FuncDef": "The e-trunk eth-trunk command binds an E-Trunk's member interface Eth-Trunk to a remote backup profile (RBP).\nThe undo e-trunk eth-trunk command unbinds an E-Trunk's member interface Eth-Trunk from an RBP.\nBy default, an E-Trunk's member interface Eth-Trunk is not bound to an RBP.",
    "CLIs": [
        "e-trunk <e-trunk-id> eth-trunk <eth-trunk-id>",
        "undo e-trunk <e-trunk-id> eth-trunk <eth-trunk-id>"
    ],
    "ParentView": [
        "Remote backup profile view"
    ],
    "ParaDef": [
        {
            "Parameters": "e-trunk-id",
            "Info": "Specifies the ID of an E-Trunk.\nThe value is an integer ranging from 1 to 128."
        },
        {
            "Parameters": "eth-trunk-id",
            "Info": "Specifies the ID of an Eth-Trunk.\nThe value is an integer ranging from 0 to 65535."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] e-trunk 1",
            "[*HUAWEI-e-trunk-1] quit",
            "[*HUAWEI] interface Eth-Trunk 1",
            "[*HUAWEI-Eth-Trunk1] e-trunk 1",
            "[*HUAWEI-Eth-Trunk1] quit",
            "[*HUAWEI] remote-backup-profile p1",
            "[*HUAWEI-rm-backup-prf-p1] e-trunk 1 eth-trunk 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo bind an E-Trunk's member interface Eth-Trunk to an RBP in an hot backup scenario, run the e-trunk eth-trunk command. After the command is run, the RBP uses the Eth-Trunk status as the master/backup protocol status.\nPrerequisites\nAn RBP has been created using the remote-backup-profile profile-name command.An Eth-Trunk has been created using the interface eth-trunk trunk-id command, and an Ethernet interface has been added to the Eth-Trunk using the eth-trunk trunk-id command.An E-Trunk has been created using the e-trunk etrunkId command, and the Eth-Trunk has been added to the E-Trunk using the e-trunk etrunkId [ remote-eth-trunk ethTrunkId ] command.\n\nPrecautions\nOnly IGMP snooping services support the Eth-Trunk status as the master/backup protocol status."
}