{
    "PageTitle": "vrrp-id",
    "FuncDef": "The vrrp-id command binds an RBP to a specified VRRP backup group.\nThe undo vrrp-id command unbinds an RBP from a VRRP backup group.\nBy default, no RBP is bound to a VRRP backup group .",
    "CLIs": [
        "vrrp-id <vrid> interface { <interface-name> | <interface-type> <interface-number> }",
        "vrrp-id <vrid> interface { <interface-name> | <interface-type> <interface-number> } { odd-mac | even-mac }",
        "undo vrrp-id <vrid>"
    ],
    "ParentView": [
        "Remote backup profile view"
    ],
    "ParaDef": [
        {
            "Parameters": "vrid",
            "Info": "Specifies the ID of a VRRP backup group.\nThe value is an integer ranging from 1 to 255."
        },
        {
            "Parameters": "interface interface-type interface-number",
            "Info": "Specifies the type and number of an interface configured with a VRRP group.\n-"
        },
        {
            "Parameters": "odd-mac",
            "Info": "Binds an RBP to a VRRP backup group in odd MAC address mode.\n-"
        },
        {
            "Parameters": "even-mac",
            "Info": "Binds an RBP to a VRRP backup group in even MAC address mode.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/1",
            "[*HUAWEI-GigabitEthernet1/0/1] vrrp vrid 1",
            "[*HUAWEI-GigabitEthernet1/0/1] quit",
            "[*HUAWEI] remote-backup-profile rpf",
            "[*HUAWEI-rm-backup-prf-rpf] vrrp-id 1 interface GigabitEthernet 1/0/1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBefore applying an RBP to the interface with a VRRP backup group configured, run the vrrp-id command to bind the RBP to the VRRP backup group. You can run the command to bind an RBP to a VRRP backup group in odd or even MAC address mode.\nPrerequisites\nAn RBP has been created using the remote-backup-profile command in the system view.\nFollow-up Procedure\nRun the remote-backup-profile command in the interface view to bind the RBP to the interface with the VRRP backup group configured.\nPrecautions\nThe ID of the VRRP backup group bound with an RBP must be the same as the ID of the VRRP backup group configured on the corresponding interface."
}