{
    "PageTitle": "batch-shutdown",
    "FuncDef": "The batch-shutdown command shuts down BFD sessions in batches so that the sessions enter the AdminDown state.\nThe undo batch-shutdown command starts BFD sessions in batches.",
    "CLIs": [
        "batch-shutdown { all | ip | lsp | pw | tunnel }",
        "undo batch-shutdown { all | ip | lsp | pw | tunnel }"
    ],
    "ParentView": [
        "BFD view"
    ],
    "ParaDef": [
        {
            "Parameters": "all",
            "Info": "Shuts down all BFD sessions in batches.\n-"
        },
        {
            "Parameters": "ip",
            "Info": "Shuts down BFD sessions of the IP link type in batches.\n-"
        },
        {
            "Parameters": "lsp",
            "Info": "Shuts down BFD sessions of the LSP link type in batches.\n-"
        },
        {
            "Parameters": "pw",
            "Info": "Shuts down BFD sessions of the PW link type in batches.\n-"
        },
        {
            "Parameters": "tunnel",
            "Info": "Shuts down BFD sessions of the tunnel link type in batches.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bfd",
            "[*HUAWEI-bfd] batch-shutdown all"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen a large number of BFD sessions flap, frequent link switchovers are performed. As a result, service forwarding is affected. If the undo bfd command is run to disable BFD to restore services, a large number of BFD configurations are lost. As a result, flapping fault locating becomes difficult. To resolve this issue, run the batch-shutdown command to shut down BFD sessions in batches.\nThe batch-shutdown command takes effect on static BFD sessions and static self-negotiated BFD sessions. This command issues the shutdown commands in a batch for these types of BFD sessions. A shutdown command instance is generated in the view of each BFD session.\nConfiguration Impact\nAfter the batch-shutdown command is run, all static BFD sessions and static auto BFD sessions or static BFD sessions and static auto BFD sessions of a specified link type enter the AdminDown state.\nPrecautions\nThe batch-shutdown and shutdown commands have the same result for a BFD session. For example, after running the batch-shutdown all command to shut down all BFD sessions, you can run the undo shutdown command to start a specified BFD session."
}