{
    "PageTitle": "bfd authentication-mode",
    "FuncDef": "The bfd authentication-mode command enables the negotiation authentication function for the BFD session with a specified peer IP address and configure authentication information.\nThe undo bfd authentication-mode command disables the negotiation authentication function for the BFD session with a specified peer IP address.\nBy default, negotiation authentication is disabled for a BFD session. You are advised to configure BFD negotiation authentication to reduce security risks.",
    "CLIs": [
        "bfd single-hop peer-ip <ip-address> [ vpn-instance <vpn-name> ] authentication-mode met-sha1 key-id <key-id-value> cipher <cipher-text> nego-packet",
        "bfd single-hop peer-ipv6 <ipv6-address> [ vpn-instance <vpn-name> ] authentication-mode met-sha1 key-id <key-id-value> cipher <cipher-text> nego-packet",
        "bfd multi-hop peer-ip <ip-address> [ vpn-instance <vpn-name> ] authentication-mode met-sha1 key-id <key-id-value> cipher <cipher-text> nego-packet",
        "bfd multi-hop peer-ipv6 <ipv6-address> [ vpn-instance <vpn-name> ] authentication-mode met-sha1 key-id <key-id-value> cipher <cipher-text> nego-packet",
        "bfd mpls-passive peer-ip <ip-address> authentication-mode met-sha1 key-id <key-id-value> cipher <cipher-text> nego-packet",
        "bfd lsp-tunnel peer-ip <ip-address> authentication-mode met-sha1 key-id <key-id-value> cipher <cipher-text> nego-packet",
        "undo bfd single-hop peer-ip <ip-address> [ vpn-instance <vpn-name> ]",
        "undo bfd single-hop peer-ipv6 <ipv6-address> [ vpn-instance <vpn-name> ]",
        "undo bfd multi-hop peer-ip <ip-address> [ vpn-instance <vpn-name> ]",
        "undo bfd multi-hop peer-ipv6 <ipv6-address> [ vpn-instance <vpn-name> ]",
        "undo bfd mpls-passive peer-ip <ip-address>",
        "undo bfd lsp-tunnel peer-ip <ip-address>"
    ],
    "ParentView": [
        "BFD view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance vpn-name",
            "Info": "Specifies the name of a VPN instance for the BFD sessions with negotiation authentication.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "met-sha1",
            "Info": "Specifies the M-SHA1 algorithm.\n-"
        },
        {
            "Parameters": "key-id key-id-value",
            "Info": "Specifies the key ID.\nThe value is an integer ranging from 1 to 255."
        },
        {
            "Parameters": "cipher cipher-text",
            "Info": "Specifies the encryption password.\nThe value is a string case-sensitive characters, spaces not supported.\nThe value is a string of 1 to 20 characters for simple authentication keys.The value is a string of 20 to 148 characters for ciphertext authentication keys."
        },
        {
            "Parameters": "nego-packet",
            "Info": "Specifies authentication for BFD session negotiation packets.\n-"
        },
        {
            "Parameters": "single-hop",
            "Info": "Specifies the BFD for IP single-hop session type.\n-"
        },
        {
            "Parameters": "peer-ipv6 ipv6-address",
            "Info": "Specifies the peer IPv6 address of the BFD sessions with negotiation authentication.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "multi-hop",
            "Info": "Specifies the BFD for IP multi-hop session type.\n-"
        },
        {
            "Parameters": "peer-ip ip-address",
            "Info": "Specifies the peer IPv4 address of the BFD sessions with negotiation authentication.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "mpls-passive",
            "Info": "Specifies the BFD for LSP passive session type.\n-"
        },
        {
            "Parameters": "lsp-tunnel",
            "Info": "Specifies the BFD for LSP proactive session type.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bfd",
            "[*HUAWEI-bfd] bfd single-hop peer-ip 10.1.1.1 authentication-mode met-sha1 key-id 1 cipher HUAWEI_123456 nego-packet"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen configuring negotiation authentication for BFD sessions, you need to select different commands according to the type of the target BFD sessions.\nbfd single-hop peer-ip ip-address [ vpn-instance vpnname-value ] authentication-mode met-sha1 key-id key-id-value cipher cipher-text nego-packet\nEnable negotiation authentication for a BFD for IP single-hop session with the specified peer IP address on the IPv4 network and configure the key ID and encryption password.\nbfd single-hop peer-ipv6 ipv6-address [ vpn-instance vpnname-value ] authentication-mode met-sha1 key-id key-id-value cipher cipher-text nego-packet\nEnable negotiation authentication for a BFD for IP single-hop session with the specified peer IP address on the IPv6 network and configure the key ID and encryption password.\nbfd multi-hop peer-ip ip-address [ vpn-instance vpnname-value ] authentication-mode met-sha1 key-id key-id-value cipher cipher-text nego-packet\nEnable negotiation authentication for a BFD for IP multi-hop session with the specified peer IP address on the IPv4 network and configure the key ID and encryption password.\nbfd multi-hop peer-ipv6 ipv6-address [ vpn-instance vpnname-value ] authentication-mode met-sha1 key-id key-id-value cipher cipher-text nego-packet\nEnable negotiation authentication for a BFD for IP multi-hop session with the specified peer IP address on the IPv6 network and configure the key ID and encryption password.\nbfd mpls-passive peer-ip ip-address [ vpn-instance vpnname-value ] authentication-mode met-sha1 key-id key-id-value cipher cipher-text nego-packet\nEnable negotiation authentication for a BFD for LSP passive session with the specified peer IP address on the IPv4 network and configure the key ID and encryption password.\nbfd lsp-tunnel peer-ip ip-address [ vpn-instance vpnname-value ] authentication-mode met-sha1 key-id key-id-value cipher cipher-text nego-packet\nEnable negotiation authentication for a BFD for LSP proactive session with the specified peer IP address on the IPv4 network and configure the key ID and encryption password.\n\nPrerequisites\nBFD has been enabled globally using the bfd command.\nPrecautions\nThe peer device must be configured with the same algorithm (met-sha1) and key (key-id key-id-value) as the local device to ensure that BFD sessions can be authenticated and go Up after negotiation.BFD negotiation authentication information is configured based on the peer IP address.BFD for LSP passive session authentication information is configured based on the peer IP address, regardless of service types. If the peer-ip values of multiple passive sessions are the same, the configured authentication information takes effect for these sessions. In addition, the same authentication information must be configured for multiple sessions on the initiator."
}