{
    "PageTitle": "bfd (session)",
    "FuncDef": "The bfd command displays a specified BFD session view.",
    "CLIs": [
        "bfd <session-name>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "session-name",
            "Info": "Specifies the BFD configuration name.\nThe value is a string of 1 to 64 characters, spaces not supported. When quotation marks are used around the string, spaces are allowed in the string.\nWhen the name of a BFD session is configured, the uppercase and lowercase letters in the name must be the same as what you enter.BFD session names are case-insensitive. For example, ABC and abc are regarded as the same BFD session. If you have configured ABC as the name of a BFD session, the ABC BFD session view is directly displayed when you configure abc."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bfd",
            "[*HUAWEI-bfd] quit",
            "[*HUAWEI] bfd session bind peer-ip 10.10.20.2",
            "[*HUAWEI-session-session] quit",
            "[*HUAWEI] bfd session",
            "[*HUAWEI-bfd-session-session]"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo enter the view of the specified BFD session before setting functional parameters for a created BFD session, run the bfd session-name command.\nPrerequisites\nA BFD session has been created using any of the following commands:\nbfd bind peer-ipbfd bind peer-ip default-ipbfd bind peer-ip source-ip autobfd bind peer-ipv6bfd bind peer-ipv6 source-ipv6 auto\n\nFollow-up Procedure\nAfter the BFD session view is displayed, you can perform the following operations:\nRun the description command to configure a description for the BFD session.Run the min-tx-interval command to set a desired minimum interval at which BFD packets are sent.Run the min-rx-interval command to set a desired minimum interval at which BFD packets are received.Run the detect-multiplier command to set a local detection multiplier for the BFD session.Run the wtr command to set a WTR time for the BFD session.\n\nPrecautions\nAfter the bfd session-name command is run, the BFD session view is displayed irrespective of whether the BFD session is Up.After the functional parameters of the BFD session are set, you must run the commit command to make the configurations take effect.If the BFD session is in the Down state and you run the bfd session-name command to enter the BFD session view and set functional parameters, the configurations can immediately take effect after being committed using the commit command.You can run the undo bfd command to delete a specified BFD session."
}