{
    "PageTitle": "default-ip-bfd transparent-transmission enable",
    "FuncDef": "The default-ip-bfd transparent-transmission enable command configures multicast IPv4 BFD packets on an interface and its sub-interfaces to be transparently transmitted.\nThe undo default-ip-bfd transparent-transmission enable command configures multicast IPv4 BFD packets on an interface and its sub-interfaces to be sent to the CPU.\nBy default, multicast IPv4 BFD packets on an interface and its sub-interfaces are sent to the CPU.",
    "CLIs": [
        "default-ip-bfd transparent-transmission enable",
        "undo default-ip-bfd transparent-transmission enable"
    ],
    "ParentView": [
        "100GE interface view",
        "10G LAN interface view",
        "10G WAN interface view",
        "25GE interface view",
        "400GE interface view",
        "40GE interface view",
        "50GE interface view",
        "50|100GE interface view",
        "Eth-Trunk interface view",
        "FlexE interface view",
        "GE optical interface view",
        "GE electrical interface view",
        "XGE interface view",
        "Port extension interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] default-ip-bfd transparent-transmission enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn a network, if a customer-side router that functions as a CE has the default BFD function enabled, the default BFD packets received by a PE are sent to the CPU instead of being transparently transmitted to the peer CE. After BFD is enabled globally on a device, you can run the default-ip-bfd transparent-transmission enable command on an interface to configure multicast IPv4 BFD packets to be transparently transmitted on the interface and its sub-interfaces even if all interfaces can capture BFD packets.\nPrecautions\nThis command can be run only on an interface. After the command is run, the command configuration takes effect on all the sub-interfaces of the interface."
}