{
    "PageTitle": "delay-up",
    "FuncDef": "The delay-up command sets the delay before a BFD session goes Up.\nThe undo delay-up command deletes the configured delay.\nBy default, no delay is set before a BFD session goes Up.",
    "CLIs": [
        "delay-up <seconds>",
        "undo delay-up"
    ],
    "ParentView": [
        "BFD view"
    ],
    "ParaDef": [
        {
            "Parameters": "seconds",
            "Info": "Specifies the time that elapses when the BFD session is delayed to become Up.\nThe value is an integer ranging from 1 to 600, in seconds. The default value is 0, indicating that the BFD session immediately goes Up."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bfd",
            "[*HUAWEI-bfd] delay-up 120"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn scenarios in which a Huawei device and a non-Huawei device are connected, if the Huawei device or its interface board restarts, traffic needs to be switched from an active link to a standby link. After the Huawei device or its interface board successfully restarts, the traffic needs to be switched from the standby link to the active link. In this case, the BFD session on the active link is Up. On certain non-Huawei devices, a link switchover is performed according to the BFD session status, the route to the Huawei devices may not be generated on the non-Huawei devices. As a result, traffic is dropped. To prevent this problem, the BFD session can be created and go Up through the negotiation after a delay.\nPrerequisites\nBFD has been globally enabled using the bfd command in the system view.\nConfiguration Impact\nThis command takes effect only on the configuration of the BFD sessions to be established but does not affect the established BFD sessions.\nPrecautions\nThe delay-up command applies only to scenarios in which Huawei devices interwork with non-Huawei devices and takes effect only after the Huawei device or its interface board restarts.\nIf the secondary link fails after traffic has been switched to it from the primary link, traffic may fail to be switched back because the BFD session that monitors the primary link is in the delay-up state. In this case, you are advised to configure a best-effort path."
}