{
    "PageTitle": "discriminator (BFD session view)",
    "FuncDef": "The discriminator command sets the local and remote discriminators of a static BFD session.\nThe undo discriminator command deletes the local and remote discriminators of a static BFD session.\nBy default, the discriminator of a static BFD session is not created.",
    "CLIs": [
        "discriminator local <discr-value>",
        "discriminator remote <discr-value>",
        "undo discriminator local",
        "undo discriminator remote"
    ],
    "ParentView": [
        "BFD session view"
    ],
    "ParaDef": [
        {
            "Parameters": "remote discr-value",
            "Info": "Specifies the remote discriminator of a BFD session.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "local discr-value",
            "Info": "Specifies the local discriminator of a BFD session.\nThe value is an integer ranging from 1 to 16384."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bfd",
            "[*HUAWEI-bfd] quit",
            "[*HUAWEI] bfd s1 bind peer-ip 10.10.20.2",
            "[*HUAWEI-session-s1] quit",
            "[*HUAWEI] bfd s1",
            "[*HUAWEI-bfd-session-s1] discriminator local 80",
            "[*HUAWEI-bfd-session-s1] discriminator remote 800"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nDuring the establishment of a static BFD session, you must run the discriminator command to set the local and remote discriminators of the static BFD session; otherwise, the static BFD session cannot be established.\nDiscriminators identify different BFD sessions between virtual systems (VSs). During the negotiation of the BFD session, the two ends of the BFD session need to negotiate on the local and remote discriminators.\nPrerequisites\nA BFD session has been created.\nConfiguration Impact\nOnce the local and remote identifiers for the static BFD session are configured successfully, they can be modified.\nPrecautions\nOnly a static BFD session requires local and remote discriminators.In a BFD session, the local discriminator of the local end must be the same as the remote discriminator of the remote end, and the remote discriminator of the local end must be the same as the local discriminator of the remote end. Otherwise, the BFD session cannot go Up.The local discriminators of different virtual systems (VSs) must be different; otherwise, an error message will be displayed.The local and remote discriminators set for a static BFD session can be changed.Do not configure the same remote discriminator and local discriminator for different sessions on a device. - When a BFD session is Up, changing the local or remote discriminator causes the session to enter the administratively Down state. The BFD session recovers automatically without manual intervention."
}