{
    "PageTitle": "process-pst",
    "FuncDef": "The process-pst command enables a BFD session to modify the port state table or link state table upon detection of a fault.\nThe undo process-pst command disables a BFD session from modifying the port state table or link state table upon detection of a fault.\nBy default, a BFD session does not modify the port state table or link state table upon detection of a fault.",
    "CLIs": [
        "process-pst",
        "undo process-pst"
    ],
    "ParentView": [
        "BFD session view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bfd",
            "[*HUAWEI-bfd] quit",
            "[*HUAWEI] bfd session bind peer-ip 10.10.20.2 interface GigabitEthernet 1/0/0",
            "[*HUAWEI-bfd-session-session] process-pst"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn BFD-based link protection scenarios such as BFD for FRR, you are advised to run the process-pst command to enable a BFD session to modify the port state table or link state table upon detection of a fault so that a fast link switchover can be performed.\nConfiguration Impact\nAfter the process-pst command is run, the BFD session is associated with the port state table or link state table of the interface to which the BFD session is bound. After the BFD session detects a link down event, the system sets the port state table or link state table of the interface bound to the BFD session to down. Then, the system switches traffic to a working link accordingly.\nPrecautions\nThe process-pst command can be run in the view of a single-hop BFD session bound to an interface. If multiple BFD sessions are bound to the same physical interface, only one BFD session can modify the port state table or link state table after the process-pst command is run. If multiple BFD sessions are bound to the same logical interface (sub-interface or VBDIF interface), the process-pst command takes effect for one BFDv4 session and one BFDv6 session.\nThe process-pst command also takes effect for BFD sessions for LDP LSP, TE LSP, and TE tunnel."
}