{
    "PageTitle": "reflector discriminator",
    "FuncDef": "The reflector discriminator command configures a discriminator for a Seamless Bidirectional Forwarding Detection (SBFD) reflector.\nThe undo reflector discriminator command deletes a discriminator configured for an SBFD reflector.\nBy default, no discriminator is configured for an SBFD reflector.",
    "CLIs": [
        "reflector discriminator { <unsigned-integer-value> | <ip-address-value> }",
        "undo reflector discriminator { <unsigned-integer-value> | <ip-address-value> }"
    ],
    "ParentView": [
        "SBFD view"
    ],
    "ParaDef": [
        {
            "Parameters": "unsigned-integer-value",
            "Info": "Specifies an integer-type discriminator.\nThe value is an integer ranging from 16777216 to 2130706431 and from 2147483648 to 3758096383."
        },
        {
            "Parameters": "ip-address-value",
            "Info": "Specifies an IP-address-type discriminator.\nThe value is in dotted decimal notation and must be a unicast address."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bfd",
            "[*HUAWEI-bfd] quit",
            "[*HUAWEI] sbfd",
            "[*HUAWEI-sbfd] reflector discriminator 16777216"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nSimilar to BFD, SBFD also uses My Discriminator and Your Discriminator to distinguish different sessions. An SBFD reflector loops back packets without detecting services, and therefore you only need to run the reflector discriminator command to configure a discriminator for the SBFD reflector. The discriminator is Your Discriminator for the initiator.\nYou can configure a 32-bit integer-type discriminator or an IP-address-type discriminator. A device converts the discriminators into a uniform form for management, ensuring that each discriminator is globally unique in a domain.\nPrerequisites\nSBFD has been enabled using the sbfd command.\nPrecautions\nOn a network, you can deploy multiple reflectors for an initiator and configure multiple discriminators for a reflector. All discriminators configured for reflectors must be globally unique on a network."
}