{
    "PageTitle": "authentication-mode (BFD session view)",
    "FuncDef": "The authentication-mode command configures an authentication mode and key for a BFD session.\nThe undo authentication-mode command deletes the authentication mode and key configured for a BFD session.\nBy default, no authentication mode and key are configured for a BFD session.",
    "CLIs": [
        "authentication-mode met-sha1 key-id <key-id> cipher <cipher-text> nego-packet [ timeout-interval <interval-value> ]",
        "undo authentication-mode"
    ],
    "ParentView": [
        "BFD session view"
    ],
    "ParaDef": [
        {
            "Parameters": "key-id key-id",
            "Info": "Specifies an authentication key ID.\nThe value is an integer ranging from 1 to 255."
        },
        {
            "Parameters": "cipher cipher-text",
            "Info": "Specifies a ciphertext key type.\nThe value is a string of characters.\nThe value is a string of 1 to 20 characters for simpletext authentication keys.The value is a string of 20 to 148 characters for ciphertext authentication keys.\nThe characters exclude question marks (?) and spaces. However, if a password string is between a pair of quotation marks, the string can contain spaces."
        },
        {
            "Parameters": "nego-packet",
            "Info": "Authenticates BFD negotiation packets.\n-"
        },
        {
            "Parameters": "timeout-interval interval-value",
            "Info": "Specifies a negotiation timeout period.\nThe value is an integer. The value is a string of 1 to 10000 characters, in seconds."
        },
        {
            "Parameters": "met-sha1",
            "Info": "Specifies the SHA1 algorithm.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bfd",
            "[*HUAWEI-bfd] quit",
            "[*HUAWEI] bfd test bind peer-ip default-ip interface GigabitEthernet1/0/0",
            "[*HUAWEI-bfd-session-test] authentication-mode met-sha1 key-id 5 cipher aaa nego-packet timeout-interval 5"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn a network demanding higher security, run the authentication-mode command to configure BFD session authentication information. In a specific access scenario, for example, when a multicast BFD session is associated with the protocol status of an interface, you need to configure authentication information for the BFD session on the interface. BFD negotiation can succeed, the BFD-associated protocol status of the interface can be activated, and users can access the device through this interface only when the BFD session authentication information on both ends is consistent.\nPrerequisites\nBFD is globally enabled by running the bfd command.Establishing a BFD session.\n\nPrecautions\nIf you run the authentication-mode command to configure BFD session authentication information, BFD renegotiation will be performed. BFD renegotiation can succeed only when the BFD session authentication information on both ends is consistent."
}