{
    "PageTitle": "resource (VS resource template view)",
    "FuncDef": "The resource command adds a resource item to a resource template and specifies the upper limit for the resource item.\nThe undo resource command deletes a resource item from a resource template.\nBy default, a newly created resource template contains no resource item.",
    "CLIs": [
        "resource u4route upper-limit <resource-limit>",
        "resource u6route upper-limit <resource-limit>",
        "resource m4route upper-limit <resource-limit>",
        "resource m6route upper-limit <resource-limit>",
        "resource vpn-instance upper-limit <resource-limit>",
        "undo resource u4route upper-limit",
        "undo resource u6route upper-limit",
        "undo resource m4route upper-limit",
        "undo resource m6route upper-limit",
        "undo resource vpn-instance upper-limit"
    ],
    "ParentView": [
        "VS resource template view"
    ],
    "ParaDef": [
        {
            "Parameters": "u6route",
            "Info": "Specifies the u6route (Unicast IPv6 routing entry) resource to be allocated to the service VS.\n-"
        },
        {
            "Parameters": "upper-limit resource-limit",
            "Info": "Specifies the upper limit for a logical resource to be assigned to a VS.\nThe value is an integer."
        },
        {
            "Parameters": "m4route",
            "Info": "Specifies the m4route (Multicast IPv4 routing entry) resource be allocated to the service VS.\n-"
        },
        {
            "Parameters": "m6route",
            "Info": "Specifies the m6route (Multicast IPv6 routing entry) resource to be allocated to the service VS.\n-"
        },
        {
            "Parameters": "vpn-instance",
            "Info": "Specifies the vpn-instance resource to be allocated to the service VS.\n-"
        },
        {
            "Parameters": "u4route",
            "Info": "Specifies the u4route (Unicast IPv4 routing entry) resource to be allocated to the service VS.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] admin",
            "[~HUAWEI-admin] resource-template temp_Test",
            "[*HUAWEI-admin-template:temp_Test] resource u4route upper-limit 10000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo add a resource item to a resource template and specify the upper limit for the resource item, run the resource command. After the configuration is complete, the PS uses the resource template to assign resources to a VS in a batch, improving VS resource management flexibility.\nFollow-up Procedure\nAfter the resource template is assigned to the VS, modify the resource items in the template. Modifying a resource item in a resource template does not affect the resources that have been used.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}