{
    "PageTitle": "resource (Management view)",
    "FuncDef": "The resource command assigns logical resources to a virtual system (VS).\nThe undo resource command restores the default resource allocation method.\nBy default, no logical resource is allocated to a VS.",
    "CLIs": [
        "resource u4route upper-limit <resource-limit>",
        "resource u6route upper-limit <resource-limit>",
        "resource m4route upper-limit <resource-limit>",
        "resource m6route upper-limit <resource-limit>",
        "resource vpn-instance upper-limit <resource-limit>",
        "undo resource u4route upper-limit",
        "undo resource u6route upper-limit",
        "undo resource m4route upper-limit",
        "undo resource m6route upper-limit",
        "undo resource vpn-instance upper-limit"
    ],
    "ParentView": [
        "Management view"
    ],
    "ParaDef": [
        {
            "Parameters": "u6route",
            "Info": "Specifies the u6route (Unicast IPv6 routing entry) resource to be allocated to the service VS.\nThe value ranges from 0 to 2097152. The default value is 1048576."
        },
        {
            "Parameters": "upper-limit resource-limit",
            "Info": "Specifies the upper limit for a logical resource to be assigned to a VS.\nThe value is an integer."
        },
        {
            "Parameters": "m4route",
            "Info": "Specifies the m4route (Multicast IPv4 routing entry) resource be allocated to the service VS.\nThe value ranges from 0 to 16000. The default value is 2000."
        },
        {
            "Parameters": "m6route",
            "Info": "Specifies the m6route (Multicast IPv6 routing entry) resource to be allocated to the service VS.\nThe value ranges from 0 to 8000. The default value is 512."
        },
        {
            "Parameters": "vpn-instance",
            "Info": "Specifies the vpn-instance resource to be allocated to the service VS.\nThe value ranges from 1 to 4096. The default value is 512."
        },
        {
            "Parameters": "u4route",
            "Info": "Specifies the u4route (Unicast IPv4 routing entry) resource to be allocated to the service VS.\nThe value ranges from 0 to 4194304. The default value is 1048576."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] admin",
            "[~HUAWEI-admin] virtual-system vs1",
            "[*HUAWEI-admin-vs:vs1] port-mode port",
            "[*HUAWEI-admin-vs:vs1] resource m4route upper-limit 100"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo assign or reclaim logical resources, run the resource command. To restore the default configuration, run the undo resource command. If a specified resource is insufficient, an error message is displayed.\nPrerequisites\nLogical resources can be assigned or reclaimed only when both of the following conditions are true:\nA VS is running.You have specified the port mode for the VS.\n\nConfiguration Impact\nDecreasing the upper limit for a logical resource does not affect services that are already running on the VS."
}