{
    "PageTitle": "port-mode (VS resource template view)",
    "FuncDef": "The port-mode command specifies a port mode and a resource template for a virtual system (VS).\nBy default, the port mode is PORT.",
    "CLIs": [
        "port-mode <port-mode> [ resource-template <template-name> ]"
    ],
    "ParentView": [
        "VS resource template view"
    ],
    "ParaDef": [
        {
            "Parameters": "port-mode",
            "Info": "Specifies the port mode.\nPORT: When you run the assign interface (VS view) command to assign interface resources, a specified interface is assigned to the VS."
        },
        {
            "Parameters": "template-name",
            "Info": "Specifies the name of a resource template.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] admin",
            "[*HUAWEI-admin] virtual-system vs1",
            "[*HUAWEI-admin-vs:vs1] port-mode port"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo specify a port mode and a resource template for a VS, run the port-mode command.\nA resource template is a collection of resource items.\nConfiguration Impact\nThe port allocation mode determines the granularity of interfaces allocated to VSs and the range of resources allocated to VSs.\nAll VSs in port mode share resources in a resource pool in port mode.\nFor details about the resource usage of each resource pool, see the display virtual-system resource command.\nFollow-up Procedure\n Run the assign resource-template command to modify the resource template associated with the VS. Run the assign resource command to modify the specification of a specified VS resource item.\n\nPrecautions\nAfter you create a VS, you must first configure a port mode. If you do not first configure a port mode, you cannot:\nConfigure resources for the VS, including interface, main control board and logical resources.Switch from the Admin-VS to the VS.Log in to the VS using Telnet or SSH.Restart or shut down the VS.A port mode determines the scope of resources assigned to a VS. If you do not specify a resource template for a VS, the VS uses the default resources.\nYou cannot modify or delete the port mode that has been configured for a VS.\nThis command can be used only on VSs that are independently managed but not on VSs that are uniformly managed. The PAF determines whether a VS is managed in independent or uniform mode."
}