{
    "PageTitle": "condition timer",
    "FuncDef": "The condition timer cron command configures the specific time when a maintenance assistant is executed.\nThe undo condition command deletes the trigger condition of a maintenance assistant.\nBy default, the scheduled task is executed at 04:30 every three days on and after the first day of each month.",
    "CLIs": [
        "condition timer <cron> <minutes> <hours> <daysOfMonth> <months> <daysOfWeek> [ <years> ]"
    ],
    "ParentView": [
        "Maintenance assistant task view"
    ],
    "ParaDef": [
        {
            "Parameters": "minutes",
            "Info": "Specifies the minutes in the assistant execution time.\nThe value is a string of characters in the format of cron time. The value is an integer ranging from 0 to 23."
        },
        {
            "Parameters": "hours",
            "Info": "Specifies the hours in the assistant execution time.\nThe value is a string of characters in the format of cron time. The value is an integer ranging from 0 to 23."
        },
        {
            "Parameters": "daysOfMonth",
            "Info": "Specifies the date in the assistant execution time.\nThe value is a string of characters in the format of cron time. The value ranges from 1 to 28, 29, 30, or 31 based on the specific month. The value and days-of-week are mutually exclusive. Either of them must be configured as *."
        },
        {
            "Parameters": "months",
            "Info": "Specifies the month in the assistant execution time.\nThe value is a string of characters in the format of cron time. The value is an integer ranging from 1 to 12."
        },
        {
            "Parameters": "daysOfWeek",
            "Info": "Specifies the weekday in the assistant execution time.\nThe value is a string of characters in the format of cron time. The value ranges from 0 to 7. Both 0 and 7 indicate Sunday. The values 1 to 6 indicate Monday to Saturday, respectively. The value and days-of-month are mutually exclusive. Either of them must be configured as *."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ops",
            "[~HUAWEI-ops] assistant _auto_diagnose",
            "[*HUAWEI-ops-assistant-task] condition timer cron 0 20 4 5 * 2012"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure the time when a maintenance assistant is executed, run the condition timer cron command.\nAfter an alarm is generated, an event occurs, or a timer expires, the maintenance assistant can be executed.\nTo trigger a maintenance assistant based on a timer, run this command. The time is expressed using the syntax in Unix or Linux cron program.\nThe commonly used time and date format (hh:mm:ss dd-mm-yyyy) can specify only one specific time value. The time in the cron format is more flexible and can represent a single moment, multiple moments, time range, or interval in a simplified manner. The value can contain 10 numbers (0 to 9) and four special characters (*, -, / and ,)."
}