{
    "PageTitle": "virtual-system (Management view)",
    "FuncDef": "The virtual-system command creates a virtual system (VS) or displays the view of a created VS.\nThe undo virtual-system command deletes a specified VS.\nThe default VS on a PS is Admin-VS.",
    "CLIs": [
        "virtual-system <vs-name> [ pvmb slot <slot-name1> [ <slot-name2> [ <slot-name3> [ <slot-name4> ] ] ] ]",
        "undo virtual-system <vs-name>"
    ],
    "ParentView": [
        "Management view"
    ],
    "ParaDef": [
        {
            "Parameters": "vs-name",
            "Info": "Specifies the name of a VS.\nThe value is a string of 1 to 31 case-insensitive characters. The string can be a combination of letters, numerals, underlines (_), or subtraction signs (-). The name must begin with an English letter, except \"all\", \"brief\", or \"verbose\"."
        },
        {
            "Parameters": "slot slot-name1",
            "Info": "Specifies the name of a slot resource to be assigned to a VS.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] admin",
            "[~HUAWEI-admin] virtual-system vs1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nEach PS has its own main boards (MBs) and line cards (LCs). To fully utilize hardware resources and share slot resources, a PS can be partitioned into several virtual systems (VSs). To create VSs on a physical system (PS), run the virtual-system command.\nConfiguration Impact\nAfter having been created on a PS, VSs can share the same system software but different service protocols, such as Border Gateway Protocol (BGP) and Open Shortest Path First (OSPF). Each VS has its own configuration management system and routing protocols.\nFollow-up Procedure\nA VS is a system with simulated software and hardware. VSs share all resources, such as MBs, LCs, and chassis, not physical and logical interfaces. VSs can be working properly only after they are assigned slot and interface resources.\nTo assign slot resources to a VS, run the virtual-system command.\nTo assign interface resources to a VS, run the assign interface command in the VS view.\nPrecautions\nAfter a VS is created, a device automatically creates Admin-VS. Admin-VS cannot be manually created or deleted.If Admin-VS is reset, all other VSs that are managed by Admin-VS will be automatically reset.The VS slot resources can be allocated only by The PS administrator. The same slot resources can be allocated to multiple VSs.The slot resources deleted from a VS are automatically allocated to The Admin-VS, and The Admin-VS takes over services carried using these slot resources.a newly created VS does not have any configuration. Therefore, you need to manually configure it. If you want to load another configuration file for The VS, ensure that The interfaces in The configuration file are in one-to-one mapping with The interfaces of The VS.If The specified virtual device is deleted using The undo virtual-system VS-name command, The configuration associated with The VS is also deleted.VS names are case-insensitive when being created. For example, if a VS named AAA has been created, you cannot create a VS named aaa. After a VS is created, the name of the VS is case-sensitive when being used."
}