{
    "PageTitle": "resource-template",
    "FuncDef": "The resource-template command creates or modifies a resource template.\nundo resource-template command deletes a resource template.\nIf no resource template is assigned, a VS uses the default resource template.",
    "CLIs": [
        "resource-template <template-name>",
        "undo resource-template <template-name>"
    ],
    "ParentView": [
        "Management view"
    ],
    "ParaDef": [
        {
            "Parameters": "template-name",
            "Info": "Specifies the name of a resource template.\nThe value is a string of 1 to 31 case-insensitive characters. The string can contain letters, digits, underscores (_), and hyphens (-). The resource template name must begin with letters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] admin",
            "[~HUAWEI-admin] resource-template temp_Test",
            "[*HUAWEI-admin-template:temp_Test] resource u4route upper-limit 10000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nLogical resources include u4route, m4route, u6route, m6route, vpn-instance, mcast, mpls and vlan. You can assign logical resources using either of the following methods:\nRun the resource command in the VS view to assign a logical resource to a VS each time.Use a resource template to assign multiple logical resources to a VS in a batch. To create or modify a resource template, run the resource-template command.\n\nFollow-up Procedure\nAfter you create a resource template, run the resource command in the resource template view to configure the resource template.\nAfter the configuration is complete, run the assign resource-template command to specify the resource template for the VS.\nPrecautions\nThis command is supported only on the admin VS.\nAfter you specify a resource template for a VS, modify resource items in the template. The modification takes effect on the VS only after you run the assign resource-template command to specify the template for the VS."
}