{
    "PageTitle": "reset virtual-system",
    "FuncDef": "The reset virtual-system command restarts a virtual system (VS).",
    "CLIs": [
        "reset virtual-system <vsName>"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "vsName",
            "Info": "Specifies the name of a VS.\nThe value is a string of 1 to 31 case-insensitive characters. The string can contain letters, digits, underscores (_), and hyphens (-). The VS name must begin with letters except \"all,\" \"brief,\" or \"verbose.\""
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset virtual-system vs1",
            "Warning: Current configuration of the virtual system will be saved to the next startup saved-configuration file. Continue? [Y/N]:y",
            "Now saving the current configuration.",
            "Save the configuration successfully.",
            "The virtual system will reset. Continue? [Y/N]:y"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo update VS configurations or diagnose faults, run the reset virtual-system command to restart the VS.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nYou can restart only a VS, except the Admin-VS.You can restart a VS only on the admin VS.\nDuring a VS restart, you cannot allocate or reclaim the VS's hardware resources (main boards or interfaces) or logical resources, but you can delete the VS.If you do not save the configuration to the startup configuration file before restarting a VS, restarting the VS causes the configuration to be lost.If a master/slave main control board switchover is performed during a VS restart, the VS may enter the stop status after the switchover. To resolve this problem, restart the VS once again.\nThe following cases occur during a VS restart:\nAll interfaces of the VS switch to the Down state, and all services are interrupted.All user connections of the VS are disconnected. The users who have switched from the Admin-VS to the VS are switched back to the Admin-VS. The users who have logged in to the VS using Telnet or SSH are disconnected.\nThe following data remains unchanged during a VS restart:\nResource configuration data of the VS, including interfaces, PVMBs, MBs, and logical resourcesService configuration data saved for the VS\nAfter a VS restart is complete:\nUsers can log in to the VS again.When other conditions do not change, all interfaces of the VS are restored to the status before the restart, and all services are restored to the original state."
}