{
    "PageTitle": "shutdown (VS resource template view)",
    "FuncDef": "The shutdown command shuts down a virtual system (VS).\nThe undo shutdown command starts the VS again.\nBy default, a VS is in the running state after being created.",
    "CLIs": [
        "shutdown",
        "undo shutdown"
    ],
    "ParentView": [
        "VS resource template view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] admin",
            "[~HUAWEI-admin] resource-template temp_Test",
            "[*HUAWEI-admin-template:temp_Test] port-mode port",
            "[*HUAWEI-admin-template:temp_Test] shutdown",
            "Warning: All the services of this virtual system will be stopped. Continue? [Y/N]:Y"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBefore you diagnose VS faults or stop VS services, run the shutdown command to shut down a VS.\nPrerequisites\nA VS must be running, and an interface has been assigned to the VS.\nConfiguration Impact\nAfter you run the shutdown command to shut down a VS, the following situations occur:\nAll services running on the VS are interrupted, all interfaces of the VS switch to the Down state, and all user connections of the VS are disconnected.All unsaved service configuration data on the VS is lost, but the resource configuration and saved service configuration data remain unchanged.After you run the undo shutdown command to start the VS again, all interfaces and services are restored to the status before the shutdown.\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nThe shutdown command applies only to a VS except the Admin-VS.\nYou can run this command only on the admin VS.\nWhen a VS is shut down, you cannot allocate or reclaim the VS's hardware resources (MBs or interfaces) or logical resources, but you can delete the VS.\nIf you do not save the configuration to the startup configuration file before shutting down a VS, starting the VS again causes the configuration to be lost."
}