{
    "PageTitle": "remote-attestation ssl certificate load",
    "FuncDef": "The remote-attestation ssl certificate load command configures local SSL authentication parameters.\nThe undo remote-attestation ssl certificate load command deletes local SSL authentication parameters.\nBy default, no local SSL authentication parameters are configured.",
    "CLIs": [
        "remote-attestation ssl certificate load pem-cert <certfile> key-pair rsa <keyfile> auth-code cipher <authcode>",
        "undo remote-attestation ssl certificate load [ pem-cert <certfile> ] [ key-pair rsa <keyfile> ] [ auth-code cipher <authcode> ]"
    ],
    "ParentView": [
        "Trust environment management"
    ],
    "ParaDef": [
        {
            "Parameters": "key-pair",
            "Info": "Indicates a key pair type.\n-"
        },
        {
            "Parameters": "rsa",
            "Info": "Indicates that the key pair type is RSA.\n-"
        },
        {
            "Parameters": "keyfile",
            "Info": "Specifies a key pair file.\nThe value is a string of 1 to 64 case-sensitive characters. It cannot contain spaces. If spaces are used, the string must start and end with double quotation marks (\").\nThe name of this file must be the same as that of the file to be uploaded."
        },
        {
            "Parameters": "auth-code",
            "Info": "Specifies a verification code.\n-"
        },
        {
            "Parameters": "cipher authcode",
            "Info": "Specifies a verification code for a key file.\nThe value is a string of case-sensitive characters, which can be letters or digits. The value is a string of 1 - 31 characters in plain text or a string of 32 - 168 characters in cipher text.If spaces are used, the string must start and end with double quotation marks (\")."
        },
        {
            "Parameters": "pem-cert certfile",
            "Info": "Specifies the name of a PEM digital certificate file.\nThe value is a string of 1 to 63 case-sensitive characters. It cannot contain spaces. If spaces are used, the string must start and end with double quotation marks (\").\nThe name of this file must be the same as that of the file to be uploaded."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] trustem",
            "[*HUAWEI-trustem] remote-attestation ssl certificate load pem-cert 1_servercert_pem_rsa.pem key-pair rsa 1_serverkey_pem_rsa.pem auth-code cipher 123456"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe remote attestation function uses the SSL security mechanism suite, including:\nData transmission confidentiality: The symmetric key algorithm is used to encrypt data during data transmission.Message integrity verification: The MAC algorithm is used to check the integrity of messages during message transmission.Identity verification mechanism: The digital signature method is used to verify identities based on certificates.\nA PEM digital certificate is issued by the certificate authority (CA) and is used to describe the identity of a digital certificate user. The PEM digital certificate is used to establish a trust relationship with the peer end in a connection with high security requirements."
}