{
    "PageTitle": "keepalive (dot1x template view)",
    "FuncDef": "The keepalive command sets the number of retransmission attempts and timeout period of the handshake packets exchanged between the EAP client and server.\nThe undo keepalive command restores the default setting.\nBy default, the number of retransmission attempts is 0, which means no handshake mechanism is used, and the timeout period of handshake packets is 20 seconds.",
    "CLIs": [
        "keepalive { retransmit <times> | interval <time> } *",
        "undo keepalive"
    ],
    "ParentView": [
        "802.1X template view"
    ],
    "ParaDef": [
        {
            "Parameters": "retransmit times",
            "Info": "Specifies the number of retransmission attempts.\nThe value is an integer that ranges from 0 to 10. If the value is 0, it indicates that no handshake packets are sent."
        },
        {
            "Parameters": "interval time",
            "Info": "Specifies the timeout period.\nThe value is an integer that ranges from 1 to 1800, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dot1x-template 1",
            "[*HUAWEI-dot1x-template-1] keepalive retransmit 4 interval 50"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the EAPoL-Logoff packet is lost during the transmission, the client, however, may consider itself offline whereas the server still considers the client online and performs accounting on the client. To prevent such an exception, the handshake mechanism is required between the server and client. In such a case, the PC of the client is still working so that the PC can send ARP packets. The server cannot discover that the client is offline. As defined in 802.1X, the server can initiate the re-authentication by sending EAP-Request/Identity packets at any time; the client must respond. In this case, the NE40E can handshake with the client.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}