{
    "PageTitle": "link-down offline delay",
    "FuncDef": "The link-down offline delay command configures a delay for user logout after an access interface goes Down.\nThe undo link-down offline delay command deletes the delay for user logout after an access interface goes Down.\nBy default, no delay is configured for user logout after an access interface goes Down.",
    "CLIs": [
        "link-down offline delay { <delay-value> | unlimited }",
        "undo link-down offline delay"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "delay-value",
            "Info": "Specifies a delay for user logout after an access interface goes Down.\nThe value is an integer ranging from 1 to 600, in seconds."
        },
        {
            "Parameters": "unlimited",
            "Info": "Indicates that user logout is not configured.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] link-down offline delay 600"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo prevent user logout due to link flapping after users pass 802.1X authentication, run the link-down offline delay command to configure a delay for user logout after an access interface goes Down.\nConfiguration Impact\nDuring this period, the system detects the interface status. If the interface becomes Up, users will remain online. If the interface remains Down, users will be logged out.\nPrecautions\nIf the delay for user logout after an access interface goes Down configured using this command is greater than the detection threshold or reauthentication threshold, the user goes offline because of the detection failure or reauthentication failure. If the delay for user logout after an access interface goes Down configured using this command is less than the detection threshold, whether the user goes offline depends on the interface status after the delay expires.If the delay for user logout after an access interface goes Down configured using this command does not expire and an active/standby switchover occurs, the delay recounts after the standby board is switched to be the active board.If the EAP reauthentication threshold configured using the command is less than the EAP detection threshold and reauthentication is performed before the detection period reaches, the detection is implemented by exchanging reauthentication packets without exchanging detection packets.\nThis command is supported only on the admin VS."
}