{
    "PageTitle": "reset dot1x statistics",
    "FuncDef": "The reset dot1x statistics command clears 802.1X statistics.",
    "CLIs": [
        "reset dot1x statistics slot <slot-num>",
        "reset dot1x statistics interface { <interface-name> | <interface-type> <interface-num> }"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "interface interface-num",
            "Info": "Specifies the type of an interface board based on which 802.1X statistics are cleared.\ninterface-number is a string data type. The string length range is from 1 to 32 characters."
        },
        {
            "Parameters": "interface interface-name",
            "Info": "Specifies the name of an interface board based on which 802.1X statistics are cleared.\ninterface-name is a string data type. The string length range is from 1 to 49 characters."
        },
        {
            "Parameters": "interface interface-type",
            "Info": "Specifies the type of an interface board based on which 802.1X statistics are cleared.\ninterface-type is a string data type. The string length range is from 1 to 32 characters."
        },
        {
            "Parameters": "slot slot-num",
            "Info": "Specifies the slot number of an interface board based on which 802.1X statistics are cleared.\nThe value is an integer ranging from 1 to 16."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset dot1x statistics slot 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\n802.1X authentication statistics include statistics about authentication successes and failures and packets sent and received on an interface. To clear 802.1X statistics, run the reset dot1x statistics command. After services are re-deployed, you need to clear existing 802.1X statistics so that the system starts to collect 802.1X statistics from zero. Additionally, after measures are taken to rectify 802.1X faults, you can run this command to clear existing statistics. Then, the system starts to collect 802.1X statistics from zero. After a period of time elapses, you can run the display dot1x statistics command to view 802.1X statistics and determine whether faults are rectified. Statistics that can be cleared using the reset dot1x statistics command include: total number of packets sent to terminals (including EAP-Request/Identity, EAP-Request/SIM/Challenge, EAP-Request/TLS, EAP-Success, and EAP-Failure packets) and total number of packets sent from terminals (including EAP-Response/Identity, EAP-Response/SIM/Challenge, EAP-Response/TLS, EAPOL-Start, EAPOL-Logoff, and EAPOL-Key packets)\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}