{
    "PageTitle": "ipv6 address-policy",
    "FuncDef": "The ipv6 address-policy command configures the policies for selecting source and destination addresses.\nThe undo ipv6 address-policy command deletes the policies for selecting source and destination addresses.\nBy default, only default address selection policy entries are configured. These entries are prefixed with ::1, ::, 2002::, FC00::, and ::ffff:0.0.0.0.",
    "CLIs": [
        "ipv6 address-policy [ vpn-instance <vpn-instance-name> ] <ipv6-address> <prefix-length> <precedence> <label>",
        "undo ipv6 address-policy [ vpn-instance <vpn-instance-name> ] <ipv6-address> <prefix-length>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "ipv6-address",
            "Info": "Specifies an IPv6 address.\nThe prefix is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "prefix-length",
            "Info": "Specifies the prefix length of an IPv6 address.\nThe value is an integer that ranges from 0 to 128."
        },
        {
            "Parameters": "precedence",
            "Info": "Specifies the priority of an IPv6 address when the address is the destination address.\nThe value is an integer that ranges from 0 to 4294967295."
        },
        {
            "Parameters": "label",
            "Info": "Specifies the priority of an IPv6 address when the address is the source address.\nThe value is an integer that ranges from 0 to 4294967295."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 address-policy 2001:db8::1 64 15 20"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nSource/destination addresses used for sending out can be manipulated by applying policy entries into the policy table. The ipv6 address-policy command allows the user to configure source/destination address selection policy for an address/prefix. The policy table allows the user to give preference to an address/prefix in comparison to other available addresses/prefixes during the source/destination address selection.\nConfiguration Impact\nThe label parameter can be used to determine the result of source address selection. The address whose label value is the same as the label value of the destination address is selected preferably as the source address.The destination address is selected based on both the label and precedence parameters. If label values of the candidate addresses are the same, the address whose precedence value is the largest is selected preferably as the destination address.\n\nPrecautions\nThe default policy entries are those whose prefixes are ::1, ::, 2002::, FC00::, and :ffff:0.0.0.0.\nDefault policy entries cannot be configured by using a command."
}