{
    "PageTitle": "ipv6 extension-header (system view)",
    "FuncDef": "The ipv6 extension-header option-code command configures a filtering policy for the IPv6 Hop-by-Hop Options or Destination Options header.\nThe undo ipv6 extension-header option-code command restores the default configuration for the IPv6 Hop-by-Hop Options or Destination Options header.\nThe ipv6 extension-header routing routing-type command configures a filtering policy for the IPv6 Routing header.\nThe undo ipv6 extension-header routing routing-type command restores the default configuration for the IPv6 Routing header.\nThe ipv6 extension-header command configures a filtering policy for the IPv6 Fragment, Encapsulating Security Payload, or Authentication header.\nThe undo ipv6 extension-header command restores the default configuration for the IPv6 Fragment, Encapsulating Security Payload, or Authentication header.\nBy default, no filtering policy is configured for IPv6 extension headers.",
    "CLIs": [
        "ipv6 extension-header { hop-by-hop | destination } option-code { all | <optcodevalue> } { deny | permit }",
        "ipv6 extension-header routing routing-type { all | <routing-number> } { deny | permit }",
        "ipv6 extension-header { fragment | esp | ah } { deny | permit }",
        "undo ipv6 extension-header { hop-by-hop | destination } option-code { all | <optcodevalue> } [ deny | permit ]",
        "undo ipv6 extension-header routing routing-type { all | <routing-number> } [ deny | permit ]",
        "undo ipv6 extension-header { fragment | esp | ah } [ deny | permit ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "hop-by-hop",
            "Info": "Indicates the IPv6 Hop-by-Hop Options header.\n-"
        },
        {
            "Parameters": "destination",
            "Info": "Indicates the IPv6 Destination Options header.\n-"
        },
        {
            "Parameters": "option-code",
            "Info": "Indicates all options or a specified one for an IPv6 extension header.\n-"
        },
        {
            "Parameters": "all",
            "Info": "Indicates all options for an IPv6 extension header.\n-"
        },
        {
            "Parameters": "optcodevalue",
            "Info": "Specifies the type value of an option for an IPv6 extension header.\nThe value is an integer ranging from 0 to 255."
        },
        {
            "Parameters": "deny",
            "Info": "Sets a filtering policy to deny for an IPv6 extension header.\n-"
        },
        {
            "Parameters": "permit",
            "Info": "Sets a filtering policy to permit for an IPv6 extension header.\n-"
        },
        {
            "Parameters": "routing",
            "Info": "Indicates the IPv6 Routing header.\n-"
        },
        {
            "Parameters": "routing-type",
            "Info": "Indicates all routing types or a specified one for the IPv6 Routing header.\n-"
        },
        {
            "Parameters": "routing-number",
            "Info": "Specifies the value of a routing type for the IPv6 Routing header.\nThe value is an integer ranging from 0 to 255."
        },
        {
            "Parameters": "fragment",
            "Info": "Indicates the IPv6 Fragment header.\n-"
        },
        {
            "Parameters": "esp",
            "Info": "Indicates the IPv6 Encapsulation Security Payload header.\n-"
        },
        {
            "Parameters": "ah",
            "Info": "Indicates the IPv6 Authentication header.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 extension-header destination option-code all deny"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 extension-header hop-by-hop option-code 5 deny"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 extension-header routing routing-type 4 permit"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 extension-header ah deny"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo prevent the system from being attacked by specific packets, run the ipv6 extension-header command to configure a filtering policy (deny or permit) for an extension header in the packets. The methods of configuring filtering policies for different types of extended headers are as follows:\nIf the extension header is Hop-by-Hop or Destination Options, you can configure a filtering policy for all options or a specified one in the header.If the extension header is Routing, you can configure a filtering policy for all routing types or a specified one in the header.If the extension header is Fragment, Encapsulation Security Payload, or Authentication, you can configure a filtering policy directly for the header because it carries neither options nor routing types.\n\nPrecautions\nIf the extension header is Hop-by-Hop Options, Destination Options, or Routing, you can configure multiple filtering policies. A filtering policy configured for a specified option or routing type takes precedence over that for all options or routing types.A filtering policy configured in the interface view takes precedence over that in the system view."
}