{
    "PageTitle": "ipv6 address link-local cga",
    "FuncDef": "The ipv6 address link-local cga command configures a CGA IPv6 link-local address for an interface.\nThe undo ipv6 address link-local cga command deletes the CGA IPv6 link-local address configured for an interface.\nBy default, no CGA IPv6 link-local address is configured for an interface.",
    "CLIs": [
        "ipv6 address <ipv6-address> link-local cga",
        "undo ipv6 address <ipv6-address> link-local cga"
    ],
    "ParentView": [
        "PW-VE interface view",
        "PW-VE sub-interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "GE electrical interface view",
        "Port extension interface view",
        "Serial interface view",
        "Eth-Trunk sub-interface view",
        "400GE interface view",
        "50GE sub-interface view",
        "10GE interface view",
        "MP-group interface view",
        "GE sub-interface view",
        "VBDIF interface view",
        "VE sub-interface view",
        "GE interface view",
        "25GE sub-interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "25GE interface view",
        "100ge sub-interface view",
        "40GE sub-interface view",
        "Eth-Trunk interface view",
        "10GE sub-interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv6-address",
            "Info": "Specifies the IPv6 address.\nThe address is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] rsa key-pair label huawei modulus 2048",
            "[*HUAWEI] interface GigabitEthernet 1/0/1",
            "[*HUAWEI-GigabitEthernet1/0/1] ipv6 enable",
            "[*HUAWEI-GigabitEthernet1/0/1] ipv6 security rsakey-pair huawei",
            "[*HUAWEI-GigabitEthernet1/0/1] ipv6 security modifier sec-level 1",
            "[*HUAWEI-GigabitEthernet1/0/1] ipv6 address fe80::1 link-local cga"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nLink-local addresses are used for the communications between link-local nodes in either the neighbor discovery or the stateless auto-configuration process. The packets with link-local addresses being the source or destination addresses are not forwarded to other links, that is, link-local addresses are valid only on local links.\nYou can also run the ipv6 address link-local command to manually configure a link-local address for an interface.\nTo enable IPv6 SEND to protect ND messages that carry CGA and RSA options, you need to configure a CGA IPv6 address on the interface. Running the ipv6 address link-local command with the keyword cga generates a CGA IPv6 link-local address.\nPrerequisites\nBefore running the ipv6 address link-local command to configure a link-local address for an interface, you need to run the ipv6 enable command in the interface view to enable the IPv6 function on the interface.\nBefore configuring a CGA link-local address, you must complete the following configurations:\nRun the rsa key-pair label command in the system view to create an RSA key pair.Run the ipv6 security rsakey-pair command in the interface view to bind the created RSA key pair to the interface.Run the ipv6 security modifier command in the interface view to configure a modifier value and a security level for the CGA address.\n\nConfiguration Impact\nIf an automatically allocated link-local address has already been configured on an interface, the ipv6 address link-local configuration overrides the existing link-local address.\nPrecautions\nTry to avoid changing link-local addresses.\nYou can configure multiple IPv6 addresses but only one link-local address for an interface.\nThe following IPv6 addresses cannot be configured for an interface:\nLoopback address (::1/128)Unspecified address (::/128)Multicast addressAnycast address\nIPv4-mapped IPv6 addresses (0:0:0:0:0:FFFF:IPv4-address) can be configured on public networks but not on VPNs.\nAfter the undo rsa key-pair label label-name command is run in the system view, the IPv6 link-local address of the CGA type of the RSA key corresponding to each interface will be deleted."
}