{
    "PageTitle": "using (E1/CE1 interface view)",
    "FuncDef": "The using command configures a working mode for an E1 interface.\nThe undo using command restores the default setting.\nBy default, an E1 interface works in channelized mode.",
    "CLIs": [
        "using e1",
        "using ce1",
        "undo using"
    ],
    "ParentView": [
        "E1/CE1 interface view",
        "E1 interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "ce1",
            "Info": "Specifies the channelized mode or unchannelized mode.\n-"
        },
        {
            "Parameters": "e1",
            "Info": "Specifies the clear channel mode.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] controller e1 1/0/0",
            "[~HUAWEI-E1 1/0/0] using e1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAn E1 interface can work in either of the following modes:\nChannelized mode or unchannelized mode: An E1 interface is divided into 32 timeslots. Timeslots 1 to 31 can be bundled into several channel-sets, with each functioning as a synchronous serial interface working at N x 64kbit/s.Clear channel mode: An E1 interface is not divided into timeslots and does not support the channel-set command. Instead, it is used as a 2.048 Mbit/s serial interface.\nThe using command allows you to configure the working mode of an E1 interface.\n\nFollow-up Procedure\nIf an E1 interface works in channelized mode or unchannelized mode, run the channel-set command to bundle the timeslots of the E1 interface into several channel-sets.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nBefore changing the working mode of an E1 interface, note the following:\nTo switch an E1 interface from the channelized mode or unchannelized mode to the clear channel mode, delete the channelized configurations and run the using e1 command.To switch an E1 interface from the clear channel mode to the channelized mode or unchannelized mode, delete the clear channel configurations and configurations under the synchronous serial interface (without the need to delete the synchronous serial interface), and run the using ce1 or undo using command."
}