{
    "PageTitle": "channel-set timeslot-list (E1 interface view)",
    "FuncDef": "The channel-set command bundles timeslots of a CE1 interface into a channel-set.\nThe undo channel-set command unbundles the timeslots of a CE1 interface from a channel-set.\nBy default, no timeslots of a CE1 interface are bundled into a channel-set.",
    "CLIs": [
        "channel-set <set-number> timeslot-list { <slot-list> [ ts0 ] | ts0 }",
        "undo channel-set [ <set-number> ]"
    ],
    "ParentView": [
        "E1 interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "set-number",
            "Info": "Specifies the number of a channel-set that is formed by bundling timeslots of a CE1 interface.\nThe value is an integer ranging from 0 to 30."
        },
        {
            "Parameters": "slot-list",
            "Info": "Specifies the number or range of the timeslots to be bundled.\nYou can specify either a single timeslot or a range of timeslots. A comma (,) is used to separate timeslots, and a hyphen (-) is used to specify a timeslot range.\nThe value is an integer ranging from 1 to 31."
        },
        {
            "Parameters": "ts0",
            "Info": "Specifies timeslot 0 to be bundled into a channel-set.The channel-set <set-number> timeslot-list <slotbitmask> ts0 command bundles timeslot 0 and the timeslots specified by <slotbitmask> into a channel-set.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] controller e1 1/0/0",
            "[~HUAWEI-E1 1/0/0] using ce1",
            "[*HUAWEI-E1 1/0/0] channel-set 1 timeslot-list 1,10-15,18"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA CE1 interface works in either of the following mode:\nChannelized mode: A CE1 interface is divided into 32 timeslots physically. Timeslots 1 to 31 can be bundled into several channel-sets. Each channel-set functions as an interface whose logical features are the same as a synchronous serial interface. The interface serial command allows you to enter the view of the interface that is formed by bundling timeslots.Clear channel mode: A CE1 interface is not divided into timeslots and does not support the channel-set command. Instead, it is used as a 2.048 Mbit/s serial interface.\n\nPrerequisites\nA CE1 interface has been configured to work in channelized mode using the using ce1 command.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}