{
    "PageTitle": "peer graceful-restart static-timer (BGP IPv4 SR-Policy address family view)",
    "FuncDef": "The peer graceful-restart static-timer command sets the maximum time for the local end to wait for GR recovery of the peer.\nThe undo peer graceful-restart static-timer command deletes the configured maximum duration.\nBy default, the maximum time for the local end to wait for GR recovery of the peer is 0, in seconds.",
    "CLIs": [
        "peer <ipv4-address> graceful-restart static-timer <restart-time>",
        "undo peer <ipv4-address> graceful-restart static-timer <restart-time>",
        "undo peer <ipv4-address> graceful-restart static-timer"
    ],
    "ParentView": [
        "BGP IPv4 SR-Policy address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv4-address",
            "Info": "Specifies the IPv4 address of a peer.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "restart-time",
            "Info": "Specifies the maximum time for the local end to wait for GR recovery of the peer.\nThe value is an integer ranging from 3600 to 86400, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 10.1.1.1 as-number 200",
            "[*HUAWEI-bgp] ipv4-family sr-policy",
            "[*HUAWEI-bgp-af-ipv4-srpolicy] peer 10.1.1.1 enable",
            "[*HUAWEI-bgp-af-ipv4-srpolicy] peer 10.1.1.1 graceful-restart static-timer 4000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nEven if you run the graceful-restart timer restart time command in the BGP view, the maximum wait time can be changed to 3600s at most. If some BGP sessions take more than 3600s to re-establish due to poor network conditions, you can run the peer graceful-restart static-timer command to set a proper wait time for a specified peer.\nConfiguration Impact\nIf the graceful-restart timer restart command is run in the BGP view and the peer graceful-restart static-timer command is run in any of its views, the latter command takes precedence over the former command.\nPrecautions\nGR has been enabled using the graceful-restart command."
}