{
    "PageTitle": "conflict auto-recycle(IPv6 prefix pool view)",
    "FuncDef": "The conflict auto-recycle command sets the interval at which conflicting addresses are automatically recycled.\nThe undo conflict auto-recycle command restores the default interval at which conflicting addresses are automatically recycled.\nBy default, conflicting addresses are automatically recycled at an interval of 30 minutes.",
    "CLIs": [
        "conflict auto-recycle interval <interval-time>",
        "undo conflict auto-recycle [ interval <interval-time> ]"
    ],
    "ParentView": [
        "IPv6 prefix pool view"
    ],
    "ParaDef": [
        {
            "Parameters": "interval interval-time",
            "Info": "Interval at which conflicting addresses are automatically recycled.\nThe value is an integer ranging from 30 to 1440 and 0, in minutes. By default, it is 30. If the value is 0, the function of conflicting addresses automatic recycling is disabled."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 prefix huawei local",
            "[~HUAWEI-ipv6-prefix-huawei] conflict auto-recycle interval 0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a prefix is repeatedly assigned to different users because the device receives a decline packet or an internal error occurs, the device sets the state of this prefix to conflicting. Prefixes in the conflicting state will not be assigned to other users. If automatic recycling of conflicting prefixes is disabled, you can only recycle conflicting prefixes by running the reset conflict-ip-address command.\nConfiguration Impact\nIf interval-time is set to 0, automatic recycling is disabled. Conflicting prefixes will be isolated and must be manually recycled.\nIf interval-time is set to a non-zero value, when the prefix pool usage exceeds the alarm threshold and the prefix conflicting duration exceeds the value of interval-time, the NE40E automatically recycles conflicting prefixes for assignment.\nPrecautions\nThis command is supported only on the admin VS.\nThis command is valid only to the local prefix pool."
}