{
    "PageTitle": "dhcpv6-server send-solicit-speed",
    "FuncDef": "The dhcpv6-server send-solicit-speed command configures the rate at which Solicit packets are sent to the DHCPv6 server.\nThe undo dhcpv6-server send-solicit-speed command restores the default configuration.\nBy default, the rate at which Solicit packets are sent to the DHCPv6 server is not specified.",
    "CLIs": [
        "dhcpv6-server { <ipv6-address> [ vpn-instance <vpn-instance> ] | interface { <ifname> | <iftype> <ifnum> } } send-solicit-speed <packet-number> <time-value>",
        "undo dhcpv6-server { <ipv6-address> [ vpn-instance <vpn-instance> ] | interface { <ifname> | <iftype> <ifnum> } } [ send-solicit-speed <packet-number> <time-value> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv6-address",
            "Info": "Specifies the IPv6 address of the DHCPv6 server.\nThe address is a 32-digit hexadecimal number."
        },
        {
            "Parameters": "vpn-instance vpn-instance",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "interface ifnum",
            "Info": "Specifies the number of the outbound interface for sending DHCPv6 packets.\n-"
        },
        {
            "Parameters": "interface ifname",
            "Info": "Specifies the name of the outbound interface for sending DHCPv6 packets.\n-"
        },
        {
            "Parameters": "interface iftype",
            "Info": "Specifies the type of the outbound interface for sending DHCPv6 packets.\n-"
        },
        {
            "Parameters": "packet-number",
            "Info": "Specifies the number of Solicit packets that can be sent within a period.\nThe value is an integer ranging from 1 to 65535."
        },
        {
            "Parameters": "time-value",
            "Info": "Specifies a period of time.\nThe value is an integer ranging from 1 to 10, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dhcpv6-server group huawei",
            "[~HUAWEI-dhcpv6-server-group-huawei] dhcpv6-server destination 111:1111::1",
            "[~HUAWEI-dhcpv6-server-group-huawei] dhcpv6-server 111:1111::1 send-solicit-speed 100 3"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo protect the remote DHCPv6 server against attacks, run the dhcpv6-server send-solicit-speed command to limit the rate at which Solicit packets are sent to the DHCPv6 server.\nPrerequisites\nThe remote DHCPv6 server has been configured in the DHCPv6 server group.\nConfiguration Impact\nThe more Solicit packets are sent to the DHCPv6 server within a specified period, the higher the user access rate.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}