{
    "PageTitle": "dhcpv6 rebind no-user action reply",
    "FuncDef": "The dhcpv6 rebind no-user action reply command is used to configure the device to reply with a Reply packet if no user entry exists after a dhcpv6 rebind packet is received.\nThe undo dhcpv6 rebind no-user action reply command is used to disable the device from sending Reply packets if no user entry exists after the dhcpv6 rebind packet is received.\nBy default, after a dhcpv6 rebind packet is received, if no user entry exists on the device, the device discards the dhcpv6 rebind packet and does not process the packet.",
    "CLIs": [
        "dhcpv6 rebind no-user action reply",
        "undo dhcpv6 rebind no-user action reply"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dhcpv6 rebind no-user action reply"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe dhcpv6 rebind no-user action reply command is used to solve the problem that users on the BNG are offline but still online on the CPE in some abnormal scenarios. A user is cut out on the BNG or the metro is faulty. As a result, the user goes online and offline on the BNG. In this case, the CPE cannot detect that the user on the BNG has gone offline. After the timer expires, the CPE still sends renew/rebind packets. After the BNG receives the renew/rebind packet and configures the dhcpv6 rebind no-user action reply command after receiving the renew/rebind packet, the BNG immediately responds with a reply packet to instruct the CPE to re-dial up to apply for an IP address.\nPrecautions\nIn the scenario where cold backup is configured on physical devices: If the dhcpv6 rebind no-user action reply command is run, both the master and backup devices can respond with a Reply message upon receipt of a Rebind message. This may cause abnormal user logouts. Therefore, running this command in this scenario is not recommended.\nIn the scenario where cold backup is configured between vBRAS-CPs or vBRAS-UPs: The backup vBRAS-CP or vBRAS-UP does not process received Rebind messages. Users go online from only the master vBRAS-CP or vBRAS-UP. Therefore, running the dhcpv6 rebind no-user action reply command does not affect services."
}