{
    "PageTitle": "dhcpv6 option-37 rebuild self-define send-to-server",
    "FuncDef": "The dhcpv6 option-37 rebuild self-define send-to-server command enables a device to insert the self-defined Option 37 attribute into a Relay-forward message to be sent to the DHCPv6 server.\nThe undo dhcpv6 option-37 rebuild self-define send-to-server command disables the function.\nBy default, a device is disabled from inserting the Option 37 attribute into a Relay-forward message to be sent to the DHCPv6 server based on the self-defined OSP format.",
    "CLIs": [
        "dhcpv6 option-37 rebuild self-define <self-define-value> send-to-server",
        "undo dhcpv6 option-37 rebuild self-define <self-define-value> send-to-server"
    ],
    "ParentView": [
        "BAS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "self-define-value",
            "Info": "Specifies a self-defined Option 37 attribute (remote ID), which identifies a remote host.\nThe value is a string of 1 to 64 characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Eth-Trunk 100.21",
            "[*HUAWEI-Eth-Trunk100.21] commit",
            "[~HUAWEI-Eth-Trunk100.21] bas",
            "[~HUAWEI-Eth-Trunk100.21-bas] dhcpv6 option-37 rebuild self-define HUAWEI send-to-server"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen IPv6 addresses are assigned from a remote IPv6 address pool, the DHCPv6 server identifies a carrier based on the Option 37 attribute carried in a Relay-forward message and assigns a carrier-specific IPv6 address to the user. By default, a device is disabled from inserting the self-defined Option 37 attribute which carries information to identify carriers into a Relay-forward message to be sent to the DHCP server. To enable the device to insert the self-defined Option 37 attribute into a Relay-forward message to be sent to the DHCPv6 server, run the dhcpv6 option-37 rebuild self-define send-to-server command.\nConfiguration Impact\nThe dhcpv6 option-37 rebuild self-define send-to-server command takes effect in real time. The contents of the Option 37 attribute inserted into the Relay-forward messages sent to the DHCPv6 server are different before and after the configurations are added or deleted.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nThe dhcpv6 option-37 rebuild self-define  send-to-server command is configured in the BAS interface view, whereas the dhcpv6 relay option-insert remote-id and dhcpv6 relay option-insert mode type1 commands are configured in the interface view. If the commands configured in the two views are both run, the command configured in the BAS interface view takes effect."
}