{
    "PageTitle": "dhcpv6 conflict-ip-address offline user",
    "FuncDef": "The dhcpv6 conflict-ip-address offline user command configures the device to log out an online user and deny access of a new user if it detects that the IPv6 address assigned to the new user from a DHCPv6 remote address pool, an IPv6 prefix pool, or by the RADIUS server is the same as the IPv6 address of the online user.\nThe undo dhcpv6 conflict-ip-address offline user command restores the default configuration.\nBy default, if the device detects that the IPv6 address assigned to a new user from a DHCPv6 remote address pool, an IPv6 prefix pool, or by the RADIUS server is the same as the IPv6 address of an online user, the device sends a DHCPv6 Decline message to the DHCPv6 server. The online user is still online, but the new user fails to log in.",
    "CLIs": [
        "dhcpv6 conflict-ip-address offline user [ include framed-ipv6 ]",
        "undo dhcpv6 conflict-ip-address offline user [ include framed-ipv6 ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "include framed-ipv6",
            "Info": "Configures the device to detect IPv6 addresses assigned from a DHCPv6 remote address pool, an IPv6 prefix pool, and by the RADIUS server.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dhcpv6 conflict-ip-address offline user include framed-ipv6"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo implement authentication, authorization, and accounting for users separately, users must use different IPv6 addresses to go online. This requires the device to detect whether the IPv6 address assigned to a new user conflicts with that of an online user. By default, if the device detects that the IPv6 address assigned to a new user is the same as the IPv6 address of an online user, it sends a DHCPv6 Decline message to the DHCPv6 server. Then the new user cannot go online, but the online user is not affected.\nTo allow the device to log out the online user and trigger the new user to attempt to go online again, run the dhcpv6 conflict-ip-address offline user command.\nIf include frame-ip is not configured, the device only detects whether the IPv6 address assigned to a user from a DHCPv6 remote address pool and an IPv6 prefix pool conflicts with that of another user.If include frame-ip is configured, the device detects whether the IPv6 address assigned to a user from a DHCPv6 remote address pool, an IPv6 prefix pool, or by the RADIUS server conflicts with that of another user.\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}