{
    "PageTitle": "dhcpv6-follow-ipv6cp wait-delay",
    "FuncDef": "The dhcpv6-follow-ipv6cp wait-delay command configures a timeout period for waiting for a DHCPv6 connection request from a PPPoE user on the device.\nThe undo dhcpv6-follow-ipv6cp wait-delay command restores the default timeout period for waiting for a DHCPv6 connection request from a PPPoE user on the device.\nBy default, the timeout period for waiting for a DHCPv6 connection request from a PPPoE user is 60 seconds.",
    "CLIs": [
        "dhcpv6-follow-ipv6cp wait-delay { <time-value> | infinity }",
        "undo dhcpv6-follow-ipv6cp wait-delay"
    ],
    "ParentView": [
        "AAA domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "time-value",
            "Info": "Specifies the timeout period for waiting for a DHCPv6 connection request.\nThe value is an integer that ranges from 30 to 120, in seconds."
        },
        {
            "Parameters": "infinity",
            "Info": "The infinite timeout period for waiting for a DHCPv6 connection request will not end the PPPv6 connection.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] domain d1",
            "[*HUAWEI-aaa-domain-d1] commit",
            "[~HUAWEI-aaa-domain-d1] dhcpv6-follow-ipv6cp wait-delay 90"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen the device is connected to different types of device, the dhcpv6-follow-ipv6cp wait-delay command needs to be used to adjust the timeout period for waiting for a DHCPv6 connection request from a PPPoE user after IPv6CP negotiation is completed.\nConfiguration Impact\nAfter IPv6 CP negotiation is completed, an IPv6 user that accesses the network using PPPoX will be logged out in one of the following situations:\nIn bridging mode, no DHCPv6 connection request packet carrying IA_NA information is received before the set timeout period expires.In numbered routing mode, no DHCPv6 connection request packet carrying IA_NA and IA_PD information is received before the set timeout period expires.In unnumbered routing mode, no DHCPv6 connection request packet carrying IA_PD information is received before the set timeout period expires.\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}