{
    "PageTitle": "dhcpv6-unshare-only",
    "FuncDef": "The dhcpv6-unshare-only command configures an IPv6 prefix pool to assign only IPv6 addresses not prefixes to users.\nThe undo dhcpv6-unshare-only command cancels the configuration.\nBy default, an IPv6 prefix pool assigns only prefixes not IPv6 addresses to users.",
    "CLIs": [
        "dhcpv6-unshare-only",
        "undo dhcpv6-unshare-only"
    ],
    "ParentView": [
        "IPv6 prefix pool view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 prefix pd delegation",
            "[~HUAWEI-ipv6-prefix-pd] dhcpv6-unshare-only"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, the device assigns the same 64-bit prefix to users when IPv6 addresses are assigned through DHCPv6, and no prefix information is carried in RA packets. Users cannot learn prefix information about neighbors and have to communicate with each other through a gateway device. To allow different users of a home connected to the network through a hub to communicate with each other directly rather than through a gateway device, configure the device to assign IPv6 addresses based on the Option 18 or Option 37 attribute and to send RA packets carrying the first 64 bits of the addresses assigned to IPv6 users as on-link prefixes. Then, the preceding users will be assigned IPv6 addresses sharing the same 64-bit prefix. In this way, the users can identify neighbors and communicate with each other based on the on-link prefix carried in RA packets. To allow the device to assign IPv6 addresses based on the Option 18 or Option 37 attribute, run the dhcpv6-unshare-only command to configure the IPv6 prefix pool to assign only IPv6 addresses not prefixes to users.\nPrecautions\nIn VS mode, this command is supported only on the admin VS.\nThe dhcpv6-unshare-only command is mutually exclusive with the following commands:\nslaac-unshare-onlypd-unshare-onlyclient-duid client-duid bind prefix prefix-address"
}