{
    "PageTitle": "dhcpv6 option-17 decode version1",
    "FuncDef": "The dhcpv6 option-17 decode version1 command enables the device to parse the Option 17 field based on the format defined by the DSL Forum and send the obtained sub-attributes to a RADIUS server.\nThe undo dhcpv6 option-17 decode version1 command cancels the configuration.\nBy default, the function to parse the Option 17 field based on the format defined by the DSL Forum is disabled.",
    "CLIs": [
        "dhcpv6 option-17 decode version1",
        "undo dhcpv6 option-17 decode version1"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dhcpv6 option-17 decode version1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nUser login request packets carry Relay headers. The Relay header carries the Option 17 field which contains sub-options. To enable the device to parse the Option 17 field based on the format defined by the DSL Forum and send the obtained sub-attributes to the RADIUS server, run the\ndhcpv6 option-17 decode version1 command in the system view. The types and names of the Option 17 sub-options supported by the device are as follows:\n129(0x81) Actual-Data-Rate-Upstream130(0x82) Actual-Data-Rate-Downstream131(0x83) Minimum-Data-Rate-Upstream132(0x84) Minimum-Data-Rate-Downstream133(0x85) Attainable-Data-Rate-Upstream134(0x86) Attainable-Data-Rate-Downstream135(0x87) Maximum-Data-Rate-Upstream136(0x88) Maximum-Data-Rate-Downstream137(0x89) Minimum-Data-Rate-Upstream-Low-Power138(0x8A) Minimum-Data-Rate-Downstream-Low-Power139(0x8B) Maximum-Interleaving-Delay-Upstream140(0x8C) Actual-Interleaving-Delay-Upstream141(0x8D) Maximum-Interleaving-Delay-Downstream142(0x8E) Actual-Interleaving-Delay-Downstream144(0x90) Access-Loop-Encapsulation\nUser login request packets carry multi-level Relay headers. The Relay header carries the Option 17 field which contains sub-options. Run the dhcpv6 option-17 decode version1 command in the system view to enable the device to parse the Option 17 field carried in the outermost Relay header based on the format defined by the DSL Forum and send the obtained sub-attributes to the RADIUS server.\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nIf the format of the options carried in the Relay headers and DHCPv6 packets do not meet the following requirements, the device does not parse the options and send the attributes to the RADIUS server.\nVendor ID in the Option 17 field is 3561.The types of the sub-options of the Option 17 are 0x81-0x90 (excluding 0x89f).The length of the sub-option 0x90 is 3 and the length of all other sub-options is 4.Run the dhcpv6 option-17 decode version1 command in the system view."
}