{
    "PageTitle": "dhcpv6 forward-mode through-packet",
    "FuncDef": "The dhcpv6 retransmit-solicit forward-mode through-packet command enables a BRAS to transparently transmit retransmitted Solicit messages from users to a DHCPv6 server whereas waiting for Advertise messages from the DHCPv6 server.\nThe dhcpv6 retransmit-request forward-mode through-packet command enables a BRAS to transparently transmit retransmitted Request messages from users to a DHCPv6 server whereas waiting for Reply messages from the DHCPv6 server.\nThe undo dhcpv6 retransmit-solicit forward-mode through-packet command enables a BRAS to discard retransmitted Solicit messages from users whereas waiting for Advertise messages from a DHCPv6 server.\nThe undo dhcpv6 retransmit-request forward-mode through-packet command enables a BRAS to discard retransmitted Request messages from users whereas waiting for Reply messages from a DHCPv6 server.\nBy default, a BRAS discards retransmitted Solicit messages from users while waiting for Advertise messages from a DHCPv6 server. By default, a BRAS discards retransmitted Request messages from users while waiting for Reply messages from a DHCPv6 server.",
    "CLIs": [
        "dhcpv6 retransmit-solicit forward-mode through-packet",
        "dhcpv6 retransmit-request forward-mode through-packet",
        "undo dhcpv6 retransmit-solicit forward-mode through-packet",
        "undo dhcpv6 retransmit-request forward-mode through-packet"
    ],
    "ParentView": [
        "DHCPv6 server group view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dhcpv6-server group huawei",
            "[*HUAWEI-dhcpv6-server-group-huawei] commit",
            "[~HUAWEI-dhcpv6-server-group-huawei] dhcpv6 retransmit-solicit forward-mode through-packet"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn a scenario where IPv6 addresses are assigned from a remote IPv6 address pool, if the DHCPv6 server has low processing performance, there is a probability that the DHCPv6 server fails to send an Advertise or Reply message in response to a Solicit or Request message from a user. If this happens, the user fails to obtain an IPv6 address because the BRAS discards a retransmitted Solicit or Request message whereas waiting for an Advertise or Reply message from the DHCPv6 server by default. To enable the BRAS to transparently transmit retransmitted Solicit or Request messages from users to the DHCPv6 server whereas waiting for Advertise or Reply messages from the DHCPv6 server, run the dhcpv6 retransmit-solicit forward-mode through-packet or dhcpv6 retransmit-request forward-mode through-packet command. This increases the success rate of IPv6 address application of users.\nPrecautions\nIn VS mode, this command is supported only on the admin VS.\nThe dhcpv6 retransmit-solicit forward-mode through-packet command takes effect for DHCPv6 Solicit messages only, whereas the dhcpv6 retransmit-request forward-mode through-packet command takes effect for DHCPv6 Request messages only. If the DHCPv6 server responds slowly to the received Solicit or Request messages and users resend a large number of Solicit and Request messages during the login process, enabling the transparent transmission function may overload the DHCPv6 server."
}