{
    "PageTitle": "ipv6-pool auto-block slave-switch",
    "FuncDef": "The ipv6-pool auto-block slave-switch enable command enables the function to associate IPv6 address pool isolation with master/slave main control board switchover.\nThe ipv6-pool auto-block slave-switch disable command disables the function to associate IPv6 address pool isolation with master/slave main control board switchover.\nThe undo ipv6-pool auto-block slave-switch disable command enables the function to associate IPv6 address pool isolation with master/slave main control board switchover.\nBy default, the function to associate IPv6 address pool isolation with master/slave main control board switchover is enabled.",
    "CLIs": [
        "ipv6-pool auto-block slave-switch disable",
        "ipv6-pool auto-block slave-switch enable",
        "undo ipv6-pool auto-block slave-switch disable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6-pool auto-block slave-switch disable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a user fails to apply for an address in an address pool for 50 consecutive times, this address pool is considered faulty and will be automatically isolated. The device then preferentially selects an IP address from another available address pool. The device continues to select the current address pool only when no other address pool is available.\nBy default, the master/slave main control board switchover is triggered when the number of IPv6 address pool isolation times reaches 20. The master/slave main control board switchover can be triggered only once within 24 hours. If the address pool on the master main control board is isolated and the address pool on the slave main control board is not isolated, run the ipv6-pool auto-block slave-switch enable command to enable the function to associate IPv6 address pool isolation with master/slave main control board switchover to trigger a master/slave main control board switchover.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}