{
    "PageTitle": "ipv6-address assign",
    "FuncDef": "The ipv6-address assign command configures a device to assign IPv6 addresses based on the Option 17 or Option 37 attribute.\nThe undo ipv6-address assign command cancels the configuration.\nBy default, the device assigns the same 64-bit prefix to users when IPv6 addresses are assigned through DHCPv6, and no prefix information is carried in RA packets.",
    "CLIs": [
        "ipv6-address assign { circuit-id | remote-id } *",
        "undo ipv6-address assign { circuit-id | remote-id } *"
    ],
    "ParentView": [
        "AAA domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "circuit-id",
            "Info": "Specifies an interface ID.\n-"
        },
        {
            "Parameters": "remote-id",
            "Info": "Specifies a remote interface ID.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] domain test1",
            "[*HUAWEI-domain-test1] ipv6-address assign circuit-id"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, the device assigns the same 64-bit prefix to users when IPv6 addresses are assigned through DHCPv6, and no prefix information is carried in RA packets. Users cannot learn prefix information about neighbors. As a result, they have to communicate with each other through a gateway device. To allow different users of a home connected to the network through a hub to communicate with each other directly rather than through a gateway device, configure the device to assign IPv6 addresses based on the Option 18 or Option 37 attribute and to send RA packets carrying the first 64 bits of the addresses assigned to IPv6 users as on-link prefixes. Then, the preceding users will be assigned IPv6 addresses sharing the same 64-bit prefix. In this way, the users can identify neighbors and communicate with each other based on the on-link prefix carried in RA packets. To configure a device to assign IPv6 addresses based on the Option 17 or Option 37 attribute, run the ipv6-address assign command.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}