{
    "PageTitle": "ipv6-pool address-assign-mode",
    "FuncDef": "The ipv6-pool statistic include shared-user command configures the IPv6 address pool statistics to include statistics about users sharing the prefix pool.\nThe undo ipv6-pool statistic include shared-user command configures the IPv6 address pool statistics to exclude statistics about users sharing the prefix pool.\nThe ipv6-pool address-assign-mode eui-64 command sets an interface ID to be in the standard EUI-64 format when DHCPv6 is used to allocate addresses.\nThe undo ipv6-pool address-assign-mode command restores the default format of an interface ID.\nBy default, the interface ID starts from 1 and increases by one for each user, and IPv6 address pool statistics exclude statistics about users sharing the prefix pool.",
    "CLIs": [
        "ipv6-pool address-assign-mode eui-64",
        "ipv6-pool statistic include shared-user",
        "undo ipv6-pool address-assign-mode",
        "undo ipv6-pool statistic include shared-user"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6-pool address-assign-mode eui-64"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6-pool statistic include shared-user"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nPrefix sharing users include the users whose shared prefixes are allocated by ND and the prefix sharing users with the ipv6-pool address-assign-mode eui-64 command configuration. By default, IPv6 address pool statistics exclude statistics about users sharing the prefix pool.\nTo configure the IPv6 address pool statistics to include statistics about users sharing the prefix pool, run the ipv6-pool statistic include shared-user command.\nIn the IPv6 addressing scheme, every IPv6 unicast address needs an interface identifier. When the device needs to assign global unicast IP addresses to DHCPv6 users, the ipv6-pool address-assign-mode eui-64 command can be used to set interface IDs to be in the standard EUI-64 format. These 64-bit interface identifiers are globally valid for addressing and each interface identifier uniquely identifies a network interface.\nPrerequisites\nRun the ipv6 command to enable IPv6 packet forwarding on the device.\nConfiguration Impact\nAfter the ipv6-pool address-assign-mode eui-64 command is run, all DHCPv6 IA_NA users are assigned 64-bit prefixes and EUI-64 interface IDs. The 64-bit prefixes and EUI-64 interface IDs are used to generate IPv6 addresses. The device can only allocate addresses from the address pool with a configured prefix length smaller than or equal to 64 bits to users.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}