{
    "PageTitle": "ipv6 nd autoconfig other-flag",
    "FuncDef": "The ipv6 nd autoconfig other-flag command enables a user to use either NDRA or DHCPv6 to perform other configurations when NDRA is used to allocate IPv6 addresses.\nUsing the undo ipv6 nd autoconfig other-flag command, you can restore the default configuration.\nBy default, DHCPv6 is used to perform other configurations when NDRA is used to allocate IPv6 addresses.",
    "CLIs": [
        "ipv6 nd autoconfig other-flag { ndra | dhcpv6 | dhcpv6-enhance }",
        "undo ipv6 nd autoconfig other-flag [ ndra | dhcpv6-enhance ]"
    ],
    "ParentView": [
        "AAA domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "ndra",
            "Info": "Indicates that NDRA is used to perform other configurations.\n-"
        },
        {
            "Parameters": "dhcpv6",
            "Info": "Indicates that DHCPv6 is used to perform other configurations.\n-"
        },
        {
            "Parameters": "dhcpv6-enhance",
            "Info": "Enable the DHCPv6 enhanced function, which encapes DNS information in the RA packet when DHCPv6 is used to perform other configurations.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] domain d1",
            "[*HUAWEI-domain-d1] commit",
            "[~HUAWEI-domain-d1] ipv6 nd autoconfig other-flag ndra"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen NDRA is used to allocate IPv6 addresses, you need to run the ipv6 nd autoconfig other-flag command to select either NDRA or stateless DHCPv6 to perform other configurations.If the client supports the DHCPv6 mode, you can obtain the configuration information through the DHCPv6 Information-Request packet. If the access users in the same domain do not support the DHCPv6 mode, run the ipv6 nd autoconfig other-flag dhcpv6-enhance command to enable the DHCPv6-enhance function and enable the RA packet to carry the DNS attribute.\nPrerequisites\nFor PPPoX and L2TPusers, the ipv6 nd autoconfig managed-address-flag command must not be run in the AAA domain view.\nFor IPoX users, the ipv6 nd autoconfig managed-address-flag command must not be run in the view of a specified interface.\nPrecautions\nThis command is supported only on the admin VS.\nThe ipv6 nd autoconfig other-flag dhcpv6 command or the undo ipv6 nd autoconfig other-flag command or the undo ipv6 nd autoconfig other-flag dhcpv6-enhance command restores the default configuration. This command is not contained in the configuration file."
}