{
    "PageTitle": "ipv6 urpf strict enable",
    "FuncDef": "The ipv6 urpf strict enable command enables IPv6 URPF for IPv6 L2TP users and IPv6 PPPoE users in the virtual template view.\nThe undo ipv6 urpf strict enable command disables IPv6 URPF for IPv6 L2TP users and IPv6 PPPoE users in the virtual template view.\nBy default, IPv6 URPF is disabled for IPv6 L2TP users and IPv6 PPPoE users.",
    "CLIs": [
        "ipv6 urpf strict enable [ check subnet ]",
        "undo ipv6 urpf strict enable [ check subnet ]"
    ],
    "ParentView": [
        "Virtual template view"
    ],
    "ParaDef": [
        {
            "Parameters": "check",
            "Info": "Enables strict URPF check for common L2TP users, dual-stack L2TP users, L2TP leased line users, common PPPoE users, dual-stack PPPoE users, and PPPoE leased line users. If the parameter is not specified, strict URPF check is enabled only for common L2TP users, dual-stack L2TP users, common PPPoE users and dual-stack PPPoE users.\n-"
        },
        {
            "Parameters": "subnet",
            "Info": "The subnet of framed-ipv6-route.\n-"
        },
        {
            "Parameters": "strict",
            "Info": "Indicates URPF strict check. That is, a packet can pass the URPF check only when there is a matched entry in the forwarding table and the inbound interface is matched.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Virtual-Template 1",
            "[*HUAWEI-Virtual-Template1] ipv6 urpf strict enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo prevent source address spoofing attacks, run the ipv6 urpf strict enable command to enable IPv6 URPF for L2TP users and PPPoE users.\nIf the check subnet parameter is not specified in the ipv6 urpf strict enable command, IPv6 URPF takes effect only for common L2TP users, dual-stack L2TP users, common PPPoE users and dual-stack PPPoE users. If the check subnet parameter is specified in the ipv6 urpf strict enable command, IPv6 URPF also takes effect for L2TP leased line users and PPPoE leased line users based on the Framed-IPv6-Route.\nConfiguration Impact\nWhen IPv6 URPF is enabled in the virtual template view, IPv6 URPF for L2TP users and PPPoE users that have access to the virtual template will be enabled.\nLeased line users that are configured with static routes are considered as common users in the URPF configuration.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nWhen both URPF and redirection (including redirect ip-nexthop and redirect ip-multinhp) apply to an interface, URPF does not take effect."
}