{
    "PageTitle": "ipv6-pool auto-block",
    "FuncDef": "The ipv6-pool auto-block enable command enables the function to automatically isolate an IPv6 address pool.\nThe ipv6-pool auto-block disable command disables the function to automatically isolate an IPv6 address pool.\nThe undo ipv6-pool auto-block disable command enables the function to automatically isolate an IPv6 address pool.\nBy default, the function to automatically isolate an IPv6 address pool is enabled.",
    "CLIs": [
        "ipv6-pool auto-block disable",
        "ipv6-pool auto-block enable",
        "undo ipv6-pool auto-block disable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6-pool auto-block disable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, the function to automatically isolate an IPv6 address pool is enabled. If a user fails to apply for an address in an address pool for 50 consecutive times, this address pool is considered faulty and will be automatically isolated. The device then preferentially selects an IP address from another available address pool. The device continues to select the current address pool only when no other address pool is available. If the address pool isolation function is disabled, even if a user fails to apply for an IP address from an address pool for 50 consecutive times, this address pool will not be automatically isolated. The device can still assigns an IP address from this address pool to allow the user to go online.\nAn isolated address pool can be de-isolated using either of the following methods:\nThe system automatically starts a timer. If the timer times out after 5 minutes, the address pool will be automatically de-isolated.If no address pool is available in a domain, all the isolated address pools in the domain are de-isolated (a locked address pool will not be de-isolated).\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}