{
    "PageTitle": "ipv6 prefix",
    "FuncDef": "The ipv6 prefix command creates an IPv6 prefix pool and displays the IPv6 prefix pool view, or directly enters the IPv6 prefix pool view if the IPv6 prefix pool already exists.\nThe undo ipv6 prefix command deletes an IPv6 prefix pool.\nBy default, no IPv6 prefix pool is created on a device.",
    "CLIs": [
        "ipv6 prefix <prefix-name> [ local | delegation | remote ]",
        "undo ipv6 prefix <prefix-name>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "prefix-name",
            "Info": "Specifies the name of the IPv6 prefix pool to be created.\nThe value is a sting of 1 to 32 case-insensitive characters. It cannot contain spaces. The value can be a combination of letters, digits, dots (.), hyphens (-), and underscores (_). The value cannot be only one hyphen (-) or two consecutive hyphens (--)."
        },
        {
            "Parameters": "local",
            "Info": "Configures a local prefix pool. After IPv6 prefixes are configured in a local prefix pool on a device, and the local prefix pool is bound to a local address pool, the device functions as a server and assigns IPv6 prefixes or IPv6 addresses to users.\n-"
        },
        {
            "Parameters": "delegation",
            "Info": "Configures a delegation prefix pool. After an IPv6 delegation prefix pool is bound to an IPv6 delegation address pool on a device, the device functions as a delegating router and assigns IPv6 prefixes to requesting routers. Requesting routers use these IPv6 prefixes exclusively.\n-"
        },
        {
            "Parameters": "remote",
            "Info": "Configures a remote prefix pool. After a remote IPv6 prefix pool is bound to a remote IPv6 address pool on a remote device, the remote device functions as a DHCP server and assigns IPv6 prefixes or IPv6 addresses to users.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 prefix prefix1 local"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA delegation prefix pool is used in the prefix delegation (PD) scenario. The PD scenario involves two roles: delegating routers and requesting routers. Requesting routers apply to delegating routers for IPv6 prefixes and release of IPv6 prefixes as required. Delegating routers, which can be BRAS device or servers, are used to configure IPv6 network segments and assign address segments according to the requests of requesting routers.\nA dynamic prefix pool functions as the client of a DAP IPv6 resource pool to assign prefixes to users.\nAfter a prefix pool is configured, you must bind it to an address pool. Only one prefix pool can be bound to an address pool. The binding relationship is as follows:\nA local prefix pool or a dynamic prefix pool can be bound to a user-side local address pool (if the prefix-shared command is run).A delegation prefix pool or a dynamic prefix pool can be bound to a user-side delegation address pool (if the prefix-shared command is run).A local prefix pool can be bound to a user-side relay address pool.A remote prefix pool can be bound to a user-side remote address pool.\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}