{
    "PageTitle": "lifetime",
    "FuncDef": "The lifetime command configures the lifetime of an IPv6 prefix.\nThe undo lifetime command restores the default lifetime of an IPv6 prefix.\nBy default, the preferred lifetime is 2 days and the valid lifetime is 3 days.",
    "CLIs": [
        "lifetime preferred-lifetime { days <days-value> [ hours <hours-value> [ minutes <minutes-value> ] ] | infinite } valid-lifetime { days <days-value> [ hours <hours-value> [ minutes <minutes-value> ] ] | infinite }",
        "undo lifetime"
    ],
    "ParentView": [
        "IPv6 prefix pool view"
    ],
    "ParaDef": [
        {
            "Parameters": "days days-value",
            "Info": "Specifies days.\nThe value is an integer ranging from 0 to 999."
        },
        {
            "Parameters": "hours hours-value",
            "Info": "Specifies hours.\nThe value is an integer ranging from 0 to 23."
        },
        {
            "Parameters": "minutes minutes-value",
            "Info": "Specifies minutes.\nThe value is an integer ranging from 0 to 59."
        },
        {
            "Parameters": "infinite",
            "Info": "Indicates an infinite time.\n-"
        },
        {
            "Parameters": "valid-lifetime",
            "Info": "Configures the valid lifetime of an IPv6 prefix. The valid lifetime indicates the expiration time stamp. After the expiration time stamp times out, all clients with this prefix are logged out. The valid lifetime must not be shorter than 3 hours or the preferred lifetime.\n-"
        },
        {
            "Parameters": "preferred-lifetime",
            "Info": "Configures the preferred lifetime of an IPv6 prefix. The preferred lifetime is used for calculating the renewal time and rebinding time. The preferred lifetime must not be shorter than 2 hours.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 prefix test local",
            "[~HUAWEI-ipv6-prefix-test] lifetime preferred-lifetime days 4 hours 0 minutes 0 valid-lifetime days 5 hours 0 minutes 0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nYou can run this command to change the preferred lifetime or valid lifetime of an IPv6 prefix in default.\nConfiguration Impact\nWhen an IPv6 prefix pool works in stateless mode, this command configures the Preferred Lifetime and Valid Lifetime in the ND RA prefix option. When an IPv6 prefix pool works in stateful mode, this command configures the Preferred Lifetime and Valid Lifetime in the DHCPv6 IANA, IATA or IAPD option.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}