{
    "PageTitle": "link-address",
    "FuncDef": "The link-address command configures a link address.\nThe undo link-address command deletes the configured link address.\nBy default, no link address is configured.",
    "CLIs": [
        "link-address <ipv6-address/prefix-length>",
        "undo link-address"
    ],
    "ParentView": [
        "IPv6 address prefix view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv6-address/prefix-length",
            "Info": "Specifies a global unicast address or a site-local unicast address and the mask length of the link address.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 prefix prefix1 remote",
            "[~HUAWEI-ipv6-prefix-prefix1] link-address 2001:db8:1::1/64"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA remote server can allocate IPv6 addresses or prefixes only when the link-address command is run to configure a link address in the remote prefix pool on the relay agent.\nThe remote DHCPv6 server selects an address pool based on the link-address option in packets sent by the relay agent. When a remote DHCPv6 server assigns IPv6 addresses to ND and DHCPv6 users, configure a link address to be on the same network segment as the user address.\nPrerequisites\nA remote prefix pool has been configured.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nFor IPv6 remote address pool use in dual-device hot backup scenarios:\n When two devices are configured with the same gateway, the dhcpv6-server source command is not recommended. Alternatively, run the dhcpv6-server source interface command only to ensure that the source IP addresses in the packets sent by the devices to the DHCPv6 server are different. When two devices are configured with the same gateway, the dhcpv6-server source link-address command must be configured. This solution can be used only when the address pool is exclusively used. The IP addresses in the exclusively used address pool can control route advertisement through RBP master/backup status to achieve route switching. This solution cannot be used for shared address pools. When two gateways are configured with two different IP addresses in a subnet, the DHCPv6 server needs to properly process the user request packets that have a link-address different from that carried in the packets sent for user access."
}