{
    "PageTitle": "option",
    "FuncDef": "The option command configures a DHCPv6 user-defined option.\nThe undo option command deletes a DHCPv6 user-defined option.\nBy default, the DHCPv6 user-defined option is not configured.",
    "CLIs": [
        "option <code> { suboption <sub-code> { ipv6-address <ipv6-address> | string <string-value> } } &<1-16>",
        "option <code> { ipv6-address { ipv6-address } &<1-2> | string <string-value> | hex <hex-value> } &<1-160>",
        "undo option <code>"
    ],
    "ParentView": [
        "IPv6 address pool view"
    ],
    "ParaDef": [
        {
            "Parameters": "suboption sub-code",
            "Info": "Specifies the code of a sub-option of an option.\nThe value is an integer ranging from 1 to 65535."
        },
        {
            "Parameters": "ipv6-address ipv6-address",
            "Info": "Specifies an IPv6 address.\nThe value is a 32-bit hexadecimal number in the format of X:X::X:X."
        },
        {
            "Parameters": "string string-value",
            "Info": "Specifies the string that is represented by the option code value.\nThe value is an integer that ranges from 1 to 128."
        },
        {
            "Parameters": "option code",
            "Info": "Specifies the code of a user-defined option.\nThe value is an integer ranging from 15 to 65535, excluding 18-20, 23-26, and 37-38."
        },
        {
            "Parameters": "hex hex-value",
            "Info": "Specifies the hexadecimal character string that is represented by the value of the option code.\nThe length of the hexadecimal string is an even number of characters, and the maximum length is 320 characters. You can input the characters without any spaces or in groups of two with a space in-between each group. For example, 80070000010A2C00FE and 80 07 00 00 01 0A 2C 00 FE are both acceptable."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 pool huawei bas local",
            "[~HUAWEI-ipv6-pool-huawei] option 80 string www.pcp.com"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen the device functions as a server, the device must provide parameters carried in common options, such as DNS, Preference, Rapid Commit, and Server Unicast, as well as other control information and parameters that can be carried in packets sent to clients. To configure a DHCPv6 user-defined option, run the option command and specify the meaning of the option in the command. Do not use this command to configure the common options, including DNS, Preference, Rapid Commit, and Server Unicast.\nConfiguration Impact\nThe option command takes effect for online users and users who go online after the command is configured.\nAfter an option is configured, the device replies with the configured option to clients no matter whether the clients apply for the option.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nThe option command cannot be configured in a remote address pool."
}