{
    "PageTitle": "prefix",
    "FuncDef": "The prefix command configures an IPv6 prefix.\nThe undo prefix command deletes an IPv6 prefix.\nBy default, no IPv6 prefix is configured.",
    "CLIs": [
        "prefix <prefix-address/prefix-length> [ delegating-prefix-length <delegating-prefix-length> ]",
        "undo prefix"
    ],
    "ParentView": [
        "IPv6 prefix pool view"
    ],
    "ParaDef": [
        {
            "Parameters": "delegating-prefix-length delegating-prefix-length",
            "Info": "Specifies the length of the IPv6 prefix assigned by the delegating router to the requesting router. The length of prefixes to be assigned from a delegation prefix pool must be greater than the length of prefixes in the delegation prefix pool. Otherwise, the delegating router cannot assign prefixes from the delegation prefix pool to clients.\ndelegating-prefix-length cannot be configured for a local prefix pool.\nThe value is an integer that ranges from 1 to 128, the default value is 64."
        },
        {
            "Parameters": "prefix prefix-address/prefix-length",
            "Info": "Specifies the address and length of an IPv6 prefix.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 prefix prefixtest local",
            "[~HUAWEI-ipv6-prefix-prefixtest] prefix 2001:db8::/64"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf you want the device to allocate addresses and prefixes for users, you need to configure a prefix pool and bind it to the address pool. Run this command to configure the prefixes in the prefix pool which are allocated to users.\nPrecautions\nIn VS mode, this command is supported only on the admin VS.\nAfter an IPv6 prefix pool is bound to an IPv6 address pool, prefixes in the prefix pool cannot be changed or deleted.\nDifferent prefix pools are used for different address allocation modes:\nThe local prefix pool is configured when the WAN interface address is allocated in ND prefix allocation or DHCPv6 IA_NA/IA_TA mode.The delegation prefix pool is configured when the LAN interface prefix is allocated in ND prefix allocation or DHCPv6 PD mode.The remote prefix pool is configured when the address or prefix is allocated by the remote server in DHCPv6 IA_NA/IA_TA/IA_PD mode."
}