{
    "PageTitle": "slaac-unshare-only",
    "FuncDef": "The slaac-unshare-only command configures the NE40E prefix pool to allocate IP addresses by using only the unshared-mode stateless address autoconfiguration (SLAAC) protocol.\nThe undo slaac-unshare-only command deletes the preceding configuration.\nBy default, a prefix pool is used for DHCPv6 IA_PD prefix allocation and stateless address autoconfiguration in unshared mode.",
    "CLIs": [
        "slaac-unshare-only",
        "undo slaac-unshare-only"
    ],
    "ParentView": [
        "IPv6 address prefix view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 prefix p1 delegation",
            "[~HUAWEI-ipv6-prefix-p1] slaac-unshare-only"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the delegation prefix pools for ND prefix allocation need to be differentiated with the delegation prefix pools for DHCPv6 IA_PD prefix allocation on a device, run the slaac-unshare-only command and the pd-unshare-only command in the corresponding delegation prefix pools.\nIf the remote prefix pools for ND prefix allocation need to be differentiated with the remote prefix pools for DHCPv6 IA_PD prefix allocation or DHCPv6 IA_NA on a device, run the slaac-unshare-only command and the dhcpv6-only command in the corresponding remote prefix pools.\nConfiguration Impact\nAfter slaac-unshare-only command is configured in the delegation prefix pool view, the pool allocates prefixes by using only unshared-mode SLAAC and the delegation prefix pool is prior to allocates prefixes than other prefix pool. The pool does not allocate IP addresses when DHCPv6 IAPD packets are used to apply for IP addresses.\nAfter slaac-unshare-only command is configured in the delegation prefix pool view, the length of prefixes to be assigned from the delegation prefix pool must not be less than 64.\nAfter slaac-unshare-only command is configured in the remote prefix pool view, the pool allocates prefixes by using only unshared-mode SLAAC and the remote prefix pool is prior to allocates prefixes than other remote prefix pool.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}