{
    "PageTitle": "warning-threshold(IPv6 address pool view)",
    "FuncDef": "The warning-threshold command sets an alarm threshold for the address usage of an IPv6 address pool. If the IPv6 address usage exceeds the threshold, an alarm is generated on the device.\nThe undo warning-threshold command restores the default alarm threshold for the address usage of an address pool.\nBy default, the alarm threshold for the address usage of an IPv6 address pool is set to 80%.",
    "CLIs": [
        "warning-threshold <threshold>",
        "undo warning-threshold [ <threshold> ]"
    ],
    "ParentView": [
        "IPv6 address pool view"
    ],
    "ParaDef": [
        {
            "Parameters": "threshold",
            "Info": "The alarm threshold for the address usage of an IPv6 address pool is a percentage. If the value of threshold-value is set to 80, an alarm will generate when the address usage of the address pool reaches 80%. 0 indicates that the alarm is disabled.\nThe value is an integer ranging from 0 to 100."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 pool huawei bas remote",
            "[~HUAWEI-ipv6-pool-huawei] warning-threshold 70"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe warning-threshold command is used to set an alarm threshold for the usage of an IPv6 address pool. If the address usage exceeds the threshold, an alarm is generated on the , prompting the administrator to reallocate addresses. If all addresses of the IPv6 address pool are used, subsequent users cannot log in.\nIf the usage of an address pool exceeds the threshold, an alarm is generated. When the address usage falls below 90% of the threshold, the alarm is cleared.\nIf you want the device to generate an alarm when the usage of an IPv6 address pool exceeds the alarm threshold and another alarm when IPv6 addresses in the IPv6 address pool are exhausted, run the warning-threshold and warning-exhaust commands.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nIf a dynamic prefix pool is bound to an IPv6 address pool , the warning-threshold command can be configured but does not take effect."
}