{
    "PageTitle": "remote-backup-service (VSP service instance group view)",
    "FuncDef": "The remote-backup-service command binds a remote backup service (RBS) group to a service-instance-group service instance group.\nThe undo remote-backup-service command unbinds an RBS group from a service-instance-group service instance group.\nBy default, an RBS group is not bound to any service-instance-group service instance group.",
    "CLIs": [
        "remote-backup-service <service-name>",
        "undo remote-backup-service [ <service-name> ]"
    ],
    "ParentView": [
        "VSP service instance group view"
    ],
    "ParaDef": [
        {
            "Parameters": "service-name",
            "Info": "Specifies the name of an RBS group.\nThe value is a string of 1 to 32 case-insensitive characters, spaces not supported. The characters can be letters or numbers, hyphens (-) not supported. The string can contain spaces if it is enclosed with double quotation marks (\")."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] remote-backup-service cgn",
            "[*HUAWEI-rm-backup-srv-rbs] peer 2.2.2.2 source 1.1.1.1 port 2046",
            "[*HUAWEI-rm-backup-srv-rbs] commit",
            "[~HUAWEI-rm-backup-srv-rbs] quit",
            "[~HUAWEI] service-instance-group group1",
            "[*HUAWEI-service-instance-group-group1] remote-backup-service cgn"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nYou must run the remote-backup-service command to implement the basic inter-chassis hot backup in special scenarios. For example, inter-chassis NAT hot backup is configured together with the VPN function or with the multi-VS function, or inter-chassis hot backup is configured together with the CGN load balancing mode.\nPrerequisites\nThe basic functions of an RBS group have been achieved.A VSP service instance group has been created.\n\nPrecautions\nThis command is applicable only to the VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S.\nThe VSP service instance group configured with inter-chassis hot backup can be used on either IPsec."
}