{
    "PageTitle": "vrrp vrid interface (Service location view)",
    "FuncDef": "The vrrp vrid interface command binds an inter-chassis backup group to a VRRP backup group.\nThe undo vrrp vrid interface command unbinds an inter-chassis backup group from a VRRP backup group.\nBy default, a inter-chassis backup group is not bound to any VRRP backup group.",
    "CLIs": [
        "vrrp vrid <vrrp-id> interface { <interface-type> <interface-number> | <interface-name> }",
        "undo vrrp [ vrid <vrrp-id> interface { <interface-type> <interface-number> | <interface-name> } ]"
    ],
    "ParentView": [
        "Service location view"
    ],
    "ParaDef": [
        {
            "Parameters": "vrrp-id",
            "Info": "Specifies the ID of a VRRP backup group.\nThe value is an integer ranging from 1 to 255."
        },
        {
            "Parameters": "interface interface-type",
            "Info": "Specifies the type of the interface on which a VRRP backup group resides.\nCurrently, the GE interface, GE sub-interface, Eth-Trunk interface, Eth-Trunk sub-interface, and loopback interface are supported."
        },
        {
            "Parameters": "interface-number",
            "Info": "Specifies the number of the interface on which a VRRP backup group resides.\n-"
        },
        {
            "Parameters": "interface-name",
            "Info": "Specifies the name of the interface on which a VRRP backup group resides.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] service-location 1",
            "[*HUAWEI-service-location-1] location slot 1 engine 0",
            "[*HUAWEI-service-location-1] vrrp vrid 1 interface GigabitEthernet 1/0/1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo bind an inter-chassis backup group to a VRRP backup group, run the vrrp vrid interface command. This command is applicable only to inter-chassis hot backup scenarios, but not inter-board hot backup scenarios.\nPrerequisites\nVRRP has been configured in an inter-chassis hot backup scenario.\nPrecautions\nThis command is applicable only to the VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S in inter-chassis hot backup scenarios."
}