{
    "PageTitle": "emdi monitor-period",
    "FuncDef": "The emdi monitor-period command configures an EMDI monitoring period.\nThe undo emdi monitor-period command restores the default configuration.\nBy default, the EMDI monitoring period is 60s.",
    "CLIs": [
        "emdi monitor-period <period-value>",
        "undo emdi monitor-period [ <period-value> ]"
    ],
    "ParentView": [
        "EMDI view"
    ],
    "ParaDef": [
        {
            "Parameters": "period-value",
            "Info": "Specifies an EMDI monitoring period.\nThe value is an enumerated type and can be 10, 30, or 60, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] emdi",
            "[~HUAWEI-emdi] emdi monitor-period 10",
            "Info: Once the detection period changes, the default alarm threshold also changes. The default alarm threshold changed to (unit: 1/100000): ",
            "SD loss packet: 100; HD loss packet: 100; 4K loss packet: 100; SD sequence error packet: 100; HD sequence error packet: 100; 4K sequence error packet: 100."
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWith EMDI, monitoring data can be obtained from a device on a regular basis and periodically send to the uTraffic in various modes such as Telemetry. After analysis on the uTraffic, the monitoring data can be displayed in a trend chart. The monitoring period can be set to 10s, 30s, or 60s. To change the monitoring period, run the emdi monitor-period command.\nConfiguration Impact\nThe monitoring period changes lead to changes of the EMDI alarm threshold. When the monitoring period is changed from 60s to 30s/10s or from 30s/10s to 60s, the old alarm threshold is changed to the one corresponding to the new monitoring period.\nPrecautions\nTo ensure the integrity and accuracy of the monitoring data, the monitoring period changes do not take effect instantly. Instead, data is collected based on the new monitoring period upon next statistics collection."
}