{
    "PageTitle": "emdi bind channel-group lpu-group",
    "FuncDef": "The emdi bind channel-group lpu-group command binds an EMDI channel group and a board group.\nThe undo emdi bind channel-group lpu-group command cancels the binding relationship between an EMDI channel group and a board group.\nThe emdi bind channel-group lpu-group outbound command binds an EMDI channel group to an EMDI board group in the downstream direction.\nThe undo emdi bind channel-group lpu-group outbound command unbinds an EMDI channel group from an EMDI board group in the downstream direction.\nBy default, an EMDI channel group is not bound to an EMDI board group in either the upstream or downstream direction.",
    "CLIs": [
        "emdi bind channel-group <channel-group-name> lpu-group <lpu-group-name>",
        "emdi bind channel-group <channel-group-name> lpu-group <lpu-group-name> outbound",
        "undo emdi bind channel-group <channel-group-name> lpu-group <lpu-group-name>",
        "undo emdi bind channel-group <channel-group-name> lpu-group <lpu-group-name> outbound"
    ],
    "ParentView": [
        "EMDI view"
    ],
    "ParaDef": [
        {
            "Parameters": "channel-group-name",
            "Info": "Specifies the name of an EMDI channel group.\nThe name is a string of 1 to 31 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "lpu-group-name",
            "Info": "Specifies the name of a board group.\nThe name is a string of 1 to 31 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "outbound",
            "Info": "Binds an EMDI channel group to an EMDI board group in the downstream direction.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] emdi",
            "[~HUAWEI-emdi] emdi bind channel-group 1 lpu-group 1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] emdi",
            "[~HUAWEI-emdi] emdi bind channel-group 1 lpu-group 1 outbound"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen the upstream EMDI detection solution is used, after the EMDI channels and boards to be detected are configured, run the emdi bind channel-group lpu-group command to bind the EMDI channel group to the EMDI board group in the upstream direction to detect indicators of a specified channel.\nWhen the downstream EMDI detection solution is used, after the EMDI channels and boards to be detected are configured, run the emdi bind channel-group lpu-group outbound command to bind the EMDI channel group to the EMDI board group in the downstream direction to detect indicators of a specified channel.\nPrerequisites\nAn EMDI channel group has been created using the emdi channel-group command and a board group has been created using the emdi lpu-group command.\nPrecautions\nOne EMDI channel group can be bound to an EMDI board group in both the upstream and downstream directions or to two EMDI board groups, one in the upstream direction and the other in the downstream direction."
}