{
    "PageTitle": "reset emdi statistics history channel",
    "FuncDef": "The reset emdi statistics history channel command clears historical upstream statistics of a specified channel or all channels.\nThe reset emdi statistics history outbound channel command clears historical downstream statistics of a specified channel or all channels.",
    "CLIs": [
        "reset emdi statistics history channel [ <channel-name> ]",
        "reset emdi statistics history outbound channel [ <channel-name> ] slot <slot-id>"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "channel-name",
            "Info": "Specifies the name of a channel.\nThe name is a string of 1 to 31 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "outbound",
            "Info": "Clears historical downstream statistics of an EMDI channel.\n-"
        },
        {
            "Parameters": "channel",
            "Info": "Specifies a channel.\n-"
        },
        {
            "Parameters": "slot slot-id",
            "Info": "Specifies a slot ID.\nThe value is a string of 1 to 15 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset emdi statistics history channel 2"
        ],
        [
            "<HUAWEI> reset emdi statistics history outbound channel 2 slot 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA lot of historical statistics are generated after the EMDI detection solution is used to implement monitoring for multiple periods, which exerts interference for record viewing. To avoid interference of useless records, run the reset emdi statistics history channel command to clear historical upstream statistics of a specified channel or all channels and run the reset emdi statistics history outbound channel command to clear historical downstream statistics of a specified channel or all channels. If the channel-name parameter is specified, the historical statistics of a specified channel are cleared. If the channel-name is not specified, historical statistics of all channels are cleared.\nConfiguration Impact\nThe cleared historical statistics of a specified channel or all channels cannot be restored."
}