{
    "PageTitle": "assign instance",
    "FuncDef": "The assign instance command adds a multicast NAT instance to a multicast NAT instance group.\nThe undo assign instance command deletes a multicast NAT instance from a multicast NAT instance group.\nBy default, no multicast NAT instance is configured in a multicast NAT instance group.",
    "CLIs": [
        "assign instance id <instance-id> [ name <instance-name> ] part <part-id> [ type { video-stream | audio-stream | ancillary-data } ]",
        "undo assign instance id <instance-id> [ name <instance-name> ] part <part-id> [ type { video-stream | audio-stream | ancillary-data } ]"
    ],
    "ParentView": [
        "multicast-nat-instance-group"
    ],
    "ParaDef": [
        {
            "Parameters": "name instance-name",
            "Info": "Specifies the name of a multicast NAT instance.\nThe value is a string of 1 to 127 case-sensitive characters. It cannot contain spaces."
        },
        {
            "Parameters": "part part-id",
            "Info": "Specifies the number of a multicast NAT instance in a multicast NAT instance group.\nThe value is an integer ranging from 1 to 16."
        },
        {
            "Parameters": "type",
            "Info": "Indicates a media stream type. Set this parameter if a multicast NAT instance is added to a multicast NAT instance group.\n-"
        },
        {
            "Parameters": "video-stream",
            "Info": "Sets the type to video-stream.\n-"
        },
        {
            "Parameters": "audio-stream",
            "Info": "Sets the type to audio-stream.\n-"
        },
        {
            "Parameters": "ancillary-data",
            "Info": "Sets the type to ancillary-data.\n-"
        },
        {
            "Parameters": "id instance-id",
            "Info": "Specifies the ID of a multicast NAT instance.\nThe value is an integer ranging from 1 to 16000."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast-nat enable",
            "[*HUAWEI] multicast-nat instance id 1 name stream1",
            "[*HUAWEI-multicast-nat-instance-1] multicast-nat instance id 2 name stream2",
            "[*HUAWEI-multicast-nat-instance-2] quit",
            "[*HUAWEI] multicast-nat instance-group id 1 name group1",
            "[*HUAWEI-multicast-nat-instance-group-1] assign instance id 1 part 1 type video-stream",
            "[*HUAWEI-multicast-nat-instance-group-1] assign instance id 2 part 2 type audio-stream"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast-nat enable",
            "[*HUAWEI] multicast-nat instance id 1 name stream1",
            "[*HUAWEI-multicast-nat-instance-1] multicast-nat instance id 2 name stream2",
            "[*HUAWEI-multicast-nat-instance-2] quit",
            "[*HUAWEI] multicast-nat instance-group id 1 name group1",
            "[*HUAWEI-multicast-nat-instance-group-1] assign instance id 1 part 1",
            "[*HUAWEI-multicast-nat-instance-group-1] assign instance id 2 part 2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn multicast NAT, to translate an input multicast stream into output multicast streams, create a multicast NAT instance and then associate the input multicast stream with the multicast NAT instance. If there are multiple input multicast streams (that is, multiple multicast NAT instances exist) and you want to place the streams together based on unified rules, you can create a multicast NAT instance group and add those multicast NAT instances to the group. To add a multicast NAT instance to a multicast NAT instance group, run the assign instance command.\nPrerequisites\nMulticast NAT has been globally enabled using the multicast-nat enable command.\nA multicast NAT instance has been created using the multicast-nat instance command.\nA multicast NAT instance group has been created using the multicast-nat instance group command.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nIf none of video-stream, audio-stream, and ancillary-data is specified, the default stream type is retained when a multicast NAT instance is added to a multicast NAT instance group.\nBefore adding multicast NAT instances to a multicast NAT instance group, you must either specify the type of media streams or retain the default stream type for the multicast NAT instance group."
}