{
    "PageTitle": "multicast-nat bind instance",
    "FuncDef": "The multicast-nat bind instance command binds a multicast NAT instance to a traffic behavior.\nThe undo multicast-nat bind instance command unbinds a multicast NAT instance from a traffic behavior.\nBy default, no multicast NAT instance is bound to a traffic behavior.",
    "CLIs": [
        "multicast-nat bind instance id <instance-id> [ name <instance-name> ]",
        "undo multicast-nat bind instance id <instance-id> [ name <instance-name> ]"
    ],
    "ParentView": [
        "Traffic behavior view"
    ],
    "ParaDef": [
        {
            "Parameters": "name instance-name",
            "Info": "Specifies the name of a multicast NAT instance.\nThe value is a string of 1 to 127 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "id instance-id",
            "Info": "Specifies the ID of a multicast NAT instance.\nThe value is an integer ranging from 1 to 16000."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[*HUAWEI] multicast-nat enable",
            "[*HUAWEI] multicast-nat instance id 1 name stream1",
            "[*HUAWEI] traffic behavior behavior1",
            "[*HUAWEI-behavior-behavior1] multicast-nat bind instance id 1 name stream1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn multicast NAT, to translate an input multicast stream into output multicast streams, you must create a multicast NAT instance. To bind a multicast NAT instance to a traffic behavior in a traffic policy, run the multicast-nat bind instance command in the traffic behavior view. After the traffic policy is applied on the inbound interface of multicast streams, input multicast streams are associated with the multicast NAT instance.\nFollow-up Procedure\nApply the traffic policy on the inbound interface of multicast streams, so that input multicast streams are associated with the multicast NAT instance.\nPrecautions\nThis command is supported only in the admin VS."
}