{
    "PageTitle": "multicast-nat outbound",
    "FuncDef": "The multicast-nat outbound command enables multicast stream translation on an outbound interface and configures multicast stream translation parameters.\nThe undo multicast-nat outbound command disables multicast stream translation on an outbound interface and restores the initial multicast stream parameters.\nBy default, no multicast stream translation is configured on outbound interfaces.",
    "CLIs": [
        "multicast-nat outbound id <outbound-id> [ name <outbound-name> ] [ src-mac auto-translate ] [ src-ip <source-address> ] [ dst-ip <destination-address> ] [ src-udp-port <source-port> ] [ dst-udp-port <port> ] [ rtp-ssrc auto-translate ] [ rtp-sn auto-translate [ rtp-ext-sn auto-translate ] ]",
        "undo multicast-nat outbound id <outbound-id> [ name <outbound-name> ] [ src-mac auto-translate ] [ src-ip <source-address> ] [ dst-ip <destination-address> ] [ src-udp-port <source-port> ] [ dst-udp-port <port> ] [ rtp-ssrc auto-translate ] [ rtp-sn auto-translate [ rtp-ext-sn auto-translate ] ]"
    ],
    "ParentView": [
        "100GE interface view",
        "10GE interface view",
        "25GE interface view",
        "400GE interface view",
        "40GE interface view",
        "50GE interface view",
        "GE interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "name outbound-name",
            "Info": "Specifies the name of an output multicast stream on an outbound interface.\nThe value is a string of 1 to 127 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "src-mac",
            "Info": "Indicates the post-translation MAC address of a multicast stream on an outbound interface.\nThe value is the MAC address of an outbound interface."
        },
        {
            "Parameters": "auto-translate",
            "Info": "Auto translate.\n-"
        },
        {
            "Parameters": "src-ip source-address",
            "Info": "Specifies the post-translation source IP address of a multicast stream on an outbound interface.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "dst-ip destination-address",
            "Info": "Specifies the post-translation destination IP address of a multicast stream on an outbound interface.\nThe value ranges from 224.0.1.0 to 239.255.255.255, in dotted decimal notation."
        },
        {
            "Parameters": "src-udp-port source-port",
            "Info": "Specifies the post-translation source port number of a multicast stream on an outbound interface.\nThe value is an integer ranging from 0 to 65535."
        },
        {
            "Parameters": "dst-udp-port port",
            "Info": "Specifies the post-translation destination port number of a multicast stream on an outbound interface.\nThe value is an integer ranging from 0 to 65535."
        },
        {
            "Parameters": "rtp-ssrc",
            "Info": "Indicates that the synchronization source field of multicast streams is automatically translated.\n-"
        },
        {
            "Parameters": "rtp-sn",
            "Info": "Indicates that the sequence number of multicast streams is automatically translated.\n-"
        },
        {
            "Parameters": "rtp-ext-sn",
            "Info": "Indicates that the extended sequence number of multicast streams is automatically translated.\n-"
        },
        {
            "Parameters": "id outbound-id",
            "Info": "Specifies the ID of an output multicast stream on an outbound interface.\nThe value is an integer ranging from 1 to 16000."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast-nat enable",
            "[*HUAWEI] interface GigabitEthernet 1/0/1",
            "[*HUAWEI-GigabitEthernet1/0/1] multicast-nat outbound id 1 name out1 src-mac auto-translate src-ip 10.0.0.1 dst-ip 225.0.0.1 dst-udp-port 100"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo translate a multicast stream's characteristics (source IP address, destination IP address, and UDP destination port number), run the multicast-nat outbound command to configure multicast stream translation parameters on an outbound interface. To perform clean switching on an input multicast stream, run the command to enable the system to automatically translate the synchronization source field, sequence number, and extended sequence number of the multicast stream according to a media gateway's needs.\nPrerequisites\nMulticast NAT has been globally enabled using the multicast-nat enable command.\nPrecautions\nThis command is supported only in the admin VS."
}