{
    "PageTitle": "set multicast-nat bind",
    "FuncDef": "The set multicast-nat bind command fast switches the binding between a multicast NAT output stream and multicast NAT instance in the multicast NAT binding view.",
    "CLIs": [
        "set multicast-nat outbound-id <outbound-id-value> bind instance-id <instance-id-value> [ clean-switch [ first-field | second-field ] ] fast-mode"
    ],
    "ParentView": [
        "multicast-nat-bind-list"
    ],
    "ParaDef": [
        {
            "Parameters": "instance-id instance-id-value",
            "Info": "Specifies the ID of a multicast NAT instance.\nThe value is an integer that ranges from 1 to 16000."
        },
        {
            "Parameters": "clean-switch",
            "Info": "Sets the switching mode of multicast NAT to clean switching.\n-"
        },
        {
            "Parameters": "first-field",
            "Info": "Sets the first field for multicast NAT's switching.\n-"
        },
        {
            "Parameters": "second-field",
            "Info": "Sets the second field for multicast NAT's switching.\n-"
        },
        {
            "Parameters": "fast-mode",
            "Info": "Sets the switching mode of multicast NAT to fast switching.\n-"
        },
        {
            "Parameters": "outbound-id outbound-id-value",
            "Info": "Specifies the ID of a multicast NAT output stream.\nThe value is an integer that ranges from 1 to 16000."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast-nat enable",
            "[*HUAWEI] multicast-nat instance id 1 name stream1",
            "[*HUAWEI-multicast-nat-instance-1] quit",
            "[*HUAWEI] multicast-nat instance id 2 name stream2",
            "[*HUAWEI-multicast-nat-instance-2] quit",
            "[*HUAWEI] interface GigabitEthernet 1/0/1",
            "[*HUAWEI-GigabitEthernet1/0/1] multicast-nat outbound id 1 name out1 src-mac auto-translate src-ip 10.0.0.1 dst-ip 225.0.0.1 dst-udp-port 100",
            "[*HUAWEI] multicast-nat bind-list",
            "[*HUAWEI-multicast-nat-bind-list] multicast-nat outbound id 1 name out1 bind instance id 1 name stream1 switch-mode clean-switch switch-field first-field fast-mode",
            "[*HUAWEI-multicast-nat-bind-list] commit",
            "[~HUAWEI-multicast-nat-bind-list] set multicast-nat outbound-id 1 bind instance-id 2 clean-switch first-field fast-mode"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo fast switch the binding between a multicast NAT output stream and multicast NAT instance, run the set multicast nat bind fast switch command in the multicast NAT binding view.\nThis command takes effect only when fast switching is configured for the binding between a multicast NAT output stream and multicast NAT instance. No configuration is generated in the configuration file."
}