{
    "PageTitle": "encode",
    "FuncDef": "This command configures an HTTP header enrichment template field static string.",
    "CLIs": [
        "encode type <type> key <key>",
        "encode type <type> key <hash-key> hash",
        "encode type <type> key <hash2-key> hash2",
        "encode type <type> cert-profile <cert-profile-name>",
        "no encode"
    ],
    "ParentView": [
        "config>app-assure>group>http-enrich>field"
    ],
    "ParaDef": [
        {
            "Parameters": "type",
            "Info": "Specifies whether the parameters are hashed with MD5 or encrypted with RC4 using the configured key, or if certificate-based encryption is used with RSA. Values-md5, rc4, certificate."
        },
        {
            "Parameters": "key",
            "Info": "Specifies the key string, 64 characters maximum."
        },
        {
            "Parameters": "hash-key",
            "Info": "Specifies the first hashed key."
        },
        {
            "Parameters": "hash-key2",
            "Info": "Specifies the second hashed key."
        },
        {
            "Parameters": "hash",
            "Info": "Specifies the key is entered in an encrypted form. If the hash or hash2 parameter is not used, the key is assumed to be in an unencrypted, clear text form. For security, all keys are stored in encrypted form in the configuration file with the hash or hash2 parameter specified."
        },
        {
            "Parameters": "hash2",
            "Info": "Specifies the key is entered in a more complex encrypted form that involves more variables than the key value alone, meaning that the hash2 encrypted variable cannot be copied and pasted. If the hash or hash2 parameter is not used, the key is assumed to be in an unencrypted, clear text form. For security, all keys are stored in encrypted form in the configuration file with the hash or hash2 parameter specified."
        },
        {
            "Parameters": "cert-profile-name",
            "Info": "Specifies the name of the certificate profile to be used. This profile must have already been created using the certificate-profile command."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: no static-string"
}