{
    "PageTitle": "segment-routing ipv6 egress-engineering locator",
    "FuncDef": "The segment-routing ipv6 egress-engineering locator command enables a device to allocate a locator to all its BGP EPE peers.\nThe undo segment-routing ipv6 egress-engineering locator command disables a device from allocating a locator to any of its BGP EPE peers.\nBy default, a device is not enabled to allocate a locator to any of its BGP EPE peers.",
    "CLIs": [
        "segment-routing ipv6 egress-engineering locator <locator-name>",
        "undo segment-routing ipv6 egress-engineering locator [ <locator-name> ]"
    ],
    "ParentView": [
        "BGP view"
    ],
    "ParaDef": [
        {
            "Parameters": "locator-name",
            "Info": "Specifies the name of a SID node route locator, which was configured through the locator command.\nThe value is a string of 1 to 31 case-sensitive characters. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] segment-routing ipv6",
            "[*HUAWEI-segment-routing-ipv6] locator test ipv6-prefix 30::1 64 static 32",
            "[*HUAWEI-segment-routing-ipv6-locator] quit",
            "[*HUAWEI-segment-routing-ipv6] quit",
            "[*HUAWEI] bgp 100",
            "[*HUAWEI-bgp] segment-routing ipv6 egress-engineering locator test"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBGP is a dynamic routing protocol used between ASs. BGP EPE is an extension of BGP for SR and is used to implement source routing between ASs.\nBGP EPE can allocate BGP peer SIDs to inter-AS paths, and the peer SIDs can then be advertised to a network controller through extended BGP LS functions. The controller orchestrates IGP SIDs and BGP peer SIDs to implement inter-AS forwarding over the optimal path.\nAfter the segment-routing ipv6 egress-engineering locator command is run on a device, the device can allocate peer node segment (peer-node SID) and peer adjacency segment (peer-Adj SID) values to all its peers enabled with BGP EPE.\nA peer-node SID identifies a peer node.A Peer-Adj SID identifies an adjacency to a peer.\n\nPrecautions\nIf a locator is specified in the peer egress-engineering srv6 locator command, BGP EPE allocates SIDs from this locator to peers. If no locator is specified in the peer egress-engineering srv6 locator command, BGP EPE uses the locator specified in the segment-routing ipv6 egress-engineering locator command for allocation."
}