{
    "PageTitle": "segment-routing ipv6 locator (OSPFv3 view)",
    "FuncDef": "The segment-routing ipv6 locator command enables OSPFv3 to support SRv6.\nThe undo segment-routing ipv6 locator command disables OSPFv3 from supporting SRv6.\nBy default, OSPFv3 does not support SRv6.",
    "CLIs": [
        "segment-routing ipv6 locator <locator-name> auto-sid-disable",
        "undo segment-routing ipv6 locator <locator-name> auto-sid-disable"
    ],
    "ParentView": [
        "OSPFv3 view"
    ],
    "ParaDef": [
        {
            "Parameters": "auto-sid-disable",
            "Info": "Cancel SID automatic allocation ability.\n-"
        },
        {
            "Parameters": "locator locator-name",
            "Info": "Specifies the name of a locator. After the locator is specified, OSPFv3 can advertise intra-area LSAs carrying information about the IPv6 prefix configured for the locator, and deliver the Null0 route with this IPv6 prefix to the local routing table.\nThe value is a string of 1 to 31 case-sensitive characters. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] segment-routing ipv6",
            "[*HUAWEI-segment-routing-ipv6] locator test1 ipv6-prefix 100::1 64 static 32",
            "[*HUAWEI-segment-routing-ipv6-locator] quit",
            "[*HUAWEI-segment-routing-ipv6] quit",
            "[*HUAWEI] ospfv3 1",
            "[*HUAWEI-ospfv3-1] segment-routing ipv6 locator test1 auto-sid-disable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn a scenario that uses OSPFv3 on the public network, for example an SRv6 BE scenario, to enable OSPFv3 SRv6, run the segment-routing ipv6 locator command. After the command is run, OSPFv3 can advertise intra-area LSAs carrying information about the IPv6 prefix configured for the locator, and deliver the Null0 route with this IPv6 prefix to the local routing table. Currently, OSPFv3 cannot be used to allocate or advertise SRv6 SIDs in such a scenario.\nPrerequisites\nBefore configuring the segment-routing ipv6 locator command, complete the following configuration:\nRun the segment-routing ipv6 command in the system view to enable global SRv6.Run the command locator ipv6-prefix command in the segment-routing ipv6 view to configure a locator."
}