{
    "PageTitle": "segment-routing ipv6 locator (IS-IS view)",
    "FuncDef": "The segment-routing ipv6 locator command enables the IS-IS SRv6 function.\nThe undo segment-routing ipv6 locator command disables the IS-IS SRv6 function.\nBy default, the IS-IS SRv6 function is disabled.",
    "CLIs": [
        "segment-routing ipv6 locator <locator-name> [ auto-sid-disable ]",
        "undo segment-routing ipv6 locator <locator-name> [ auto-sid-disable ]"
    ],
    "ParentView": [
        "IS-IS view"
    ],
    "ParaDef": [
        {
            "Parameters": "locator-name",
            "Info": "Specifies the name of a SID node route locator, which was configured through the locator command.\nAfter you configure the locator-name parameter, IS-IS allows static End and End.X SIDs to be imported from the configured locator-name.\nThe value is a string of 1 to 31 case-sensitive characters. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "auto-sid-disable",
            "Info": "Disables the dynamic assignment of End and End.X SIDs.\nIf the auto-sid-disable parameter is configured to disable the dynamic assignment of End and End.X SIDs, these SIDs are imported only from a specified locator.\nIf the auto-sid-disable parameter is not configured, End and End.X SIDs can be dynamically assigned. If static End and End.X SIDs exist, the static SIDs are used. If no static SIDs exist, dynamically assigned End and End.X SIDs are used.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] segment-routing ipv6",
            "[*HUAWEI-segment-routing-ipv6] locator test1 ipv6-prefix 100:: 64 static 32",
            "[*HUAWEI-segment-routing-ipv6-locator] quit",
            "[*HUAWEI-segment-routing-ipv6] quit",
            "[*HUAWEI] isis 1",
            "[*HUAWEI-isis-1] ipv6 enable",
            "[*HUAWEI-isis-1] cost-style wide",
            "[*HUAWEI-isis-1] segment-routing ipv6 locator test1 auto-sid-disable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn SRv6 scenarios, after the IS-IS SRv6 function is enabled, End and End.X SIDs are generated preferentially based on the specified locator. Each SRv6 SID generated by IS-IS is added to the local SID table on the device and also advertised externally through IS-IS LSP packets.\nThe command function varies according to the parameters configured in the command. Detailed command functions are as follows:\nThe segment-routing ipv6 locator locator-name command enables the IS-IS SRv6 function and dynamic SID assignment. SIDs must be assigned within the locator range specified using the locator parameter.The segment-routing ipv6 locator locator-name auto-sid-disable command enables the IS-IS SRv6 function but disables dynamic SID assignment. SIDs must be assigned within the locator range specified using the locator parameter.The undo segment-routing ipv6 locator locator-name [ auto-sid-disable ] command deletes all the dynamic and static SIDs assigned by IS-IS within the specified locator range. The auto-sid-disable parameter is optional. The configuration effect is not affected no matter whether this parameter is configured.\nIf a static operation code is configured, it is preferentially used for SID generation. If no static operation code is configured, operation codes are dynamically assigned. The process of generating SRv6 SIDs through IS-IS is as follows:\nConfigure a locator segment in the Segment Routing IPv6 view, and run the segment-routing ipv6 locator command in the IS-IS view to enable SRv6 and reference the locator. An IS-IS process can reference multiple locators, and the locator names cannot be modified directly. Instead, the locator names can be reconfigured. If multiple locators are configured, only one of the locators advertise the End and End.X SIDs.IS-IS generates End SIDs for all locators based on the dynamic operation code segment specified in locator configurations. Both penultimate segment pop of the SRH (PSP) and non-PSP SIDs are generated.Configure an IPv6 address for the desired interface, enable IS-IS IPv6, and generate End.X SIDs for the interface through IS-IS. SIDs are generated based on the dynamic operation code segment specified in locator configurations. Both PSP and non-PSP SIDs are generated.\n\nPrerequisites\nBefore you run the segment-routing ipv6 locator command, ensure that the following commands have been run:\nipv6 enable: enables IPv6 for the IS-IS process.cost-style wide: sets the IS-IS cost type to wide.\n\nPrecautions\nAfter the undo segment-routing ipv6 locator command is configured, IS-IS does not support the assignment and advertisement of SRv6 SIDs."
}