{
    "PageTitle": "loop-detect only-alarm",
    "FuncDef": "The loop-detect only-alarm command configures an interface with loop detection enabled to report an alarm only if it detects a loop, without blocking itself.\nThe undo loop-detect only-alarm command restores the default configuration.\nBy default, an interface with loop detection enabled reports an alarm if it detects a loop and blocks itself.",
    "CLIs": [
        "loop-detect only-alarm",
        "undo loop-detect only-alarm"
    ],
    "ParentView": [
        "Eth-Trunk sub-interface view",
        "Eth-Trunk interface view",
        "GE sub-interface view",
        "GE interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] loop-detection enable",
            "[*HUAWEI] commit",
            "[~HUAWEI] interface GigabitEthernet1/0/0.1",
            "[*HUAWEI-GigabitEthernet1/0/0.1] loop-detect enable",
            "[*HUAWEI-GigabitEthernet1/0/0.1] loop-detect only-alarm"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter a device interface detects a loop using the loop detection mechanism, you can run the loop-detect only-alarm command to configure the device interface to report an alarm only if a loop is detected, without blocking itself. This command helps users to flexibly select a processing mode after loop detection.\nPrerequisites\nL2VPN loop detection has been enabled globally using the loop-detection enable command, and loop detection has been enabled on an interface.\nConfiguration Impact\nAfter the loop-detect only-alarm command is run on an interface, if the interface detects a loop, it reports an alarm only and does not block the loop interface. The command configuration has the following impacts:\nIf a loop is detected on an interface after the loop-detect only-alarm command is run on the interface, the interface reports an alarm only and does not block itself.If the loop-detect only-alarm command is run on an interface on which a loop has been detected, blocking on the interface is disabled. In this case, if the undo loop-detect only-alarm command is run to restore the default configuration on the interface, block the interface again to prevent the loop."
}