{
    "PageTitle": "loop-detect detection pe-vid ce-vid",
    "FuncDef": "The loop-detect detection pe-vid ce-vid command specifies a VLAN range for a sub-interface for QinQ VLAN tag termination to send loop detection packets.\nThe undo loop-detect detection pe-vid ce-vid command deletes the VLAN range specified for a sub-interface for QinQ VLAN tag termination to send loop detection packets.\nBy default, a sub-interface for QinQ VLAN tag termination can send loop detection packets to all VLANs configured on the sub-interface.",
    "CLIs": [
        "loop-detect detection pe-vid <pe-vid> ce-vid <low-vid> [ to <high-vid> ]",
        "undo loop-detect detection pe-vid <pe-vid> ce-vid <low-vid> [ to <high-vid> ]"
    ],
    "ParentView": [
        "Eth-Trunk sub-interface view",
        "GE sub-interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "pe-vid",
            "Info": "Specifies the outer VLAN to which a sub-interface for QinQ VLAN tag termination can send loop detection packets.\nThe value is an integer ranging from 1 to 4094."
        },
        {
            "Parameters": "low-vid",
            "Info": "Specifies the start VLAN ID carried in loop detection packets.\nThe value is an integer ranging from 1 to 4094."
        },
        {
            "Parameters": "to high-vid",
            "Info": "Specifies the end VLAN ID carried in loop detection packets.\nThe value is an integer ranging from 1 to 4094. The value of high-vid must be greater than the value of low-vid."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] loop-detection enable",
            "[*HUAWEI] interface GigabitEthernet 1/0/0.2",
            "[*HUAWEI-GigabitEthernet1/0/0.2] control-vid 3 qinq-termination",
            "[*HUAWEI-GigabitEthernet1/0/0.2] qinq termination pe-vid 100 ce-vid 1 to 1000",
            "[*HUAWEI-GigabitEthernet1/0/0.2] loop-detect enable",
            "[*HUAWEI-GigabitEthernet1/0/0.2] loop-detect detection pe-vid 100 ce-vid 3 to 100"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe loop-detect detection pe-vid ce-vid command can be configured on a sub-interface for QinQ VLAN tag termination only after loop detection is enabled globally and the loop-detect enable command is configured on the VPLS AC interface.\nThis command applies only to sub-interfaces for QinQ VLAN tag termination. By default, a sub-interface for QinQ VLAN tag termination sends loop detection packets to all configured VLANs to detect intra-VLAN loops. This command allows you to specify the VLAN range to which a sub-interface for QinQ VLAN tag termination can send loop detection packets."
}