{
    "PageTitle": "loop-detect detection vid",
    "FuncDef": "The loop-detect detection vid command sets a VLAN range for a sub-interface for dot1q VLAN tag termination and its main interface to send loop detection packets.\nThe undo loop-detect detection vid command deletes the VLAN range specified for a sub-interface for dot1q VLAN tag termination and its main interface to send loop detection packets.\nBy default, a sub-interface for dot1q VLAN tag termination can send loop detection packets to all VLANs configured on the sub-interface, whereas its main interface sends only untagged VLAN packets and packets with the VLAN ID being 0.",
    "CLIs": [
        "loop-detect detection vid <low-vid> [ to <high-vid> ]",
        "undo loop-detect detection vid <low-vid> [ to <high-vid> ]"
    ],
    "ParentView": [
        "Eth-Trunk sub-interface view",
        "Eth-Trunk interface view",
        "GE sub-interface view",
        "GE interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "low-vid",
            "Info": "Specifies the start VLAN ID carried in loop detection packets.\nThe value is an integer ranging from 1 to 4094."
        },
        {
            "Parameters": "to high-vid",
            "Info": "Specifies the end VLAN ID carried in loop detection packets.\nThe value is an integer ranging from 1 to 4094. The value of high-vid must be greater than that of low-vid."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] loop-detection enable",
            "[*HUAWEI] interface GigabitEthernet 1/0/0.1",
            "[*HUAWEI-GigabitEthernet1/0/0.1] control-vid 3 dot1q-termination",
            "[*HUAWEI-GigabitEthernet1/0/0.1] dot1q termination vid 1 to 100",
            "[*HUAWEI-GigabitEthernet1/0/0.1] loop-detect enable",
            "[*HUAWEI-GigabitEthernet1/0/0.1] loop-detect detection vid 3 to 100"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] loop-detection enable",
            "[*HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] loop-detect enable",
            "[*HUAWEI-GigabitEthernet1/0/0] loop-detect detection vid 3 to 100"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe loop-detect detection vid command can be run on a sub-interface for dot1q VLAN tag termination and its main interface only after loop detection is enabled globally and the loop-detect enable command is run on the VPLS AC interface.\nThe loop-detect detection vid command applies only to sub-interfaces for dot1q VLAN tag termination and its main interface. By default, a sub-interface for dot1q VLAN tag termination sends loop detection packets to all configured VLANs to detect intra-VLAN loops. This command allows you to specify the VLAN range to which a sub-interface for dot1q VLAN tag termination can send loop detection packets. By default, a main interface sends only untagged VLAN packets and packets with the VLAN ID being 0. After this command is run on a main interface, the interface sends loop detection packets with a specified VLAN range in addition to the untagged VLAN packets and packets with the VLAN ID being 0."
}