{
    "PageTitle": "loop-detect identifier",
    "FuncDef": "The loop-detect identifier command configures an authentication identifier for L2VPN loop detection on an interface.\nThe undo loop-detect identifier command deletes the configured authentication identifier for L2VPN loop detection on an interface.\nBy default, no authentication identifier for L2VPN loop detection is configured on an interface.",
    "CLIs": [
        "loop-detect identifier <identifier-value>",
        "undo loop-detect identifier [ <identifier-value> ]"
    ],
    "ParentView": [
        "Eth-Trunk sub-interface view",
        "Eth-Trunk interface view",
        "GE sub-interface view",
        "GE interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "identifier-value",
            "Info": "Specifies an authentication identifier.\nThe name is a string of 1 to 16 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] loop-detection enable",
            "[~HUAWEI] interface GigabitEthernet1/0/0.1",
            "[~HUAWEI-GigabitEthernet1/0/0.1] loop-detect enable",
            "[*HUAWEI-GigabitEthernet1/0/0.1] loop-detect identifier abc"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nL2VPN loop detection detects whether a loop exists between the AC interfaces of two PEs on a VPLS or VLL network when a CE is dual-homed to the PEs. To prevent an AC interface from being unexpectedly blocked, run the loop-detect identifier command on the two PEs to configure the same authentication identifier. After a PE receives a detection packet, it checks whether the identifier in the packet is the same as its local one. The PE considers the packet valid only when the identifiers are the same.\nPrerequisites\nL2VPN loop detection has been enabled globally and on an interface.\nPrecautions\nThe loop-detect identifier command takes effect only for L2VPN loop detection.\nIf an authentication identifier for L2VPN loop detection is configured in both the interface view and global view, the configuration in the interface view is preferentially used.\nAfter an authentication identifier is configured on the local device, if the identifier in the detection packet received from a peer device is different from the local one, the local device discards the packet."
}