{
    "PageTitle": "mapping-path",
    "FuncDef": "The mapping-path command configures a mapping mode for client signals.\nThe undo mapping-path command restores the default configuration.\nBy default, the mapping mode is defined by GSup43 7.3.",
    "CLIs": [
        "mapping-path { opu2-standard | opu2-non-standard | opu2e }",
        "undo mapping-path"
    ],
    "ParentView": [
        "WDM interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "opu2-standard",
            "Info": "Configures the standard mapping defined in section 6.2 of G.Sup43.\n-"
        },
        {
            "Parameters": "opu2-non-standard",
            "Info": "Configures the non-standard mapping defined in section 7.3 of G.Sup43.\n-"
        },
        {
            "Parameters": "opu2e",
            "Info": "Configures the mapping defined in section 7.1 of G.Sup43.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] controller wdm 1/0/0",
            "[~HUAWEI-Wdm1/0/0] mapping-path opu2e"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA WDM interface consists of controller WDM and its GE interface. All optical and OTN parameters of the WDM interface are configured on the GE interface. The service signal mapping mode on the interface is Ethernet over OTN. Service signals of a 10GE interface can be mapped to an OTN channel in different ways. When a Huawei device connects to a non-Huawei device, run the mapping-path command to configure a mapping mode for the client signals of the Huawei device, so that the two interconnected interfaces have the same mapping mode.\nPrerequisites\nThe undo shutdown, loopback, clock, and ptp command configurations have been cleared from the Ethernet interface that the WDM interface corresponds to.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nInterfaces that have different mapping modes cannot communicate with each other. The mapping-path command can be run only on 10GE OTN subcards.\nAfter the mapping-path command is run, the original WDM configuration is automatically cleared."
}