{
    "PageTitle": "otn prefec-tca",
    "FuncDef": "The otn prefec-tca command configures an alarm threshold and detection interval for FEC bit error ratio detection on an optical transport network (OTN).\nThe undo otn prefec-tca command restores the default configuration for FEC bit error ratio detection.\nBy default, FEC bit error ratio detection is enabled.  In this case, the default detection period and threshold are used, the default detection period is 3s, and the default recovery detection period is 30s.You can run the display interface phy-option command to view the default alarm association threshold and alarm clearing threshold.",
    "CLIs": [
        "otn prefec-tca trigger-threshold <trigger-coefficient> <trigger-power> trigger-interval <trigger-time-interval> [ recover-threshold <recover-coefficient> <recover-power> ] [ recover-interval <recover-time-interval> ]",
        "undo otn prefec-tca"
    ],
    "ParentView": [
        "WDM interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "trigger-coefficient",
            "Info": "Coefficient of the alarm association threshold for an FEC bit error ratio, that is x in xE-y.\nThe value is an integer that ranges from 1 to 9. The default value is 1."
        },
        {
            "Parameters": "trigger-power",
            "Info": "Power of the alarm association threshold for an FEC bit error ratio, that is y in xE-y.\nThe value is an integer that ranges from 1 to 7 .The default value is 6."
        },
        {
            "Parameters": "trigger-interval trigger-time-interval",
            "Info": "Specifies an association detection interval.\nThe value is an integer ranging from 1 to 10, in seconds. The default value is 3s."
        },
        {
            "Parameters": "recover-threshold",
            "Info": "Specifies an alarm clearing threshold.\n-"
        },
        {
            "Parameters": "recover-coefficient",
            "Info": "Coefficient of the alarm clearing threshold for an FEC bit error ratio, that is x in xE-y.\nThe value is an integer that ranges from 1 to 9 .The default value is 1."
        },
        {
            "Parameters": "recover-power",
            "Info": "Power of the alarm clearing threshold for an FEC bit error ratio, that is y in xE-y.\nThe value is an integer that ranges from 1 to 8. The default value is 7."
        },
        {
            "Parameters": "recover-interval recover-time-interval",
            "Info": "Specifies a clearing detection interval.\nThe value is an integer ranging from 10 to 100, in seconds. The default value is 30s."
        },
        {
            "Parameters": "trigger-threshold",
            "Info": "Specifies an alarm association threshold.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] controller wdm 1/0/0",
            "[~HUAWEI-Wdm1/0/0] otn prefec-tca trigger-threshold 1 4 trigger-interval 5 recover-threshold 1 6 recover-interval 10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure an alarm threshold and detection interval for FEC bit error ratio detection on an OTN, run the otn prefec-tca command. By default, FEC bit error ratio detection is enabled. The default alarm thresholds and detection intervals are used. If the FEC bit error ratio exceeds a specified threshold, the device reports an FEC bit error ratio alarm to the NMS. When the FEC bit error ratio falls below a specified threshold, the device reports an FEC bit error ratio clear alarm to the NMS.\nTo associate FEC bit error detection with a WDM interface, the transmission-alarm down prefec-tca command must also be run.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nWhen the fec command is used to configure the FEC mode, the otn prefec-tca threshold is changed accordingly."
}