{
    "PageTitle": "card",
    "FuncDef": "This command monitors policer statistics in an ingress FP queue group.",
    "CLIs": [
        "card <slot-number> fp <fp-number> ingress { access | network } queue-group <queue-group-name> instance <instance-id> [ interval <seconds> ] [ repeat <repeat> ] policer <policer-id> [ absolute | percent-rate | <reference-rate> ]"
    ],
    "ParentView": [
        "monitor"
    ],
    "ParaDef": [
        {
            "Parameters": "slot-number",
            "Info": "Specifies the slot number associated with the queue group, expressed as an integer. Values-1 to 10."
        },
        {
            "Parameters": "fp-number",
            "Info": "Specifies the FP number associated with the queue group, expressed as an integer. Values-1 to 8."
        },
        {
            "Parameters": "ingress",
            "Info": "Displays policer statistics applied on the ingress FP."
        },
        {
            "Parameters": "access",
            "Info": "Displays policer statistics on the FP access."
        },
        {
            "Parameters": "network",
            "Info": "Displays policer statistics on the FP network."
        },
        {
            "Parameters": "queue-group-name",
            "Info": "Specifies the name of the queue group up to 32 characters in length."
        },
        {
            "Parameters": "instance-id",
            "Info": "Specifies the identification of a specific instance of the queue-group. Values-1 to 65535."
        },
        {
            "Parameters": "repeat",
            "Info": "Configures how many times the command is repeated. Values-1 to 999. ParamDefault: Default- 10"
        },
        {
            "Parameters": "policer-id",
            "Info": "Specifies the policer ID; must exist within the queue-group template applied to the ingress context of the forwarding plane. Values-1 to 32."
        },
        {
            "Parameters": "absolute",
            "Info": "Displays Raw statistics, without processing. No calculations are performed on the delta or rate statistics."
        },
        {
            "Parameters": "percent-rate",
            "Info": "Displays rate-per-second for each statistic based on the reference rate of 10G. Values-1 to 999. ParamDefault: Default- 10"
        },
        {
            "Parameters": "reference-rate",
            "Info": "Displays rate-per-second for each statistic as a percentage based on the reference rate specified. Values-100M, 1G, 10G, 40G, 100G, 400G. ParamDefault: Default- 10G"
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}