{
    "PageTitle": "customer",
    "FuncDef": "This command monitors scheduler statistics per customer multi-service-site. The first screen displays the current statistics related to the specified customer ID and customer site name. The subsequent statistical information listed for each interval is displayed as a delta to the previous display. When the keywordrateis specified, the rate-per-second for each statistic is displayed instead of the delta. \nMonitor commands are similar toshowcommands but only statistical information displays. These commands display selected statistics per the configured number of times at the interval specified.",
    "CLIs": [
        "customer <customer-id> site <customer-site-name> [ scheduler <scheduler-name> ] [ ingress | egress ] [ interval <seconds> ] [ repeat <repeat> ] [ absolute | rate ]"
    ],
    "ParentView": [
        "monitor>qos>scheduler-stats"
    ],
    "ParaDef": [
        {
            "Parameters": "customer-id",
            "Info": "Specifies the ID number to be associated with the customer, expressed as an integer. Values-1 to 2147483647."
        },
        {
            "Parameters": "customer-site-name",
            "Info": "Specifies the customer site, which is an anchor point for ingress and egress virtual scheduler hierarchy."
        },
        {
            "Parameters": "scheduler-name",
            "Info": "Specifies an existing scheduler-name. Scheduler names are configured in the config>qos>scheduler-policy>tier level context. This parameter is mandatory if the customer resides on a LAG in adapt-qoslink or port-fair mode. Values-An existing scheduler-name is in the form of a string up to 32 characters long composed of printable, 7-bit ASCII characters. If the string contains special characters (#, $, spaces, and so on), the entire string must be enclosed within double quotes.."
        },
        {
            "Parameters": "ingress",
            "Info": "Displays the customer s multi-service-site ingress scheduler policy."
        },
        {
            "Parameters": "egress",
            "Info": "Displays the customer s multi-service-site egress scheduler policy."
        },
        {
            "Parameters": "seconds",
            "Info": "Configures the interval for each display in seconds. Values-11 to 60. ParamDefault: Default- 11 seconds"
        },
        {
            "Parameters": "repeat",
            "Info": "Configures how many times the command is repeated. Values-1 to 999. ParamDefault: Default- 10"
        },
        {
            "Parameters": "absolute",
            "Info": "Displays raw statistics, without processing. No calculations are performed on the delta or rate statistics."
        },
        {
            "Parameters": "rate",
            "Info": "Displays rate-per-second for each statistic instead of the delta."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}