{
    "PageTitle": "ping",
    "FuncDef": "This command is the TCP/IP utility that is used to verify IP reachability.",
    "CLIs": [
        "ping { <ip-address> | <dns-name> } [ rapid | detail ] [ ttl <time-to-live> ] [ tos <type-of-service> ] [ size <bytes> ] [ pattern <pattern> ] [ source <ip-address> ] [ interval <centisecs> | <secs> ] [ { next-hop <ip-address> } | { interface <interface-name> } | bypass-routing ] [ count <requests> ] [ do-not-fragment ] [ router <router-instance> | service-name <service-name> ] [ timeout <timeout> ] [ fc <fc-name> ]"
    ],
    "ParentView": [
        "<global>"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address | dns-name",
            "Info": "Specifies the remote host to ping. The IP address or the DNS name (if DNS name resolution is configured) can be specified. Values-ipv4-address: a.b.c.d."
        },
        {
            "Parameters": "rapid | detail",
            "Info": "Specifies to send ping requests rapidly. The results are reported in a single message, not in individual messages for each ping request. By default, five ping requests are sent before the results are reported. To change the number of requests, include the count option."
        },
        {
            "Parameters": "time-to-live",
            "Info": "Specifies the IP Time To Live (TTL) value to include in the ping request, expressed as a decimal integer. Values-0 to 128. ParamDefault: Default- 64"
        },
        {
            "Parameters": "type-of-service",
            "Info": "Specifies the type-of-service (TOS) bits in the IP header of the ping packets, expressed as a decimal integer. Values-0 to 255. ParamDefault: Default- 0"
        },
        {
            "Parameters": "bytes",
            "Info": "Specifies the size in bytes of the ping request packets. Values-0 to 16384. ParamDefault: Default- 56 bytes (actually 64 bytes because 8 bytes of ICMP header data are added to the packet)"
        },
        {
            "Parameters": "pattern",
            "Info": "Specifies a 16-bit pattern string to include in the ping packet, expressed as a decimal integer. Values-0 to 65535. ParamDefault: Default- system-generated sequential pattern"
        },
        {
            "Parameters": "source ip-address",
            "Info": "Specifies the source IP address to use in the ping requests, in dotted decimal notation. Values-ipv4-address: a.b.c.d. ParamDefault: Default- The IP address of the egress IP interface."
        },
        {
            "Parameters": "centisecs | secs",
            "Info": "The interval between consecutive ping requests, expressed as a decimal integer. Values-1 to 10000 seconds; if \"rapid\" is selected, 1 to 10000 centiseconds. ParamDefault: Default- 1 second; if \"rapid\" is selected, 1 centisecond"
        },
        {
            "Parameters": "next-hop ip-address",
            "Info": "Disregards the routing table and will send this packet to the specified next hop address. This address must be on an adjacent router that is attached to a subnet that is common between this and the next-hop router. Values-ipv4-address: a.b.c.d. ParamDefault: Default- Per the routing table."
        },
        {
            "Parameters": "interface-name",
            "Info": "Specifies the interface name. 32 characters maximum."
        },
        {
            "Parameters": "bypass-routing",
            "Info": "Sends the ping request to a host on a directly attached network bypassing the routing table. The host must be on a directly attached network or an error is returned."
        },
        {
            "Parameters": "requests",
            "Info": "Specifies the number of ping requests to send to the remote host, expressed as a decimal integer. Values-1 to 10000. ParamDefault: Default- 5"
        },
        {
            "Parameters": "do-not-fragment",
            "Info": "Specifies that the request frame should not be fragmented. This option is particularly useful in combination with the size parameter for maximum MTU determination (does not apply to ICMPv6)."
        },
        {
            "Parameters": "router-instance",
            "Info": "Specifies the router name, CPM router instance, or service ID. Values-router-instance: router name or service-id, |router-name|\"Base\" | \"management\" | cpm-vr-name | \"vpls-management\", |cpm-vr-name|[32 characters maximum], |vprn-service-id|1 to 2147483647. ParamDefault: Default- Base"
        },
        {
            "Parameters": "service-name",
            "Info": "Specifies the service name up to 64 characters in length."
        },
        {
            "Parameters": "timeout",
            "Info": "Specifies the timeout in seconds. Values-1 to 10. ParamDefault: Default- 5"
        },
        {
            "Parameters": "fc-name",
            "Info": "Specifies the forwarding class. Values-be, l2, af, l1, h2, ef, h1, nc. ParamDefault: Default- nc"
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}