{
    "PageTitle": "ssh",
    "FuncDef": "This command initiates a client SSH session with the remote host and is independent from the administrative or operational state of the SSH server. However, to be the target of an SSH session, the SSH server must be operational. This command also allows the user to initiate a SSH session, with a key re-exchange, based on maximum megabytes or minutes, whichever occurs first. If the re-exchange options are not set, the default behavior will not perform a key re-exchange.",
    "CLIs": [
        "ssh <host> [ -l <username> ] [ -v <ssh-version> ] [ router <router-instance> | service-name <service-name> ] [ re-exchange-min <minutes> ] [ re-exchange-mbyte <megabytes> ]"
    ],
    "ParentView": [
        "<global>"
    ],
    "ParaDef": [
        {
            "Parameters": "host",
            "Info": "Specifies the remote host for the SSH session. Values-host: user@hostname - [255 chars max], user |32 chars max, hostname |[dns-name | ipv4-address | ipv6-address], ipv4-address |a.b.c.d, ipv6-address |x:x:x:x:x:x:x:x[-interface], |x:x:x:x:x:x:d.d.d.d[-interface], |x - [0 to FFFF]H, |d - [0 to 255]D, |interface - 32 chars max, mandatory for link local addresses, dns-name|128 chars max."
        },
        {
            "Parameters": "username",
            "Info": "Specifies the user name to use when opening the SSH session; 32 characters maximum."
        },
        {
            "Parameters": "router-instance",
            "Info": "Specifies the router name or service ID. Values-router-instance: router-name or vprn-svc-id, |router-name|\"Base\", \"management\", \"vpls-management\", |vprn-svc-id|1 to 2147483647. ParamDefault: Default- Base"
        },
        {
            "Parameters": "service-name",
            "Info": "Specifies the service name up to 64 characters in length."
        },
        {
            "Parameters": "minutes",
            "Info": "Specifies the time interval after which the SSH client will initiate the                        key-re-exchange. Values-1 to 1440 minutes."
        },
        {
            "Parameters": "megabytes",
            "Info": "Specifies the number of megabytes, on a SSH session, after which the SSH client will initiate the key re-exchange. Values-1 to 64000 megabytes."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}