{
    "PageTitle": "traceroute",
    "FuncDef": "The TCP/IP traceroute utility determines the route to a destination address. Note that aborting a traceroute with the<Ctrl-C>command could require issuing a second<Ctrl-C>command before the prompt is returned.",
    "CLIs": [
        "traceroute { <ip-address> | <dns-name> } [ ttl <ttl> ] [ wait <milliseconds> ] [ no-dns ] [ source <ip-address> ] [ tos <type-of-service> ] [ router <router-instance> | service-name <service-name> ] [ detail ]"
    ],
    "ParentView": [
        "<global>"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address | dns-name",
            "Info": "Specifies the remote address to traceroute. The IP address or the DNS name (if DNS name resolution is configured) can be specified. Values-ipv4-address|a.b.c.d|, ipv6-address |x:x:x:x:x:x:x:x[-interface]x:x:x:x:x:x:d.d.d.d[-interface]|x:   [0 to FFFF]Hd:   [0 to 255]D, dns-name |63 characters maximum|."
        },
        {
            "Parameters": "ttl",
            "Info": "Specifies the maximum time-to-live (TTL) value to include in the traceroute request, expressed as a decimal integer. Values-1 to 255. ParamDefault: Default- 30 hops"
        },
        {
            "Parameters": "milliseconds",
            "Info": "Specifies the time in milliseconds to wait for a response to a probe, expressed as a decimal integer. Values-10 to 60000. ParamDefault: Default- 5000 milliseconds"
        },
        {
            "Parameters": "no-dns",
            "Info": "Specifies that a DNS lookup for the specified host name will not be performed. ParamDefault: Default- DNS lookups are performed"
        },
        {
            "Parameters": "source ip-address",
            "Info": "Specifies the source IP address to use as the source of the probe packets in dotted decimal notation. If the IP address is not one of the device s interfaces, an error is returned. Values-ipv4-address|a.b.c.d|, ipv6-address |x:x:x:x:x:x:x:x (eight 16-bit pieces)x:x:x:x:x:x:d.d.d.d|x:   [0 to FFFF]Hd:   [0 to 255]D."
        },
        {
            "Parameters": "type-of-service",
            "Info": "Specifies the type-of-service (TOS) bits in the IP header of the probe packets, expressed as a decimal integer. Values-0 to 255. ParamDefault: Default- 0"
        },
        {
            "Parameters": "router-instance",
            "Info": "Specifies the router name, CPM router instance, or service ID. Values-router-instance : router-name or service-id, |router-name|Base, management, cpm-vr-name, vpls-management, |cpm-vr-name|[32 characters maximum], |vprn-service-id|1 to 2147483647. ParamDefault: Default- Base"
        },
        {
            "Parameters": "service-name",
            "Info": "Specifies the service name up to 64 characters in length."
        },
        {
            "Parameters": "detail",
            "Info": "Displays MPLS label stack information (if available)."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}