{
    "PageTitle": "hello-authentication-key",
    "FuncDef": "This command configures the authentication key (password) for hello PDUs. Neighboring routers use the password to verify the authenticity of hello PDUs sent from this interface. Both the hello authentication key and the hello authentication type on a segment must match. Thehello-authentication-typemust be specified.",
    "CLIs": [
        "hello-authentication-key [ <authentication-key> | <hash-key> ] [ hash | hash2 ]",
        "no hello-authentication-key"
    ],
    "ParentView": [
        "config>router>isis>interface",
        "config>router>isis>if>level"
    ],
    "ParaDef": [
        {
            "Parameters": "authentication-key",
            "Info": "The hello authentication key (password). The key can be any combination of ASCII characters up to 254 characters in length (un-encrypted). If spaces are used in the string, enclose the entire string in quotation marks (\" \")."
        },
        {
            "Parameters": "hash-key",
            "Info": "The hash key. The key can be any combination of ASCII characters up to 342 characters in length (encrypted). If spaces are used in the string, enclose the entire string in quotation marks (\" \")."
        },
        {
            "Parameters": "hash",
            "Info": "Specifies the key is entered in an encrypted form. If the hash or hash2 parameter is not used, the key is assumed to be in an unencrypted, clear text form. For security, all keys are stored in encrypted form in the configuration file with the hash or hash2 parameter specified."
        },
        {
            "Parameters": "hash2",
            "Info": "Specifies the key is entered in a more complex encrypted form that involves more variables than the key value alone, meaning that the hash2 encrypted variable cannot be copied and pasted. If the hash or hash2 parameter is not used, the key is assumed to be in an unencrypted, clear text form. For security, all keys are stored in encrypted form in the configuration file with the hash or hash2 parameter specified."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: no hello-authentication-key"
}