{
    "PageTitle": "loss-measure single-ended-synthetic continual send",
    "FuncDef": "The loss-measure single-ended-synthetic continual send command enables single-ended proactive SLM.\nThe undo loss-measure single-ended-synthetic continual send command disables single-ended proactive SLM.\nBy default, the function is disabled.",
    "CLIs": [
        "loss-measure single-ended-synthetic continual send test-id <test-id> interval { 1000 | 10000 } [ sending-count <count-value> ] [ time-out <timeout> ] [ period <period> ]",
        "undo loss-measure single-ended-synthetic continual send test-id <test-id>"
    ],
    "ParentView": [
        "MA view"
    ],
    "ParaDef": [
        {
            "Parameters": "test-id test-id",
            "Info": "Specifies the ID.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "interval 1000",
            "Info": "Specifies the interval.\n-"
        },
        {
            "Parameters": "interval 10000",
            "Info": "Specifies the interval.\n-"
        },
        {
            "Parameters": "sending-count count-value",
            "Info": "Specifies the times that synthetic loss measurements (SLM) are sent within each measurement period.\nThe value is an integer ranging from 1 to 1000. The default value is 10."
        },
        {
            "Parameters": "time-out timeout",
            "Info": "Specifies the timeout period during which the device waits for a reply.\nThe value is an integer ranging from 1 to 10, in seconds. The default value is 5s."
        },
        {
            "Parameters": "period period",
            "Info": "Specifies the interval at which statistics are collected.\nThe value is an integer ranging from 1 to 65535, in seconds. The default value is 900."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] cfm enable",
            "[*HUAWEI] cfm md md1",
            "[*HUAWEI-md-md1] ma ma1",
            "[*HUAWEI-md-md1-ma-ma1] map mpls l2vc 100 raw",
            "[*HUAWEI-md-md1-ma-ma1] mep mep-id 1 interface GigabitEthernet1/0/0 inward",
            "[*HUAWEI-md-md1-ma-ma1] loss-measure single-ended-synthetic continual send test-id 1 interval 1000 sending-count 10 time-out 5"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo collect accurate frame loss statistics on a point-to-multipoint network, run the loss-measure single-ended-synthetic continual send command to enable single-ended proactive SLM.\nPrerequisites\nEnsure that the following commands have been run:\nIEEE Standard 802.1ag-2007 of CFM has been specified using the cfm version standard command in the system view.The Connectivity Fault Management (CFM) function has been enabled globally using the cfm enable (system view) command in the system view.A Maintenance Domain (MD) has been created using the cfm md command in the system view.A Maintenance Association (MA) has been created using the ma command in the MD view.An inward-facing Maintenance Association End Point (MEP) has been created using the mep mep-id command in the MA view.The local MEP has been enabled to send Continuity Check Message (CCM) to the RMEP in the MA using the mep ccm-send enable command in the MA viewThe local MEP has been enabled to receive CCMs from the remote MEP in the same MA using the remote-mep ccm-receive enable command in the MA view."
}