{
    "PageTitle": "acl ipv6 number",
    "FuncDef": "The acl ipv6 number command creates an ACL6 and displays the ACL6 view. If the ACL6 already exists, this command directly displays the ACL6 view.\nThe undo acl ipv6 number command deletes a created ACL6.\nBy default, no ACL6 is created.",
    "CLIs": [
        "acl ipv6 [ number ] <interface-based-acl6-number> [ match-order { config | auto } ]",
        "acl ipv6 [ number ] <basic-acl6-number> [ match-order { config | auto } ]",
        "acl ipv6 [ number ] <advance-acl6-number> [ match-order { config | auto } ]",
        "acl ipv6 [ number ] <ucl-acl6-number> [ match-order { auto | config } ]",
        "undo acl ipv6 [ number ] <basic-acl6-number>",
        "undo acl ipv6 [ number ] <advance-acl6-number>",
        "undo acl ipv6 [ number ] <interface-based-acl6-number>",
        "undo acl ipv6 all",
        "undo acl ipv6 [ number ] <ucl-acl6-number>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "interface-based-acl6-number",
            "Info": "Creates an interface-based ACL6 with a number.\nThe value is an integer ranging from 1000 to 1999."
        },
        {
            "Parameters": "match-order",
            "Info": "Indicates the order in which advanced ACL6 rules are matched.\n-"
        },
        {
            "Parameters": "config",
            "Info": "Indicates the configuration order, meaning that ACL6 rules are matched in the order they are configured.This mechanism applies only when rule numbers are not specified. If rule numbers are specified, the ACL6 rules are matched based on the numbers in ascending order.\n-"
        },
        {
            "Parameters": "auto",
            "Info": "Indicates the automatic order, meaning that ACL6 rules are matched based on the depth-first principle.The depth-first principle matches ACL6 rules based on how precise the rules are. The more matching criteria an ACL6 rule contains, the more precise the rule is.If two rules have the same precision, they are matched in the order they are configured.\n-"
        },
        {
            "Parameters": "basic-acl6-number",
            "Info": "Creates a basic ACL6 with a number.\nThe value is an integer ranging from 2000 to 2999."
        },
        {
            "Parameters": "advance-acl6-number",
            "Info": "Creates an advanced ACL6 with a number.\nThe value is an integer ranging from 3000 to 3999."
        },
        {
            "Parameters": "ucl-acl6-number",
            "Info": "Creates a user ACL6 with a number.\nThe value is an integer ranging from 6000 to 9999."
        },
        {
            "Parameters": "all",
            "Info": "Deletes all ACL6s.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl ipv6 number 1999"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl ipv6 number 2999"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl ipv6 number 3999"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl ipv6 number 6999"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo create an ACL6, run the acl ipv6 command.\nAn interface-based ACL6 defines rules for filtering packets based on the inbound interfaces of packets.A basic ACL6 defines rules for filtering packets based on the source IP addresses of packets.Advanced ACL6s match packets based on the source IP address, destination IP address, IP protocol type, and protocol-specific configurations (for example, source and destination TCP ports and ICMPv6 protocol type and code) of the packets.User ACL6s match packets based on the source/destination IPv6 address, source/destination service group, source/destination user group, source/destination port number, and protocol type.\n\nConfiguration Impact\nThe undo acl ipv6 all command deletes all types of ACL6s on a device. If the ACL6s being deleted are applied to services, these services are interrupted. Before deleting an ACL6, ensure that the ACL6 is not referenced by services.\nFollow-up Procedure\nAfter you create an ACL6, the ACL6 view is displayed.\nDeleting an ACL referenced by a service may interrupt this service. Before deleting an ACL, check whether the ACL is referenced by any service."
}