{
    "PageTitle": "acl ipv6 name (advanced ACL6)",
    "FuncDef": "The acl ipv6 name command creates an advanced ACL6 and displays the ACL6 view. If the advanced ACL6 already exists, this command directly displays the ACL6 view.\nThe undo acl ipv6 name command deletes a created advanced ACL6.\nBy default, no advanced ACL6 is created.",
    "CLIs": [
        "acl ipv6 name <advance-acl6-name> advance [ match-order { config | auto } ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "advance",
            "Info": "Creates an advanced ACL6 with a keyword.\n-"
        },
        {
            "Parameters": "match-order",
            "Info": "Indicates the order in which advanced ACL6 rules are matched.\n-"
        },
        {
            "Parameters": "config",
            "Info": "Indicates the configuration order, meaning that ACL6 rules are matched in the order they are configured.This mechanism applies only when rule numbers are not specified. If rule numbers are specified, the ACL6 rules are matched based on the numbers in ascending order.\n-"
        },
        {
            "Parameters": "auto",
            "Info": "Indicates the automatic order, meaning that ACL6 rules are matched based on the depth-first principle.The depth-first principle matches ACL6 rules based on how precise the rules are. The more matching criteria an ACL6 rule contains, the more precise the rule is.If two rules have the same precision, they are matched in the order they are configured.\n-"
        },
        {
            "Parameters": "name advance-acl6-name",
            "Info": "Creates an advanced ACL6 with a name.\nThe value is a string of 1 to 64 case-sensitive characters, spaces not supported. The name must start with a letter or digit, and cannot contain only digits."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl ipv6 name advance-acl6 advance"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAdvanced ACL6s match packets based on the source IP address, destination IP address, IP protocol type, and protocol-specific configurations (for example, source and destination TCP ports and ICMPv6 protocol type and code) of the packets. To create an advanced ACL6, run the acl ipv6 command.\nConfiguration Impact\nThe undo acl ipv6 all command deletes all types of ACL6s on a device. If the ACL6s being deleted are applied to services, these services are interrupted. Before deleting an ACL6, ensure that the ACL6 is not referenced by services.\nFollow-up Procedure\nRun the rule command to configure a rule for a created advanced ACL6. Then the ACL6 rule can be applied to match packets.\nRun the description command to configure a description for a created advanced ACL6. The description can contain the functions of the advanced ACL6, facilitating applications."
}