{
    "PageTitle": "undo rule (UCL6 view)",
    "FuncDef": "The undo rule command deletes an ACL6 rule or certain configuration information.\nBy default, no user ACL6 rule has been created.",
    "CLIs": [
        "undo rule <rule-id> { destination | destination-port | dscp | icmp6-type | logging | precedence | source | source-port | time-range | tos | traffic-class | fragment } *"
    ],
    "ParentView": [
        "UCL6 view"
    ],
    "ParaDef": [
        {
            "Parameters": "destination",
            "Info": "Matches packets based on destination IP addresses.\n-"
        },
        {
            "Parameters": "destination-port",
            "Info": "Specify?destination?port.\n-"
        },
        {
            "Parameters": "dscp",
            "Info": "Matches packets based on the 6-bit DSCP field in an IPv4 packet as defined in standard protocols.\n-"
        },
        {
            "Parameters": "icmp6-type",
            "Info": "Matches ICMP packets based on the ICMP type and message code.\n-"
        },
        {
            "Parameters": "logging",
            "Info": "Logs matching packets.\n-"
        },
        {
            "Parameters": "precedence",
            "Info": "Matches packets based on the high-order 3-bit ToS field in an IP packet as defined in standard protocols.\n-"
        },
        {
            "Parameters": "source",
            "Info": "Matches packets based on source IP addresses.\n-"
        },
        {
            "Parameters": "source-port",
            "Info": "Specify?source?port.\n-"
        },
        {
            "Parameters": "time-range",
            "Info": "Specifies a time range during which an ACL rule takes effect.\n-"
        },
        {
            "Parameters": "tos",
            "Info": "Matches packets based on the 4-bit ToS field in an IPv4 packet as defined in standard protocols.\n-"
        },
        {
            "Parameters": "traffic-class",
            "Info": "Matches?packets?based?on?a?traffic?type.\n-"
        },
        {
            "Parameters": "fragment",
            "Info": "Checks fragmented packets.\n-"
        },
        {
            "Parameters": "rule rule-id",
            "Info": "Specifies the ID of a user ACL6 rule.\nThe value is an integer ranging from 0 to 4294967294."
        },
        {
            "Parameters": "undo",
            "Info": "Cancel current setting.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl ipv6 number 6999",
            "[*HUAWEI-acl6-ucl-6999] rule 1 deny ipv6 source service-group any destination user-group any",
            "[*HUAWEI-acl6-ucl-6999] undo rule 1 source"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo delete an ACL rule in the user ACL6 view, run the undo rule command.\nPrerequisites\nA basic ACL6 has been created using the acl ipv6 command in the system view.\nA time range has been configured using the time-range command in the system view if you want to specify a validity period when creating a basic ACL6 rule.\nConfiguration Impact\nWhen specifying an ACL6 rule ID, note the following:\nIf a rule with a specified rule ID already exists, and the new rule conflicts with the existing one, the conflicting part in the new rule overwrites that in the existing rule.If no rule with the specified rule ID exists, a rule with the specified rule ID is created.\nWhen an ACL6 rule ID is not specified and a rule is added, the system automatically allocates an ID to this rule. ACL6 rules are arranged in ascending order of rule IDs, with the difference between two adjacent rules as an ACL6 step.\nThe rule IDs automatically generated by the system start from the ACL6 step. For example, if the ACL6 step is 5, the rule ID starts from 5; if the ACL6 step is 2, the rule ID starts from 2. This allows you to add rules before the first rule.\n\nPrecautions\nIf auto is configured when you run the acl ipv6 command to create an ACL6, you cannot specify a rule ID when creating a rule. The system automatically uses the ACL6 step as the start rule ID, and the subsequent rules are numbered by a step in ascending order.\nIf rule-id is not specified when you run the rule command to create an ACL6, the system automatically assigns an ID to the ACL6 rule. You can run the display acl ipv6 command to check the rule ID automatically assigned to an ACL6.\nIf name rule-name is not specified when you run the rule command to create an ACL6, the system automatically generates a name for the ACL6 in the format of \"rule\"+\"_\"+rule ID. Rule ID is the ID of an ACL6 rule that can be specified using the rule-id parameter or automatically assigned by the system. You can check the automatically generated name of an ACL6 rule through the NMS.\nYou must specify the rule ID when deleting a rule. To check rule IDs, run the display acl ipv6 command.Before deleting an ACL6 rule, run the display acl ipv6 command to check whether the ACL6 rule has been applied to other services. Delete the rule only when it is not applied to other services."
}