{
    "PageTitle": "dir",
    "FuncDef": "The dir command displays information about a specified file or a directory of a storage device on the device.\nBy default, information about files in the current directory is displayed.",
    "CLIs": [
        "dir",
        "dir /all",
        "dir <filename>",
        "dir /all <filename>",
        "dir /all-filesystems",
        "dir /all /all-filesystems"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "/all",
            "Info": "Displays all files, including the dumped files in the recycle bin.\n-"
        },
        {
            "Parameters": "filename",
            "Info": "Specifies the name of a file or a directory.\nThe value is a character string in the format of [ <drive> ][ <path>  ][ <file-name> ]. An absolute <path> name is a string of 1 to 255 characters. A relative <path> name is a string of 1 to 128 characters. Up to 8 levels of directories are supported.\nAn absolute <path> is in the format of <drive> [ <path> ][ <file-name> ], and a relative <path> is in the format of [ <path> ][ <file-name> ]. That is, a relative <path> is the root <path>  of the current working <path>."
        },
        {
            "Parameters": "/all-filesystems",
            "Info": "Displays information about all files in the root directory of storage medium.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> dir",
            "Directory of cfcard:/                                                           ",
            "                                                                                ",
            "  Idx  Attr     Size(Byte)  Date        Time       FileName                     ",
            "    0  drwx              -  Jul 13 2013 21:47:58   $_checkpoint                 ",
            "    1  -rw-      1,173,968  May 28 2013 06:31:03   123.PAT     ",
            "    2  -rw-    164,169,606  Jul 08 2013 20:48:21   123.cc   ",
            "    3  -rw-          6,632  Jul 13 2013 20:19:02   a.cfg                        ",
            "    4  -rw-          4,444  Jul 13 2013 20:43:58   device.sys"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nYou can run the dir /all command to view information about all files including dumped files in the recycle bin. The name of a dumped file is placed in brackets \"[ ]\", for example, [text].\nTable 1 describes the file information in the dir command output.\nFiles and the system software version displayed depend on service configurations. The following lists only common files.\nTable 1 File information in the dir command outputFile Name\n\nFile Description\n\n\n\n$_checkpoint\n\nFile in which the configuration rollback point information is saved\n\n\n**.cc\n\nSoftware version file\n\n\n$_install_hpg\n\nDirectory where patches released with the version are saved\n\n\n$_install_mod\n\nDirectory where dynamic module packages are saved\n\n\n$_license\n\nDirectory where activated licenses are backed up\n\n\n$_security_info\n\nDirectory where the historical AAA user data is saved\n\n\n$_system\n\nLinux system-predefined directory where system scripts are saved\n\n\nbackup_bkp_elb.txt\n\nBackup file of the backplane's electronic label (E-label)\n\n\nbackupelb.txt\n\nBackup file of the E-label of a specific board, which is generated after the board's E-label is automatically read most recently\n\n\nbackupelable.txt\n\nBackup file of the E-label of a specific board, which is generated after the board's E-label is automatically read using commands most recently\n\n\ndbupgrade.log\n\nLog files generated during the database upgrade\n\n\ndevice.sys\n\nSystem hardware configuration file\n\n\nlcsbox\n\nFile where the names and contents of the activated GTL license files\n\n\nlpustat\n\nDirectory where the number of discarded packets on the main control board chip is saved. The main control board collects the number of discarded packets on the main control board chip periodically and reports it to the main control board. The data is then saved in this directory.\n\n\npmdata\n\nDirectory where the service performance data is saved\n\n\nsecurity\n\nDirectory where the SSL certificate is saved\n\n\nlogfile\n\nLog directory file, occuping independent storage space.\n\n\nKPISTAT\n\nCollected KPI data.\n\n\nsaid\n\nInformation generated during fault detection, diagnosis, and rectification on the SAID node.\n\n\ndropCauseLog\n\nWhen a large number of packets are lost, the device records packet loss information. For example, the packet ID, packet loss slot, packet loss direction, label, and IP address are recorded to locate the cause of packet loss. The file name is DropCauseLog.log.\n\n\nlost+found\n\nInformation about the damaged file in the file management module recovered by the system during the abnormal restart\n\n\n**.zip/**.cfg/**.dat\n\nSystem configuration file. For details, see the save command.\nThe file name extension of compressed log files is also .zip.\nlog_slot ID_time.log.zip: a common log file that reaches a specified size\ndiaglog_slot ID_time.log.zip: a diagnostic log file that reaches a specified size\nYou can run the info-center logfile size command to set the size of a log file.\n\n\n*.pat\n\nPatch file\n\n\nlpustat.dat\n\nLog file generated when packets are unexpectedly dropped by forwarding chips.\nThe device is enabled to automatically record data about packets unexpectedly dropped by forwarding chips. The system saves the data to the lpustat directory on the CF card of the master main control board as a structured hexadecimal file named lpustat.dat. As the lpustat.dat file is stored in hexadecimal format, it cannot be directly opened for viewing. To view this file, ask Huawei engineers to convert the file into an lpustat.csv file in which data is displayed by time, slot ID, module, chip, fault ID, and drop information.\nWhen the remaining space of the CF card is less than or equal to 110 MB, the device does not record packet loss logs.\n\n\ninsegdroplog.log\n\nLog file to be collected when packet loss occurs during MPLS forwarding. The device automatically records packet loss data generated due to label table query failures that occur during label-based service forwarding. The device saves the data to the insegdroplog directory on the CF card of the master main control board as a file named insegdroplog.log. When the insegdroplog.log file is greater than 8 MB, the device automatically compresses the file into an insegdroplog_timestamp.rar package and deletes the insegdroplog.log file. If new packet loss data is generated, the device creates another insegdroplog.log file to record the data. The insegdroplog directory provides a maximum of 10 MB for log files. When the size of all log files in the directory exceeds 10 MB, the device deletes earliest log files to store new ones.\n\n\n\n\n\nThe wildcard \"*\" can be used in the command.\nIf hidden files exist in the system, they occupy disk space."
}