{
    "PageTitle": "clock sa-bit (virtual access ap-id view)",
    "FuncDef": "The clock sa-bit command configures a timeslot of 2 Mbps signals of a BITS clock source from which the NE40E extracts SSM levels of clock signals.\nBy default, the device extracts SSM levels of clock signals from the sa4 timeslot of 2 Mbps signals of a BITS clock source.",
    "CLIs": [
        "clock sa-bit { sa4 | sa5 | sa6 | sa7 | sa8 } source bits0 [ slot <slotid> ]"
    ],
    "ParentView": [
        "Virtual access AP-ID view"
    ],
    "ParaDef": [
        {
            "Parameters": "sa4",
            "Info": "Specifies the sa4 timeslot.\n-"
        },
        {
            "Parameters": "sa5",
            "Info": "Specifies the sa5 timeslot.\n-"
        },
        {
            "Parameters": "sa6",
            "Info": "Specifies the sa6 timeslot.\n-"
        },
        {
            "Parameters": "sa7",
            "Info": "Specifies the sa7 timeslot.\n-"
        },
        {
            "Parameters": "sa8",
            "Info": "Specifies the sa8 timeslot.\n-"
        },
        {
            "Parameters": "source",
            "Info": "Specifying a reference source.\n-"
        },
        {
            "Parameters": "bits0",
            "Info": "External reference source bit0.\n-"
        },
        {
            "Parameters": "slot slotid",
            "Info": "Specifies the slot ID of the main control board which the clock is installed.\nOnly the master and slave main control boards that can exchange BITS signals support the configurations of the slot slot-id keyword and parameter.\nThe value is a string of 1 to 16 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ap-id 1025",
            "[~HUAWEI-ap1025] clock sa-bit sa5 source bits0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the signal type of an external clock source connected to the device BITS interface is 2 Mbps, the external clock signal has carried SSM levels in an Sa timeslot. To enable the device to automatically extract SSM levels from clock signals, configure the Sa timeslot from which the device extracts SSM levels to be the same as the Sa timeslot of the external clock signal. If the two Sa timeslots are different, the device cannot extract SSM levels of clock signals received on the BITS interface. In this situation, the SSM levels of the clock signals are unk.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}