{
    "PageTitle": "clock max-out-ssm (virtual access port-extension view)",
    "FuncDef": "The clock max-out-ssm command configures the maximum output SSM level for clock signals.\nThe undo clock max-out-ssm command deletes the maximum output SSM level configured for clock signals.\nBy default, no maximum output SSM level is configured for clock signals. That is, the actual output SSM level is used.",
    "CLIs": [
        "clock [ 2msync-1 ] max-out-ssm { prc | ssua | ssub | sec }",
        "clock [ 2msync-1 | 2msync-2 ] max-out-ssm { prc | ssua | ssub | sec }",
        "undo clock [ 2msync-1 | 2msync-2 ] max-out-ssm",
        "undo clock [ 2msync-1 ] max-out-ssm"
    ],
    "ParentView": [
        "Virtual access port-extension view"
    ],
    "ParaDef": [
        {
            "Parameters": "2msync-1",
            "Info": "Specifies the maximum output SSM level for 2M synchronous PLL clocks.\n-"
        },
        {
            "Parameters": "prc",
            "Info": "Indicates that the SSM level is PRC (G.811 clock signal).\n-"
        },
        {
            "Parameters": "ssua",
            "Info": "Indicates that the SSM level is SSUA (G.812 transit node clock signal).\n-"
        },
        {
            "Parameters": "ssub",
            "Info": "Indicates that the SSM level is SSUB (G.812 local node clock signal).\n-"
        },
        {
            "Parameters": "sec",
            "Info": "Indicates that the SSM level is SEC.\n-"
        },
        {
            "Parameters": "2msync-2",
            "Info": "Specifies the maximum output SSM level for 2M synchronous PLL clocks.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] virtual-access port-extend",
            "[~HUAWEI-virtual-access-portextend] clock max-out-ssm ssua"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the device transmits poor-quality clock signals to a downstream device, run the clock max-out-ssm command to configure a low maximum output SSM level for clock signals. If SSM levels are also configured to participate in clock source selection on this downstream device, there is a low probability that this downstream device traces this clock source.\nIf the SSM level of clock signals is higher than the configured maximum output SSM level, the device automatically adjusts the output SSM level to the configured maximum output SSM level. If the SSM level of clock signals is lower than or equal to the configured maximum output SSM level, the device uses the actual output SSM level.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}