{
    "PageTitle": "clock ssm (port extension interface view)",
    "FuncDef": "The clock ssm command configures an SSM level for a line clock source.\nThe undo clock ssm command deletes the SSM level configured for a line clock source.\nBy default, the SSM level of a clock source is DNU.",
    "CLIs": [
        "clock ssm { prc | ssua | ssub | sec | dnu | unk }",
        "undo clock ssm"
    ],
    "ParentView": [
        "Port extension interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "prc",
            "Info": "Indicates that the SSM level is PRC (G.811 clock signal).\n-"
        },
        {
            "Parameters": "ssua",
            "Info": "Indicates that the SSM level is SSUA (G.812 transit node clock signal).\n-"
        },
        {
            "Parameters": "ssub",
            "Info": "Indicates that the SSM level is SSUB (G.812 local node clock signal).\n-"
        },
        {
            "Parameters": "sec",
            "Info": "Indicates that the SSM level is SEC.\n-"
        },
        {
            "Parameters": "dnu",
            "Info": "Indicates that the SSM level is not used for clock synchronization.\n-"
        },
        {
            "Parameters": "unk",
            "Info": "Indicates that the SSM level is unknown clock synchronization quality.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ap-id 1000",
            "[~HUAWEI-ap1000] remote-interface GigabitEthernet1/0/0",
            "[*HUAWEI-ap1000] commit",
            "[~HUAWEI-ap1000] quit",
            "[~HUAWEI] interface GigabitEthernet 1000/1/0/0",
            "[~HUAWEI-GigabitEthernet1000/1/0/0] clock ssm prc"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA synchronization status message (SSM) transmits the quality level of timing signals on a synchronous timing link. Node clocks on a synchronization network parse the SSM to obtain the quality level of an upstream clock.\nIf SSM levels are configured to participate in clock source selection, the NE40E selects a clock source to be traced based on the SSM levels of clock sources. By default, the line clock source learns SSM levels sent by an upstream device. You can manually configure an SSM level for the line clock source.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}