{
    "PageTitle": "ptp asymmetry-measure enable (virtual access port-extension view)",
    "FuncDef": "The ptp asymmetry-measure enable command enables automatic asymmetry measurement on the router over a 1588v2 ring network.\nThe undo ptp asymmetry-measure enable command disables automatic asymmetry measurement on the router over a 1588v2 ring network.\nBy default, automatic asymmetry measurement is disabled on the router.",
    "CLIs": [
        "ptp asymmetry-measure enable",
        "undo ptp asymmetry-measure enable"
    ],
    "ParentView": [
        "Virtual access port-extension view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] virtual-access port-extend",
            "[~HUAWEI-virtual-access-portextend] ptp asymmetry-measure enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe NodeB can synchronize clock signals with the global positioning system (GPS) on the ring network shown in a ring network consisting of BC1-BC2-BC3-BC6-BC5-BC4 only if fibers working in opposite directions on each network segment have the same length. Each node can synchronize clock signals with the GPS, irrespective of changes in clock sources that slave clocks trace. If a fiber between BC5 and BC6 is disconnected, BC6 traces clock signals of BC3. As a compensation value has calculated, BC6 uses the compensation value to successfully synchronize clock signals with the GPS.\nAfter the faulty fiber between BC5 and BC6 is repaired, the difference between the lengths of the fibers that transmit traffic in opposite directions changes, and BC6 traces clock signals of BC5, not BC3. BC6 uses the previous compensation value but fails to synchronize clock signals with the GPS. To address this problem, run the ptp asymmetry-measure enable command to enable automatic asymmetry measurement. Automatic asymmetry measurement allows a device to calculate an offset and sends an alarm about the offset. The device uses the offset to synchronize clock signals with the GPS.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}