{
    "PageTitle": "ptp passive-measure enable (virtual access port-extension view)",
    "FuncDef": "The ptp passive-measure enable command enables a 1588v2 device to monitor the performance of a passive interface.\nThe undo ptp passive-measure enable command disables a 1588v2 device from monitoring the performance of a passive interface.\nA 1588v2 device by default does not monitor the performance of a passive interface.",
    "CLIs": [
        "ptp passive-measure enable",
        "undo ptp passive-measure enable"
    ],
    "ParentView": [
        "Virtual access port-extension view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] virtual-access port-extend",
            "[~HUAWEI-virtual-access-portextend] ptp passive-measure enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA passive interface does not trace or advertise time information. If a device has multiple master 1588v2 interfaces in the same clock domain, the device selects the interface with the highest priority as the master clock. The interface connected to the master clock is the slave clock. The unselected master interfaces enter the Passive state and function as backups for the slave clock. Passive interfaces can send Delay_Req, Pdelay_Resp, Delay_Resp_Follow_Up, signaling, and management response messages.\nA passive interface can be selected as a slave clock or a master clock to participate in time synchronization after a clock source changes. Monitoring the passive interface before a clock source changes helps keep stable time signals on a synchronous 1588v2 network.\nWhen the display ptp all command output displays \"yes\" in the \"Time lock success\" field. The 1588v2 network is time synchronous. To monitor time synchronization performance on the network, run the ptp passive-measure enable command.\nThe passive interface checks the offset between the master and slave clocks. If the offset is greater than a configured alarm threshold, the device sends an alarm named hwPtpPassiveFiberLengthChange to a network management system (NMS). To set the alarm threshold, run the ptp passive-measure alarm-threshold command.\nPrerequisites\nA passive interface is determined. The display ptp all command output contains \"passive\" in the State field of the Port Info part.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}