{
    "PageTitle": "ptp virtual-clock-id (virtual access ap-id view)",
    "FuncDef": "The ptp virtual-clock-id command configures a virtual clock ID on a local device.\nThe undo ptp virtual-clock-id command restores the default clock ID and deletes the configured virtual clock ID.\n\nBy default, a local device has only a default clock ID.\n\n\nA clock ID is an 8-byte hexadecimal MAC address with \"fffe\" padded between the sixth and seventh bits. For example, a system has a MAC address 111122223333, and the default clock ID of the system is 111122fffe223333.",
    "CLIs": [
        "ptp virtual-clock-id clock-id-value",
        "undo ptp virtual-clock-id"
    ],
    "ParentView": [
        "Virtual access AP-ID view"
    ],
    "ParaDef": [
        {
            "Parameters": "clock-id-value",
            "Info": "Specifies the four least significant bytes of a virtual clock ID.\nA system automatically assigns the four most significant bytes of a virtual clock ID.\nThe value is a decimal integer ranging from 1 to FFFFFFFF."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ap-id 1000",
            "[~HUAWEI-ap1000] ptp virtual-clock-id 00000123"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA clock ID uniquely identifies a 1588v2 device in a single clock domain. The default clock ID is determined by the system MAC address.\nThe default clock ID remains even if the active main board (AMB)/standby main board (SMB) switchover is performed or the AMB is replaced. If an AMB is removed from a device and installed in another device, the clock IDs of the two devices are the same. To address this problem, run the ptp virtual-clock-id command to set a virtual clock ID for either of the two devices. The configured virtual clock ID also uniquely identifies the 1588v2 device and does not change even if the AMB is replaced.\nPrerequisites\n1588v2 has been enabled on the device using the ptp enable command.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}