{
    "PageTitle": "display ssh server ip-block",
    "FuncDef": "The display ssh server ip-block all command displays information about the IP addresses of all the clients that fail to pass authentication.\nThe display ssh server ip-block list command displays information about client IP addresses that are locked because of authentication failures.",
    "CLIs": [
        "display ssh server ip-block list",
        "display ssh server ip-block all"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> display ssh server ip-block list",
            "-------------------------------------------------------------------------------------",
            " IP Address                 VPN Name                   UnBlock Interval(Seconds)     ",
            "-------------------------------------------------------------------------------------",
            " 192.168.10.1               _public_                          36                     ",
            "-------------------------------------------------------------------------------------"
        ],
        [
            "<HUAWEI> display ssh server ip-block all",
            "-------------------------------------------------------------------------------------",
            " IP Address                 VPN Name                   State           Auth-fail Count",
            "--------------------------------------------------------------------------------------",
            " 192.168.10.1               _public_                   BLOCKED             6          ",
            "--------------------------------------------------------------------------------------"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo check information about the IP addresses of all the clients that fail to pass authentication, run the display ssh server ip-block all command. The command output includes the names of VPN instances to which the IP addresses belong, IP address status, numbers of authentication failures, and the IP addresses that fails to pass authentication will not be adopted to make invalid authentication.\nIf a user logs in using SSH, the user's IP address will be locked for 5 minutes upon 6 incorrect password attempts within 5 minutes. After the IP address is locked, the IP address status displayed in the display ssh server ip-block all command output changes from AUTH FAILED to BLOCKED.\nTo check information about client IP addresses that are locked because of authentication failures, run the display ssh server ip-block list command. The command output includes the names of VPN instances to which the locked client IP addresses belong and the remaining locking period."
}