{
    "PageTitle": "dsa peer-public-key",
    "FuncDef": "The dsa peer-public-key command configures an encoding format for DSA public key and enters the DSA public key view.\nThe undo dsa peer-public-key command deletes the DSA public key.\nBy default, no DSA public key is created.",
    "CLIs": [
        "dsa peer-public-key <key-name> encoding-type <enc-type>",
        "undo dsa peer-public-key <key-name>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "key-name",
            "Info": "Specifies the DSA public key name.\nThe value is a string of 1 to 40 case-sensitive characters, spaces not supported.\nWhen quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "encoding-type enc-type",
            "Info": "Specifies an encoding format for DSA public key.\nThe value is an enumerated type, which can be:\nSpecifies the Distinguished Encoding Rules (DER) format for DSA public key. DER encodes data in hexadecimal format.Specifies the OpenSSH format for DSA public key. OpenSSH encodes data in base-64 format and is based on PEM.Specifies the Privacy Enhanced Mail (PEM) format for DSA public key. PEM encodes data in base-64 format."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dsa peer-public-key dsakey001 encoding-type der"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen you use a DSA public key for authentication, specify the public key on the server for the client of SSH users. When the client logs in to the server, the server uses the specified public key to authenticate the client.\nAfter you enter the DSA public key view, run the public-key-code begin command, and copy the DSA public key to the server.\nA maximum of 20 DSA public keys can be configured.\nFollow-up Procedure\nAfter you copy the DSA public key generated on the client to the server, perform the following operations to exit the DSA public key view:\nRun the public-key-code end command to return to the DSA public key view.Run the peer-public-key end command to exit the DSA public key view and return to the system view.\n\nPrecautions\nIf the DSA public key has been assigned to an SSH user, delete the mapping between the DSA public key and the SSH user. If you do not delete the mapping, the undo dsa peer-public-key command cannot delete the DSA public key.\nThe public key on the client is randomly generated by the client software."
}