{
    "PageTitle": "ecc peer-public-key",
    "FuncDef": "The ecc peer-public-key command creates an ECC public key and enters the ECC public key view.\nThe undo ecc peer-public-key command deletes the ECC public key.\nBy default, no ECC public key is created.",
    "CLIs": [
        "ecc peer-public-key <key-name> [ encoding-type <enc-type> ]",
        "undo ecc peer-public-key <key-name>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "key-name",
            "Info": "Specifies the ECC public key name.\nThe value is a string of 1 to 40 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "encoding-type",
            "Info": "Encoding type of the remote peer's public key.\nCurrently, only distinguished encoding rules (DER, PEM, OPENSSH) are supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ecc peer-public-key ecckey001",
            "Enter \"ECC public key\" view, return system view with \"peer-public-key end\".",
            "[*HUAWEI-ecc-public-key]"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen you use an ECC public key for authentication, specify the public key on the server for the client of SSH users. When the client logs in to the server, the server uses the specified public key to authenticate the client.\nAfter you enter the ECC public key view, run the public-key-code begin command, and copy the ECC public key to the server.\nFollow-up Procedure\nAfter you copy the ECC public key generated on the client to the server, perform the following operations to exit the ECC public key view:\n Run the public-key-code end command to return to the ECC public key view. Run the peer-public-key end command to exit the ECC public key view and return to the system view.\n\nPrecautions\nThe public key on the client is randomly generated by the client software.\nIf an ECC public key has been assigned to an SSH user, run the undo ssh user user-name assign ecc-key command to delete the mapping between the ECC public key and the SSH user. If you do not delete the mapping, the undo ecc peer-public-key command cannot delete the ECC public key."
}