{
    "PageTitle": "ftp server ip-block failed-times",
    "FuncDef": "The ftp server ip-block failed-times command sets the maximum number of consecutive FTP authentication failures within a specified period. If the number is reached, the system locks out the IP address of user.\nThe undo ftp server ip-block failed-times command restores the maximum number of consecutive FTP authentication failures and the period in which consecutive authentication failures are counted to default values.\nBy default, the maximum number of consecutive FTP authentication failures before the IP address of user lockout is 6, and the period is 5 minutes.",
    "CLIs": [
        "ftp server ip-block failed-times <failed-times> period <period>",
        "undo ftp server ip-block failed-times <failed-times> period <period>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "failed-times",
            "Info": "Specifies the maximum number of consecutive FTP authentication failures before the IP address of user lockout.\nThe value is an integer ranging from 1 to 10."
        },
        {
            "Parameters": "period period",
            "Info": "Specifies a period in which consecutive FTP authentication failures are counted.\nThe value is an integer ranging from 1 to 120, in minutes."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ftp server ip-block failed-times 3 period 6"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo set the maximum number of consecutive authentication failures within\na specified period, run the ftp server ip-block failed-times command.\nIf the number is reached, the system locks out the IP address of user, which prevents the user from accessing the device through FTP. The system automatically unlocks the IP address of user until the unlocking period expires. This improves device security.\nTo manually unlock the IP address of user, run the activate ftp server ip-block ip-address command."
}