{
    "PageTitle": "ftp server port",
    "FuncDef": "The ftp server port command sets the FTP server IPv4 listen port.\nThe undo ftp server port command resets the FTP server IPv4 listen port to default value.\nBy default, FTP server listen port is 21.",
    "CLIs": [
        "ftp server port <port-number>",
        "undo ftp server port"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "port-number",
            "Info": "Specifies the port number.\nPort number is an integer that is 21 or ranges from 1025 to 65535."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] undo ftp server",
            "[*HUAWEI] ftp server port 9000",
            "Info: Port change successful. Please start the FTP service.",
            "[*HUAWEI] ftp server enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, the listening port number of an FTP server is 21. You can directly log in to the device without specifying the port number. Attackers may access the default listening port, consuming bandwidth, deteriorating server performance, and causing authorized users unable to access the server. To improve security, run this command to change the listening port number of the FTP server. After that, attackers are deprived of information about the newly configured listening port number, and the FTP server is thus well protected.\nThe command ftp server port sets the FTP server listen port.\nPrerequisites\nConfirm that the FTP server function has been disabled. If not, run the undo ftp server command to disable the FTP server function.\nConfiguration Impact\nThe FTP server closes all FTP connection and uses the new listening port.\nIf the listening port number of the FTP server is 21, the FTP client can log in to the FTP server without specifying the port number. If the listening port number of the FTP server is not 21, the FTP client needs to specify the port number when trying to log in to the FTP server. The specified port number must be identical with the listening port number of the FTP server.\nPrecautions\nAfter the listening port number of the FTP server is changed using the ftp server port command, run the ftp server enable command to enable the FTP server function."
}