{
    "PageTitle": "ftp server login-failed threshold-alarm",
    "FuncDef": "The ftp server login-failed threshold-alarm command configures alarm generation and clearance thresholds for FTP server login failures within a specified period.\nThe undo ftp server login-failed threshold-alarm command restores the default alarm generation and clearance thresholds.\nBy default, an alarm is generated if the number of login failures reaches 30 within 5 minutes and is cleared if the number of login failures falls below 20 within the same period.",
    "CLIs": [
        "ftp server login-failed threshold-alarm upper-limit <report-times> lower-limit <resume-times> period <period-time>",
        "undo ftp server login-failed threshold-alarm",
        "undo ftp server login-failed threshold-alarm upper-limit <report-times> lower-limit <resume-times> period <period-time>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "lower-limit resume-times",
            "Info": "Specifies the number of times authentication failure clear alarms are reported.\nThe value is an integer ranging from 0 to 45."
        },
        {
            "Parameters": "period period-time",
            "Info": "Specifies the period in which failure alarms are counted.\nThe value is an integer ranging from 1 to 120, in minute."
        },
        {
            "Parameters": "upper-limit report-times",
            "Info": "Specifies the number of times authentication failure alarms are reported.\nThe value is an integer ranging from 0 to 100. If the value is 0, no authentication failure alarm is reported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ftp server login-failed threshold-alarm upper-limit 40 lower-limit 25 period 10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf an FTP management user frequently fails to log in within a short period, the device generates a management security alarm and reports it to administrators for their intervention. To configure alarm reporting and clearance thresholds within a specified period, run the ftp server login-failed threshold-alarm command.\nThe command takes effect for both ipv4 and ipv6 FTP servers."
}