{
    "PageTitle": "key-pair label",
    "FuncDef": "The key-pair label command creates the key-pairs with specified label name.\nThe undo key-pair label command deletes the key-pairs with specified label name.\nBy default, a device does not have local key pairs or server key pairs.",
    "CLIs": [
        "dsa key-pair label <label-name> [ modulus <modulus-bits> ]",
        "ecc key-pair label <label-name> [ modulus <modulus-bits> ]",
        "sm2 key-pair label <label-name>",
        "undo { dsa | ecc } key-pair label <label-name>",
        "undo sm2 key-pair label <label-name>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "label-name",
            "Info": "Specifies the label name of the key pair.\nThe value is a string of 1 to 35 case-insensitive characters, spaces not supported. The string can contain only letters, digits, and underscores (_)."
        },
        {
            "Parameters": "modulus modulus-bits",
            "Info": "Specifies the key-pair modulus bit value.\nThe value is an integer that can be 256, 384, or 521, in bits. The default value is 521 bits.\nThe greater the modulus of a key pair, the higher the security. However, it takes longer time to generate and use key pairs of a greater modulus."
        },
        {
            "Parameters": "ecc",
            "Info": "Specifies to generate the ECC key-pairs.\n-"
        },
        {
            "Parameters": "sm2",
            "Info": "Specifies to generate the SM2 key-pairs.\n-"
        },
        {
            "Parameters": "dsa",
            "Info": "Specifies to generate the DSA key-pairs.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] sm2 key-pair label sm2key001"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ecc key-pair label ecc_key_pair modulus 521"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe DSA/ECC/SM2 key-pair algorithms are used for user authentication in SSH and ensures security.\nConfiguration Impact\nOn execution of the dsa key-pair label command, a new DSA key-pair is generated and stored with the given label name. On execution of the undo dsa key-pair label command, the DSA key-pair with the given label name is deleted from the database.\nOn execution of the ecc key-pair label command, a new ECC key-pair is generated and stored with the given label name. On execution of the undo ecc key-pair label command, the ECC key-pair with the given label name is deleted from the database.\nOn execution of the sm2 key-pair label command, a new SM2 key-pair is generated and stored with the given label name. On execution of the undo sm2 key-pair label command, the SM2 key-pair with the given label name is deleted from the database."
}