{
    "PageTitle": "rsa peer-public-key",
    "FuncDef": "The rsa peer-public-key command configures an encoding format for RSA public key and enters the RSA public key view.\nThe undo rsa peer-public-key command deletes the RSA public key.\nBy default, rsa peer-public-key is not configured.",
    "CLIs": [
        "rsa peer-public-key <key-name>",
        "rsa peer-public-key <key-name> encoding-type <enc-type>",
        "undo rsa peer-public-key <key-name>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "key-name",
            "Info": "Specifies the RSA public key name.\nThe name is a string of 1 to 40 characters without a blank space.\nWhen quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "encoding-type enc-type",
            "Info": "Specifies an encoding format for RSA public key, the default is DER.\nThe value is an enumerated type, which can be:\nder: Specifies the Distinguished Encoding Rules (DER) format for RSA public key. DER encodes data in hexadecimal format.openssh: Specifies the Open SSH format for RSA public key. OpenSSH encodes data in base-64 format and is based on PEM.pem: Specifies the Privacy Enhanced Mail (PEM) format for RSA public key. PEM encodes data in base-64 format."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] rsa peer-public-key rsakey001 encoding-type der",
            "Enter \"RSA public key\" view, and you can return the system view with \"peer-public-key end\".",
            "[*HUAWEI-rsa-public-key]"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen you use RSA public key for authentication, specify the public key on the server for the client of SSH users. When the client logs in to the server, the server uses the specified public key to authenticate the client.\nPeer public keys can be in the PKCS#1 format only.\nThe public key on the client is randomly generated by the client software.\nFollow-up Procedure\n Run the public-key-code begin command to edit the public key, and copy the RSA public key to the server. Run the public-key-code end command to return to the RSA public key view. Run the peer-public-key end command to exit the RSA public key view and return to the system view.\n\nPrecautions\nIf the RSA public key has been assigned to an SSH user, run the undo ssh user user-name assign rsa-key command to delete the mapping between the RSA public key and the SSH user. If you do not delete the mapping, the undo rsa peer-public-key command cannot delete the RSA public key."
}