{
    "PageTitle": "ssh server acl",
    "FuncDef": "The ssh server acl command configures the ACL to control the access of clients for STelnet, SFTP, SCP and SNetconf.\nThe undo ssh server acl command cancels the ACL configuration.\nBy default, no ACL is configured.",
    "CLIs": [
        "ssh server acl { <acl4name> | <acl4num> }",
        "ssh ipv6 server acl { <acl6name> | <acl6num> }",
        "undo ssh server acl",
        "undo ssh ipv6 server acl"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "acl4num",
            "Info": "Specifies the IPv4 ACL number.\nACL number is an integer data type. The basic acl number value ranges from 2000 to 2999, the advanced acl number value ranges from 3000 to 3999."
        },
        {
            "Parameters": "ipv6",
            "Info": "IPv6 protocol.\n-"
        },
        {
            "Parameters": "acl6num",
            "Info": "Specifies the ACL6 number.\nACL number is an integer data type. The basic acl number value ranges from 2000 to 2999, the advanced acl number value ranges from 3000 to 3999."
        },
        {
            "Parameters": "name acl4name",
            "Info": "Specifies the ACL4 name.\nThe value is a string of 1 to 64 case-sensitive characters without spaces. The value must start with a letter (a to z or A to Z, case sensitive)."
        },
        {
            "Parameters": "name acl6name",
            "Info": "Specify the ACL6 name.\nThe value is a string of 1 to 64 case-sensitive characters without spaces. The value must start with a letter (a to z or A to Z, case sensitive)."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl 2000",
            "[*HUAWEI-acl4-basic-2000] quit",
            "[*HUAWEI] ssh server acl 2000"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl ipv6 name test",
            "[*HUAWEI-acl6-advance-test] quit",
            "[*HUAWEI] ssh ipv6 server acl test"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a device serves as\nSTelnet client, you can configure the ACL on the device to control the login of the local device to the STelnet server through STelnet.SFTP client, you can configure the ACL on the device to control the login of the local device to the SFTP server through SFTP.SFTP client, you can configure the ACL on the device to control the login of the local device to the SCP server through SFTP.SNetconf client, you can configure the ACL on the device to control the login of the local device to the SNetconf server through SNetconf.\n\nPrerequisites\nRun the acl command to create an ACL.\nPrecautions\nIf no rule is configured, the incoming and outgoing calls are not restricted after the command ssh server acl is run.The command ssh server acl BW11only takes effect for ipv4 client.User can restrict the source address by using basic ACL and by using advanced ACL the user can restrict the source and destination address.An ACL bound to an SSH server supports only the source IP address, source port number, destination IP address, and destination port number. If the destination address is bound to a VPN instance, the vpn-instance parameter must be set when creating an ACL rule. Otherwise, the login fails."
}