{
    "PageTitle": "set default ftp-directory",
    "FuncDef": "The set default ftp-directory command sets the default working directory for FTP users.\nThe undo set default ftp-directory command cancels the setting of the default directory for FTP users.\nBy default, FTP users have no working directory.",
    "CLIs": [
        "set default ftp-directory <directory>",
        "undo set default ftp-directory"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "directory",
            "Info": "Specifies the default working directory for FTP users.\nThe value is a character string in the format of [ <drive> ][ <path> ]. An absolute <path> name is a string of 1 to 255 characters. A relative <path> name is a string of 1 to 128 characters. Up to 8 levels of directories are supported.\nAn absolute <path> is in the format of <drive> [ <path> ], and a relative <path> is in the format of <path>. That is, a relative <path> is the root <path> of the current working <path>."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] set default ftp-directory cfcard:/"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBefore you perform FTP operations on a file, you must specify the FTP working directory. Otherwise, you cannot use FTP to access a device.\nThe command takes effect for both ipv4 and ipv6 users.\nPrecautions\nFTP users are classified as local authentication users and remote authentication (RADIUS and HWTACACS) users.\nThe local-user ftp-directory command must be run to specify the FTP working directory for local authentication users. Otherwise, local authentication users cannot use FTP to access the device.The FTP working directory for remote authentication users can be specified using the HWTACACS server. The set default ftp-directory command can also be used to specify the default FTP working directory for remote authentication users.The set default ftp-directory command applies only to remote authentication users."
}