{
    "PageTitle": "ssh server key-exchange",
    "FuncDef": "The ssh server key-exchange command configures a key exchange algorithm list on an SSH server.\nThe undo ssh server key-exchange command restores the default configuration.\nBy default, an SSH server supports dh_group_exchange_sha256 key exchange algorithms.",
    "CLIs": [
        "ssh server key-exchange { dh_group_exchange_sha256 | dh_group_exchange_sha1 | dh_group1_sha1 | ecdh_sha2_nistp256 | ecdh_sha2_nistp384 | ecdh_sha2_nistp521 | sm2_kep | dh_group14_sha1 } *",
        "undo ssh server key-exchange"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "dh_group_exchange_sha256",
            "Info": "Specifies that the Diffie-hellman-group-exchange-sha256 algorithm is contained in the key exchange algorithm list configured on the SSH server.\n-"
        },
        {
            "Parameters": "dh_group_exchange_sha1",
            "Info": "Specifies that the Diffie-hellman-group-exchange-sha1 algorithm is contained in the key exchange algorithm list configured on the SSH server.\n-"
        },
        {
            "Parameters": "dh_group1_sha1",
            "Info": "Specifies that the Diffie-hellman-group1-sha1 algorithm is contained in the key exchange algorithm list configured on the SSH server.\n-"
        },
        {
            "Parameters": "ecdh_sha2_nistp256",
            "Info": "Specifies that the Elliptic curve Diffie-hellman-sha2-nistp256 algorithm is contained in the key exchange algorithm list configured on the SSH server.\n-"
        },
        {
            "Parameters": "ecdh_sha2_nistp384",
            "Info": "Specifies that the Elliptic curve Diffie-hellman-sha2-nistp384 algorithm is contained in the key exchange algorithm list configured on the SSH server.\n-"
        },
        {
            "Parameters": "ecdh_sha2_nistp521",
            "Info": "Specifies that the Elliptic curve Diffie-hellman-sha2-nistp521 algorithm is contained in the key exchange algorithm list configured on the SSH server.\n-"
        },
        {
            "Parameters": "sm2_kep",
            "Info": "Specifies that the SuperMemo 2 Key Exchange Protocol algorithm is contained in the key exchange algorithm list configured on the SSH server.\n-"
        },
        {
            "Parameters": "dh_group14_sha1",
            "Info": "Specifies that the Diffie-hellman-group14-sha1 algorithm is contained in the key exchange algorithm list configured on the SSH server.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ssh server key-exchange dh_group_exchange_sha256"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAn SSH server and a client need to negotiate a key exchange algorithm for the packets exchanged between them. You can run the ssh server key-exchange command to configure a key exchange algorithm list for the SSH server. After the list is configured, the server matches the key exchange algorithm list of a client against the local list after receiving a packet from the client and selects the first key exchange algorithm that matches the local list. If no key exchange algorithms in the list of the client match the local list, the negotiation fails.\nThis command takes effect for both IPv4 and IPv6 SSH clients.\nPrecautions\nTo ensure high security, you can use the key-exchange algorithms such as dh_group_exchange_sha256."
}