{
    "PageTitle": "ssh server cipher",
    "FuncDef": "The ssh server cipher command configures encryption algorithms on an SSH server.\nThe undo ssh server cipher command restores the default encryption algorithms on the SSH server.\nBy default, the SSH server supports these encryption algorithms: AES128_CTR, AES256_CTR, AES192_CTR, AES128_GCM, AES256_GCM. The SSH server supports these HMAC authentication algorithms: SHA2_512 and SHA2_256.",
    "CLIs": [
        "ssh server cipher { des_cbc | 3des_cbc | aes128_cbc | aes192_cbc | aes256_cbc | aes128_ctr | aes256_ctr | arcfour128 | arcfour256 | blowfish_cbc | aes128_gcm | aes256_gcm | aes192_ctr } *",
        "undo ssh server cipher"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "des_cbc",
            "Info": "Specifies the DES encryption algorithm in CBC mode.\n-"
        },
        {
            "Parameters": "3des_cbc",
            "Info": "Specifies the 3DES encryption algorithm in CBC mode.\n-"
        },
        {
            "Parameters": "aes128_cbc",
            "Info": "Specifies the AES128 encryption algorithm in CBC mode.\n-"
        },
        {
            "Parameters": "aes192_cbc",
            "Info": "Specifies the AES192 encryption algorithm in CBC mode.\n-"
        },
        {
            "Parameters": "aes256_cbc",
            "Info": "Specifies the AES256 encryption algorithm in CBC mode.\n-"
        },
        {
            "Parameters": "aes128_ctr",
            "Info": "Specifies the AES128 encryption algorithm in CTR mode.\n-"
        },
        {
            "Parameters": "aes256_ctr",
            "Info": "Specifies the AES256 encryption algorithm in CTR mode.\n-"
        },
        {
            "Parameters": "arcfour128",
            "Info": "Specifies the Arcfour128 encryption algorithm.\n-"
        },
        {
            "Parameters": "arcfour256",
            "Info": "Specifies the Arcfour256 encryption algorithm.\n-"
        },
        {
            "Parameters": "blowfish_cbc",
            "Info": "Specifies the Blowfish encryption algorithm in CBC mode.\n-"
        },
        {
            "Parameters": "aes128_gcm",
            "Info": "Specifies the AES128 encryption algorithm in GCM mode.\n-"
        },
        {
            "Parameters": "aes256_gcm",
            "Info": "Specifies the AES256 encryption algorithm in GCM mode.\n-"
        },
        {
            "Parameters": "aes192_ctr",
            "Info": "Specifies the AES192 encryption algorithm in CTR mode.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ssh server cipher aes256_ctr"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure encryption algorithms on an SSH server, run the ssh server cipher command. The SSH client and server negotiate encryption algorithms for the packets exchanged between them. During negotiation, the client sends the specified encryption algorithms to the server. After comparing the received encryption algorithms with the local ones, the server selects the first matching encryption algorithm received for packet transmission. If no matching encryption algorithm is found, the negotiation fails.\nPrecautions\nTo ensure high security, you can use the encryption algorithms such as: aes128_ctr, aes256_ctr, aes192_ctr, aes128_gcm, aes256_gcm.\nThis command takes effect for both IPv4 and IPv6 SSH clients."
}