{
    "PageTitle": "ssh server publickey",
    "FuncDef": "The ssh server publickey command enables the public key algorithm function of the SSH server.\nThe undo ssh server publickey command restores public key algorithms of the SSH server to default values.\nBy default, RSA_SHA2_256 and RSA_SHA2_512 algorithms are enabled.",
    "CLIs": [
        "ssh server publickey { dsa | ecc | rsa | sm2 | rsa_sha2_256 | rsa_sha2_512 } *",
        "undo ssh server publickey [ dsa | ecc | rsa | sm2 | rsa_sha2_256 | rsa_sha2_512 ] *"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "dsa",
            "Info": "Indicates the DSA algorithm.\n-"
        },
        {
            "Parameters": "ecc",
            "Info": "Indicates the ECC algorithm.\n-"
        },
        {
            "Parameters": "rsa",
            "Info": "Indicates the RSA algorithm.\n-"
        },
        {
            "Parameters": "rsa_sha2_256",
            "Info": "Indicates the RSA SHA2-256 algorithm.\n-"
        },
        {
            "Parameters": "rsa_sha2_512",
            "Info": "Indicates the RSA SHA2-512 algorithm.\n-"
        },
        {
            "Parameters": "sm2",
            "Info": "Indicates the SM2 algorithm.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ssh server publickey ecc"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ssh server publickey sm2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe command enables you to use a more secure public key algorithm to log in to the device, with other public key algorithms rejected. This improves device security. You are advised to use the RSA_SHA2_256 or RSA_SHA2_512 public key algorithm.To allow a public key algorithm and deny other public key algorithms, run the ssh server publickey specified public key algorithm command. For example, after the ssh server publickey dsa command is run, the DSA algorithm is allowed but other algorithms are not. If this command is run more than once, the latest configuration overrides the previous one.To ensure high security, do not use the RSA algorithm whose length is less than 2048 digits as the authentication type for the SSH user. You are advised to use a more secure RSA_SHA2_256 or RSA_SHA2_512 authentication algorithm for higher security.\n\nPrecautions\nA public key algorithm can be used for login only after it is enabled on both the client and server.When you run the undo ssh server publickey command with an algorithm specified, ensure that the algorithm specified is the same as that configured using the ssh server publickey command. Or you can run the undo ssh server publickey command with no algorithm specified. Otherwise, the configuration restoration function does not take effect.This command takes effect for both IPv4 and IPv6 SSH servers."
}