{
    "PageTitle": "telnet server login-failed threshold-alarm",
    "FuncDef": "The telnet server login-failed threshold-alarm command configures alarm generation and clearance thresholds for Telnet server login failures within a specified period.\nThe undo telnet server login-failed threshold-alarm command restores the default alarm generation and clearance thresholds.\nBy default, an alarm is generated if the number of login failures reaches 30 within 5 minutes and is cleared if the number of login failures falls below 20 within the same period.",
    "CLIs": [
        "telnet server login-failed threshold-alarm upper-limit <report-times> lower-limit <resume-times> period <period-time>",
        "undo telnet server login-failed threshold-alarm",
        "undo telnet server login-failed threshold-alarm upper-limit <report-times> lower-limit <resume-times> period <period-time>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "lower-limit resume-times",
            "Info": "Specifies an alarm clearance threshold.\nThe value is an integer ranging from 0 to report-times. It varies with report-times. The default value is 20, and the maximum value is 45. If resume-times is 0, it functions the same as the value is set to 1, which means that a clear alarm is generated if no login failures occur."
        },
        {
            "Parameters": "period period-time",
            "Info": "Specifies a statistics collection period.\nThe value is an integer ranging from 1 to 120, in minutes. The default value is 5. If report-times is 0, the period-time value specified does not take effect."
        },
        {
            "Parameters": "upper-limit report-times",
            "Info": "Specifies an alarm generation threshold.\nThe value is an integer ranging from 0 to 100. The default value is 30. If the value is 0, no alarms are generated upon Telnet server login failures."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] telnet server login-failed threshold-alarm upper-limit 20 lower-limit 10 period 3"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo manage frequent Telnet server login failures within a specified period, run the telnet server login-failed threshold-alarm command to configure alarm generation and clearance thresholds for the login failures.\nThis command takes effect for both ipv4 and ipv6 Telnet servers."
}