{
    "PageTitle": "multicast ipv6 load-splitting(VPN instance view)",
    "FuncDef": "The multicast ipv6 load-splitting command configures an IPv6 multicast load splitting policy.\nThe undo multicast ipv6 load-splitting command restores the default configuration.\nBy default, no IPv6 multicast load splitting policy is configured.",
    "CLIs": [
        "multicast ipv6 load-splitting { group | source | source-group | stable-preferred | balance-ucmp }",
        "undo multicast ipv6 load-splitting"
    ],
    "ParentView": [
        "VPN instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "group",
            "Info": "Indicates group address-based load splitting, which is applicable to the scenario of one source to multiple groups.\n-"
        },
        {
            "Parameters": "source",
            "Info": "Indicates source address-based load splitting, which is applicable to the scenario of one group to multiple sources.\n-"
        },
        {
            "Parameters": "source-group",
            "Info": "Indicates source and group addresses-based load splitting, which is applicable to the scenario of multiple sources to multiple groups.\n-"
        },
        {
            "Parameters": "stable-preferred",
            "Info": "Indicates stable-preferred load splitting, which is applicable to a stable multicast networking.\n-"
        },
        {
            "Parameters": "balance-ucmp",
            "Info": "Indicates link bandwidth-based load splitting. This policy is applicable to the scenario in which links have different bandwidth.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance abcde",
            "[*HUAWEI-vpn-instance-abcde] ipv6-family",
            "[*HUAWEI-vpn-instance-abcde-af-ipv6] route-distinguisher 200:200",
            "[*HUAWEI-vpn-instance-abcde-af-ipv6] quit",
            "[*HUAWEI-vpn-instance-abcde] multicast ipv6 routing-enable",
            "[*HUAWEI-vpn-instance-abcde] multicast ipv6 load-splitting stable-preferred"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf multiple IPv6 equal-cost routes exist on a network, run the multicast ipv6 load-splitting command to realize load splitting among these routes. The Router selects equal-cost routes from unicast, MBGP, MIGP, and multicast static routing tables, and determines the routing table for creating multicast routing entries based on the mask lengths and preferences of routes. The Router supports IPv6 load splitting among the routes in only one routing table.\nPrerequisites\nThe multicast ipv6 routing-enable command is run in vpn instance view.\nConfiguration Impact\nThe four load splitting policies are mutually exclusive. You are advised to adopt a fixed IPv6 multicast load splitting policy based on the actual networking.\nstable-preferred is specified, the Router runs the load splitting algorithm based on the actual network status and splits (*, G) and (S, G) entries into the corresponding equal-cost routes; When equal-cost routes are added or deleted, the Router automatically adjusts and balances the entries; when IPv6 multicast routing entries are deleted, the Router does not automatically adjust the entries on the equal-cost routes.group, source, or source-group is specified, fixed algorithms are used for load splitting. In case that multicast routing entries and network configurations are stable, Reverse Path Forwarding (RPF) interfaces and RPF neighbors keep unchanged.balance-ucmp is specified, the Router automatically adjusts and balances traffic based on link bandwidth, implementing unequal load splitting."
}