{
    "PageTitle": "multicast ipv6 minimum-ttl",
    "FuncDef": "The multicast ipv6 minimum-ttl command sets the minimum TTL value of IPv6 multicast packets that an interface is allowed to send.\nThe undo multicast ipv6 minimum-ttl command restores the default value.\nBy default, the minimum TTL value of IPv6 multicast packets that an interface is allowed to send is 1.",
    "CLIs": [
        "multicast ipv6 minimum-ttl <ttl-value>",
        "undo multicast ipv6 minimum-ttl"
    ],
    "ParentView": [
        "PW-VE sub-interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "GE electrical interface view",
        "Port extension interface view",
        "Loopback interface view",
        "Serial interface view",
        "Eth-Trunk sub-interface view",
        "50GE sub-interface view",
        "MP-group interface view",
        "400GE interface view",
        "10GE interface view",
        "GE sub-interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "GE interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "100ge sub-interface view",
        "25GE interface view",
        "40GE sub-interface view",
        "Eth-Trunk interface view",
        "10GE sub-interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "ttl-value",
            "Info": "Specifies the minimum TTL value of IPv6 multicast packets that an interface is allowed to send.\nThe value is an integer ranging from 1 to 255."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast ipv6 routing-enable",
            "[*HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] ipv6 enable",
            "[*HUAWEI-GigabitEthernet1/0/0] multicast ipv6 minimum-ttl 8"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy setting the minimum TTL value of IPv6 multicast packets on an interface, you can limit the transmission distance of IPv6 multicast packets. If you do not want an interface to forward IPv6 multicast packets, you can change the minimum TTL value set on the interface to a larger value.\nAn interface will compare the TTL value of an IPv6 multicast packet (either the packet received and to be forwarded by the interface or the packet constructed and to be sent by the interface) with the minimum TTL value configured on it and determine whether to send or forward the packet out.\nIf the TTL value of the packet (that has already reduced by 1 on the interface) is greater than or equal to the minimum TTL value configured on the interface, the interface forwards the packet out.If the TTL value of the packet is smaller than the minimum TTL value configured on the interface, the interface discards the packet.\n\nPrerequisites\nThe multicast ipv6 routing-enable command is run in the public network instance view.\nConfiguration Impact\nIf the multicast ipv6 minimum-ttl command is run several times, the latest configuration overrides the previous one.\nPrecautions\nIf the minimum TTL value is set to 255 on an interface, the interface does not forward any IPv6 multicast packets."
}