{
    "PageTitle": "echo-timeout count",
    "FuncDef": "The echo-timeout count command sets a timeout threshold for CUSP connection heartbeat detection.\nThe undo echo-timeout count command restores the default configuration.\nBy default, the timeout threshold for CUSP connection heartbeat detection is 5.",
    "CLIs": [
        "echo-timeout count <countval>",
        "undo echo-timeout count <countval>",
        "undo echo-timeout count"
    ],
    "ParentView": [
        "CUSP-forwarder view"
    ],
    "ParaDef": [
        {
            "Parameters": "countval",
            "Info": "Specifies a timeout threshold for heartbeat detection.\nThe value is an integer ranging from 4 to 10."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] cu-controller",
            "[~HUAWEI-cu-controller] up 1024",
            "[~HUAWEI-cu-controller-up1024] config",
            "[~HUAWEI-cu-controller-up1024-config] cusp agent abc",
            "[~HUAWEI-cu-controller-up1024-config-cusp-agent-abc] echo-timeout count 6"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] cu-controller",
            "[~HUAWEI-cu-controller] up 1024",
            "[~HUAWEI-cu-controller-up1024] config",
            "[~HUAWEI-cu-controller-up1024-config] cusp agent abc",
            "[~HUAWEI-cu-controller-up1024-config-cusp-agent-abc] echo-timeout count 6"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo specify the number of echo-request packet sending times used to determine whether the heartbeat of a CUSP channel is lost, run the echo-timeout command.If the heartbeat detection times out for countval consecutive times, the CUSP channel is disconnected.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nIf the echo-timeout count command is run in the CUSP controller view, but not in the CUSP controller agent view, the command configuration takes effect on all CUSP connections.If the echo-timeout count command is run in the CUSP controller agent view, this configuration takes precedence over the global configuration.Do not run this command unless there are special requirements. Using the default value is recommended."
}