{
    "PageTitle": "echo-interval (ofa)",
    "FuncDef": "The echo-interval command sets the interval at which heartbeat packets are sent over a CUSP connection.\nThe undo echo-interval command restores the default interval.\nBy default, the interval at which heartbeat packets are sent over a CUSP connection is 30 seconds.",
    "CLIs": [
        "echo-interval <interval>",
        "undo echo-interval <interval>",
        "undo echo-interval"
    ],
    "ParentView": [
        "CUSP-forwarder view"
    ],
    "ParaDef": [
        {
            "Parameters": "interval",
            "Info": "Specifies the interval at which heartbeat packets are sent.\nThe value is an integer ranging from 2 to 60, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] cu-controller",
            "[~HUAWEI-cu-controller] up 1024",
            "[~HUAWEI-cu-controller-up1024] config",
            "[~HUAWEI-cu-controller-up1024-config] cusp agent abc",
            "[~HUAWEI-cu-controller-up1024-config-cusp-agent-abc] echo-interval 20"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nDevices at both ends of a CUSP connection send Echo Request (heartbeat) packets to monitor the status of the CUSP connection. To perform heartbeat detection, run both the echo-interval and echo-timeout count commands. If the initiator at either end neither receives an Echo Reply packet nor receives any other valid CUSP packet from the peer after sending Echo Request packets for several consecutive times specified using within a heartbeat detection period specified using , the device considers the peer faulty and tears down the CUSP connection. If the initiator does not receive any Echo Reply packet but receives another valid CUSP packet from the peer, it does not tear down the connection.\nThis command is delivered by the vBRAS-CP to the vBRAS-UP.\nPrerequisites\nThe CUSP forwarder view has been displayed by running the cusp agent command.\nPrecautions\nTo prevent CUSP session flapping, you are advised to set a large interval on both the controller and forwarder in either of the following scenarios:\nA large volume of service data is exchanged between the controller and forwarder.A large number of services exist in the system.\nIn VS mode, this command is supported only by the admin VS."
}