{
    "PageTitle": "transport-address (ofa)",
    "FuncDef": "The transport-address command configures a local IP address for a CUSP connection.\nThe undo transport-address command deletes the local IP address configured for a CUSP connection.\nBy default, no local IP address is configured for a CUSP connection.",
    "CLIs": [
        "transport-address <transport-ip> [ vpn-instance <vpn-instance-name> ]",
        "undo transport-address <transport-ip> vpn-instance <vpn-instance-name>",
        "undo transport-address <transport-ip>",
        "undo transport-address"
    ],
    "ParentView": [
        "CUSP-forwarder view"
    ],
    "ParaDef": [
        {
            "Parameters": "transport-ip",
            "Info": "Specifies a local IP address for a CUSP connection.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies the name of the VPN instance used by a CUSP connection.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] cu-controller",
            "[~HUAWEI-cu-controller] up 1024",
            "[~HUAWEI-cu-controller-up1024] config",
            "[~HUAWEI-cu-controller-up1024-config] cusp agent abc",
            "[~HUAWEI-cu-controller-up1024-config-cusp-agent-abc] transport-address 1.1.1.1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn a CU separation scenario, the controller and forwarders communicate through control channels. The control channels can be established using various protocols. Currently, the VRP uses the CUSP protocol to establish the control channels. To configure a local IP address for a CUSP connection, run the transport-address command.\nThis command is delivered by the vBRAS-CP to the vBRAS-UP.\nPrerequisites\nThe CUSP forwarder view has been displayed by running the cusp agent command.\nConfiguration Impact\nAfter the transport-address command is run on a forwarder, the forwarder and the controller establish a TCP connection for CUSP exchanges.\nPrecautions\nAfter the undo transport-address command is run, the related CUSP session is interrupted.\nIn VS mode, this command is supported only by the admin VS."
}