{
    "PageTitle": "channel",
    "FuncDef": "This command creates a multicast channel within the bundle where it is configured. A join for a particular multicast channel can be accepted if:",
    "CLIs": [
        "channel <start-address> <end-address> bw <bandwidth> [ class <class> ] [ type <type> ] [ source <prefix/prefix-length> ]",
        "no channel <start-address> <end-address> [ source <prefix/prefix-length> ]"
    ],
    "ParentView": [
        "config>router>mcac>policy>bundle"
    ],
    "ParaDef": [
        {
            "Parameters": "start-address",
            "Info": "Specifies the beginning multicast IP address that identifies a multicast stream (BTV channel). Both addresses have to be either IPv4 or IPv6. Values-This must be a valid IPv4 or IPv6 multicast group address."
        },
        {
            "Parameters": "end-address",
            "Info": "Specifies the ending multicast IP address that identifies a multicast stream (BTV channel). Both addresses have to be either IPv4 or IPv6. Values-This must be a valid IPv4 or IPv6 multicast group address."
        },
        {
            "Parameters": "prefix/prefix-length",
            "Info": "Specifies the source of the multicast IP stream. This must be a valid IPv4 or IPv6 multicast source address prefix. Values-address-prefix/prefix-length."
        },
        {
            "Parameters": "bandwidth",
            "Info": "Specifies the bandwidth required by this channel in kb/s. If this bandwidth is configured for a mandatory channel then this bandwidth is reserved by subtracting the amount from the total available bandwidth for all potential egress interfaces and the bundle. Values-10 to 10000000 kb/s."
        },
        {
            "Parameters": "class",
            "Info": "Provides deeper classification of channels used in the algorithm when LAG ports change state. Values-high, low. ParamDefault: Default- low"
        },
        {
            "Parameters": "type",
            "Info": "Specifies the channel to be either mandatory or optional. Values-mandatory | optional. ParamDefault: Default- optional"
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: No channels are specified as part of a bundle on default."
}