{
    "PageTitle": "level",
    "FuncDef": "This command configures an explicit within-CIR bandwidth limit and a total bandwidth limit for each port scheduler s priority level. To understand how to set the level rate and CIR parameters, a basic understanding of the port-level scheduler bandwidth allocation mechanism is required. The port scheduler takes all available bandwidth for the port or channel (after the max-rate and any port egress-rate limits have been accounted for) and offers it to each of the eight priority levels twice.",
    "CLIs": [
        "level <priority-level> rate <pir-rate> [ cir <cir-rate> ] group <name> [ weight <weight> ] [ monitor-threshold <percent> ]",
        "level <priority-level> percent-rate <pir-percent> [ percent-cir <cir-percent> ] group <name> [ weight <weight> ] [ monitor-threshold <percent> ]",
        "level <priority-level> rate <pir-rate> [ cir <cir-rate> ] [ monitor-threshold <percent> ]",
        "level <priority-level> percent-rate <pir-percent> [ percent-cir <cir-percent> ] [ monitor-threshold <percent> ]",
        "no level <priority-level>"
    ],
    "ParentView": [
        "config>qos>port-scheduler-policy"
    ],
    "ParaDef": [
        {
            "Parameters": "priority-level",
            "Info": "Specifies to which priority level the level command pertains. Each of the eight levels is represented by an integer value of 1 to 8, with 8 being the highest priority level. Values-1 to 8 (8 is the highest priority)."
        },
        {
            "Parameters": "pir pir",
            "Info": "Specifies the total bandwidth limits allocated to priority-level. Values-1 to 3200000000 | max (kilobits per second (1,000 bits per second))."
        },
        {
            "Parameters": "percent-rate pir-percent",
            "Info": "Specifies the percent bandwidth limits allocated to priority-level. Values-0.01 to 100.00 | max (kilobits per second)."
        },
        {
            "Parameters": "cir cir",
            "Info": "The cir specified limits the total bandwidth allocated in the within-CIR distribution pass to priority-level. When cir is not specified, all the available port or channel bandwidth may be allocated to the specified priority level during the within-CIR pass. Values-0 to 3200000000 | max (kilobits per second)."
        },
        {
            "Parameters": "percent-cir cir-percent",
            "Info": "Specifies the percent bandwidth limits allocated to priority-level. Values-0.01 to 100.00 | max (kilobits per second)."
        },
        {
            "Parameters": "group name",
            "Info": "specifies the existing group that the weighted scheduler group this level maps to."
        },
        {
            "Parameters": "weight weight",
            "Info": "Specifies the weight of the level within this weighted scheduler group. Values-1 to 100. ParamDefault: Default- 1"
        },
        {
            "Parameters": "monitor-threshold percent",
            "Info": "Specifies the percent of the configured rate. If the offered rate exceeds the configured threshold, a counter monitoring the threshold will be increased. Values-0 to 100."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: no level priority-level"
}