{
    "PageTitle": "orphan-override",
    "FuncDef": "This command overrides the default orphan behavior for port schedulers created using the port scheduler policy. The default orphan behavior is to give all orphan queues and schedulers bandwidth after all other properly parented queues and schedulers. Orphans by default do not receive any within-CIR bandwidth and receive above-CIR bandwidth after priority levels 8 through 1 have been allocated. The orphan-override command accepts the same parameters as the port-parent command in the SAP egress and network queue policy contexts. The defined parameters are used as a default port-parent association for any queue or scheduler on the port that the port scheduler policy is applied.",
    "CLIs": [
        "orphan-override [ level <priority-level> ] [ weight <weight> ] [ cir-level <cir-level> ] [ cir-weight <cir-weight> ]",
        "no orphan-override"
    ],
    "ParentView": [
        "config>qos>port-scheduler-policy"
    ],
    "ParaDef": [
        {
            "Parameters": "level priority-level",
            "Info": "Defines the port priority the orphan queues and schedulers will use to receive bandwidth for their above-CIR offered-load. Values-1 to 8 (8 is the highest priority). ParamDefault: Default- 1"
        },
        {
            "Parameters": "weight weight",
            "Info": "Defines the weight the orphan queues and schedulers will use in the above-CIR port priority level (defined by the level parameter). Values-1 to 100. ParamDefault: Default- 1"
        },
        {
            "Parameters": "cir-level cir-level",
            "Info": "Defines the port priority the orphan queues and schedulers will use to receive bandwidth for their within-CIR offered-load. If the cir-weight parameter is set to a value of 0 (the default value), the orphan queues and schedulers do not receive bandwidth during the port scheduler s within-CIR pass and the cir-level parameter is ignored. If the cir-weight parameter is 1 or greater, the cir-level parameter comes into play. Values-1 to 8 (8 is the highest level)."
        },
        {
            "Parameters": "cir-weight cir-weight",
            "Info": "Defines the weight the orphan queues and schedulers will use in the within-CIR port priority level (defined by the cir-level parameter). When the cir-weight parameter is set to a value of 0 (the default value), the orphan queues and schedulers do not receive bandwidth during the port scheduler s within-CIR pass and the cir-level parameter is ignored. If the cir-weight parameter is 1 or greater, the cir-level parameter comes into play. Values-1 to 100 (100 is the highest weight)."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}