{
    "PageTitle": "port-parent",
    "FuncDef": "Theport-parentcommand defines a child/parent association between an egress scheduler and a port-based scheduler, or between an intermediate service scheduler and a port-based scheduler. Theport-parentcommand allows for a set of within-CIR and above-CIR parameters that define the port priority levels and weights for the scheduler. If theport-parentcommand is executed without any parameters, the default parameters are assumed.",
    "CLIs": [
        "port-parent [ weight <weight> ] [ level <level> ] [ cir-weight <cir-weight> ] [ cir-level <cir-level> ]",
        "no port-parent"
    ],
    "ParentView": [
        "config>qos>scheduler-policy>tier>scheduler"
    ],
    "ParaDef": [
        {
            "Parameters": "weight weight",
            "Info": "Defines the weight the queue or scheduler will use at the above-CIR port priority level (defined by the level parameter). Values-0 to 100. ParamDefault: Default- 1"
        },
        {
            "Parameters": "level level",
            "Info": "Defines the port priority the queue or scheduler will use to receive bandwidth for its above-CIR offered-load. Values-1 to 8 (8 is the highest priority). ParamDefault: Default- 1"
        },
        {
            "Parameters": "cir-weight cir-weight",
            "Info": "Defines the weight the queue or scheduler will use at the within-CIR port priority level (defined by the cir-level parameter). The weight is specified as an integer value from 0 to 100 with 100 being the highest weight. When the cir-weight parameter is set to a value of 0, the queue or scheduler does not receive bandwidth during the port scheduler s within-CIR pass and the cir-level parameter is ignored. If the cir-weight parameter is 1 or greater, the cir-level parameter comes into play. Values-0 to 100. ParamDefault: Default- 0"
        },
        {
            "Parameters": "cir-level cir-level",
            "Info": "Defines the port priority the queue or scheduler will use to receive bandwidth for its within-CIR offered-load. If the cir-weight parameter is set to a value of 0 (the default value), the queue or scheduler does not receive bandwidth during the port scheduler s within-CIR pass and the cir-level parameter is ignored. If the cir-weight parameter is 1 or greater, the cir-level parameter comes into play. Values-0 to 8 (8 is the highest priority). ParamDefault: Default- 0"
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: no port-parent"
}