{
    "PageTitle": "access-vlan",
    "FuncDef": "The access-vlan command adds one VLAN or a group of VLANs to a super VLAN. All the VLANs added to the super VLAN are called sub-VLANs.\nThe undo access-vlan command deletes one VLAN or a group of VLANs from a super VLAN.\nBy default, no VLAN is added to a super VLAN.",
    "CLIs": [
        "access-vlan { <vlan-id1> [ to <vlan-id2> ] } &<1-10>",
        "undo access-vlan { <vlan-id1> [ to <vlan-id2> ] } &<1-10>"
    ],
    "ParentView": [
        "VLAN view"
    ],
    "ParaDef": [
        {
            "Parameters": "vlan-id1",
            "Info": "Specifies the start VLAN ID.\nThe value is an integer ranging from 1 to 4094."
        },
        {
            "Parameters": "vlan-id2",
            "Info": "Specifies the end VLAN ID.\nThe value is an integer ranging from 1 to 4094."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] vlan batch 3 to 10 20 to 30 50",
            "[*HUAWEI] vlan 2",
            "[*HUAWEI-vlan2] aggregate-vlan",
            "[*HUAWEI-vlan2] access-vlan 3 to 10 20 to 30 50"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nVLANs are widely used on switching networks because of its flexible control of broadcast domains and convenient deployment. To implement communication between VLANs, you need to create a VLANIF interface for each VLAN and assign an IP address to the VLANIF interface. This wastes IP address resources. To implement communication between VLANs and save IP address resources, configure VLAN aggregation.\nIn VLAN aggregation, a super VLAN is associated with multiple sub-VLANs. A super VLAN does not support physical interface addition but can have a VLANIF interface and IP address configured. A sub-VLAN supports physical interface addition but cannot have a VLANIF interface configured. All the interfaces in the sub-VLAN use the IP address assigned to the VLANIF interface of the super VLAN. This saves some subnet IDs, subnets' default gateway addresses, directed broadcast addresses as well as eliminates subnet differences by allowing different broadcast domains to use addresses in the same subnet segment. In addition, VLAN aggregation improves addressing flexibility and reduces idle address waste. It allows each sub-VLAN to function as a broadcast domain to implement broadcast isolation and saves IP address resources.\nTo add one or more VLANs to the super VLAN, run the access-vlan command. After being added to the super VLAN, the VLAN(s) becomes sub-VLAN(s).\nPrerequisites\nA VLAN has been configured as a super VLAN using the aggregate-vlan command.\nVLANs to be added to the super VLAN have been created and no VLANIF interface is created for the VLANs. If VLANIF interfaces have been created for the VLANs, delete the VLANIF interfaces first.\nConfiguration Impact\nVLANIF interfaces cannot be created for the VLANs that are added to a super VLAN.\nIf the access-vlan is run for several times, all the VLANs added to the super VLAN are valid\nPrecautions\nA super VLAN must have a different VLAN ID from sub-VLANs.\nOne VLAN cannot be added to different super VLANs.\nA super VLAN is composed of sub-VLANs and does not support physical interface addition.\nThe IP address of the VLANIF interface of a super VLAN must cover the subnet segments where users in sub-VLANs reside. The sub-VLANs all use the IP address of the VLANIF interface of the super VLAN."
}