{
    "PageTitle": "port link-type",
    "FuncDef": "The port link-type command configures a link type on an Ethernet interface.\nThe undo port link-type command restores the default link type.\nThe default link type of an interface is hybrid.",
    "CLIs": [
        "port link-type access",
        "port link-type hybrid",
        "port link-type trunk",
        "port link-type dot1q-tunnel",
        "undo port link-type"
    ],
    "ParentView": [
        "Layer 2 100GE interface view",
        "Layer 2 10GE interface view",
        "25GE-L2 view",
        "400GE-L2 view",
        "Layer 2 40GE interface view",
        "Layer 2 50GE interface view",
        "Layer 2 50|100GE interface view",
        "Eth-Trunk interface view",
        "Layer 2 GE interface view",
        "Port extension Layer 2 interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "hybrid",
            "Info": "Configures the link type of an interface as hybrid.\n-"
        },
        {
            "Parameters": "trunk",
            "Info": "Configures the link type of an interface as trunk.\n-"
        },
        {
            "Parameters": "dot1q-tunnel",
            "Info": "Configures the link type of an interface as dot1q-tunnel.\n-"
        },
        {
            "Parameters": "access",
            "Info": "Configures the link type of an interface as access.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1/0/1",
            "[*HUAWEI-GigabitEthernet1/0/1] portswitch",
            "[*HUAWEI-GigabitEthernet1/0/1] port link-type trunk"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nDifferent types of interfaces can be used in different scenarios:\nAccess interfaces are used to connect user hosts on access links. These interfaces transmit Ethernet frames without tags. If a default VLAN is configured for an access interface, the access interface can transmit Ethernet frames with a VLAN ID same as the default VLAN ID.Trunk interfaces are used to connect switching devices on trunk links. A trunk interface allows frames with VLAN tags to pass through.Hybrid interfaces are used to connect user hosts or switching devices on access links or trunk links. A hybrid interface allows frames with or without VLAN tags to pass through.Dot1q-tunnel interfaces are usually applied on carrier networks. This type of interfaces expands VLAN space by adding another 802.1Q tag to a tagged packet. In this manner, private VLAN packets can be transparently transmitted to the public network.\n\nPrecautions\nThe port link-type command cannot be configured on physical interfaces that are added to an Eth-Trunk.\nA Layer 3 interface must be switched to a Layer 2 interface using the portswitch command. The link type of the Layer 2 interface is hybrid by default. You can run the port link-type command to modify its link type."
}