{
    "PageTitle": "qinq protocol",
    "FuncDef": "The qinq protocol command configures the EtherType value in the outer tag of tagged packets.\nThe undo qinq protocol command restores the default EtherType value in the outer tag of tagged packets.\nBy default, the EtherType value in the outer tag of tagged packets received by an Ethernet interface is 0x8100.",
    "CLIs": [
        "qinq protocol <ethertype-value>",
        "undo qinq protocol"
    ],
    "ParentView": [
        "Layer 2 40GE interface view",
        "40GE interface view",
        "GE electrical interface view",
        "Port extension interface view",
        "Port extension Layer 2 interface view",
        "Layer 2 10GE interface view",
        "Layer 2 GE interface view",
        "400GE interface view",
        "10GE interface view",
        "Layer 2 100GE interface view",
        "Layer 2 50|100GE interface view",
        "25GE-L2 view",
        "400GE-L2 view",
        "GE interface view",
        "Layer 2 50GE interface view",
        "100GE interface view",
        "50GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Eth-Trunk interface view",
        "FlexE interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "protocol ethertype-value",
            "Info": "Specifies the EtherType value in the outer tag of tagged packets on an Ethernet interface. If this parameter is set to a well-known Ethernet encapsulation type, packet identification will be affected on inbound interfaces, which will result in packet forwarding errors. Therefore, setting this parameter to a well-known Ethernet encapsulation type is not recommended.\nThe value ranges from 0x0600 to 0xFFFF, in hexadecimal format."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] qinq protocol 9100"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen a Huawei device connects to a non-Huawei device and QinQ is configured, these devices all use 0x8100 as the EtherType value in the inner tag protocol identifier (TPID) but may use different EtherType values in the outer TPID. For example, the non-Huawei device uses the EtherType value 0x88a8 defined in IEEE 802.1ad in the outer TPID while the Huawei device uses the EtherType value 0x8100. To implement interoperation between these devices, run the qinq protocol command to configure an EtherType value in the outer tag.\nPrecautions\nThe qinq protocol command takes effect both on double-tagged and single-tagged packets.\nThis command can be used on Layer 2 and Layer 3 Ethernet interfaces."
}