{
    "PageTitle": "qinq-vlan description",
    "FuncDef": "The qinq-vlan description command configures a description for the outer VLAN tag carried in double-tagged packets that a sub-interface receives.\nThe undo qinq-vlan description command deletes the description for the outer VLAN tag carried in double-tagged packets that a sub-interface receives.\nBy default, no description is configured for the outer VLAN tag carried in double-tagged packets that a sub-interface receives.",
    "CLIs": [
        "qinq-vlan <pe-vlan> description <description>",
        "undo qinq-vlan <pe-vlan> description"
    ],
    "ParentView": [
        "Global VE sub-interface view",
        "Sub-interface view",
        "VE sub-interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "pe-vlan",
            "Info": "Specifies a VLAN ID.\nThe value is an integer ranging from 1 to 4094."
        },
        {
            "Parameters": "description",
            "Info": "Specifies a description.\nThe value is a string of 1 to 128 case-sensitive characters, spaces supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1/0/0.1",
            "[*HUAWEI-GigabitEthernet1/0/0.1] qinq-vlan 20 description huawei"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen users send double-tagged VLAN packets to go online in batches through a BRAS with the outer VLAN tag representing services and the inner VLAN tag representing users, to learn only the users' service information, run the qinq-vlan description command to configure a description for the outer VLAN tag carried in double-tagged packets that the BRAS's sub-interface receives.\nConfiguration Impact\nAfter the qinq-vlan description command is run on a sub-interface, any outer VLAN tag (irrespective of the inner VLAN tags) carrying the same VLAN ID as pe-vlan specified in the qinq-vlan description command will have the specified description.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}