{
    "PageTitle": "vlan-group",
    "FuncDef": "The vlan-group command creates a VLAN group and displays the VLAN group view.\nThe undo vlan-group command deletes a VLAN group.\n\nBy default, no VLAN group is configured on sub-interfaces.",
    "CLIs": [
        "vlan-group <group-id>",
        "undo vlan-group <group-id>"
    ],
    "ParentView": [
        "GE sub-interface view",
        "PW-VE sub-interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "Global VE sub-interface view",
        "Eth-Trunk sub-interface view",
        "400GE sub-interface view",
        "50GE sub-interface view",
        "100ge sub-interface view",
        "40GE sub-interface view",
        "10GE sub-interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "group-id",
            "Info": "Specifies the VLAN group ID.\nThe value is an integer ranging from 1 to 16."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/1.1",
            "[*HUAWEI-GigabitEthernet1/0/1.1] vlan-group 1",
            "[*HUAWEI-GigabitEthernet1/0/1.1-vlangroup1]"
        ]
    ],
    "ExtraInfo": "Usage Scenario\n\nAssume that QinQ has been configured on edge devices on a carrier network. In the following situations:\n\nThe network administrator needs to deploy separate QoS policies for various services. This ensures that service traffic with high priorities is more reliably transmitted over the network and helps to improve user experience.\nThe network administrator needs to view QinQ packet statistics to check the device status.\n\nRun the vlan-group command to create a VLAN group.\n\nConfiguration Impact\n\nAfter a VLAN group is created, you can configure the working mode for the VLAN group, enable VLAN group-based QinQ packet statistics, and view QinQ packet statistics.\n\nFollow-up Procedure\n\n\nPerform any of the following configuration steps:\n\n\nRun the dot1q termination vid low-pe-vid [ to high-pe-vid ] vlan-group group-id command in the view of a sub-interface for Dot1q VLAN tag termination to associate the VLAN IDs to be terminated by the sub-interface with the VLAN group.\nRun the qinq termination pe-vid pe-vid [ to high-pe-vid ] ce-vid low-ce-vid [ to high-ce-vid ] vlan-group group-id command in the view of a sub-interface for QinQ VLAN tag termination to associate the VLAN IDs to be terminated by the sub-interface with the VLAN group.\nRun the qinq stacking vid low-ce-vid [ to high-ce-vid ] vlan-group group-id command in the view of a QinQ stacking sub-interface to associate the outer VLAN ID with the VLAN group.\n\n2.Run the group mode command in the VLAN group view to configure the working mode for the VLAN group.\n3.Run the statistic enable (VLAN group view) command in the VLAN group view to enable VLAN group-based QinQ packet statistics.\nPrecautions\n\nPrecautions\n\nIf you configure vlan-group after you run the qinq stacking vid command on an Ethernet sub-interface, the qinq stacking vid command cannot be run."
}