{
    "PageTitle": "port trunk allow-pass vlan",
    "FuncDef": "The port trunk allow-pass vlan command adds a trunk or a hybrid interface to a VLAN.\nThe undo port trunk allow-pass vlan command deletes a trunk or a hybrid interface from a VLAN.\nBy default, a trunk or hybrid interface is not added to a VLAN.",
    "CLIs": [
        "port trunk allow-pass vlan { { { <vlan-id1> [ to <vlan-id2> ] } &<1-10> } | all }",
        "undo port trunk allow-pass vlan { { { <vlan-id1> [ to <vlan-id2> ] } &<1-10> } | all }"
    ],
    "ParentView": [
        "Layer 2 100GE interface view",
        "Layer 2 10GE interface view",
        "25GE-L2 view",
        "400GE-L2 view",
        "Layer 2 40GE interface view",
        "Layer 2 50GE interface view",
        "Layer 2 50|100GE interface view",
        "Layer 2 Eth-Trunk interface view",
        "Layer 2 GE interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "vlan-id1",
            "Info": "Specifies the start VLAN ID.\nThe value is an integer ranging from 1 to 4094."
        },
        {
            "Parameters": "vlan-id2",
            "Info": "Specifies the end VLAN ID.\nThe value is an integer ranging from 1 to 4094."
        },
        {
            "Parameters": "all",
            "Info": "Adds a trunk or a hybrid interface all VLANs.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1/0/1",
            "[*HUAWEI-GigabitEthernet1/0/1] portswitch",
            "[*HUAWEI-GigabitEthernet1/0/1] port link-type trunk",
            "[*HUAWEI-GigabitEthernet1/0/1] port trunk allow-pass vlan 2 to 10 100 200"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA trunk interface can be added to multiple VLANs and is generally used to connect network devices. If frames with one or more VLAN tags need to pass through a trunk interface, run the port trunk allow-pass command to add the trunk interface to the VLAN(s). In this manner, the trunk interface forwards these frames without removing the VLAN tags.\nPrerequisites\nAn interface has been configured as a trunk or a hybrid interface using the port link-type command.\nPrecautions\nThe trunk interface to be added to VLANs must be a Layer 2 interface. If the interface is a Layer 3 interface, run the portswitch command to change the interface to a Layer 2 interface.\nIf you run the port trunk allow-pass command more than once on the same interface, all the configured VLANs take effect on the interface.\nRunning the undo port trunk allow-pass vlan command on an interface deletes the MAC address entries of the interface."
}