{
    "PageTitle": "feature lldp",
    "FuncDef": "The Link Layer Discovery Protocol (LLDP), which is a neighbor discovery protocol that is used for network devices to advertise information about themselves to other devices on the network, is enabled on the switch by default.",
    "CLIs": [
        "feature lldp",
        "no feature lldp"
    ],
    "ParentView": null,
    "ParaDef": null,
    "Examples": [
        [
            "switch(config)# feature lldp",
            "switch(config)#"
        ],
        [
            "switch(config)# no feature lldp",
            "switch(config)#"
        ]
    ],
    "ExtraInfo": "You cannot enable or disable LLDP on a Cisco Nexus device. LLDP is enabled on the switch by default. However, the feature lldp command shows as part of the running configuration on the switch, as shown below:The Cisco Discovery Protocol (CDP) is a device discovery protocol that runs over Layer 2 (the data link layer) on all Cisco-manufactured devices (routers, bridges, access servers, and switches). CDP allows network management applications to automatically discover and learn about other Cisco devices connected to the network.To support non-Cisco devices and to allow for interoperability between other devices, the switch supports the Link Layer Discovery Protocol (LLDP). LLDP is a neighbor discovery protocol that is used for network devices to advertise information about themselves to other devices on the network. This protocol runs over the data-link layer, which allows two systems running different network layer protocols to learn about each other.\nCommand Default: Enabled",
    "HTMLPage": "data/manuals/cisco/cisco_nexus5500/cisco_nexus5500_layer2_command_ref_cisco_nexus5500_layer2_command_ref_chapter_0100.html",
    "ori_path": "data/cmdcorpus/cisco/cisco_nexus5500/cmd_corpus/cisco_nexus5500_layer2_command_ref_cisco_nexus5500_layer2_command_ref_chapter_0100/cisco_nexus5500_layer2_command_ref_cisco_nexus5500_layer2_command_ref_chapter_0100_feature lldp.json",
    "msg": [
        "ParentView should be a list."
    ]
}