{
    "PageTitle": "qos link-adjustment remote",
    "FuncDef": "The qos link-adjustment remote command configures the remote packet adjustment value.\nThe undo qos link-adjustment remote command deletes the configured remote packet adjustment value.\nBy default, the remote packet adjustment value is 0.",
    "CLIs": [
        "qos link-adjustment <adjust-value> remote",
        "undo qos link-adjustment remote"
    ],
    "ParentView": [
        "AAA domain view",
        "Interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "adjust-value",
            "Info": "Specifies the remote packet adjustment value.\nThe value is an integer that ranges from -64 to 64, in bytes. The default value is 0."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] domain huawei",
            "[*HUAWEI-aaa-domain-huawei] qos link-adjustment 20 remote"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWith last-mile QoS, you can configure the following two parameters to change the DSLAM link bandwidth so that the rate of the packets sent by the router is the same as that of the packets on the DSLAM peer. This rate is actually the bandwidth specified by users. In this manner, the traffic rate will not exceed the actual performance of the DSLAM link, and traffic congestion is avoided.\nType of the remote DSLAM linkRemote packet adjustment value on the Router\nTwo types of DSLAM links are available: the frame type and the cell type. The remote packet adjustment value refers to the difference in bytes between the links on the two ends of a DSLAM due to their difference in packet encapsulation mode; the local packet adjustment value is used for adjusting the bandwidth when the remote packet adjustment value cannot meet the requirements for bandwidth adjustment.\n\nPrerequisites\nIn AAA domain view, before configuring the remote packet adjustment value, you must enable the last-mile QoS by running the qos link-adjustment remote enable command.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nFor L2TP services, this command has to be configured in the AAA domain view. If this command is configured in both the interface view and the AAA domain view, the command configured in the AAA domain view takes effect."
}