{
    "PageTitle": "qos link-adjustment link-layer-exclude l2tp-layer-exclude",
    "FuncDef": "The qos link-adjustment link-layer-exclude l2tp-layer-exclude command enables CAR for Layer 3 packets and statistics about Layer 3 packets.\nThe undo qos link-adjustment link-layer-exclude l2tp-layer-exclude command disables CAR for Layer 3 packets and statistics about Layer 3 packets.\nBy default, CAR for Layer 3 packets and statistics about Layer 3 packets are not enabled.",
    "CLIs": [
        "qos link-adjustment { link-layer-exclude | l2tp-layer-exclude } [ slot <slot-id> ]",
        "qos link-adjustment link-layer-exclude access-type leased-line-access [ slot <slot-id> ]",
        "undo qos link-adjustment { link-layer-exclude | l2tp-layer-exclude } [ slot <slot-id> ]",
        "undo qos link-adjustment link-layer-exclude access-type leased-line-access [ slot <slot-id> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "slot slot-id",
            "Info": "Specifies the slot ID of the interface board where CAR and statistics are enabled for Layer 3 packets.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "access-type",
            "Info": "Specify access type.\n-"
        },
        {
            "Parameters": "leased-line-access",
            "Info": "Specify access type.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] qos link-adjustment link-layer-exclude slot 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter this command is configured, CAR and statistics are implemented only on Layer 3 packets. Layer 2 packets are ignored. If this command is not configured, CAR and statistics are implemented on all packets.\nThe command takes effect on all interfaces that are located on the specified interface board.\nThe qos link-adjustment link-layer-exclude command configures the device to ignore Layer 2 headers during CAR operations and to collect statistics only about non-L2TP LNS users instead of residential users.The undo qos link-adjustment link-layer-exclude command disables the device from ignoring Layer 2 headers during CAR operations.The qos link-adjustment l2tp-layer-exclude command configures the device to ignore Layer 2 and L2TP headers during CAR operations, to apply CAR only to Layer 3 packets, and collect statistics only about L2TP users.The undo qos link-adjustment l2tp-layer-exclude command disable the device from ignoring Layer 2 and L2TP headers during CAR operations, applying CAR only to Layer 3 packets, and collecting statistics only about L2TP LNS users instead of LAC users.The qos link-adjustment link-layer-exclude access-type leased-line-access [ slot slot-id ] command configures the device to ignore Layer 2 headers when CAR is performed in leased line user access scenarios.The undo qos link-adjustment link-layer-exclude access-type leased-line-access [ slot slot-id ] command disables the device from ignoring Layer 2 headers when CAR is performed in leased line user access scenarios.\nThe downstream LNS performs CAR on packets carrying L2TP headers, affecting CAR precision. After the qos link-adjustment l2tp-layer-exclude command is run, the device ignores L2TP headers when collecting traffic statistics about L2TP LNS users. That is, the length of collected packets decreases, improving CAR precision. Traffic statistics about non-L2TP LNS users are not affected. The qos link-adjustment l2tp-layer-exclude command takes effect only for new access L2TP LNS users.\n\nPrecautions\nThis command is supported only on the admin VS.\nThe parameter link-layer-exclude cannot be specified to a slot."
}