{
    "PageTitle": "ptp-adaptive announce receipt-timeout",
    "FuncDef": "The ptp-adaptive announce receipt-timeout command sets the allowable maximum number of consecutive Announce packets that the client fails to receive.\nThe undo ptp-adaptive announce receipt-timeout command restores the default setting.\nThe default value is 3.\nBy default, the value is 3.",
    "CLIs": [
        "ptp-adaptive announce receipt-timeout <timeout-time>",
        "undo ptp-adaptive announce receipt-timeout"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "receipt-timeout timeout-time",
            "Info": "Specifies the allowable maximum number of consecutive Announce packets that the client fails to receive.\nThe value is an integer ranging from 2 to 255."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ptp-adaptive enable",
            "[*HUAWEI] ptp-adaptive device-type client",
            "[*HUAWEI] ptp-adaptive announce receipt-timeout 8"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter the connection between the client and server is established, the server periodically sends Announce packets to inform the client of the connection validity.\nThe ptp-adaptive announce receipt-timeout command is used to set the allowable maximum number of consecutive Announce packets that the client fails to receive. Usually, the default value is used. The interval at which Announce packets are sent and the number of consecutive Announce packets that the client fails to receive together define the timeout period of the Announce packet. For example, if the interval at which Announce packets are sent is 0.125s and the number of consecutive Announce packets that the client fails to receive is 3, the timeout period of the Announce packet is 0.375s (0.125 x 3). Usually, 1588 ACR/ATR-enabled client and server are connected across an intermediate network. Considering the delay on the intermediate network, setting the timeout period for Announce packets to 1s or a larger value is recommended. As a result, the allowable maximum number of consecutive Announce packets that the client fails to receive can be set to 8.\nPrerequisites\n1588 ACR/ATR has been enabled.\nConfiguration Impact\nThe ptp-adaptive announce receipt-timeout command sets the allowable maximum number of consecutive Announce packets that the client fails to receive.\nPrecautions\nThis command is supported only on the admin VS.\nThis command is available only for 1588v2 ACR/ATR enabled clients."
}