{
    "PageTitle": "ptp-adaptive profile",
    "FuncDef": "The ptp-adaptive frequency profile command configures a device to totally comply with ITU-T G.8265.1.\nThe undo ptp-adaptive frequency profile command configures a device to partially comply with ITU-T G.8265.1.\nThe ptp-adaptive time profile command enables a device to support ITU-T G.8275.2.\nThe undo ptp-adaptive time profile command restores the default configuration.\nBy default, a device partially supports ITU-T G.8265.1.",
    "CLIs": [
        "ptp-adaptive { frequency | time } profile",
        "undo ptp-adaptive { frequency | time } profile"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "frequency",
            "Info": "Set frequency profile,support ITUT-G.8265.1.\n-"
        },
        {
            "Parameters": "time",
            "Info": "Set time profile, support ITUT-G.8275.2.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ptp-adaptive enable",
            "[*HUAWEI] ptp-adaptive frequency profile"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ptp-adaptive enable",
            "[*HUAWEI] ptp-adaptive time profile"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe ptp-adaptive frequency profile command can be used to configure a 1588 ACR-enabled device to totally comply with ITU-T G.8265.1.\nWhen 1588 ATR is used to implement time synchronization over a third-party network, run the ptp-adaptive time profile command to enable a device to support ITU-T G.8275.2.\nPrerequisites\nThe adaptive time synchronization function has been configured using the ptp-adaptive enable command.\nConfiguration Impact\nAfter the ptp-adaptive frequency profile command is run, the default domain value changes to 4. The domain value range changes to 4-23.After the undo ptp-adaptive frequency profile command is run, the default domain value changes to 0. The domain value range changes to 0-255.\nAfter the ptp-adaptive time profile command is run, the default value of the clock domain changes to 44, and the value range changes to 44 to 63.After the undo ptp-adaptive time profile command is run, the default value of the clock domain changes to 0, and the value range changes to 0 to 255.\nFollow-up Procedure\nThe frequency profile specified by the ptp-adaptive frequency profile command takes effect after 1588 ACR unicast negotiation is enabled. If the frequency profile needs to be changed, you need to first disable 1588 ACR unicast negotiation.\nThe ptp-adaptive time profile command takes effect after you run the ptp-adaptive atr unicast-negotiate enable command to enable 1588 ATR unicast negotiation on the device. If 1588 ATR unicast negotiation has been enabled, disable unicast negotiation before modifying the profile."
}