{
    "PageTitle": "ptp-adaptive atr asymmetry-correction",
    "FuncDef": "The ptp-adaptive atr asymmetry-correction command configures the correction time for delay asymmetry between the client and server in the 1588 ATR scenario.\nThe undo ptp-adaptive atr asymmetry-correction command restores the default configuration.\nBy default, the correction time for delay asymmetry between the client and server in the 1588 ATR scenario is 0 ns.",
    "CLIs": [
        "ptp-adaptive atr { server1 | server2 } asymmetry-correction { positive | negative } <correction-value>",
        "undo ptp-adaptive atr { server1 | server2 } asymmetry-correction [ { positive | negative } <correction-value> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "server1",
            "Info": "Indicates server 1.\n-"
        },
        {
            "Parameters": "server2",
            "Info": "Indicates server 2.\n-"
        },
        {
            "Parameters": "positive",
            "Info": "Indicates the positive correction value for asymmetric delay.\nThe value is an integer ranging from 0 to 2000000, in ns. The default value is 0."
        },
        {
            "Parameters": "negative",
            "Info": "Indicates the negative correction value for asymmetric delay.\nThe value is an integer ranging from 0 to 2000000, in ns. The default value is 0."
        },
        {
            "Parameters": "correction-value",
            "Info": "Asymmetry correction time value.\nThe value is an integer ranging from 0 to 2000000, in ns. The default value is 0."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[HUAWEI] ptp-adaptive atr server1 asymmetry-correction positive 100"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nDuring 1588v2 path delay and time calculation, the delays for the packet sending path and packet receiving path are the same by default. If they are different, set the correction-value parameter so that the correction-value value is automatically counted in path delay calculation.\nThe delay asymmetry between the client and server needs to be measured for the 1588 ATR feature. To configure the correction time for delay asymmetry between the client and server in the 1588 ATR scenario, run the ptp-adaptive atr asymmetry-correction command.\nThis command applies only to 1588 ATR.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}