{
    "PageTitle": "ptp-adaptive remote-server-ip",
    "FuncDef": "The ptp-adaptive remote-server-ip command configures the remote clock server list used for unicast negotiation.\nThe undo ptp-adaptive remote-server-ip command deletes the remote clock server list.\nBy default, no clock server is configured.",
    "CLIs": [
        "ptp-adaptive { remote-server1-ip | remote-server2-ip } <ip-address>",
        "undo ptp-adaptive { remote-server1-ip | remote-server2-ip }"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "remote-server1-ip ip-address",
            "Info": "Specifies the IP address of clock server 1.\nThe value of ip-address can be an IPv4 address only."
        },
        {
            "Parameters": "remote-server2-ip ip-address",
            "Info": "Specifies the IP address of clock server 2. Clock server 1 and clock server 2 back up each other.\nThe value of ip-address can be an IPv4 address only."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ptp-adaptive enable",
            "[*HUAWEI] ptp-adaptive device-type client",
            "[*HUAWEI] ptp-adaptive remote-server1-ip 10.0.0.1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe clock server's and client's IP addresses uniquely identify a connection, over which a client initiates Layer 3 1588 ACR/ATR unicast negotiation with a clock server. 1588v2 packets are exchanged over the Layer 3 unicast negotiation connection.\nPrerequisites\nBefore using the ptp-adaptive remote-server-ip command, enable 1588 ACR/ATR and run the ptp-adaptive device-type command to configure the device as a client.\nConfiguration Impact\nIf the ptp-adaptive remote-server-ip command is run to configure an IP address for a server that has been configured with an IP address, the newly configured IP address overwrites the original one. The ptp-adaptive remote-server-ip command can be used twice to specify an IP address for each of server 1 and server 2 so that the two servers can back up each other.\nIf the IP addresses of two remote servers are specified, the client sends connection requests to the servers at the same time. Based on the best master clock algorithm (BMCA) and SSM algorithms, a preferred server is selected as the master server, and the other server is selected as the backup server.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}