{
    "PageTitle": "ptp-adaptive request delay-resp-interval",
    "FuncDef": "The ptp-adaptive request delay-resp-interval command sets the interval at which the 1588 ACR/ATR-enabled server sends Delay_Resp packets.\nThe undo ptp-adaptive request delay-resp-interval command restores the default value.\nThe default interval at which the 1588 ACR/ATR-enabled server sends Delay_Resp packets is 3 (8/1024s).\nBy default, the interval at which the server sends Delay_Resp packets is 3 (8/1024s).",
    "CLIs": [
        "ptp-adaptive request delay-resp-interval <interval-value>",
        "undo ptp-adaptive request delay-resp-interval"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "delay-resp-interval interval-value",
            "Info": "Specifies the interval at which the 1588 ACR/ATR-enabled server sends Delay_Resp packets.\nThe value is an integer ranging from 3 to 14, in seconds. The value is obtained using the formula: Packet sending interval = 2n/210. n is the value of delay-resp-interval."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ptp-adaptive enable",
            "[~HUAWEI] ptp-adaptive request delay-resp-interval 5"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, the 1588 ACR/ATR-enabled server sends Delay_Resp packets at the shortest interval, which ensures a better clock performance but consumes great network bandwidth. To save network bandwidth for packet transmission, you can run the ptp-adaptive request delay-resp-interval command to enable the 1588 ACR/ATR-enabled server to send Delay_Resp packets at a longer interval.\nPrerequisites\n1588 ACR/ATR has been enabled.\nConfiguration Impact\nIf you run the ptp-adaptive request delay-resp-interval command several times, the latest configuration overrides the previous configurations.\nFollow-up Procedure\nEnable 1588 ACR/ATR unicast negotiation to validate the interval at which Delay_Resp packets are sent. If the interval at which Delay_Resp packets are sent needs to be changed, disable 1588 ACR/ATR unicast negotiation first.\nPrecautions\nThis command is supported only on the admin VS.\nThis command is run on the client."
}