{
    "PageTitle": "ptp-adaptive vpn-instance",
    "FuncDef": "The ptp-adaptive vpn-instance command sets a name for a VPN instance, that is, the name of the VPN instance to which a loopback interface is bound.\nThe undo ptp-adaptive vpn-instance command deletes the name configured for a VPN instance.\nBy default, no name is configured for a VPN instance, and PTP packets are forwarded over a public network.",
    "CLIs": [
        "ptp-adaptive vpn-instance <vpn-name>",
        "undo ptp-adaptive vpn-instance"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance vpn-name",
            "Info": "Specifies the name of the VPN instance to which the loopback interface with the IP address specified using local-ip is bound.\nThe name is a string of 1 to 31 characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance acr",
            "[*HUAWEI] undo ptp-adaptive acr",
            "[*HUAWEI] commit",
            "[~HUAWEI] interface loopback 0",
            "[*HUAWEI-Loopback0] ip binding vpn-instance acr",
            "[*HUAWEI-Loopback0] quit",
            "[*HUAWEI] ptp-adaptive vpn-instance acr"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nDuring Layer 3 unicast negotiation, the local device sends a request for establishing a connection to the server. The local device address and the server address uniquely identify a connection for 1588 ACR/ATR Layer 3 unicast negotiation. To ensure that the packets sent by the server are destined for the local device, set the parameter local-ip in the ptp-adaptive local-ip command as the address of the local loopback interface. If the local device is connected to the server over a VPN network, the name of the VPN instance to which the local loopback interface is bound needs to be specified. The parameter needs to be set on both the client and the server.\nPrerequisites\n1588 ACR/ATR has been enabled.\nPrecautions\nThis command is supported only on the admin VS.\nBefore changing the value of this parameter, disable 1588 ACR/ATR unicast negotiation by using the undo ptp-adaptive acr/undo ptp-adaptive atr command."
}