{
    "PageTitle": "ptp-adaptive request announce-interval",
    "FuncDef": "The ptp-adaptive request announce-interval command sets the minimum interval at which the server sends Announce packets.\nThe undo ptp-adaptive request announce-interval command restores the default minimum interval at which the server sends Announce packets.\nFor details about the default minimum interval, see Parameter Description.",
    "CLIs": [
        "ptp-adaptive request announce-interval <announce-interval-value>",
        "undo ptp-adaptive request announce-interval"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "announce-interval-value",
            "Info": "Specifies that the minimum interval at which the 1588 ACR/ATR server sends Announce packets is about 2announce-interval/1024s.\nThe value is an integer ranging from 7 to 14 when no profile is configured or after the ptp-adaptive frequency profile command is run. The default value is 11, that is 2s. After the ptp-adaptive time profile command is run, the value range changes to 7 to 10, and the default value changes to 10, that is 1s. The relationship between announce-interval and the interval at which Announce packets are sent is as follows:\n7 128/1024s8 256/1024s9 512/1024s10 1s11 2s12 4s13 8s14 16s"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ptp-adaptive enable",
            "[*HUAWEI] ptp-adaptive request announce-interval 10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter a connection is established between a server and a client, the server periodically sends Announce packets to notify the validity of the connection to the client.\nPrerequisites\n1588 ACR/ATR has been enabled.\nConfiguration Impact\nIf the ptp-adaptive request announce-interval command is run for multiple times, the latest configuration of this command overrides the previous one.\nPrecautions\nThis command is supported only on the admin VS.\nThis command is used on clients only.\nThis configuration needs to be performed before enabling unicast negotiation. If this configuration needs to be modified, disable unicast negotiation first.\nWhen unicast negotiation parameters are being configured on the client, the timeout period within which the client receives an Announce packet cannot be shorter than the interval at which the server sends an Announce packet. Otherwise, the status of the client becomes master and the client cannot synchronize with the server. It is recommended to set the timeout period within which the client receives an Announce packet to be four times the interval at which the server sends an Announce packet."
}