{
    "PageTitle": "display pm statistics",
    "FuncDef": "The display pm statistics command displays the collected performance statistics.",
    "CLIs": [
        "display pm statistics <taskname> data-index <index> [ instance-type <instance-type-name> [ measure <measure-name> | instance { <vpn-instance-name> } &<1-8> ] * ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "taskname",
            "Info": "Displays the performance statistics of a specified performance statistics task.\nThe value is a string of 1 to 31 case-insensitive characters, spaces not supported. The string contains letters, digits, and underscores (_), and must start with letters or digits."
        },
        {
            "Parameters": "data-index index",
            "Info": "Displays the performance statistics collected at a specified interval.\nThe value is an integer ranging from 0 to 16."
        },
        {
            "Parameters": "instance-type instance-type-name",
            "Info": "Specifies the type of an instance bound to a performance statistics task. The instance type is predefined in each feature. Each instance type is defined in a feature.\nThe value is a string of 1 to 63 case-insensitive characters, spaces not supported."
        },
        {
            "Parameters": "measure measure-name",
            "Info": "Displays the performance statistics based on a specified counter. The performance counter is predefined for each feature.\nThe value is a string of 1 to 63 case-insensitive characters, spaces not supported."
        },
        {
            "Parameters": "instance vpn-instance-name",
            "Info": "Specifies the name of an instance of a specific type. The format of the instance name is predefined in each feature.\nThe value is a string of 1 to 255 case-insensitive characters, spaces supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display pm statistics a data-index 0",
            "Total measures count: 29",
            "--------------------------------------------------------------------------------",
            "Instance Type        : interface",
            "Instance Name        : GigabitEthernet1/0/1",
            "Measure Name         : in-discards",
            "Measure Data         : 10",
            "Valid Flag           : valid",
            "Timestamp            : 2011-04-23 18:16:30 UTC-08:00",
            "",
            "......"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo view the existing or historical performance statistics, run the display pm statistics command. The system can display the existing performance statistics and historical performance statistics collected at a maximum of 16 intervals.\nPrerequisites\nAn instance has been bound to the existing performance statistics task and statistics counters have been configured.\nThe performance statistics function has been enabled for the existing performance statistics task.\nPrecautions\nTo view the existing performance statistics, ensure that the performance statistics task is running."
}