{
    "PageTitle": "sample-interval",
    "FuncDef": "The sample-interval command configures the sampling interval for a performance statistics task.\nThe undo sample-interval command restores the default setting.\n\nBy default, the sampling interval varies with the performance statistics interval as follows:\n\n\nIf the interval at which the performance statistics are collected is 5 minutes, the default sampling interval is 1 minute.\n\nIf the interval at which the performance statistics are collected is 10 minutes, the default sampling interval is 2 minutes.\n\nIf the interval at which the performance statistics are collected is 15 minutes, the default sampling interval is 3 minutes.\n\nIf the interval at which the performance statistics are collected is 30 minutes, the default sampling interval is 5 minutes.\n\nIf the interval at which the performance statistics are collected is 60 minutes, the default sampling interval is 5 minutes.\n\nIf the interval at which the performance statistics are collected is 1440 minutes, the default sampling interval is 15 minutes.",
    "CLIs": [
        "sample-interval <interval>",
        "undo sample-interval"
    ],
    "ParentView": [
        "Statistics task view"
    ],
    "ParaDef": [
        {
            "Parameters": "interval",
            "Info": "Specifies the interval at which the performance statistics collected in a performance statistics task is sampled.\nThe value can be 1, 2, 3, 5, 10, 15, 30, or 60, in minutes:\nIf the interval at which performance statistics are collected is 5 minutes, the sampling interval can be set to 1 minute or 5 minutes.If the interval at which performance statistics are collected is 10 minutes, the sampling interval can be set to 1, 2, 5, or 10 minutes.If the interval at which performance statistics are collected is 15 minutes, the sampling interval can be set to 1, 3, 5, or 15 minutes.If the interval at which performance statistics are collected is 30 minutes, the sampling interval can be set to 1, 2, 3, 5, 10, 15, or 30 minutes.If the interval at which performance statistics are collected is 60 minutes, the sampling interval can be set to 1, 2, 3, 5, 10, 15, 30, or 60 minutes.If the interval at which performance statistics are collected is 1440 minutes, the sampling interval can be set to 1, 2, 3, 5, 10, 15, 30, or 60 minutes."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] pm",
            "[~HUAWEI-pm] statistics-task huawei",
            "[*HUAWEI-pm-statistics-huawei] statistics-cycle 30",
            "[*HUAWEI-pm-statistics-huawei] sample-interval 5"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter the statistics task is configured, the system collects statistics at a specified sampling interval. The shorter the sampling interval is, the more accurate the statistics are. However, more system resources are consumed.\nPrerequisites\nA performance statistics task has been configured."
}