{
    "PageTitle": "protocol",
    "FuncDef": "The protocol command configures a PM server to which performance statistics files are uploaded.\nThe undo protocol command deletes the PM server configuration.\nBy default, no PM server to which performance statistics files are uploaded is configured.",
    "CLIs": [
        "protocol { ftp | sftp } ip-address <ip-address> [ port <port-number> | { net-manager-vpn | vpn-instance <vpn-instance-name> } ] *",
        "undo protocol"
    ],
    "ParentView": [
        "PM server view"
    ],
    "ParaDef": [
        {
            "Parameters": "ftp",
            "Info": "Specifies the FTP protocol for uploading performance statistics files.\n-"
        },
        {
            "Parameters": "sftp",
            "Info": "Specifies the SFTP protocol for uploading performance statistics files.\n-"
        },
        {
            "Parameters": "ip-address ip-address",
            "Info": "Specifies the IP address of the PM server.\nFor IPv4 address, the value is in dotted decimal notation.\nFor IPv6 address, the value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "port port-number",
            "Info": "Specifies the listening port number of the PM server.\nIf the port number is not specified, the default port number is used.\nThe value is an integer ranging from 1 to 65535. The default standard port number is 21 (using FTP) or 22 (using SFTP)."
        },
        {
            "Parameters": "net-manager-vpn",
            "Info": "Indicates the network management VPN.\n-"
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies a VPN instance name.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] pm",
            "[~HUAWEI-pm] pm-server a",
            "[*HUAWEI-pm-server-a] protocol sftp ip-address 192.168.10.3 port 1025"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] pm",
            "[~HUAWEI-pm] pm-server a",
            "[*HUAWEI-pm-server-a] protocol sftp ip-address 192.168.10.2 net-manager-vpn"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo upload performance statistics files to a PM server, run the protocol command to specify the PM server with a specified IP address and port number.\nIf the IP address of the PM server is a private address, configure net-manager-vpn for files to be uploaded, or specify vpn-instance vpn-instance-name for files to be uploaded.\nPrecautions\nUsing FTP to upload performance statistics files is not secure. Therefore, using SFTP is recommended."
}