{
    "PageTitle": "username",
    "FuncDef": "The username password command configures the user name and password for logging in to the PM server.\nThe undo username command deletes the user name and password for logging in to the PM server.\nBy default, no user name and password for logging in to the PM server are configured.",
    "CLIs": [
        "username <user-name> password <password>",
        "undo username"
    ],
    "ParentView": [
        "PM server view"
    ],
    "ParaDef": [
        {
            "Parameters": "password password",
            "Info": "Specifies the password for logging in to a PM server.\nIt is recommended that the preset password of the performance management server contain at least two types of the following characters: uppercase letters, lowercase letters, digits, and special characters. The password must contain at least eight characters.To prevent high security risks, you are advised to select the ciphertext mode. To ensure the security of the performance management server, change the password periodically and modify the configuration information of the system.\nThe password is a string of 1 to 128 case-sensitive characters, spaces or question marks not supported. The ciphertext of a configured password is a string of 24 or 32-268 characters in the configuration file.\nWhen quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "username user-name",
            "Info": "Specifies the user name for logging in to a PM server.\nThe name is a string of 1 to 255 case-sensitive characters, spaces or question marks not supported.\nWhen quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] pm",
            "[~HUAWEI-pm] pm-server a",
            "[*HUAWEI-pm-server-a] username admin password Huawei-123"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBefore you log in to a PM server for upload performance statistics files to the PM server, run the username password command to configure the user name and password."
}