{
    "PageTitle": "file-format",
    "FuncDef": "The file-format command sets the format for performance statistics files to be uploaded.\nThe file-format command deletes the format for performance statistics files to be uploaded.\nBy default, a performance statistics file is generated in the text format.",
    "CLIs": [
        "file-format { text | xml }",
        "undo file-format"
    ],
    "ParentView": [
        "Statistics task view"
    ],
    "ParaDef": [
        {
            "Parameters": "text",
            "Info": "Specifies text as the format for performance statistics files.\n-"
        },
        {
            "Parameters": "xml",
            "Info": "Specifies xml as the format for performance statistics files.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] pm",
            "[~HUAWEI-pm] statistics-task task1",
            "[*HUAWEI-pm-statistics-task1] file-format text"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo set the format of performance statistics files to .text or .xml, run the file-format command.\nThe format of a .text file is tasknameyyyymmddhhmmindexnum.txt.The format of a .xml file is tasknameyyyymmddhhmmindexnum.xml.\nA performance statistics file consists of a file header and a file body:\nFile header: includes the name of a device, software version running on the device, and interval at which performance statistics are collected.File body: includes the time when performance statistics collection starts, performance statistics objects and their types, counters of a performance statistics object, and counter values within a performance statistics cycle.\n\nPrecautions\nA .xml file occupies more storage space than a .text file does. However, a .xml file is more readable, expandable.\nIf the format for the performance statistics files is .text, historical statistics collected within the number of intervals set using the record-interval command will be recorded. If the format for the performance statistics files is .xml, historical statistics collected within the latest one interval will be recorded."
}