{
    "PageTitle": "task-type",
    "FuncDef": "The task-type command sets a type for a performance statistics task.\nThe undo task-type command restores the default type of a performance statistics task.\nBy default, no type is specified for any performance statistics task..",
    "CLIs": [
        "task-type pm-sdh",
        "task-type mon-history",
        "task-type mon-statistics",
        "undo task-type"
    ],
    "ParentView": [
        "Statistics task view"
    ],
    "ParaDef": [
        {
            "Parameters": "mon-history",
            "Info": "Indicates the history type.\n-"
        },
        {
            "Parameters": "mon-statistics",
            "Info": "Indicates the RMON type.\n-"
        },
        {
            "Parameters": "pm-sdh",
            "Info": "Indicates the synchronous digital hierarchy (SDH) type.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] pm",
            "[~HUAWEI-pm] statistics-task huawei",
            "[*HUAWEI-pm-statistics-huawei] task-type mon-history"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter a performance statistics task is created, if you want to perform SDH traffic statistics, run the task-type command to change the performance statistics task type so that a specific instance can be bound to the task.\nPrerequisites\nA performance statistics task has been created using the statistics-task task-name command.No statistics instance has been bound to the performance statistics task.The performance statistics collection interval matches the task type to be set.\n\nConfiguration Impact\nIf the SDH type is set for a performance statistics task, the performance statistics collection interval for this task can only be 15 minutes or 24 hours.\nIf the RMON type is set for a performance statistics task, the default settings are restored for the statistics collection interval, file generation status, threshold alarm status, file generation interval, and automatic file upload status. In addition, the task attributes cannot be changed, and threshold alarm configurations cannot be performed."
}