{
    "PageTitle": "upload file",
    "FuncDef": "The upload file command enables the device to upload performance statistics files to a PM server.",
    "CLIs": [
        "upload <request-name> file { <filename> } &<1-16>"
    ],
    "ParentView": [
        "Performance management view"
    ],
    "ParaDef": [
        {
            "Parameters": "request-name",
            "Info": "Specifies the name of a request for uploading performance statistics files.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "filename",
            "Info": "Specifies the name of a performance statistics file.\nThe file name can contain the file path (absolute path or relative path). If multiple files are specified at the same time, file names are separated using blank spaces.\nThe value is a string of 1 to 255 case-insensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] pm",
            "[~HUAWEI-pm] pm-server a",
            "[*HUAWEI-pm-server-a] commit",
            "[~HUAWEI-pm-server-a] quit",
            "[~HUAWEI-pm] statistics enable",
            "[*HUAWEI-pm] upload-config req1 server a",
            "[*HUAWEI-pm] upload req1 file a20110422210001.txt"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe system generates performance statistics files based on the collected performance statistics at a specified interval. To enable the device to upload performance statistics files to a PM server, run the upload file command. A maximum of 16 performance statistics files can be uploaded at a time.\nBy default, performance statistics files are saved to the path cfcard:/PmData. You can name the performance statistics files in the specified path after running the upload command, or you can specify the path and file name in any path.\nPrerequisites\nEnsure that the configurations have been complete:\nThe ssh client first-time enable command has been run in the system view to enable initial authentication on the SSH client.The upload-config request-name server server-name command has been run in the PM view to configure basic information about the PM server to which performance statistics files are uploaded.\n\nFollow-up Procedure\nView the performance statistics on the PM server."
}