{
    "PageTitle": "reset pm",
    "FuncDef": "The reset pm command clears the performance statistics of a performance statistics task.",
    "CLIs": [
        "reset pm current-data [ instance-type <instance-type-name> [ measure <measure-name> | instance { <vpn-instance-name> } &<1-8> ] * ]"
    ],
    "ParentView": [
        "Statistics task view"
    ],
    "ParaDef": [
        {
            "Parameters": "current-data",
            "Info": "Clears the current performance statistics of a performance statistics task.\n-"
        },
        {
            "Parameters": "instance-type instance-type-name",
            "Info": "Specifies an instance type. The instance type is predefined for each feature.\nThe value is a string of 1 to 63 case-insensitive characters, spaces not supported."
        },
        {
            "Parameters": "measure measure-name",
            "Info": "Specifies the name of a performance counter in a performance statistics task. The performance counter is predefined for each feature.\nThe value is a string of 1 to 63 case-insensitive characters, spaces not supported."
        },
        {
            "Parameters": "instance vpn-instance-name",
            "Info": "Specifies an instance name of a specified instance type. The instance name format is predefined for each feature.\nThe value is a string of 1 to 255 case-insensitive characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] pm",
            "[~HUAWEI-pm] statistics-task huawei",
            "[~HUAWEI-pm-statistics-huawei] reset pm history-data"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a large number of performance statistics have been generated, run the reset pm command to clear the current performance statistics.\nIf no instance type, instance name, or performance counter is specified, the reset pm command clears all performance statistics.\nPrecautions\nThe performance statistics of a performance statistics task cannot be restored after they are cleared. Exercise caution when running this command."
}