{
    "PageTitle": "advertise-ipv6-next-hops",
    "FuncDef": "This command applies to a BGP session established on top of IPv6; transport, BGP routes belonging to the specified families can be advertised with a true IPv6 address when originated or whennext-hop-self(configured or automatic) is applied.",
    "CLIs": [
        "advertise-ipv6-next-hops [ vpn-ipv6 ] [ label-ipv6 ] [ vpn-ipv4 ] [ label-ipv4 ]",
        "no advertise-ipv6-next-hops"
    ],
    "ParentView": [
        "config>router>bgp",
        "config>router>bgp>group",
        "config>router>bgp>group>neighbor"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-ipv6",
            "Info": "Allows VPN IPv6 routes to be advertised to IPv6 transport peers with an IPv6 address as the BGP next hop in cases of route origination or next-hop-self (configured or automatic)."
        },
        {
            "Parameters": "label-ipv6",
            "Info": "Allows label IPv6 routes to be advertised to IPv6 transport peers with an IPv6 address as the BGP next hop in cases of route origination or next-hop-self (configured or automatic)."
        },
        {
            "Parameters": "vpn-ipv4",
            "Info": "Allows VPN IPv4 routes to be advertised to IPv6 transport peers with an IPv6 address as the BGP next hop in cases of route origination or next-hop-self (configured or automatic). It also allows export policies to change the BGP next hop of a VPN IPv4 route to an IPv6 address. All of these cases require the remote peer to advertise the necessary extended NH encoding capability."
        },
        {
            "Parameters": "label-ipv4",
            "Info": "Allows label IPv4 routes to be advertised to IPv6 transport peers with an IPv6 address as the BGP next hop in cases of route origination or next-hop-self (configured or automatic). It also allows export policies to change the BGP next hop of a label IPv4 route to an IPv6 address. All of these cases require the remote peer to advertise the necessary extended NH encoding capability."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: no advertise-ipv6-next-hops"
}