{
    "PageTitle": "always-compare-med",
    "FuncDef": "This command configures the comparison of BGP routes based on the MED attribute. The default behavior of SR-OS (equivalent to thenoform of the command) is to only compare two routes on the basis of MED if they have the same neighbor AS (the first non-confed AS in the received AS_PATH attribute). Also by default, a route without a MED attribute is handled the same as though it had a MED attribute with the value 0. Thealways-compare-medcommand without thestrict-askeyword allows MED to be compared even if the paths have a different neighbor AS; in this case, if neitherzeroorinfinityis specified, thezerooption is inferred, meaning a route without a MED is handled the same as though it had a MED attribute with the value 0. When thestrict-askeyword is present, MED is only compared between paths from the same neighbor AS,\nand in this case,zeroorinfinityis mandatory and tells BGP how to interpret paths without a MED attribute.",
    "CLIs": [
        "always-compare-med { zero | infinity }",
        "no always-compare-med strict-as { zero | infinity }",
        "no always-compare-med"
    ],
    "ParentView": [
        "config>router>bgp>best-path-selection",
        "config>service>vprn>bgp>best-path-selection"
    ],
    "ParaDef": [
        {
            "Parameters": "zero",
            "Info": "Specifies that for routes learned without a MED attribute that a zero (0) value is used in the MED comparison. The routes with the lowest metric are the most preferred."
        },
        {
            "Parameters": "infinity",
            "Info": "Specifies for routes learned without a MED attribute that a value of infinity (2^32-1) is used in the MED comparison. This in effect makes these routes the least desirable."
        },
        {
            "Parameters": "strict-as",
            "Info": "Specifies BGP paths to be compared even with different neighbor AS."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: no always-compare-med"
}