{
    "PageTitle": "prefix-limit",
    "FuncDef": "This command configures the maximum number of BGP routes that can be received from a peer before some administrative action is taken. The administrative action can be the generation of a log event or taking down the session. If a session is taken down, then it can be brought back up automatically after an idle-timeout period, or else it can be configured to stay down ('forever') until the operator performs a reset.",
    "CLIs": [
        "prefix-limit <family> <limit> [ threshold <percentage> ] [ idle-timeout { <minutes> | forever } | log-only ] [ post-import ]",
        "no prefix-limit <family>"
    ],
    "ParentView": [
        "config>router>bgp>group",
        "config>router>bgp>group>neighbor"
    ],
    "ParaDef": [
        {
            "Parameters": "log-only",
            "Info": "Enables the warning message to be sent at the specified threshold percentage, and also when the limit is reached. However, the BGP session is not taken down."
        },
        {
            "Parameters": "percentage",
            "Info": "Specifies the threshold value (as a percentage) that triggers a warning message to be sent. Values-1 to 100."
        },
        {
            "Parameters": "family",
            "Info": "Specifies the address family to which the limit applies. Values-ipv4, label-ipv4, vpn-ipv4, ipv6, label-ipv6, vpn-ipv6, mcast-ipv4, l2-vpn, mvpn-ipv4, mdt-safi, ms-pw, flow-ipv4, route-target, mcast-vpn-ipv4, mvpn-ipv6, flow-ipv6, evpn, mcast-ipv6, bgp-ls."
        },
        {
            "Parameters": "limit",
            "Info": "Specifies the number of routes that can be learned from a peer expressed as a decimal integer. Values-1 to 4294967295."
        },
        {
            "Parameters": "minutes",
            "Info": "Specifies duration in minutes before automatically re-establishing a session. Values-1 to 1024."
        },
        {
            "Parameters": "forever",
            "Info": "Specifies that the session is reestablished only after clear router bgp command is executed."
        },
        {
            "Parameters": "post-import",
            "Info": "Specifies that the limit should be applied only to the number of routes that are accepted by import policies."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}