{
    "PageTitle": "rapid-update",
    "FuncDef": "This command enables and disables BGP rapid update for specified address families.",
    "CLIs": [
        "rapid-update [ l2-vpn ] [ mvpn-ipv4 ] [ mvpn-ipv6 ] [ mdt-safi ] [ evpn ] [ label-ipv4 ] [ label-ipv6 ] [ vpn-ipv4 ] [ vpn-ipv6 ] [ mcast-vpn-ipv4 ] [ mcast-vpn-ipv6 ]",
        "no rapid-update"
    ],
    "ParentView": [
        "config>router>bgp"
    ],
    "ParaDef": [
        {
            "Parameters": "l2-vpn",
            "Info": "Specifies the BGP rapid update for the 12-byte Virtual Switch Instance identifier (VSI-ID) value consisting of the 8-byte route distinguisher (RD) followed by a 4-byte value."
        },
        {
            "Parameters": "mvpn-ipv4",
            "Info": "Specifies BGP rapid update for the mvpn-ipv4 address family. The mvpn-pv4 address is a variable size value consisting of the 1-byte route type, 1-byte length and variable size that is route type specific. Route type defines encoding for the route type specific field. Length indicates the length in octets of the route type specific field."
        },
        {
            "Parameters": "mdt-safi",
            "Info": "Specifies BGP rapid update for the mdt-safi address family. The address is a 16-byte value consisting of 12-byte route distinguisher (RD) followed by a 4-byte group address."
        },
        {
            "Parameters": "mvpn-ipv6",
            "Info": "Specifies BGP rapid update for the mvpn-ipv6 address family."
        },
        {
            "Parameters": "evpn",
            "Info": "Specifies BGP rapid update for the evpn address family by including or removing EVPN routes from the set of routes that can trigger rapid update."
        },
        {
            "Parameters": "label-ipv4",
            "Info": "Includes or removes label-ipv4 routes from the set of routes that can trigger rapid update."
        },
        {
            "Parameters": "label-ipv6",
            "Info": "Includes or removes label-ipv6 routes from the set of routes that can trigger rapid update."
        },
        {
            "Parameters": "vpn-ipv4",
            "Info": "Includes or removes vpn-ipv4 routes from the set of routes that can trigger rapid update."
        },
        {
            "Parameters": "vpn-ipv6",
            "Info": "Includes or removes vpn-ipv6 routes from the set of routes that can trigger rapid update."
        },
        {
            "Parameters": "mcast-vpn-ipv4",
            "Info": "Includes or removes mcast-vpn-ipv4 routes from the set of routes that can trigger rapid update."
        },
        {
            "Parameters": "mcast-vpn-ipv6",
            "Info": "Includes or removes mcast-vpn-ipv6 routes from the set of routes that can trigger rapid update."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: no rapid-update"
}