{
    "PageTitle": "8021p",
    "FuncDef": "The 8021p command sets VLAN priorities carried on user protocol packets.\nThe undo 8021p command cancels the VLAN priorities carried on user protocol packets.\n\nBy default, VLAN priorities carried on user protocol packets are not set.",
    "CLIs": [
        "8021p <8021p-value>",
        "undo 8021p"
    ],
    "ParentView": [
        "PW-VE interface view",
        "PW-VE sub-interface view",
        "40GE interface view",
        "GE electrical interface view",
        "Port extension interface view",
        "400GE interface view",
        "10GE interface view",
        "Layer 2 sub-interface view",
        "XGE interface view",
        "VE sub-interface view",
        "GE interface view",
        "100GE interface view",
        "Global VE sub-interface view",
        "Sub-interface view",
        "50GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Eth-Trunk interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "8021p-value",
            "Info": "Indicates the priority of VLAN frames.\nThe value is an integer ranging from 0 to 7."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] 8021p 3"
        ]
    ],
    "ExtraInfo": "Usage Scenario\n\nThe Layer 2 network allows only packets with a specific VLAN priority to pass through and discards packets with all the other VLAN priorities. Therefore, a VLAN priority must be specified for user protocol packets that are transmitted over the Layer 2 network.\n\nConfiguration Impact\n\nAfter the 8021p command is configured on an interface, the VLAN priorities of user protocol packets to be sent by the interface will be changed to the specific VLAN priority.\n\nPrecautions\n\nThis command can take effect for the user protocol packets of DHCP, PPPOE, ICMP, BFD, ND, ARP, VRRP, EAP, IS-IS, and so on.\nThe preceding commands can be configured only on a Layer 3 main interface, or a sub-interface belonging to a Layer 3 main interface.\nIf the 8021p command is configured on a main interface, the configuration takes effect on all sub-interfaces of the main interface. If the 8021p command is configured on both a main interface and one of its sub-interface, the configuration on the sub-interface takes effect preferentially on the sub-interface.\nFor double-tagged VLAN packets, change priorities carried in inner and outer VLAN tags. For single-tagged VLAN packets, change the priority carried in the VLAN tag.\nFor UDP packets, the default value of the VLAN priority is 0."
}