{
    "PageTitle": "alarm drop-rate enable",
    "FuncDef": "The alarm drop-rate enable command enables the alarm function for the packets that are dropped before they are sent to the CPU.\nThe undo alarm drop-rate enable command disables the alarm function for the packets that are dropped before they are sent to the CPU.\nBy default, the alarm function is enabled for the packets that are dropped before they are sent to the CPU.",
    "CLIs": [
        "alarm drop-rate { index <index> | user-defined-flow <flow-id> } enable",
        "alarm drop-rate whitelist-v6 enable",
        "alarm drop-rate { application-apperceive | blacklist | ma-defend | tcpip-defend | total-packet | whitelist | urpf } enable",
        "alarm drop-rate ttl-expired-loop enable",
        "alarm drop-rate tcpip-defend-v6 enable",
        "undo alarm drop-rate { index <index> | user-defined-flow <flow-id> } enable",
        "undo alarm drop-rate whitelist-v6 enable",
        "undo alarm drop-rate { application-apperceive | blacklist | ma-defend | tcpip-defend | total-packet | whitelist | urpf } enable",
        "undo alarm drop-rate ttl-expired-loop enable",
        "undo alarm drop-rate tcpip-defend-v6 enable"
    ],
    "ParentView": [
        "Attack defense policy view"
    ],
    "ParaDef": [
        {
            "Parameters": "index index",
            "Info": "Specifies the packet index. This parameter enables the alarm function for the dropped packets with the specified index.\nThe value is an integer ranging from 35 to 1658."
        },
        {
            "Parameters": "user-defined-flow flow-id",
            "Info": "Specifies the number of a user-defined flow. This parameter enables the alarm function for the packets that are dropped by the user-defined flow function before they are sent to the CPU.\nThe value is an integer ranging from 1 to 64."
        },
        {
            "Parameters": "whitelist-v6",
            "Info": "Enables the alarm function for the packets that are dropped by the IPv6 whitelist function before they are sent to the CPU.\n-"
        },
        {
            "Parameters": "application-apperceive",
            "Info": "Enables the alarm function for the packets that are dropped by the application layer association function before they are sent to the CPU.\n-"
        },
        {
            "Parameters": "blacklist",
            "Info": "Enables the alarm function for the packets that are dropped by the blacklist function before they are sent to the CPU.\n-"
        },
        {
            "Parameters": "ma-defend",
            "Info": "Enables the alarm function for the packets that are dropped by the management/control plane protection function before they are sent to the CPU.\n-"
        },
        {
            "Parameters": "tcpip-defend",
            "Info": "Enables the alarm function for the packets that are dropped by the TCP/IP attack defense function before they are sent to the CPU.\n-"
        },
        {
            "Parameters": "total-packet",
            "Info": "Enables the alarm function for the packets that are dropped before they are sent to the CPU.\n-"
        },
        {
            "Parameters": "whitelist",
            "Info": "Enables the alarm function for the packets that are dropped by the whitelist function before they are sent to the CPU.\n-"
        },
        {
            "Parameters": "urpf",
            "Info": "Enables the alarm function for the packets that are dropped by the URPF function before they are sent to the CPU.\n-"
        },
        {
            "Parameters": "ttl-expired-loop",
            "Info": "Enables the alarm function for TTL timeout loop detection.\n-"
        },
        {
            "Parameters": "tcpip-defend-v6",
            "Info": "Enables the alarm function for the packets that are dropped by the TCP/IPv6 attack defense function before they are sent to the CPU.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] cpu-defend policy 4",
            "[*HUAWEI-cpu-defend-policy-4] alarm drop-rate tcpip-defend enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo view the status of a device that drops too many packets, you can run the alarm drop-rate enable command to configure the alarm function. In this manner, when the number of dropped packets exceeds the set threshold in a specified time period, the device sends an alarm to the information center, and you can take actions accordingly.\nPrecautions\nThe device has a default alarm threshold and a default check interval, which are used when only the alarm drop-rate enable command is run. You can also run the alarm drop-rate command to set an alarm threshold and a check interval as required.\nIn VS mode, this command is supported only by the admin VS."
}