{
    "PageTitle": "application-apperceive disable",
    "FuncDef": "The application-apperceive disable command is used to disable the application layer linkage switch.\nThe undo application-apperceive disable command restores the default configuration.\nBy default, the application layer linkage switch is enabled.",
    "CLIs": [
        "application-apperceive disable",
        "undo application-apperceive disable"
    ],
    "ParentView": [
        "Attack defense policy view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] cpu-defend policy 8",
            "[*HUAWEI-cpu-defend-policy-8] application-apperceive disable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThere are many types of application layer protocols on routers, but in actual networking applications, sometimes only some protocols may be used. For the upper layer protocols that are not enabled, the protocol packets do not need to be sent to the CPU for processing. Otherwise, it will cause waste of resources and even cause attacks. Application application layer linkage can reduce the number of packets sent.\nConfiguration Impact\nWhen the application layer linkage function is enabled and the protocol switch is enabled, the packet is sent according to the configured bandwidth. When the protocol switch is turned off, the packet is processed in the manner configured by the user.\nWhen the application-layer linkage function is disabled, the protocol does not cooperate. Regardless of whether the protocol switch is enabled, packets are sent with the configured bandwidth. The device supports application-layer collaboration for 31 upper-layer protocols. You can use the display application-apperceive command to view the types of protocols supported by the device and the status of each protocol.\nFollow-up Procedure\nYou can use the application-apperceive default-action command to set how the router processes CPU packets when the upper-layer protocol is not enabled.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}