{
    "PageTitle": "application-apperceive default-action",
    "FuncDef": "The application-apperceive default-action command sets a default action to be taken on the protocol packets to be sent to the CPU when the upper-layer protocols supporting application layer association are disabled.\nBy default, the default action taken by the application layer association module on the packets to be sent to the CPU is min-to-cp.",
    "CLIs": [
        "application-apperceive default-action { drop | min-to-cp }"
    ],
    "ParentView": [
        "Attack defense policy view"
    ],
    "ParaDef": [
        {
            "Parameters": "drop",
            "Info": "Drops the packets to be sent to the CPU.\n-"
        },
        {
            "Parameters": "min-to-cp",
            "Info": "Sends packets to the CPU at the lowest rate set on the device.\nSends packets to the CPU at 100 kbps (the lowest rate set on the device)."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] cpu-defend policy 6",
            "[*HUAWEI-cpu-defend-policy-6] application-apperceive default-action drop"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe application-apperceive default-action command sets the default action to be taken on the protocol packets to be sent to the CPU when the upper-layer protocols supporting application layer association are disabled.\nWhen application layer association and protocols are enabled, packets are sent to the CPU at the configured bandwidth; when application layer association is enabled but protocols are disabled, packets are sent to the CPU at the lowest rate or directly dropped.\nWhen application layer association is disabled, packets are sent to the CPU according to the configured bandwidth regardless of whether the protocols are enabled.\nThe parameter min-to-cp parameter is recommended because it can help you to trace the attack source and collect attack information if a device is attacked when a protocol supporting the application layer association is disabled. If you specify only drop in the application-apperceive default-action command, the possibility of attack can be reduced, but the attack source cannot be traced. You can choose a proper parameter as required.\nPrerequisites\nThe application-apperceive default-action command can take effect only when application layer association is enabled.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}