{
    "PageTitle": "hostcar drop-rate enable",
    "FuncDef": "The hostcar drop-rate enable command enables a device to automatically adjust user bandwidth.\nThe undo hostcar drop-rate enable command disables a device from automatically adjusting user bandwidth.\nThe http-hostcar drop-rate enable command enables the HTTP-Host-CAR automatic bandwidth adjustment function.\nThe undo http-hostcar drop-rate enable command disables the function.\nThe vlan-host-car drop-rate enable command enables the VLAN-Host-CAR automatic bandwidth adjustment function.\nThe undo vlan-host-car drop-rate enable command disables the function.\nBy default, the Host-CAR and HTTP-Host-CAR automatic bandwidth adjustment function are enabled, the VLAN-Host-CAR automatic bandwidth adjustment function is disabled.",
    "CLIs": [
        "{ hostcar | http-hostcar | vlan-host-car } drop-rate enable",
        "undo { hostcar | http-hostcar | vlan-host-car } drop-rate enable"
    ],
    "ParentView": [
        "Slot view"
    ],
    "ParaDef": [
        {
            "Parameters": "hostcar",
            "Info": "Config Host-CAR.\n-"
        },
        {
            "Parameters": "http-hostcar",
            "Info": "Config HTTP-Host-CAR.\n-"
        },
        {
            "Parameters": "vlan-host-car",
            "Info": "Config VLAN-Host-CAR.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] slot 1",
            "[*HUAWEI-slot-1] vlan-host-car drop-rate enable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] slot 1",
            "[*HUAWEI-slot-1] http-hostcar drop-rate enable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] slot 1",
            "[*HUAWEI-slot-1] hostcar drop-rate enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a user sends excessive packets to the CPU, causing link congestion and affecting processing efficiency of the CPU, you can run the hostcar drop-rate enable command to enable the device to automatically adjust user bandwidth.\nBy default, a device automatically adjusts the bandwidth to 8 Kbit/s for a user.\nThe hostcar drop-rate enable command takes effect only for the bandwidth of users that send excessive packets to the CPU, whereas the hostcar command takes effect for the bandwidth of all users that send packets to the CPU on a board.\nWhen a user sends a great number of web packets to the CPU, the link is congested, and the CPU efficiency is affected. To resolve this problem, run the http-hostcar drop-rate enable command to enable the automatic bandwidth adjustment function.\nBy default, if the packet loss rate of a CAR ID exceeds a specific threshold, the system adjusts the bandwidth of the CAR ID to 64 kbit/s.\nThe http-hostcar drop-rate enable command takes effect only for the bandwidth of users that send excessive packets to the CPU, whereas the http-hostcar command takes effect for the bandwidth of all users that send packets to the CPU.\nWhen a user sends a great number of packets with the same VLAN ID to the CPU, the link is congested, and the CPU efficiency is affected. To resolve this problem, run the vlan-host-car drop-rate enable command to enable the automatic bandwidth adjustment function.\nAfter the vlan-host-car drop-rate enable command is run, if the packet loss rate of a CAR ID exceeds a specific threshold, the system adjusts the bandwidth of the CAR ID to 128 kbit/s.\nThe vlan-host-car drop-rate enable command takes effect only for the bandwidth of users that send excessive packets to the CPU, whereas the vlan-host-car command takes effect for the bandwidth of all users that send packets to the CPU.\nPrecautions\nAfter the hostcar drop-rate enable command is run, the hostcar drop-rate enable command configuration preferentially applies to users when the users send excessive packets to the CPU, regardless of whether the hostcar command is run. When the users no longer send excessive packets to the CPU, the hostcar command configuration applies to the users.\nAfter the http-hostcar drop-rate enable command is run, the http-hostcar drop-rate enable command configuration preferentially applies to users when the users send excessive packets to the CPU, regardless of whether the http-hostcar command is run. When the users no longer send excessive packets to the CPU, the http-hostcar command configuration applies to the users.\nAfter the vlan-host-car drop-rate enable command is run, the vlan-host-car drop-rate enable command configuration preferentially applies to users when the users send excessive packets to the CPU, regardless of whether the vlan-host-car command is run. When the users no longer send excessive packets to the CPU, the vlan-host-car command configuration applies to the users.\nIn VS mode, this command is supported only by the admin VS."
}