{
    "PageTitle": "hostcar logging",
    "FuncDef": "The hostcar logging command configures a device to generate a log when the number of bytes discarded by host CAR within a specified period reaches the specified threshold.\nThe undo hostcar logging command restores the default configuration.\nThe http-hostcar logging command configures an interval at which the device counts the number of bytes of discarded CPU-destined web packets and a log threshold for the number of these discarded bytes.\nThe undo http-hostcar logging command restores the default configuration.\nThe vlan-host-car logging command configures an interval at which the device counts the number of bytes of discarded CPU-destined packets controlled by VLAN-Host-CAR and a log threshold for the number of these discarded bytes.\nThe undo vlan-host-car logging command restores the default configuration.\nBy default, a device generates a log when the number of discarded bytes reaches 30000 within five minutes.",
    "CLIs": [
        "{ hostcar | http-hostcar | vlan-host-car } logging { discard-threshold <threshold-value> | interval <interval-value> } *",
        "undo { hostcar | http-hostcar | vlan-host-car } logging { discard-threshold | interval } *"
    ],
    "ParentView": [
        "Slot view"
    ],
    "ParaDef": [
        {
            "Parameters": "discard-threshold threshold-value",
            "Info": "Specifies a log threshold for the number of discarded bytes.\nThe value is an integer ranging from 1 to 4294967295, in bytes. The default value is 30000 bytes."
        },
        {
            "Parameters": "interval interval-value",
            "Info": "Specifies the interval at which a device counts the number of bytes discarded by host CAR.\nThe value is an integer ranging from 1 to 4294967295, in minutes. The default value is five minutes."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] slot 1",
            "[*HUAWEI-slot-1] vlan-host-car logging interval 15 discard-threshold 2048"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] slot 1",
            "[*HUAWEI-slot-1] http-hostcar logging interval 10 discard-threshold 60000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nUser-side packets to be sent to the CPU may be discarded due to excessive burst traffic or bandwidth restrictions. To configure a device to generate a log when the number of bytes discarded by host CAR within a specified period reaches the specified threshold, run the hostcar logging command.\nIf you want to configure or modify the interval at which the device counts the number of bytes of discarded CPU-destined web packets and the log threshold for the number of these discarded bytes, run the http-hostcar logging command. By default, the device counts the number of bytes of discarded CPU-destined web packets at an interval of 5 minutes and generates a log when the device discards 30,000 bytes. The log records information about users whose packets are discarded, facilitating fault location. The user information includes user MAC addresses, inner VLAN IDs, outer VLAN IDs, CAR IDs, slot IDs, subcard IDs, port numbers, and option 82 information.\nIf you want to configure or modify the interval at which the device counts the number of bytes of discarded CPU-destined packets controlled by VLAN-Host-CAR and the log threshold for the number of these discarded bytes, run the vlan-host-car logging command. By default, the device counts the number of bytes of discarded CPU-destined packets controlled by VLAN-Host-CAR at an interval of 5 minutes and generates a log when the device discards 30,000 bytes. The log records information about users whose packets are discarded, facilitating fault location. The user information includes user MAC addresses, inner VLAN IDs, outer VLAN IDs, CAR IDs, slot IDs, subcard IDs, port numbers, and option 82 information.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}