{
    "PageTitle": "http-hostcar",
    "FuncDef": "The http-hostcar command sets the bandwidth limit for web fast-reply packets.\nThe undo http-hostcar command restores the default setting.\nBy default, the CIR of web fast-reply packets at the user side is 128 kbit/s, the PIR is 128 kbit/s, the CBS is 128000bytes, and the PBS is 128000bytes.",
    "CLIs": [
        "http-hostcar cir <cir-value> [ pir <pir-value> ] [ cbs <cbs-value> pbs <pbs-value> ]",
        "undo http-hostcar"
    ],
    "ParentView": [
        "Slot view"
    ],
    "ParaDef": [
        {
            "Parameters": "pir pir-value",
            "Info": "Specifies PIR.\nThe value is an integer ranging from 8 to 4294967295, in kbit/s.Setting the PBS to be greater than or equal to the CBS."
        },
        {
            "Parameters": "cbs cbs-value",
            "Info": "Specifies CBS.\nThe value is an integer ranging from 1000 to 4294967295, in bytes."
        },
        {
            "Parameters": "pbs pbs-value",
            "Info": "Specifies PBS.\nThe value is an integer ranging from 0 to 4294967295, in bytes. Setting the PBS to a value smaller than the CBS is recommended so that traffic conforming to the CBS can be sent to the CPU."
        },
        {
            "Parameters": "cir cir-value",
            "Info": "Specifies CIR.\nThe value is an integer ranging from 0 to 4294967295, in kbit/s."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] slot 1",
            "[*HUAWEI-slot-1] http-hostcar cir 5000 pir 7000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf either of the following problems occurs, you can run the http-hostcar command to change the bandwidth limit for web fast-reply packets sent to the CPU at the user side.\nA large number of web fast-reply sent to the CPU at the user side congest the link and reduce CPU processing efficiency.\nThe high rate limit for web fast-reply packets sent to the CPU at the user side causes some packets to be dropped.\nPrecautions\nIf the effective CIR is not the same as the configured CIR, run the display cpu-defend http-hostcar auto-adjust statistics slot slot-id command to check whether automatic bandwidth adjustment is implemented."
}