{
    "PageTitle": "ipv6 nd rate-limit-percent",
    "FuncDef": "The ipv6 nd rate-limit-percent command sets the percentage of the bandwidth of level-2 CAR for ND VLAN CAR in the bandwidth of CP-CAR for ND protocol packets.\nThe undo ipv6 nd attack rate-limit-percent command restores the default percentage of the bandwidth of level-2 CAR for ND VLAN CAR in the bandwidth of CP-CAR for ND protocol packets.\nBy default, the percentage of the bandwidth of level-2 CAR for ND VLAN CAR in the bandwidth of CP-CAR for ND protocol packets is 80%.",
    "CLIs": [
        "ipv6 nd { na | ns-multicast | ns-unicast } rate-limit-percent <rate-value>",
        "undo ipv6 nd { na | ns-multicast | ns-unicast } rate-limit-percent"
    ],
    "ParentView": [
        "Slot view"
    ],
    "ParaDef": [
        {
            "Parameters": "na",
            "Info": "Neighbor advertisement.\n-"
        },
        {
            "Parameters": "ns-multicast",
            "Info": "Neighbor solicitation-Multicast.\n-"
        },
        {
            "Parameters": "ns-unicast",
            "Info": "Neighbor solicitation-Unicast.\n-"
        },
        {
            "Parameters": "rate-value",
            "Info": "Specifies the percentage of the bandwidth of level-2 CAR for ND VLAN CAR in the bandwidth of CP-CAR for ND protocol packets.\nThe value is an integer ranging from 0 to 100, in percentage. The default value is 80. The value 0 indicates no restriction on the bandwidth."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] slot 1",
            "[*HUAWEI-slot-1] ipv6 nd na rate-limit-percent 60"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nND VLAN CAR is used to restrict the rate of ND packets based on interfaces and VLANs. To further suppress excessive ND packets, level-2 CAR is enabled for ND packets that have experienced ND VLAN CAR. The percentage of the bandwidth of level-2 CAR for ND VLAN CAR in the bandwidth of CP-CAR for ND protocol packets is 80% by default. The bandwidth of level-2 CAR for ND VLAN CAR changes dynamically with the bandwidth of CP-CAR for ND protocol packets. To set the percentage of the bandwidth of level-2 CAR for ND VLAN CAR in the bandwidth of CP-CAR for ND protocol packets, run the ipv6 nd rate-limit-percent command.\nConfiguration Impact\nThe percentage of the bandwidth of level-2 CAR for ND VLAN CAR in the bandwidth of CP-CAR for ND protocol packets affects the rate at which the ND packets are sent to the CPU. The default value 80% is a proper value. If the percentage is set high, some valid ND protocol packets may fail to be sent to the CPU.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}