{
    "PageTitle": "l2-loop-detect loop-level-threshold",
    "FuncDef": "The l2-loop-detect loop-level-threshold command configures the loop level threshold on a detected main interface or sub-interface.\nThe undo l2-loop-detect loop-level-threshold command restores the default loop level threshold on a detected main interface or sub-interface.\nBy default, the determined, suspect, and notification Layer 2 loop thresholds for a main interface are 3000, 2000, and 1000, respectively. By default, the determined, suspect, and notification Layer 2 loop thresholds for a sub-interface are 300, 200, and 100, respectively.",
    "CLIs": [
        "l2-loop-detect loop-level-threshold main-interface determined <determined-threshold> suspect <suspect-threshold> notification <notification-threshold>",
        "l2-loop-detect loop-level-threshold sub-interface determined <determined-threshold> suspect <suspect-threshold> notification <notification-threshold>",
        "undo l2-loop-detect loop-level-threshold main-interface determined <determined-threshold> suspect <suspect-threshold> notification <notification-threshold>",
        "undo l2-loop-detect loop-level-threshold sub-interface determined <determined-threshold> suspect <suspect-threshold> notification <notification-threshold>"
    ],
    "ParentView": [
        "Slot view"
    ],
    "ParaDef": [
        {
            "Parameters": "suspect suspect-threshold",
            "Info": "Specifies the suspect loop threshold.\nThe value is an integer ranging from 2 to 5999,in packets. By default, the suspect Layer 2 loop thresholds of a main interface and sub-interface are 2000 and 200, respectively."
        },
        {
            "Parameters": "notification notification-threshold",
            "Info": "Specifies the notification loop threshold.\nThe value is an integer ranging from 1 to 5998, in packets. By default, the notification Layer 2 loop thresholds of a main interface and sub-interface are 1000 and 100, respectively."
        },
        {
            "Parameters": "sub-interface",
            "Info": "Indicates a sub-interface.\n-"
        },
        {
            "Parameters": "determined determined-threshold",
            "Info": "Specifies the determined loop threshold.\nThe value is an integer ranging from 3 to 6000, in packets. By default, the determined Layer 2 loop thresholds of a main interface and sub-interface are 3000 and 300, respectively."
        },
        {
            "Parameters": "main-interface",
            "Info": "Indicates a main interface.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] slot 1",
            "[*HUAWEI-slot-1] l2-loop-detect loop-level-threshold main-interface determined 3001 suspect 2001 notification 1001"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] slot 1",
            "[*HUAWEI-slot-1] l2-loop-detect loop-level-threshold sub-interface determined 301 suspect 201 notification 101"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the loop level threshold is not properly set, the displayed loop level may be inaccurate. To resolve this problem, run the l2-loop-detect loop-level-threshold command to modify the loop level threshold based on the live network experience. When the number of dropped packets reaches or exceeds the configured loop level threshold within a detection period (5s), the device displays a loop of the corresponding level.\nThe loop level threshold on a main interface must be greater than that on a sub-interface. If the loop level threshold on a main interface is smaller than that on a sub-interface and a loop occurs on the sub-interface, the system considers that the loop occurs on the main interface, and detection on the sub-interface does not take effect.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nBefore running the l2-loop-detect loop-level-threshold command, obtain the experience values of packet loss statistics. If the configured loop level threshold is too low, Layer 2 loop faults may be mistakenly reported.\nIt is recommended that you run this command with assistance from Huawei engineers."
}