{
    "PageTitle": "l2-loop-detect action trap disable",
    "FuncDef": "The l2-loop-detect action trap disable command disables the system from sending a trap after detecting a Layer 2 loop.\nThe undo l2-loop-detect action trap disable command enables the system to send a trap after detecting a Layer 2 loop.\nBy default, the system will send a trap after detecting a Layer 2 loop.",
    "CLIs": [
        "l2-loop-detect action trap disable",
        "undo l2-loop-detect action trap disable"
    ],
    "ParentView": [
        "Slot view"
    ],
    "ParaDef": [
        {
            "Parameters": "trap",
            "Info": "Sending a trap after the system detects a Layer 2 loop.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] slot 1",
            "[*HUAWEI-slot-1] l2-loop-detect action trap disable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe CPU determines whether to enable or disable Layer 2 loop detection based on packet loss caused by the CAR. After Layer 2 loop detection is enabled, the CPU will take the configured action in response to Layer 2 loops after the system detects an existing or a potential loop on an interface.\nThe system can be configured to take one of the following actions in response to an existing or possible Layer 2 loop on an interface:\nShut down the interface: The system will shut down the interface only after detecting an existing Layer 2 loop on the interface. This action stops the interface from sending numerous packets to the CPU.Send a trap: The system will send a trap after detecting an existing or a potential Layer 2 loop. The trap message can help a user locate the interface where the Layer 2 loop has occurred or may occur.Send a trap and shut down the interface: The system will send a trap and shut down the interface after detecting an existing Layer 2 loop on the interface.Ignore Layer 2 loops: The system will generate a log, but not shut down the interface or send a trap.\nTo enable the system to send a trap after detecting a Layer 2 loop, run the undo l2-loop-detect action trap disable command.\n\nPrecautions\nWhether the preceding actions are configured, the system will generate a log after detecting an existing or a potential Layer 2 loop.\nIn VS mode, this command is supported only by the admin VS."
}