{
    "PageTitle": "l2-loop-detect packets-drop-threshold",
    "FuncDef": "The l2-loop-detect packets-drop-threshold command configures the threshold for starting Layer 2 loop detection.\nThe undo l2-loop-detect packets-drop-threshold command cancels the threshold for starting Layer 2 loop detection.\nBy default, the system dynamically generates the threshold for starting Layer 2 loop detection based on packet loss detection results.",
    "CLIs": [
        "l2-loop-detect packets-drop-threshold <packets-drop-threshold>",
        "undo l2-loop-detect packets-drop-threshold [ packets-drop-threshold ]"
    ],
    "ParentView": [
        "Slot view"
    ],
    "ParaDef": [
        {
            "Parameters": "packets-drop-threshold",
            "Info": "Specifies the threshold for starting Layer 2 loop detection.\nIn normal communications, do not set this parameter.\nThe value is an integer ranging from 1 to 65535000, in packets."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] slot 1",
            "[*HUAWEI-slot-1] l2-loop-detect packets-drop-threshold 30000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the threshold for starting Layer 2 loop detection is not properly set, Layer 2 loop detection may not be started or be unexpectedly started. To resolve this problem, run the l2-loop-detect packets-drop-threshold command to modify the threshold for starting Layer 2 loop detection.\nBy default, the system calculates the threshold for starting Layer 2 loop detection based on the packet loss detection and default algorithm. After the threshold for starting Layer 2 loop detection is configured using the l2-loop-detect packets-drop-threshold command, the value specified by takes effect. To be specific, when the number of packets dropped within the detection period (5s) reaches or exceeds , Layer 2 loop detection is started.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nBefore running the l2-loop-detect packets-drop-threshold command, obtain the experience values of packet loss statistics. If the configured is too low, Layer 2 loop faults may be mistakenly reported.\nIt is recommended that you run this command with assistance from Huawei engineers."
}