{
    "PageTitle": "ma-defend global-policy",
    "FuncDef": "The ma-defend global-policy command creates a global policy for management and service plane protection and enter the global policy view.\nThe undo ma-defend global-policy command deletes a created global policy for management and service plane protection.\nBy default, the global policy for management and service plane protection is not created.",
    "CLIs": [
        "ma-defend global-policy",
        "undo ma-defend global-policy"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ma-defend global-policy",
            "[*HUAWEI-app-sec-global] protocol ftp deny",
            "[*HUAWEI-app-sec-global] enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo help the Router defend against attacks or unauthorized logins initiated by sending protocol packets, management and service plane protection is used to prevent packets of a specified protocol or all protocols from being sent to the CPU. Using management and service plane protection improves device security and reliability and ensures normal network operation.\nA global policy takes effect on an entire Router. It simplifies configuration comparing with the method involving configuration on each interface of the entire Router.\nTo configure a global policy, run the ma-defend global-policy command.\nConfiguration Impact\nAfter a global policy has been configured and its rule has also been configured to discard packets of a specified protocol or all protocols, specified packets are directly discarded after arriving at any interface on the device.\nFollow-up Procedure\nRun the protocol command to configure a rule for accepting or discarding packets of a specified protocol or all protocols before they are sent to the CPU.\nRun the enable command to apply the global policy to the device, allowing this policy to take effect.\nYou can also configure an interface-based policy and apply it to a specified interface, or configure a board-based policy and apply it to a specified board.\nPrecautions\nIf no rule is configured in a global policy, global management and service plane protection or its policy does not take effect.\nIn VS mode, this command is supported only by the admin VS."
}