{
    "PageTitle": "ma-defend-interface",
    "FuncDef": "The ma-defend-interface command applies an interface-based policy for management and service plane protection to a specified interface.\nThe undo ma-defend-interface command disables an interface-based policy on a specified interface.\nBy default, no interface-based policy is applied to a specified interface.",
    "CLIs": [
        "ma-defend-interface <ma-defend-intf-policyID>",
        "undo ma-defend-interface"
    ],
    "ParentView": [
        "100GE-Trunk member interface view",
        "100GE-Trunk member Layer 2 interface view",
        "40GE interface view",
        "GE interface view",
        "Port extension interface view",
        "100GE interface view",
        "GE electrical interface view",
        "50GE interface view",
        "400GE interface view",
        "10GE interface view",
        "Layer 2 100GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "ma-defend-intf-policyID",
            "Info": "Specifies the ID of an interface-based policy.\nThe value is an integer ranging from 1 to 64."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ma-defend interface-policy 7",
            "[*HUAWEI-app-sec-interface-7] protocol snmp permit",
            "[*HUAWEI-app-sec-interface-7] quit",
            "[*HUAWEI] interface GigabitEthernet 3/0/4",
            "[*HUAWEI-GigabitEthernet3/0/4] ma-defend-interface 7"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo help the device defend against attacks or unauthorized logins initiated by sending protocol packets, management and service plane protection is used to prevent packets of a specified protocol or all protocols from being sent to the CPU. Using management and service plane protection improves device security and reliability and ensures normal network operation.\nAn interface-based policy takes effect on a specified interface. It allows finer grained and more accurate management than a global or board-based policy\nTo apply a configured interface-based policy to a specified interface, run the ma-defend interface-policy command.\nPrerequisites\nAn interface-based policy has been configured.\nConfiguration Impact\nAfter the ma-defend-interface command has been run, the configured interface-based policy will take effect.\nPrecautions\nOnly one interface-based policy can be applied to an interface. The ma-defend-interface command is cyclic in nature, and only the latest configuration takes effect.\nIn VS mode, this command is supported only by the admin VS."
}