{
    "PageTitle": "ma-defend interface-policy",
    "FuncDef": "The ma-defend interface-policy command creates an interface-based policy for management and service plane protection and enter the interface-based policy view.\nThe undo ma-defend interface-policy command deletes a created interface-based policy.\nBy default, no interface-based policy is created.",
    "CLIs": [
        "ma-defend interface-policy <interface-policy-id>",
        "undo ma-defend interface-policy <interface-policy-id>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "interface-policy interface-policy-id",
            "Info": "Specifies the ID of an interface-based policy.\nThe value is an integer ranging from 1 to 64."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ma-defend interface-policy 7",
            "[*HUAWEI-app-sec-interface-7] protocol snmp permit",
            "[*HUAWEI-app-sec-interface-7] quit",
            "[*HUAWEI] interface GigabitEthernet 3/0/4",
            "[*HUAWEI-GigabitEthernet3/0/4] ma-defend-interface 7"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo help the device defend against attacks or unauthorized logins initiated by sending protocol packets, management and service plane protection is used to prevent packets of a specified protocol or all protocols from being sent to the CPU. Using management and service plane protection improves device security and reliability and ensures normal network operation.\nAn interface-based policy takes effect on a specified interface. It allows finer grained and more accurate management than a global or board-based policy.\nTo configure an interface-based policy, run the ma-defend interface-policy command.\nConfiguration Impact\nAfter an interface-based policy has been configured and its rule has also been configured to prevent packets of a specified protocol or all protocols from being sent to the CPU, specified packets will be directly discarded after arriving at the specified interface.\nFollow-up Procedure\nRun the protocol command to create a rule for an interface-based policy to accept or discard specified packets before the packets are sent to the CPU.\nRun the ma-defend-interface command to apply the configured policy to a specified interface.\nYou can also configure a global policy and apply it to the device, or configure a board-based policy and apply it to a specified board.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}