{
    "PageTitle": "process-sequence",
    "FuncDef": "The process-sequence command sets the match sequence of packets to be sent to the CPU: TCPSYN packets, packet fragments, dynamic link protection, management protocol ACL, whitelist, blacklist, and user-defined flow.\nThe undo process-sequence command restores the default sequence.\nBy default, packets to be sent to the CPU comply with the following match sequence: TCPSYN packets -> packet fragments -> dynamic link protection -> management protocol ACL -> whitelist -> blacklist -> user-defined flow.",
    "CLIs": [
        "process-sequence { fragment-flood tcpsyn-flood dynamic-link-protection whitelist blacklist user-defined-flow management-acl } *",
        "undo process-sequence"
    ],
    "ParentView": [
        "Attack defense policy view"
    ],
    "ParaDef": [
        {
            "Parameters": "fragment-flood",
            "Info": "Indicates packet fragments.\n-"
        },
        {
            "Parameters": "tcpsyn-flood",
            "Info": "Indicates TCPSYN packets.\n-"
        },
        {
            "Parameters": "dynamic-link-protection",
            "Info": "Indicates dynamic link protection.\n-"
        },
        {
            "Parameters": "whitelist",
            "Info": "Indicates a whitelist.\n-"
        },
        {
            "Parameters": "blacklist",
            "Info": "Indicates a blacklist.\n-"
        },
        {
            "Parameters": "user-defined-flow",
            "Info": "Indicates a user-defined flow.\n-"
        },
        {
            "Parameters": "management-acl",
            "Info": "Indicates a management protocol ACL.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] cpu-defend policy 8",
            "[*HUAWEI-cpu-defend-policy-8] process-sequence tcpsyn-flood fragment-flood dynamic-link-protection management-acl blacklist whitelist user-defined-flow"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter passing the GTSM check, packets to be sent to the CPU need to match against the TCPSYN packets, packet fragments, dynamic link protection, management protocol ACL, blacklist, whitelist, and user-defined flow. The management protocol ACL, blacklist, whitelist, and user-defined flow are configured with ACL rules. Packets matching corresponding ACL rules are added to the blacklist, whitelist, or user-defined flow. The matching order of packets is specified by the process-sequence command. The default matching sequence is as follows: TCPSYN packets, packet fragments, dynamic link protection, whitelist, blacklist, and user-defined flow.\nThe seven parameters in the process-sequence { fragment-flood tcpsyn-flood dynamic-link-protection whitelist blacklist user-defined-flow management-acl } * command are mandatory. You can specify them as required.\nThe three parameters in the process-sequence { whitelist blacklist user-defined-flow } * command are mandatory. You can specify them as required.\nPrerequisites\nThe management protocol ACL, whitelist, blacklist, and user-defined flow are configured with ACL rules.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}