{
    "PageTitle": "carrier (Port extension interface view)",
    "FuncDef": "The carrier command sets the response hold time of the system after  an interface to report status change events.\nThe undo carrier command restores the default delay time for an interface to report status change events.\n\nBy default, the response hold time of the system after an interface goes Down is 0 ms. That is, the system responds immediately after an interface goes Down.\n\n\nThe default response hold-off time of the system is 200 ms after an interface goes Up. That is, the system responds 200 ms later, and the interface is Up.\n\n\nIf an interface goes Down from Up twice within 1 minute, the default hold-off time for the system to respond to the interface Up event is adjusted to 3s. If an interface stays up within 5 minutes, the default response hold-off time restores to 200 ms.",
    "CLIs": [
        "carrier { down-hold-time | up-hold-time } <interval-value>",
        "undo carrier down-hold-time",
        "undo carrier up-hold-time"
    ],
    "ParentView": [
        "Port extension interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "down-hold-time",
            "Info": "The interface goes Down after the specified response suppression time.\n-"
        },
        {
            "Parameters": "up-hold-time",
            "Info": "The interface goes Up after the specified response suppression time.\n-"
        },
        {
            "Parameters": "interval-value",
            "Info": "Specifies the response hold time of the system when the interface status changes.\nThe value is an integer ranging from 0 to 86400000, in milliseconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1025/1/0/0",
            "[~HUAWEI-GigabitEthernet1025/1/0/0] carrier up-hold-time 100"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo set a hold period for a device to respond after an interface goes down, run the carrier down-hold-time command in the interface view. This configuration prevents flapping triggered by frequent interface status changes. It applies to scenarios where an interface is physically up, and the bottom layer detects that the link status changes from up to down because of a LOS alarm, PCS down event, local fault, remote fault, or other reasons.\nPrecautions\nIf the undo shutdown command is run on the local interface, the interface status is immediately displayed as Up in the display command output, without being affected by the response hold-on time."
}