{
    "PageTitle": "duplex",
    "FuncDef": "The duplex command configures a duplex mode for an Ethernet interface.\nThe undo duplex command restores the default duplex mode of an Ethernet interface.\nThe default duplex mode of an Ethernet interface is auto-negotiation mode.",
    "CLIs": [
        "duplex full",
        "duplex half",
        "duplex auto",
        "undo duplex"
    ],
    "ParentView": [
        "GE optical interface view",
        "GE electrical interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "half",
            "Info": "Indicates the half duplex mode.\nWhen connecting to hubs, electrical Ethernet interfaces on devices must work in half duplex mode because hubs work only in half duplex mode.\n-"
        },
        {
            "Parameters": "auto",
            "Info": "Indicates the auto-negotiation mode.\nIn auto-negotiation mode, the local device automatically adjusts the interface rate and duplex mode based on the interface rate and duplex mode of the peer so that both ends can work in the same duplex mode at the highest possible speed.\nIt is recommended that Ethernet interfaces work in auto-negotiation mode provided that the interfaces support this mode. Auto-negotiation is disabled only when two ends of a link work at mismatched rates or duplex modes. In this case, you need to manually set the interface rate and duplex mode.\n-"
        },
        {
            "Parameters": "full",
            "Info": "Indicates the full duplex mode.\nWhen connecting to LAN switches, electrical Ethernet interfaces on devices can work in either full duplex or half duplex mode.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] duplex full"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn a large-scale Ethernet network, manually setting the interface rate and duplex mode, verifying the configurations of devices, and checking statistics about Ethernet interfaces require a great deal of time and human input. Therefore, it is recommended that manually setting the interface rate and duplex mode be adopted only when auto-negotiation of an Ethernet link fails or a problem occurs with auto-negotiation. When there is an auto-negotiation problem, you are recommended to upgrade software or hardware of the device to support the auto-negotiation standard defined in IEEE802.3u/z.\nIf both ends support auto-negotiation, the duplex mode with a lower priority is adopted. Interconnected devices working in auto-negotiation mode is the prerequisite to the auto-negotiation mechanism. If one end works in auto-negotiation mode while the other end works in fixed mode, the auto-negotiation mechanism does not take effect.\nThe auto-negotiation priorities of Ethernet interface rates and duplex modes are listed as follows in descending order:\n1000M full duplex1000M half duplex100M full duplex100M half duplex10M full duplex10M half duplex\nManually setting the interface rate and duplex mode usually complicates network planning and maintenance, and incorrect setting may affect even interrupt normal communication on the network. For example, during network planning, you can set the duplex mode of the local interface same as the known peer duplex mode by running the duplex command. However, once the duplex mode of the peer interface changes, the communication quality will be affected if the duplex mode of the local interface does not change.\n\nPrerequisites\nThe duplex command is applicable only to electrical interfaces. By default, optical interfaces work in full-duplex mode.\nConfiguration Impact\nChanging the rate or the duplex mode of an interface interrupts network communication for a short period.\nDuplex modes of the Ethernet interfaces at the two ends of a link must be the same\nPrecautions\nFor details about the working modes supported by Ethernet interfaces on each board, see the Hardware Description."
}