{
    "PageTitle": "fec-eth",
    "FuncDef": "The fec-eth command configures a forward error correction (FEC) mode for a 100GE Ethernet interface.\nUsing the undo fec-eth command, you can disable the FEC mode of a 100GE Ethernet interface.\nBy default, the forward error correction mode of a 100GE Ethernet interface is hardware-adaptive or standard.",
    "CLIs": [
        "fec-eth standard",
        "fec-eth disable",
        "undo fec-eth"
    ],
    "ParentView": [
        "100GE interface view",
        "50|100GE interface view",
        "FlexE-100G interface view",
        "FlexE-50|100G interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "disable",
            "Info": "Eth FEC disable.\n-"
        },
        {
            "Parameters": "standard",
            "Info": "Standard Eth FEC mode.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 100GE 1/0/1",
            "[~HUAWEI-100GE1/0/1] fec-eth standard"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nDifferent FEC modes have distinctive internal error correcting algorithms and are supported by varied vendors. If interconnected devices have different FEC modes configured, FEC errors may occur. To prevent FEC errors, interconnected devices must have the same FEC mode. If the remote device's interface uses the standard G.709 mode, run the fec-eth standard command to set the FEC mode of the local device's connected 100GE interface to the standard G.709 mode.\nPrecautions\nTwo connected 100GE interfaces must have the same FEC mode.\nThe fec-eth disable command forcibly disables Ethernet FEC. The undo fec-eth command enables or disables Ethernet FEC based on the optical module types. By efault, standard Ethernet FEC is enabled on optical modules (SR4 or CWDM4 MSA) such as the 34061089 (QSFP28 short-distance) and 34061378 (QSFP28 short distance) optical modules.For other optical modules, Ethernet FEC is disabled by default."
}