{
    "PageTitle": "group-member",
    "FuncDef": "The group-member command adds one or more interfaces to a permanent interface group.\nThe undo group-member command deletes one or more interfaces from a permanent interface group.\nBy default, a permanent interface group does not contain any interfaces.",
    "CLIs": [
        "group-member { { <interface-name-start> | <interface-type-start> <interface-number-start> } [ to { <interface-name-end> | <interface-type-end> <interface-number-end> } ] } &<1-10>",
        "undo group-member { { <interface-name-start> | <interface-type-start> <interface-number-start> } [ to { <interface-name-end> | <interface-type-end> <interface-number-end> } ] } &<1-10>"
    ],
    "ParentView": [
        "Interface group view"
    ],
    "ParaDef": [
        {
            "Parameters": "interface-name-start",
            "Info": "Specifies a start interface name.\n-"
        },
        {
            "Parameters": "interface-type-start interface-number-start to interface-type-end interface-number-end",
            "Info": "Specifies one or more interfaces to be added to a permanent interface group.\ninterface-type-start interface-number-start indicates the first interface to be added to a permanent interface group. interface-type-end interface-number-end indicates the last interface to be added to a permanent interface group.The interface type specified using interface-type-start interface-number-start must be the same as that specified using interface-type-end interface-number-end. The interface-number-end value must be greater than or equal to the interface-type-start value. The interface-type-start and interface-number-end values together determine an interface number range.The interfaces specified before and after the keyword to must have the same attribute. For example, they are both interfaces or sub-interfaces. If they are both sub-interfaces, they must belong to the same interface.If to interface-type-end interface-number-end is not specified, only the interface specified using interface-type-start interface-number-start is added.\nA maximum of 10 interface number ranges can be specified using to in a group-member command.\n-"
        },
        {
            "Parameters": "interface-name-end",
            "Info": "Specifies an end interface name.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] port-group portgroup1",
            "[*HUAWEI-port-group-portgroup1] group-member GigabitEthernet 2/0/1 to GigabitEthernet 2/0/3"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter a permanent interface group is created using the port-group command, the permanent interface group does not contain any interfaces. To add one or more interfaces to the permanent interface group, run the group-member command. When you run a command in the interface group view, the system automatically applies the command to all the interfaces in the permanent interface group. Then interfaces in a permanent interface group are configured in a batch.\nPrerequisites\nA permanent interface group has been created using the port-group command in the system view.\nPrecautions\nSimilar to the group-member command, the port-group group-member command adds one or more interfaces to a temporary interface group, implementing batch interface configurations. The differences between permanent and temporary interface groups are described as follows:\nAfter a user exits the view of a temporary interface group, the system automatically deletes the member interfaces in the temporary interface group. However, the member interfaces in the permanent interface group can be deleted only by using the undo group-member command.\nInformation about a permanent interface group can be viewed using the display port-group command, whereas information about a temporary interface group cannot.After a permanent interface group is configured, a configuration file is generated. However, no configuration file is generated after a temporary interface group is configured.\n\nOnly Ethernet physical interfaces and POS interfaces can be added to a permanent interface group, which supports a maximum of 64 member interfaces."
}