{
    "PageTitle": "loopback (Port extension interface view)",
    "FuncDef": "The loopback command enables loopback on an Ethernet interface.\nThe undo loopback command disables loopback.\nBy default, loopback is disabled on Ethernet interfaces.",
    "CLIs": [
        "loopback { local | remote }",
        "undo loopback"
    ],
    "ParentView": [
        "Port extension interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "local",
            "Info": "Indicates local loopback.\nLocal loopback: A packet from an interface is sent back to this interface inside the system.\n-"
        },
        {
            "Parameters": "remote",
            "Info": "Indicates remote loopback.Remote loopback: After receiving packets from a peer end, the local end does not forward these packets to the destination addresses of these packets, but sends them back to the peer end.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1025/1/0/0",
            "[~HUAWEI-GigabitEthernet1025/1/0/0] loopback local"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1025/1/0/0",
            "[~HUAWEI-GigabitEthernet1025/1/0/0] loopback remote"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nFor example, if all 16 10XGE interfaces are installed on a router, the total number of GE optical interfaces is 160 (16 x 10). To test the forwarding performance and stability of all GE interfaces in the system without using interface loopback and redirection, you must have 160 GE optical interfaces, 160 optical modules, and 320 optical fibers. The test consumes a lot of resources and the costs are high. If the test uses interface loopback and redirection, only one tester interface, one optical module, and two optical fibers are needed.\nConfiguration Impact\nIn normal situations, interfaces are not allowed to work in loopback mode; otherwise, traffic is looped, causing service interruption.\nPrecautions\nIf you attempt to configure L2VPN/L2 services on an interface that has the loopback { local | remote } command run, an error message will be displayed, prompting you that the two configurations are mutually exclusive. If you attempt to run the loopback { local | remote } command on an interface that has L2VPN/L2 services configured, a warning message will be displayed to ask you whether you want to continue the configuration.\nIf no optical module is connected to the GE interface that can be configured as either an optical interface or an electrical interface, run the port-type command to configure the interface mode as fiber-100 or fiber-1000. Otherwise, the loopback command cannot be used.\nThe loopback configurations on 10GE WAN interfaces vary with different LPUs where the interfaces reside. In the actual configuration, note the following points:\nTo enable local loopback on a 10GE WAN interface, ensure that the clock of the 10GE WAN interface works in master mode.To enable remote loopback on a 10GE WAN interface, ensure that the clock of the 10GE WAN interface works in slave mode."
}