{
    "PageTitle": "negotiation auto",
    "FuncDef": "The negotiation auto command enables auto-negotiation on an Ethernet interface or an optical Ethernet interface.\nThe undo negotiation auto command disables auto-negotiation on an Ethernet interface or an optical Ethernet interface.\n\nBy default:\n\n\nAuto-negotiation is enabled on electrical Ethernet interfaces.\n\nAuto-negotiation is disabled on optical Ethernet interfaces.\n\n\nThis command varies in transport and router modes. For detailed differences, see Differences Between Commands in Transport and Router Modes. This topic describes the command configuration in router mode.",
    "CLIs": [
        "negotiation auto",
        "undo negotiation auto"
    ],
    "ParentView": [
        "10G LAN interface view",
        "10G WAN interface view",
        "25GE interface view",
        "GE optical interface view",
        "GE electrical interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] negotiation auto"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn a large-scale Ethernet network, manually setting the interface rate and duplex mode, verifying the configurations of devices, and checking statistics about Ethernet interfaces require a great deal of time and human input. Therefore, it is recommended that manually setting the interface rate and duplex mode be adopted only when auto-negotiation of an Ethernet link fails or a problem occurs with auto-negotiation. When there is an auto-negotiation problem, you are recommended to upgrade software or hardware of the device to support the auto-negotiation standard defined in IEEE802.3u/z.\nIt is recommended that Ethernet interfaces work in auto-negotiation mode provided that the interfaces support this mode. Auto-negotiation is disabled only when two ends of a link work at unmatched rates or duplex modes. In this case, you need to manually set the interface rate and duplex mode.\nThe duplex { half | full | auto } command can be used to change the duplex mode of an electrical Ethernet interface.The speed { 10 | 100 | 1000 | auto } command can be used to change the rate of an electrical Ethernet interface.\nTwo Ethernet electrical interfaces at both ends of a link can have different configurations of the auto-negotiation mode.\nTwo Ethernet optical interfaces at both ends of a link must both have auto-negotiation enabled or disabled. Enabling auto-negotiation on Ethernet optical interfaces is recommended.\n\nConfiguration Impact\nIf both ends support auto-negotiation, the duplex mode with a lower priority is adopted. Interconnected devices working in auto-negotiation mode is the prerequisite to the auto-negotiation mechanism. If one end works in auto-negotiation mode while the other end works in fixed mode, the auto-negotiation mechanism does not take effect.\nPrecautions\nIf a GE electrical interface works at 1000 Mbit/s, it can work only in full-duplex mode.\nWhen the undo negotiation auto command is run to cancel the autonegotiation configuration, a message is added to prompt users to ensure consistent configuration on the two ends.\nIf a GE electrical interface works at 1000 Mbit/s, it can work only in full-duplex mode.\nThe negotiation auto command takes effect only in the GE interface view.\nIf the negotiation auto command is run in the view of a GE interface that supports the GE, 25GE, and 10GE rates and the working mode of the interface is switched to 10GE or 25GE, the auto-negotiation configuration is reserved but does not take effect. After the working mode of the interface is switched back to GE, the auto-negotiation configuration is not lost either."
}