{
    "PageTitle": "port-group",
    "FuncDef": "The port-group command creates a permanent interface group and displays the interface group view or directly displays the view of a created permanent interface group.\nThe undo port-group command deletes a permanent interface group.\nBy default, no permanent interface group is created.",
    "CLIs": [
        "port-group <port-group-name>",
        "undo port-group <port-group-name>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "port-group-name",
            "Info": "Specifies the name of a permanent interface group.\nThe value is a string of 1 to 32 characters without spaces.\nWhen quotation marks are used around the string, spaces are allowed in the string.\nWhen configuring the name of an interface group, the uppercase and lowercase letters in the name must be consistent with what the user input.Interface group names are case-insensitive. For example, ABC and abc specify the same interface group. After ABC is configured for an interface group, the ABC interface group view will be displayed when you configure abc.Do not configure \"all\" as the name of a permanent interface group. Meanwhile, to avoid a usage conflict between the port-group group-member command and port-group-name, do not specify g, group-member, or first letters of group-member as the name of a permanent interface group."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] port-group portgroup1",
            "[*HUAWEI-port-group-portgroup1] group-member GigabitEthernet 2/0/1 to GigabitEthernet 2/0/3"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA switching device provides multiple interfaces, many of which have the same configuration. To simplify the configuration of interfaces, run the port-group command to create a permanent interface group and add interfaces to the permanent interface group. When you run a command in the interface group view, the system automatically applies the command to all the interfaces in the permanent interface group. In this manner, interfaces in a permanent interface group are configured in a batch.\nFollow-up Procedure\nRun the group-member command to add one or more interfaces to the permanent interface group.\nPrecautions\nEach VS supports a maximum of 64 permanent interface groups."
}