{
    "PageTitle": "port-type (GE electrical interface view)",
    "FuncDef": "The port-type command sets an interface type.\nThe undo port-type command deletes the setting of an interface type.\nBy default, a device determines the interface type according to the type of the Small Form-Factor Pluggable (SFP) module.",
    "CLIs": [
        "port-type copper",
        "port-type fiber-100",
        "port-type fiber-1000",
        "undo port-type"
    ],
    "ParentView": [
        "GE electrical interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "fiber-100",
            "Info": "Sets the interface type to 100M optical.\n-"
        },
        {
            "Parameters": "fiber-1000",
            "Info": "Sets the interface type to 1000M optical.\n-"
        },
        {
            "Parameters": "copper",
            "Info": "Sets the interface type to electrical.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 4/0/2",
            "[~HUAWEI-GigabitEthernet4/0/2] port-type fiber-1000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure a fixed interface type for a GE interface, run the port-type command.\nIf an SFP interface that cannot be identified works properly, you can forcibly configure an interface type for the SFP interface by using the port-type command.\nPrerequisites\nThe interface where the port-type command is to be run is an adaptive GE interface.\nConfiguration Impact\nAfter you run the port-type command, the configurations of an interface, including the loopback mode, speed, negotiation and duplex mode, are restored to default settings. You need to configure the interface again.\nWhen you replace the SFP module, the configurations of an interface, including the loopback mode, speed, negotiation and duplex mode, are restored to default settings. You need to configure the interface again.\nPrecautions\nWhen an interface has a 100M optical module installed, you are not allowed to configure the port-type fiber-1000 command.\nYou can transform an optical interface into an electrical interface by configuring the keyword copper when the following conditions are met:\nThe rate of the optical interface must not be less than 1000 Mbit/s.The SFP module that can transform an optical interface into an electrical interface must be available."
}