{
    "PageTitle": "statistic enable (VLAN-group view)",
    "FuncDef": "The statistic enable command enables the function to collect QinQ packet statistics based on VLAN groups.\nThe undo statistic enable command disables the function to collect QinQ packet statistics based on VLAN groups.\nBy default, the function to collect QinQ packet statistics based on VLAN groups is disabled.",
    "CLIs": [
        "statistic enable",
        "undo statistic enable"
    ],
    "ParentView": [
        "VLAN-group view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1/0/1.1",
            "[*HUAWEI-GigabitEthernet1/0/1.1] encapsulation qinq-termination",
            "[*HUAWEI-GigabitEthernet1/0/1.1] vlan-group 1",
            "[*HUAWEI-GigabitEthernet1/0/1.1-vlangroup1] quit",
            "[*HUAWEI-GigabitEthernet1/0/1.1] qinq termination pe-vid 1000 ce-vid 100 to 200 vlan-group 1",
            "[*HUAWEI-GigabitEthernet1/0/1.1] vlan-group 1",
            "[*HUAWEI-GigabitEthernet1/0/1.1-vlangroup1] statistic enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, the function of collecting QinQ packet statistics is disabled. The statistic enable command must be used in the VLAN group view to enable the function to collect QinQ packet statistics based on VLAN groups before the display qinq statistics command is used to view the number of sent and received QinQ packets. Based on the statistics, you can locate problems or deploy QoS policies. If the function to collect QinQ packet statistics is disabled, QinQ packet statistics on the sub-interface cannot be displayed.\nPrerequisites\nA VLAN group has been created using the vlan-group command in the sub-interface view.\nPerform any of the following configuration steps:\nRun the dot1q termination vid low-pe-vid [ to high-pe-vid ] vlan-group group-id command in the view of a sub-interface for Dot1q VLAN tag termination to associate the VLAN IDs to be terminated by the sub-interface with the VLAN group.Run the qinq termination pe-vid pe-vid [ to high-pe-vid ] ce-vid low-ce-vid [ to high-ce-vid ] vlan-group group-id command in the view of a sub-interface for QinQ VLAN tag termination to associate the VLAN IDs to be terminated by the sub-interface with the VLAN group.Run the qinq stacking vid low-ce-vid [ to high-ce-vid ] vlan-group group-id command in the view of a QinQ stacking sub-interface to associate the outer VLAN ID with the VLAN group.\n\nConfiguration Impact\nAfter the statistic enable command is used to enable the function to collect QinQ packet statistics based on VLAN groups, all QinQ packet sent and received by the VLAN group will be counted. If a large number of QinQ packets pass through a specific VLAN group, the device stores a lot of statistics, which affects system performance.\nIf there is no need to collect QinQ packet statistics, disabling the function to collect QinQ packet statistics based on VLAN groups is recommended.\nFollow-up Procedure\nRun the display qinq statistics command to view the number of sent and received QinQ packets. Based on the statistics, you can deploy QoS policies or locate problems."
}