{
    "PageTitle": "trap-threshold input-rate output-rate",
    "FuncDef": "The trap-threshold input-rate output-rate command configures an alarm threshold and a clear alarm threshold for inbound or outbound bandwidth usage.\nThe undo trap-threshold input-rate output-rate command restores the default configuration.\nBy default, the alarm threshold for inbound or outbound bandwidth usage is 90%.",
    "CLIs": [
        "trap-threshold input-rate <bandwidth-in-use> [ resume-rate <resume-threshold> ]",
        "trap-threshold output-rate <bandwidth-in-use> [ resume-rate <resume-threshold> ]",
        "undo trap-threshold input-rate",
        "undo trap-threshold output-rate"
    ],
    "ParentView": [
        "100GE-Trunk member Layer 2 interface view",
        "100GE-Trunk member interface view",
        "Layer 2 100GE interface view",
        "100GE interface view",
        "Layer 2 10GE interface view",
        "10GE interface view",
        "25GE-L2 view",
        "25GE sub-interface view",
        "25GE interface view",
        "400GE-L2 view",
        "400GE sub-interface view",
        "400GE interface view",
        "40GE-Trunk member Layer 2 interface view",
        "40GE-Trunk member interface view",
        "Layer 2 40GE interface view",
        "40GE interface view",
        "Layer 2 50GE interface view",
        "50GE sub-interface view",
        "50GE interface view",
        "Layer 2 50|100GE interface view",
        "FlexE interface view",
        "Layer 2 GE interface view",
        "GE optical interface view",
        "GE sub-interface view",
        "GE interface view",
        "GE electrical interface view",
        "POS interface view",
        "Remote-AP interface view",
        "Vbridge interface view",
        "Layer 2 sub-interface view",
        "Port extension Layer 2 interface view",
        "Port extension interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "resume-rate resume-threshold",
            "Info": "Specifies a clear alarm threshold for inbound bandwidth usage.\nThe value is an integer ranging from 1 to 100.\nIf the resume-rate <inResumeValue> command is not run, the default value of this parameter is 80.The value of resume-rate <inResumeValue> must be less than or equal to that of resume-rate <inResumeValue>.If resume-rate <inResumeValue> is not configured, the system automatically sets the clear alarm threshold for bandwidth usage to be the same as the alarm threshold for bandwidth usage."
        },
        {
            "Parameters": "resume-rate resume-threshold",
            "Info": "Specifies a clear alarm threshold for outbound bandwidth usage.\nThe value is an integer ranging from 1 to 100.\nIf the resume-rate <outResumeValue> command is not run, the default value of this parameter is 80.The value of resume-rate <outResumeValue> must be less than or equal to that of resume-rate <outResumeValue>.If resume-rate <outResumeValue> is not configured, the system automatically sets the clear alarm threshold for bandwidth usage to be the same as the alarm threshold for bandwidth usage."
        },
        {
            "Parameters": "output-rate bandwidth-in-use",
            "Info": "Specifies an alarm threshold for outbound bandwidth usage.\nThe value is an integer ranging from 1 to 100."
        },
        {
            "Parameters": "input-rate bandwidth-in-use",
            "Info": "Specifies an alarm threshold for inbound bandwidth usage.\nThe value is an integer ranging from 1 to 100."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/1.1",
            "[~HUAWEI-GigabitEthernet1/0/1.1] trap-threshold output-rate 80"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/1.1",
            "[~HUAWEI-GigabitEthernet1/0/1.1] undo trap-threshold input-rate"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nMonitoring bandwidth usage helps you keep track of the load on a device. If the bandwidth usage exceeds a specified threshold, bandwidth resources are insufficient, and the device capacity needs to be expanded. For example, if the bandwidth usage exceeds 95%, an alarm is generated, indicating that bandwidth resources are almost exhausted. As a result, some services may be interrupted before device capacity is expanded. In this case, run the trap-threshold command to configure an alarm threshold and a clear alarm threshold for inbound or outbound bandwidth usage. This ensures that device capacity is expanded in advance to prevent service interruption caused by bandwidth exhaustion.\nThe outbound bandwidth usage on an interface is calculated using the following formula: Outbound bandwidth usagey (Ratio of the traffic sent by the interface to the total bandwidth of the interface) = (Outbound traffic rate on an interface/Bandwidth of the physical interface) * 100\nThe inbound bandwidth usage on an interface is calculated using the following formula: Inbound bandwidth usage (Ratio of the traffic received by the interface to the total bandwidth of the interface) = (Inbound traffic rate on an interface/Bandwidth of the physical interface) * 100\nSpecify parameters in the trap-threshold command as required, triggering a log alarm when the threshold is reached.\nRun the trap-threshold input-rate bandwidth-in-use resume-rate resume-threshold command to set an alarm threshold and a clear alarm threshold for inbound bandwidth usage.\nIf the inbound bandwidth usage exceeds the threshold specified by bandwidth-in-use, an hwIfMonitorInputRateRising alarm is generated, indicating that the inbound bandwidth usage exceeds the configured threshold.If the inbound bandwidth usage falls below the threshold specified by resume-threshold, an hwIfMonitorInputRateResume alarm is generated, indicating that the inbound bandwidth usage falls below the threshold.\nRun the trap-threshold output-rate bandwidth-in-use resume-rate resume-threshold command to set an alarm threshold and a clear alarm threshold for outbound bandwidth usage.\nIf the outbound bandwidth usage exceeds the threshold specified by bandwidth-in-use, an hwIfMonitorOutputRateRising alarm is generated, indicating that the outbound bandwidth usage exceeds the configured threshold.If the outbound bandwidth usage falls below the threshold specified by resume-threshold, an hwIfMonitorOutputRateResume alarm is generated, indicating that the outbound bandwidth usage falls below the threshold.\n\nIn port extension scenarios, run the trap-threshold command in the port extension interface view on a master to set an alarm threshold and a clear alarm threshold for inbound or outbound bandwidth usage. The configuration is then delivered to the corresponding AP and takes effect on the AP's external communication interface mapped to the port extension interface.\nPrecautions\nTo prevent alarms from being frequently generated or cleared, set a large difference between the bandwidth-in-use and resume-threshold values."
}