{
    "PageTitle": "diffserv-mode ingress egress(interface)",
    "FuncDef": "The diffserv-mode ingress egress command configures an MPLS DiffServ mode to ensure end-to-end QoS.\nThe undo diffserv-mode command restores an MPLS DiffServ mode to the default configuration.\nBy default, the MPLS DiffServ mode is Uniform.",
    "CLIs": [
        "diffserv-mode ingress { uniform | pipe <service-class> <color> | short-pipe <service-class> <color> } egress { uniform | pipe | short-pipe [ trust { inner-vlan-8021p | ip-dscp } ] [ domain <ds-name> ] }",
        "undo diffserv-mode"
    ],
    "ParentView": [
        "100ge sub-interface view",
        "100GE interface view",
        "10GE sub-interface view",
        "10GE interface view",
        "25GE sub-interface view",
        "25GE interface view",
        "400GE sub-interface view",
        "400GE interface view",
        "40GE sub-interface view",
        "40GE interface view",
        "50GE sub-interface view",
        "50GE interface view",
        "50|100GE sub-interface view",
        "50|100GE interface view",
        "Eth-Trunk sub-interface view",
        "Eth-Trunk interface view",
        "GE optical interface view",
        "GE sub-interface view",
        "GE interface view",
        "GE electrical interface view",
        "Global VE sub-interface view",
        "IP-Trunk interface view",
        "MP-group interface view",
        "POS interface view",
        "L2VE interface view",
        "XGE sub-interface view",
        "XGE interface view",
        "Serial interface view",
        "EVC view of an Eth-Trunk interface",
        "EVC view of a GE interface",
        "Sub-interface view",
        "Port extension interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "uniform",
            "Info": "Specifies that the MPLS DiffServ mode is Uniform.\n-"
        },
        {
            "Parameters": "pipe",
            "Info": "Specifies that the MPLS DiffServ mode is Pipe.\n-"
        },
        {
            "Parameters": "service-class",
            "Info": "Specifies the Class of Service (CoS) for the packets that enter the public network from a private network.\nThe available values are cs7, cs6, ef, af4, af3, af2, af1, be."
        },
        {
            "Parameters": "color",
            "Info": "Specifies the color of a packet that enters the public network from a private network. The color marks the discard priority of the packet.\nThe available values are green, yellow, and red."
        },
        {
            "Parameters": "short-pipe",
            "Info": "Specifies that the MPLS DiffServ mode is Short-pipe.\n-"
        },
        {
            "Parameters": "egress",
            "Info": "Specifies that the node is an MPLS egress.\nIf the uniform or pipe mode is configured on an egress, the egress forwards packets based on the EXP value.\nBy default, if the short-pipe mode is configured on an egress, the egress forwards packets based on the VLAN priority. If packets do not carry the VLAN priority, the egress forwards packets based on the IP DSCP value.\n-"
        },
        {
            "Parameters": "trust",
            "Info": "Specifies the label value trusted by the egress node in short-pipe mode.\n-"
        },
        {
            "Parameters": "inner-vlan-8021p",
            "Info": "Specifies that an egress working in short-pipe mode forwards packets based on the 802.1p value carried in inner VLAN tags.\n-"
        },
        {
            "Parameters": "ip-dscp",
            "Info": "Specifies that an egress working in short-pipe mode forwards packets based on the IP DSCP value.\n-"
        },
        {
            "Parameters": "domain ds-name",
            "Info": "Specifies the name of a Diff-Serv domain that uses a specified PHB on an egress node in Short-pipe mode.\nThe value is a string of 1 to 48 characters."
        },
        {
            "Parameters": "ingress",
            "Info": "Specifies that the node is an MPLS ingress.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 2/0/0",
            "[~HUAWEI-GigabitEthernet2/0/0] diffserv-mode ingress uniform egress pipe"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nDiff-Serv models include Pipe, Short Pipe, and Uniform.\nIn the Pipe model, the EXP value in the label assigned by the ingress PE to the packet is determined by the user-defined parameters. Before the packet leaves the MPLS network, the MPLS label is popped out, but the DSCP value of the IP packet remains unchanged. The egress PE then forwards the packet based on the EXP value in the MPLS label.In short-pipe mode, the EXP value assigned by the ingress to a packet is determined by the user-defined parameters. When the packet leaves the MPLS network, the egress removes the MPLS label, but the DSCP value of the IP packet remains unchanged. The egress forwards the packet based on the trust field in the MPLS label. If no trust field is configured, the egress forwards the packet based on its VLAN priority. If the packet does not have a VLAN priority, the egress forwards the packet based on its IP DSCP value.In uniform mode, the EXP value assigned by the ingress is determined by the inbound queue and egress DS domain. When the packet leaves the MPLS network, the egress removes the MPLS label and maps the EXP value to the DSCP value of the IP packet. The egress then forwards the packet based on the mapped DSCP value.\nWhen you configure the service type of packets transmitted from a private network to the public network:\nConfigure the service type as cs7 or cs6 to send signaling protocol packets.Configure the service type as ef to ensure low latency.Configure the service type as af4, af3, af2, or af1 to ensure the bandwidth key data.Configure the service type as be for the best effort delivery without strict QoS assurance.\nThe preceding service types are listed in the descending order of sending priorities.\nThe colors of the packets sent from private network to the public network are arranged in the ascending order of the discard priorities, specifically, green, yellow, and red.\n\nPrecautions\nThe trust {inner-vlan-8021p | ip-dscp} parameter is not supported in the global-VE sub-interface view."
}