{
    "PageTitle": "diffserv-mode (interface)",
    "FuncDef": "The diffserv-mode command configures an MPLS DiffServ mode to ensure end-to-end QoS.\nThe undo diffserv-mode command restores an MPLS DiffServ mode to the default configuration.\nBy default, the MPLS DiffServ mode is Uniform.",
    "CLIs": [
        "diffserv-mode { pipe <service-class> <color> | short-pipe <service-class> <color> [ domain <ds-name> ] | uniform }",
        "undo diffserv-mode"
    ],
    "ParentView": [
        "100ge sub-interface view",
        "100GE interface view",
        "10GE sub-interface view",
        "10GE interface view",
        "10G LAN interface view",
        "10G WAN interface view",
        "25GE sub-interface view",
        "25GE interface view",
        "400GE sub-interface view",
        "400GE interface view",
        "40GE sub-interface view",
        "40GE interface view",
        "50GE sub-interface view",
        "50GE interface view",
        "50|100GE sub-interface view",
        "50|100GE interface view",
        "Eth-Trunk sub-interface view",
        "Eth-Trunk interface view",
        "GE optical interface view",
        "GE electrical interface view",
        "Global VE sub-interface view",
        "IP-Trunk interface view",
        "POS interface view",
        "L2VE interface view",
        "XGE interface view",
        "XGE sub-interface view",
        "Sub-interface view",
        "Port extension interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "pipe",
            "Info": "Specifies that the MPLS DiffServ mode is Pipe.\n-"
        },
        {
            "Parameters": "service-class",
            "Info": "Specifies the Class of Service (CoS) for the packets that enter the public network from a private network.\nThe value can be cs7, cs6, ef, af4, af3, af2, af1, or be."
        },
        {
            "Parameters": "color",
            "Info": "Specifies the color of a packet that enters the public network from a private network. The color marks the discard priority of the packet.\nThe value can be green, yellow, or red."
        },
        {
            "Parameters": "short-pipe",
            "Info": "Specifies that the MPLS DiffServ mode is Short-pipe.\n-"
        },
        {
            "Parameters": "domain ds-name",
            "Info": "Specifies the name of a Diff-Serv domain that uses a specified PHB on an egress node in Short-pipe mode.\nThe value is a string of 1 to 48 characters."
        },
        {
            "Parameters": "uniform",
            "Info": "Specifies that the MPLS DiffServ mode is Uniform.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 2/0/0",
            "[~HUAWEI-GigabitEthernet2/0/0] diffserv-mode pipe af1 green"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure a Diff-Serv mode:\nIf service priorities on an MPLS network need to be distinguished, configure the Uniform mode.If service priorities do not need to be distinguished, configure the Pipe or Short-pipe mode.\nWhen service class is configured for the packets that enter the public network from a private network:\nTo transmit signaling protocol, set service class to cs7 and cs6.To ensure the QoS for low-delay services, set the service class to ef.To ensure the bandwidth for key services, set service class to af4, af3, af2, or af1.Set the service class to be (a service class) for the services that do not need strict QoS assurance.\nThe packets with the preceding service classes are arranged in descending order of sending priorities.\nThe colors of packets that enter the public network from a private network are in ascending order of discard priorities. That is green, yellow, and red."
}