{
    "PageTitle": "diffserv-mode(evpn)",
    "FuncDef": "The diffserv-mode command configures an MPLS DiffServ mode to ensure end-to-end QoS.\nThe undo diffserv-mode command restores an MPLS DiffServ mode to the default configuration.\nBy default, the MPLS DiffServ mode is Uniform.",
    "CLIs": [
        "diffserv-mode pipe <service-class> <color>",
        "diffserv-mode short-pipe <service-class> <color> [ domain <ds-name> ]",
        "diffserv-mode uniform",
        "undo diffserv-mode"
    ],
    "ParentView": [
        "EVPL SRv6 view",
        "EVPL instance MPLS mode view",
        "EVPN instance view",
        "bd-evpn-instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "service-class",
            "Info": "Specifies the Class of Service (CoS) for the packets that enter the public network from a private network.\nThe value can be cs7, cs6, ef, af4, af3, af2, af1, or be."
        },
        {
            "Parameters": "color",
            "Info": "Specifies the color of a packet that enters the public network from a private network. The color marks the discard priority of the packet.\nThe value can be green, yellow, or red."
        },
        {
            "Parameters": "short-pipe",
            "Info": "Specifies that the MPLS DiffServ mode is Short-pipe.\n-"
        },
        {
            "Parameters": "domain ds-name",
            "Info": "Specifies the name of a Diff-Serv domain that uses a specified PHB on an egress node in Short-pipe mode.\nThe value is a string of 1 to 48 characters."
        },
        {
            "Parameters": "uniform",
            "Info": "Specifies that the MPLS DiffServ mode is Uniform.\n-"
        },
        {
            "Parameters": "pipe",
            "Info": "Specifies that the MPLS DiffServ mode is Pipe.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] evpn vpn-instance evpn1",
            "[*HUAWEI-evpn-instance-evpn1] diffserv-mode pipe af1 green"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure a Diff-Serv mode:\nIf service priorities on an MPLS network need to be distinguished, configure the Uniform mode.If service priorities do not need to be distinguished, configure the Pipe or Short-pipe mode.\nWhen you configure the service type of packets transmitted from a private network to the public network:\nConfigure the service type as cs7 or cs6 to send signaling protocol packets.Configure the service type as ef to ensure low latency.Configure the service type as af4, af3, af2, or af1 to ensure the bandwidth key data.Configure the service type as be for the best effort delivery without strict QoS assurance.\nThe preceding service types are listed in the descending order of sending priorities.\nThe colors of the packets sent from private network to the public network are arranged in the ascending order of the discard priorities, specifically, green, yellow, and red."
}