{
    "PageTitle": "l3vpn diffserv-mode short-pipe enhance enable",
    "FuncDef": "The l3vpn diffserv-mode short-pipe enhance enable command sets the enhanced Short Pipe mode in L3VPN scenarios.\nThe undo l3vpn diffserv-mode short-pipe enhance enable command restores the default configuration.\nBy default, the enhanced Short Pipe mode is not enabled in L3VPN scenarios.",
    "CLIs": [
        "l3vpn diffserv-mode short-pipe enhance enable",
        "undo l3vpn diffserv-mode short-pipe enhance enable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] l3vpn diffserv-mode short-pipe enhance enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn L3VPN scenarios, packets sent by the device enter queues based on the following default rules:\nIn Uniform mode, the ingress PE puts the packets into queues based on DSCP values, and the egress PE puts the packets into queues based on EXP values.In Pipe mode, both the ingress PE and egress PE put the packets into queues based on EXP values.In Short Pipe mode, the ingress PE puts the packets into queues based on EXP values, and the egress PE puts the packets into queues based on DSCP values.\nIn L3VPN scenarios with the Short Pipe mode configured, if the ingress PE and egress PE are the same node, packets enter queues based on EXP values by default, which does not comply with the rule of putting packets leaving the public network into queues based on DSCP values in Short Pipe mode. To resolve this issue, set the enhanced Short Pipe mode so that packets on the ingress PE enter queues based on DSCP values.\n\nPrecautions\nThe l3vpn diffserv-mode short-pipe enhance enable command configuration takes effect only after the DiffServ mode is set to Short-Pipe.\nIn an NG MVPN scenario, if the MPLS DiffServ mode of the ingress is set to Short Pipe, packets for multicast traffic entering the public network tunnel and packets forwarded by the local VPN instance are put into queues all based on carrier-specified priorities. After the l3vpn diffserv-mode short-pipe enhance enable is run, these packets are put into queues all based on the DSCP values of user packets."
}