{
    "PageTitle": "accounting-together enable",
    "FuncDef": "The accounting-together enable command enables uniform accounting for DAA services.\nThe undo accounting-together enable command disables uniform accounting for DAA services.\nBy default, uniform accounting is disabled for DAA services.",
    "CLIs": [
        "accounting-together enable",
        "undo accounting-together enable"
    ],
    "ParentView": [
        "Value-added service policy view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] value-added-service policy policy1 daa",
            "[~HUAWEI-vas-policy-policy1] accounting-together enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen users access network services with different bandwidth requirements, such as game, FTP, and VoD services, different network services are planned as different DAA services for rate limit. You can configure a virtual uniform accounting service to interact with an accounting server, implementing traffic reporting and service quota management. To enable uniform accounting for DAA services, run the accounting-together enable command.\nPrerequisites\nA DAA service policy has been created using the value-added-service policy <service-policy-name> daa command.\nConfiguration Impact\nAfter the accounting-together enable command is run, for multiple DAA services, only one service accounting packet is sent and uniform accounting is implemented.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nWhen uniform accounting is enabled for DAA services, only one service accounting packet is uniformly sent for a user. Accounting is performed only for the last valid service among all of the DAA services, and all service traffic is counted into the last valid service's traffic. When uniform accounting is disabled for DAA services, accounting is performed for all of the DAA services. A service accounting packet is separately sent for each DAA service of a user. In addition, the traffic statistics of basic user services (non-DAA services) are separately collected and an independent accounting packet is sent, regardless of whether this command is enabled."
}