{
    "PageTitle": "accounting-service-policy(AAA domain view)",
    "FuncDef": "The accounting-service-policy command controls whether to match the upstream or downstream traffic of users that go online through an AAA domain against DAA services.\nBy default, By default, upstream and downstream traffic of users that go online through AAA domains is matched against DAA services.",
    "CLIs": [
        "accounting-service-policy { inbound | outbound } { disable | enable }"
    ],
    "ParentView": [
        "AAA domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "inbound",
            "Info": "Specifies upstream traffic of users that go online through domain.\n-"
        },
        {
            "Parameters": "outbound",
            "Info": "Specifies downstream traffic of users that go online through domain.\n-"
        },
        {
            "Parameters": "disable",
            "Info": "Disable the DAA service matching function of upstream traffic of users that go online through domain.\n-"
        },
        {
            "Parameters": "enable",
            "Info": "Enable the DAA service matching function of upstream traffic of users that go online through domain.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] domain Huawei",
            "[*HUAWEI-aaa-domain-huawei] commit",
            "[~HUAWEI-aaa-domain-huawei] accounting-service-policy inbound disable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo implement refined control over DAA functions, run the accounting-service-policy inbound disable command in the AAA domain view to disable the DAA service matching function of upstream traffic of users that go online through this domain, or run the accounting-service-policy outbound disable command in the AAA domain view to disable the DAA service matching function of downstream traffic of users that go online through this domain.\nConfiguration Impact\nAfter the accounting-service-policy inbound disable command is run in the AAA domain view, upstream traffic of users that go online through this domain is not matched against DAA services.After the accounting-service-policy outbound disable command is run in the AAA domain view, downstream traffic of users that go online through this domain is not matched against DAA services.\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}