{
    "PageTitle": "accounting-service-policy(Value-added service policy view)",
    "FuncDef": "The accounting-service-policy command configures the user traffic to match a DAA service policy.\nBy default, user traffic is enabled to match a DAA service policy.",
    "CLIs": [
        "accounting-service-policy { inbound | outbound } { enable | disable | auto }"
    ],
    "ParentView": [
        "Value-added service policy view"
    ],
    "ParaDef": [
        {
            "Parameters": "inbound",
            "Info": "Indicates upstream user traffic.\n-"
        },
        {
            "Parameters": "outbound",
            "Info": "Indicates downstream user traffic.\n-"
        },
        {
            "Parameters": "enable",
            "Info": "Enables user traffic from to match a DAA service policy.\n-"
        },
        {
            "Parameters": "disable",
            "Info": "Disables user traffic from matching a DAA service policy.\n-"
        },
        {
            "Parameters": "auto",
            "Info": "Automatically matches user traffic with a DAA service policy.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] value-added-service policy policy1 daa",
            "[*HUAWEI-vas-policy-policy1] commit",
            "[~HUAWEI-vas-policy-policy1] accounting-service-policy inbound enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo implement refined control over DAA functions and save DAA QoS resources, for example, run the accounting-service-policy inbound disable command to disable upstream DAA user traffic from matching a DAA service policy, preventing upstream QoS resource application.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nAfter the accounting-service-policy { inbound | outbound } auto command is run, the system can intelligently determine whether to match upstream or downstream user traffic with a DAA service policy based on a configured service bandwidth. If no bandwidth is configured for all upstream or downstream user traffic, the system disables the user traffic from matching a DAA service policy and does not apply for upstream or downstream DAA QoS resources."
}