{
    "PageTitle": "user-traffic-statistic",
    "FuncDef": "The user-traffic-statistic command configures the statistics mode for user traffic when SQ scheduling is applied to DAA services. Traffic statistics of the specified FQs (Flow Queue) are then collected as user traffic statistics.\nThe undo user-traffic-statistic command restores the default configuration.\nBy default, if DAA service separation is disabled, traffic statistics of all the eight FQs are collected as user traffic statistics; if DAA service separation is enabled, traffic statistics of FQs of non-DAA services are collected as user traffic statistics.",
    "CLIs": [
        "user-traffic-statistic { cs7 | cs6 | ef | af4 | af3 | af2 | af1 | be } * { inbound | outbound }",
        "undo user-traffic-statistic [ cs7 | cs6 | ef | af4 | af3 | af2 | af1 | be ] * { inbound | outbound }"
    ],
    "ParentView": [
        "Value-added service policy view"
    ],
    "ParaDef": [
        {
            "Parameters": "cs7",
            "Info": "Indicates that a service class is CS7.\n-"
        },
        {
            "Parameters": "cs6",
            "Info": "Indicates that a service class is CS6.\n-"
        },
        {
            "Parameters": "ef",
            "Info": "Indicates that a service class is EF.\n-"
        },
        {
            "Parameters": "af4",
            "Info": "Indicates that a service class is AF4.\n-"
        },
        {
            "Parameters": "af3",
            "Info": "Indicates that a service class is AF3.\n-"
        },
        {
            "Parameters": "af2",
            "Info": "Indicates that a service class is AF2.\n-"
        },
        {
            "Parameters": "af1",
            "Info": "Indicates that a service class is AF1.\n-"
        },
        {
            "Parameters": "be",
            "Info": "Indicates that a service class is BE.\n-"
        },
        {
            "Parameters": "inbound",
            "Info": "Indicates the upstream direction of user traffic.\n-"
        },
        {
            "Parameters": "outbound",
            "Info": "Indicates the downstream direction of user traffic.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] value-added-service policy policy1 daa",
            "[*HUAWEI-vas-policy-policy1] commit",
            "[~HUAWEI-vas-policy-policy1] user-traffic-statistic cs7 cs6 be outbound"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter CAR is performed on a DAA service flow, packets in the DAA service flow are re-marked with different priorities and are scheduled into SQs. In SQ-based traffic statistics, however, DAA traffic and non-DAA traffic are not differentiated. To specify the FQs of which traffic statistics are collected as user traffic statistics, run the user-traffic-statistic command.\nPrecautions\nThis command is supported only on the admin VS.\nThis command takes effect only when DAA services are scheduled into SQs. This command takes precedence over DAA service separation configurations."
}