{
    "PageTitle": "value-added-service tariff-queue-mapping",
    "FuncDef": "The value-added-service tariff-queue-mapping command configures the mapping relationship between tariff levels of the DAA service and flow queues.\nBy default, Level 1 maps cs7, Level 2 maps cs6, Level 3 maps ef, Level 4 maps af4, Level 5 maps af3, Level 6 maps af2, Level 7 maps af1, and Level 8 maps be.",
    "CLIs": [
        "value-added-service tariff-queue-mapping { [ cs7 ] | [ cs6 ] | [ ef ] | [ af4 ] | [ af3 ] | [ af1 ] | [ be ] | [ af2 ] }"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "cs7",
            "Info": "Indicates that the service type name is CS7.\n-"
        },
        {
            "Parameters": "cs6",
            "Info": "Indicates that the service type name is CS6.\n-"
        },
        {
            "Parameters": "ef",
            "Info": "Indicates that the service type name is EF.\n-"
        },
        {
            "Parameters": "af4",
            "Info": "Indicates that the service type name is AF4.\n-"
        },
        {
            "Parameters": "af3",
            "Info": "Indicates that the service type name is AF3.\n-"
        },
        {
            "Parameters": "af1",
            "Info": "Indicates that the service type name is AF1.\n-"
        },
        {
            "Parameters": "be",
            "Info": "Indicates that the service type name is BE.\n-"
        },
        {
            "Parameters": "af2",
            "Info": "Indicates that the service type name is AF2.\n-"
        },
        {
            "Parameters": "tariff-queue-mapping",
            "Info": "Specifies the mapping relationship between tariff levels and flow queues (tariff level 1 to tariff level 8).\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] value-added-service tariff-queue-mapping cs7 cs6 ef af4 af3 af2 af1 be"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nQueue scheduling can be performed on different value-added services to ensure that services with higher priorities are forwarded first. The value-added-service tariff-queue-mapping command is used to configure the mapping relationship between tariff levels of DAA and flow queues. CS7, CS6, EF, AF4, AF3, AF2, AF1, and BE are in descending order of priority.\nPrecautions\nThis command is supported only on the admin VS.\nThe eight parameters in the value-added-service tariff-queue-mapping command are mandatory. You can specify them as required.\nThe command updates information about online users and cannot be consecutively configured. The command can be configured again only after information about online users is updated."
}