{
    "PageTitle": "import-route (RIPng view)",
    "FuncDef": "The import-route command configures RIPng to import routes from other routing protocols or RIPng processes.\nThe undo import-route command prevents RIPng from importing routes from other routing protocols or RIPng processes.\nBy default, RIPng does not import routes from any other routing protocols or RIPng processes.",
    "CLIs": [
        "import-route { { static | direct | bgp | unr } | { { ripng | ospfv3 | isis } [ <process-id> ] } } [ [ cost <cost> | inherit-cost ] | [ route-filter <route-filter-name> | route-policy <route-policy-name> ] ] *",
        "undo import-route { { direct | static | bgp | unr } | { { ospfv3 | ripng | isis } [ <process-id> ] } }"
    ],
    "ParentView": [
        "RIPng view"
    ],
    "ParaDef": [
        {
            "Parameters": "static",
            "Info": "Imports static routes.\n-"
        },
        {
            "Parameters": "direct",
            "Info": "Imports direct routes.\n-"
        },
        {
            "Parameters": "bgp",
            "Info": "Imports BGP routes.\n-"
        },
        {
            "Parameters": "unr",
            "Info": "Imports user network routes.\n-"
        },
        {
            "Parameters": "ripng",
            "Info": "Imports RIPng routes.\n-"
        },
        {
            "Parameters": "ospfv3",
            "Info": "Imports OSPFv3 routes.\n-"
        },
        {
            "Parameters": "isis",
            "Info": "Imports IS-IS routes.\n-"
        },
        {
            "Parameters": "process-id",
            "Info": "Specifies the ID of a ripng, ospf, or isis process.\nA device can import RIPng routes from another process only when its ID is different from the local one.\nThe value is an integer ranging from 1 to 4294967295. The default value is 1."
        },
        {
            "Parameters": "cost cost",
            "Info": "Specifies the cost of imported routes. If no cost is specified, run the default-cost command to set the default cost.\nThe value is an integer ranging from 0 to 15. The default value is 0."
        },
        {
            "Parameters": "inherit-cost",
            "Info": "Retains the original cost of the imported route.\n-"
        },
        {
            "Parameters": "route-filter route-filter-name",
            "Info": "Specifies the name of a route-filter used to filter imported routes. A device imports only routes matching the policy.\nThe value is a string of 1 to 200 case-sensitive characters, spaces not supported. If parameters are included in the referenced route-filter, specify values for them in the format of (var1, var2, ...var8) behind the route-filter name. A maximum of eight parameters can be specified, and each value ranges from 1 to 200 characters."
        },
        {
            "Parameters": "route-policy route-policy-name",
            "Info": "Specifies the name of a route-policy used to filter imported routes. A device imports only routes matching the policy.\nThe name is a string of 1 to 200 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ripng 1",
            "[*HUAWEI-ripng-1] import-route isis 7 cost 5"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ripng 1",
            "[*HUAWEI-ripng-1] import-route static route-filter abc(10,11,12,13,14,15,16,17)"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen RIPng and other routing protocols are deployed on a network, you can enable the traffic within a RIPng domain to reach a destination outside the RIPng domain using import-route command.\nPrerequisites\nA RIPng process has been created and the RIPng view has been displayed using the ripng command.\nConfiguration Impact\nImporting routes of another routing protocol may lead to routing loops. Therefore, exercise caution when running the command.\nPrecautions\nThe import-route (RIPng) command cannot import default routes."
}