{
    "PageTitle": "suppression alarm-name",
    "FuncDef": "The suppression alarm-name command configures a suppression period for an alarm.\nThe undo suppression alarm-vvname command deletes a suppression period.\nBy default, the suppression period for reporting an alarm is 3s, and the suppression period for clearing an alarm is 10s.",
    "CLIs": [
        "suppression alarm-name <alarm-name> { cause-period <cause-seconds> | clear-period <clear-seconds> }",
        "undo suppression alarm-name <alarm-name> cause-period",
        "undo suppression alarm-name <alarm-name> clear-period"
    ],
    "ParentView": [
        "Alarm management view"
    ],
    "ParaDef": [
        {
            "Parameters": "alarm-name",
            "Info": "Specifies the name of an alarm. This alarm must exist.\nThe value is a string of 1 to 63 characters, spaces not supported."
        },
        {
            "Parameters": "cause-period cause-seconds",
            "Info": "Specifies the period after which an alarm is generated. If an alarm is repeatedly reported during cause-period, the system does not report the alarm until cause-period expires.\nThe value is an integer that ranges from 0 to 600, in seconds."
        },
        {
            "Parameters": "clear-period clear-seconds",
            "Info": "Specifies the period after which an alarm is cleared. If a clear alarm is repeatedly reported during clear-period, the system reports the clear alarm until cause-period expires.\nThe value is an integer that ranges from 0 to 600, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] alarm",
            "[~HUAWEI-alarm] suppression alarm-name linkDown cause-period 5",
            "[*HUAWEI-alarm] suppression alarm-name linkDown clear-period 15"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nYou can configure a suppression period to prevent an alarm from being frequently reported.\nAlarms for each application can be assigned a specific suppression period. Alarm suppression can be disabled for some alarms generated for hardware and devices.\nConfiguration Impact\nIf the suppression period is set too short, you do not give full play to the suppression effect; if the suppression period is set too long, faults cannot be detected in time. For most alarms, the default suppression period is recommended. You can set the suppression period to 0s for alarms that must be immediately reported, such as alarms about hardware and ambient environments."
}