{
    "PageTitle": "alarm-name severity",
    "FuncDef": "The alarm-name severity command changes the severity of a specific alarm.\nThe undo alarm-name severity command restores the default severity.\nBy default, an alarm object or alarm object instance uses the registered severity",
    "CLIs": [
        "alarm-name <alarm-name> severity { critical | major | minor | warning }",
        "undo alarm-name <alarm-name> severity"
    ],
    "ParentView": [
        "Alarm management view"
    ],
    "ParaDef": [
        {
            "Parameters": "alarm-name alarm-name",
            "Info": "Specifies the name of an alarm to be warning.\nThe name is a string of 1 to 63 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "severity",
            "Info": "Specifies the severity of an alarm.\n-"
        },
        {
            "Parameters": "critical",
            "Info": "Specifies the severity of an alarm to be critical.\n-"
        },
        {
            "Parameters": "major",
            "Info": "Specifies the severity of an alarm to be major.\n-"
        },
        {
            "Parameters": "minor",
            "Info": "Specifies the severity of an alarm to be minor.\n-"
        },
        {
            "Parameters": "warning",
            "Info": "Specifies the severity of an alarm to be warning.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] alarm",
            "[~HUAWEI-alarm] alarm-name linkdown severity critical"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nYou can run this command to change the severity of an alarm when the actual service requirement is not met.\nThe descriptions of alarm severities are as follows:\nCritical: A service affecting condition has occurred, and an immediate corrective action is required. For example, a managed node fails and it must be repaired.Major: A service affecting condition has developed, and an urgent corrective action is required. For example, the capabilities of a managed node are seriously weakened, and all capabilities must be restored.Minor: A non-service affecting fault condition exists, and a corrective action should be taken in order to prevent more serious fault (for example, service affecting). For example, the capabilities of a managed node are not weakened at present.Warning: A potential or impending service affecting fault is deleted, before any significant effects have been sensed. Relevant measures must be taken for further fault diagnosis and fault repair to prevent the fault from getting worse.\n\nPrerequisites\nThe alarm has been defined.\nConfiguration Impact\nThe severity of the alarm is changed.\nFollow-up Procedure\nRun the display alarm information command and check whether the changed configuration takes effect. You can run the undo alarm name severity command to restore the default severity.\nPrecautions\nChanging the severity of an alarm does not trigger the generation of new alarms. The NMS host can be configured to synchronize alarms with that on the device."
}