{
    "PageTitle": "port-parent",
    "FuncDef": "This command specifies whether this queue feeds off a port-level scheduler. For the network-queue policy context, only the port-parent command is supported. When a port scheduler exists on the port, network queues without a port-parent association will be treated as an orphan queue on the port scheduler and treated according to the current orphan behavior on the port scheduler. If the port-parent command is defined for a network queue on a port without a port scheduler defined, the network queue will operate as if a parent association does not exist. When a port scheduler policy is associated with the egress port, the port-parent command will come into effect.",
    "CLIs": [
        "port-parent [ weight <weight> ] [ level <level> ] [ cir-weight <cir-weight> ] [ cir-level <cir-level> ]",
        "no port-parent"
    ],
    "ParentView": [
        "config>qos>network-queue>queue"
    ],
    "ParaDef": [
        {
            "Parameters": "weight weight",
            "Info": "Defines the weight the queue or scheduler will use at the above-CIR port priority level (defined by the level parameter). Values-0 to 100. ParamDefault: Default- 1"
        },
        {
            "Parameters": "level level",
            "Info": "Defines the port priority the queue or scheduler will use to receive bandwidth for its above-CIR offered-load. Values-1 to 8 (8 is the highest priority). ParamDefault: Default- 1"
        },
        {
            "Parameters": "cir-weight cir-weight",
            "Info": "Defines the weight the queue or scheduler will use at the within-CIR port priority level (defined by the cir-level parameter). The weight is specified as an integer value from 0 to 100 with 100 being the highest weight. When the cir-weight parameter is set to a value of 0, the queue or scheduler does not receive bandwidth during the port scheduler s within-CIR pass and the cir-level parameter is ignored. If the cir-weight parameter is 1 or greater, the cir-level parameter is used. Values-0 to 100. ParamDefault: Default- 0"
        },
        {
            "Parameters": "cir-level cir-level",
            "Info": "Defines the port priority the queue or scheduler will use to receive bandwidth for its within-CIR offered-load. If the cir-weight parameter is set to a value of 0 (the default value), the queue or scheduler does not receive bandwidth during the port scheduler s within-CIR pass and the cir-level parameter is ignored. If the cir-weight parameter is 1 or greater, the cir-level parameter comes into play. Values-0 to 8 (8 is the highest priority). ParamDefault: Default- 0"
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: no port-parent"
}