{
    "PageTitle": "gvrp registration",
    "FuncDef": "The gvrp registration command sets a GVRP registration mode for an interface.\nThe undo gvrp registration command restores the default GVRP registration mode.\nBy default, the GVRP registration mode of an interface is Normal.",
    "CLIs": [
        "gvrp registration { fixed | forbidden | normal }",
        "undo gvrp registration [ { fixed | forbidden | normal } ]"
    ],
    "ParentView": [
        "Layer 2 40GE interface view",
        "Interface group view",
        "Layer 2 50GE interface view",
        "Port extension Layer 2 interface view",
        "Layer 2 10GE interface view",
        "Layer 2 GE interface view",
        "Layer 2 100GE interface view",
        "Layer 2 50|100GE interface view",
        "Eth-Trunk interface view",
        "25GE-L2 view",
        "400GE-L2 view"
    ],
    "ParaDef": [
        {
            "Parameters": "fixed",
            "Info": "Sets the GVRP registration mode of an interface to Fixed.\n-"
        },
        {
            "Parameters": "forbidden",
            "Info": "Sets the GVRP registration mode of an interface to Forbidden.\n-"
        },
        {
            "Parameters": "normal",
            "Info": "Sets the GVRP registration mode of an interface to Normal.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] gvrp",
            "[*HUAWEI] interface GigabitEthernet3/0/1",
            "[*HUAWEI-GigabitEthernet3/0/1] portswitch",
            "[*HUAWEI-GigabitEthernet3/0/1] port link-type trunk",
            "[*HUAWEI-GigabitEthernet3/0/1] gvrp",
            "[*HUAWEI-GigabitEthernet3/0/1] gvrp registration fixed"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe following three GVRP registration modes are available on GVRP interfaces:\nNormal mode: allows a GVRP interface to register, deregister, and propagate dynamic and static VLANs.Fixed mode: forbids a GVRP interface to register, deregister, or propagate dynamic VLANs, but allows it to register, deregister, and propagate static VLANs. If a trunk interface is set to work in fixed mode, even if packets of all VLANs are allowed to pass, only packets in manually created VLANs actually pass through the trunk interface.Forbidden mode: forbids a GVRP interface to register or deregister all VLANs. If a trunk interface is set to work in forbidden mode, all VLANs are not allowed to pass.\n\nPrerequisites\nGVRP has been enabled globally, and the interface on which a GVRP registration mode is to be set has been configured as a trunk interface."
}