{
    "PageTitle": "garp timer leaveall",
    "FuncDef": "The garp timer leaveall command sets a value for a GARP LeaveAll timer.\nThe undo garp timer leaveall command restores the default value of a GARP LeaveAll timer.\nThe default value of a LeaveAll timer is 1000 centiseconds (10s).",
    "CLIs": [
        "garp timer leaveall <timer-value>",
        "undo garp timer leaveall [ <timer-value> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "timer-value",
            "Info": "Sets a value for a GARP LeaveAll timer.\nThe value is an integral multiple of 5 centiseconds, ranging from 65 to 32765, in centiseconds. The LeaveAll timer value must be larger than any of the Leave timer values."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] gvrp",
            "[*HUAWEI] garp timer leaveall 2000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen a GARP device starts, its LeaveAll timer starts accordingly. When the LeaveAll timer expires, the device sends a LeaveAll message to request other GARP devices to re-register all its attributes and restarts its LeaveAll timer for a new round of polling.\nDevices on a network may have different settings for the LeaveAll timer, but only the LeaveAll timer with the smallest value takes effect. When the LeaveAll timer with the smallest value expires, that device whose LeaveAll timer value is the smallest sends a LeaveAll message to all other devices and restarts its own LeaveAll timer. After receiving the LeaveAll message, the other devices restart all their GARP timers, including the LeaveAll timer, and propagate the LeaveAll messages to the other connected devices except the one who sends them the LeaveAll message. To set a value for a GARP LeaveAll timer, run the garp timer leaveall command.\nPrerequisites\nGVRP has been enabled globally.\nPrecautions\nThe Leave timer value of each interface is restricted by the global LeaveAll timer value. When setting a value for the global LeaveAll timer, ensure that all the interfaces configured with a GARP Leave timer are working properly."
}