{
    "PageTitle": "l2-aware",
    "FuncDef": "This command creates NAT static port forwards for L2 aware subscribers. The ESM subscriber must be present in the system before this command is executed. Thenoform of the command deletes NAT static port forwards for L2 aware subscribers.",
    "CLIs": [
        "l2-aware subscriber <sub-ident-string> ip <ip-address> protocol { tcp | udp } [ port <port> ] [ outside-ip <ip-address> ] [ outside-port port ] [ nat-policy <policy-name> ] [ member <member-id> ] [ port-range-start port ]",
        "no l2-aware subscriber <sub-ident-string> ip <ip-address> protocol { tcp | udp } port <port>"
    ],
    "ParentView": [
        "config>service>nat>fwd"
    ],
    "ParaDef": [
        {
            "Parameters": "subscriber sub-ident-string",
            "Info": "This mandatory parameter specifies the ESM subscriber for which the SPF is to be created; ESM subscriber must be present in the system before the SPF can be created."
        },
        {
            "Parameters": "ip ip-address",
            "Info": "This mandatory parameter specifies the source IPv4/IPv6 address for which SPF will be created."
        },
        {
            "Parameters": "protocol {tcp|udp}",
            "Info": "This mandatory parameter specifies the protocol to use, either TCP or UDP."
        },
        {
            "Parameters": "port port",
            "Info": "This optional parameter specifies a source port. Values-1 to 65535."
        },
        {
            "Parameters": "outside-ip ipv4-address",
            "Info": "This mandatory parameter specifies the outside IPv4 address. If the outside IPv4 address is specified, then all other optional parameters become mandatory."
        },
        {
            "Parameters": "outside-port port",
            "Info": "This optional parameter specifies the outside port."
        },
        {
            "Parameters": "nat-policy policy-name",
            "Info": "If multiple NAT policies are used inside the routing context, then the NAT policy should be specified in the SPF request so the SPF is created in the correct NAT pool. Otherwise, the default NAT policy from the inside routing context will be used."
        },
        {
            "Parameters": "member member-id",
            "Info": "This optional parameter should not be used by the operator. It is used only if the command is replayed via the exec command or at boot-config.The memberId indicates the identifier of the NAT ISA group member associated with this NAT subscriber."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: none"
}