{
    "PageTitle": "lsn",
    "FuncDef": "This command creates NAT static port forwards for LSN44, Ds-Lite and NAT64. Static port forwards (SPF) are static mappings created so that certain applications on the inside (private side) can be reached from host that are on the outside of the NAT. SPF statically map the subscriber (inside IP address in LSN44, CPE IPv6 address/prefix in DS-Lite and IPv6 prefix in NAT64), inside port and protocol to an outside IPv4 address, port and the same protocol.",
    "CLIs": [
        "lsn router <router-instance> [ b4 <ipv6-address> ] [ aftr <ipv6-address> ] ip <ip-address> protocol { tcp | udp } [ port <port> ] [ outside-ip <ipv4-address> ] [ outside-port port ] [ nat-policy <nat-policy-name> ]",
        "no lsn router <router-instance> [ b4 <ipv6-address> ] ip <ip-address> protocol { tcp | udp } port <port> [ nat-policy <nat-policy-name> ]"
    ],
    "ParentView": [
        "config>service>nat>fwd"
    ],
    "ParaDef": [
        {
            "Parameters": "router router-instance",
            "Info": "This mandatory parameter specifies the inside routing instance; router name or service-id. Values-router-name, service-id."
        },
        {
            "Parameters": "b4 ipv6-address",
            "Info": "This optional parameter specifies the IPv6 address of the B4 element in DS-Lite. Values-<ipv6-address>       : ipv6-address   - x:x:x:x:x:x:x:x \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t(eight 16-bit pieces)."
        },
        {
            "Parameters": "aftr ipv6-address",
            "Info": "This optional parameter specifies IPv6 address of the AFTR element in DS-Lite. Values-<ip-address>         : ipv4-address - a.b.c.d."
        },
        {
            "Parameters": "protocol {tcp|udp}",
            "Info": "This mandatory parameter specifies the protocol to use, either TCP or UDP."
        },
        {
            "Parameters": "port port",
            "Info": "This optional parameter specifies a source port. Values-1 to 65535."
        },
        {
            "Parameters": "outside-ip ipv4-address",
            "Info": "This mandatory parameter specifies the outside IPv4 address. If the outside IPv4 address is specified, then all other optional parameters become mandatory."
        },
        {
            "Parameters": "outside-port port",
            "Info": "This optional parameter specifies the outside port."
        },
        {
            "Parameters": "nat-policy policy-name",
            "Info": "If multiple NAT policies are used inside the routing context, then the NAT policy should be specified in the SPF request so the SPF is created in the correct NAT pool. Otherwise, the default NAT policy from the inside routing context will be used."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: none"
}