{
    "PageTitle": "map",
    "FuncDef": "This command is applicable to prefixes in deterministic NAT (LSN44 and DS-Lite). Its purpose is to split the number of subscribers within the configured prefix over available sequence of outside IP addresses.",
    "CLIs": [
        "map start <lsn-sub-address> end <lsn-sub-address> to <outside-ip-address>",
        "no map start <lsn-sub-address> end <lsn-sub-address>"
    ],
    "ParentView": [
        "config>service>vprn>nat>inside>deterministic>prefix",
        "config>router>nat>inside>deterministic>prefix"
    ],
    "ParaDef": [
        {
            "Parameters": "inside-ip-start",
            "Info": "Start IPv4/v6 address or IPv6 prefix on the inside."
        },
        {
            "Parameters": "inside-ip-end",
            "Info": "End IPv4/v6 address or IPv6 prefix on the inside. The number of subscribers (range of inside IPv4 addresses in LSN44 or IPv6 addresses or prefixes in DS-Lite) in the map statement does not have to be a power of 2. Rather it has to be a multiple of a power of two : m * 2^n, where m is the number of consecutive outside IP addresses to which the subscribers are mapped and the 2^n is the subscriber-limit per outside IP."
        },
        {
            "Parameters": "outside-ip-start",
            "Info": "The first outside IPv4 address in the pool to which the subscribers are mapped. In case that the number of subscribers in the map statement is larger than the subscriber-limit for the outside-ip address, the consecutive outside IP addresses will be used for additional mappings. Those additional (consecutive) outside IP addresses are not shown in the map statement (only the first address is shown in the map statement)."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: By default, the system will automatically divide the prefix and create the map statements when the prefix command is enabled (no shutdown). However, this automatic map provisioning can be overruled by manual configuration."
}