{
    "PageTitle": "ldap-server",
    "FuncDef": "The ldap-server command configures the LDAP server.\nThe undo ldap-server command cancels the configured LDAP server.\nBy default, the LDAP server is not configured.",
    "CLIs": [
        "ldap-server { authentication <ldap-dn> <ldap-password> | ip <ldap-ip-address> [ vpn-instance <vpn-instance-name> ] [ source <source-ip-address> ] { [ port <port> ] | [ version <version> ] } * }",
        "undo ldap-server authentication",
        "undo ldap-server"
    ],
    "ParentView": [
        "PKI domain name configuration view"
    ],
    "ParaDef": [
        {
            "Parameters": "ldap-dn",
            "Info": "Specifies the user name of the LDAP server.\nIt is a string of 1 to 31 characters and case sensitive."
        },
        {
            "Parameters": "ldap-password",
            "Info": "Specifies the password of the LDAP server.\nThe value is a string of case-sensitive characters that can be letters or digits. The password can be a string of 1 to 31 characters in plain text or a string of 20 to 432 characters in encrypted text."
        },
        {
            "Parameters": "ip ldap-ip-address",
            "Info": "Specifies the IP address of the LDAP server.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies the VPN instance to which the CA LDAP server belongs.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "source source-ip-address",
            "Info": "Specifies the source address that is used to download the CA certificate, local certificate, or CRL.\nThe value is in the IPv4 address format, and in dotted decimal notation."
        },
        {
            "Parameters": "port port",
            "Info": "Specifies the port number of the LDAP server.\nIt is an integer ranging from 1 to 65535. The default value is 389."
        },
        {
            "Parameters": "version version",
            "Info": "Specifies the version number of LDAP.\nThe value is 2 or 3. The default value is 3."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] pki domain domain1",
            "[*HUAWEI-pki-domain-domain1] crl ldap",
            "[*HUAWEI-pki-domain-domain1] ldap-server ip 10.1.1.1 port 3389 version 2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo use LDAP for updating the CRL automatically, run the ldap-server command.\nYou should first run the crl ldap command to configure the automatic update of the CRL through LDAP, and then run the ldap-server command."
}