{
    "PageTitle": "cmp request rsa local-key-pair",
    "FuncDef": "The cmp request rsa local-key-pair command configures an RSA key pair to be used by a device to request a certificate through CMPv2.\nThe undo cmp request rsa local-key-pair command cancels the configuration.\nBy default, no RSA key pair is configured to be used by a device to request a certificate through CMPv2.",
    "CLIs": [
        "cmp request rsa local-key-pair <key-name> [ regenerate [ <key-bit> ] ]",
        "undo cmp request rsa local-key-pair"
    ],
    "ParentView": [
        "VS PKI CMP session view",
        "PKI CMP session view"
    ],
    "ParaDef": [
        {
            "Parameters": "key-name",
            "Info": "Specifies the name of an RSA key pair.\nThe value is a case-insensitive string of 1 to 31 characters."
        },
        {
            "Parameters": "regenerate",
            "Info": "Indicates that RSA key pairs are updated during a certificate update.\n-"
        },
        {
            "Parameters": "key-bit",
            "Info": "Specifies the number of bits in an RSA key pair generated during a certificate update.\nThe value is an integer ranging from 2048 to 4096. The default value is 2048."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] pki domain domain1",
            "[*HUAWEI-pki-domain-domain1] pki cmp session session1",
            "[*HUAWEI-pki-domain-domain1-pki-cmp-session-session1] cmp request rsa local-key-pair key1 regenerate"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo apply for a certificate through CMPv2, you need to run the cmp request rsa local-key-pair command in the CMP session view.\nConfiguration Impact\nNote the following points when you use the cmp request rsa local-key-pair command:\nIf you do not specify regenerate in the command, the system uses the original RSA key pairs during automatic certificate updates.If you specify regenerate in the command, the system generates new RSA key pairs during certificate updates to request certificates and overwrites the original certificates and RSA key pairs with the new ones.\nThe system stores the new RSA key pairs generated during certificate updates in a temporary cache. After the system obtains the new certificates, the system replaces the original RSA key pairs with the new ones.\n\nPrecautions\nOne RSA key pair can be referenced by only one CMP session or PKI domain."
}