{
    "PageTitle": "pki ldap ip port version dn",
    "FuncDef": "The pki ldap command configures the downloading of the CA certificate, local certificate, or CRL through LDAP.",
    "CLIs": [
        "pki ldap ip <ldap-ip-address> [ vpn-instance <vpn-instance-name> ] [ source <source-ip-address> ] port <port> version <version> [ attribute <attr-value> ] [ authentication <ldap-dn> <ldap-password> ] <save-name> dn <dn-value>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies the VPN instance to which the CA LDAP server belongs.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "source source-ip-address",
            "Info": "Specifies the local address that is used to download the CA certificate, local certificate, or CRL.\nThe value is in the IPv4 address format, and in dotted decimal notation."
        },
        {
            "Parameters": "port port",
            "Info": "Specifies the port of the LDAP server.\nIt is an integer ranging from 1 to 65535. The default value is 389."
        },
        {
            "Parameters": "version version",
            "Info": "Specifies the version number of LDAP.\nThe value is 2 or 3. The default value is 3."
        },
        {
            "Parameters": "attribute attr-value",
            "Info": "Specifies the attribute value that the device uses when obtaining the certificate from the LDAP server.\nIt is a string of 1 to 63 characters and case sensitive."
        },
        {
            "Parameters": "ldap-dn",
            "Info": "Specifies the user name of the LDAP server.\nIt is a string of 1 to 31 characters and case sensitive."
        },
        {
            "Parameters": "ldap-password",
            "Info": "Specifies the password of the LDAP server.\nIt is a string of 1 to 31 characters and case sensitive."
        },
        {
            "Parameters": "save-name",
            "Info": "Specifies the name of the CA certificate, local certificate, or CRL that is saved to the CF card.\nIt is a string of 5 to 63 characters and case insensitive."
        },
        {
            "Parameters": "dn dn-value",
            "Info": "Specifies the DN that the device uses when obtaining the CRL from the LDAP server.\nIt is a string of 1 to 255 characters in text format and spaces are valid and case sensitive."
        },
        {
            "Parameters": "ip ldap-ip-address",
            "Info": "Specifies the IP address of the LDAP server.\nThe value is in the IPv4 address format, and in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] pki ldap ip 10.1.1.1 port 3389 version 2 local.cer dn admin"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nNote the following when the device downloads the CA certificate, local certificate, or CRL through LDAP:\nThe CA certificate or local certificate cannot exceed 2 MB, the CRL file cannot exceed 1 MB.There is sufficient space in the CF card for the CA certificate, local certificate, or CRL file."
}