{
    "PageTitle": "pki whitelist enable",
    "FuncDef": "The pki whitelist enable command enables global PKI whitelist check.\nThe undo pki whitelist enable command disables global PKI whitelist check.\nBy default, global PKI whitelist check is disabled.",
    "CLIs": [
        "pki whitelist enable",
        "undo pki whitelist enable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] pki whitelist enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn LTE scenarios, a security gateway and base stations use certificates to negotiate IPsec tunnels. The PKI whitelist on the security gateway can be used to uniformly manage certificates of base stations. If PKI whitelist check is enabled on the security gateway using the pki whitelist enable command, the common names in the certificate subjects of base stations must be imported to the security gateway's PKI whitelist for certificate verification of the base stations.\nConfiguration Impact\nAfter PKI whitelist check is enabled for an IKE peer using the pki whitelist enable command and the IKE peer receives certificate authentication packets from a remote device, the IKE peer checks whether the common names in the remote certificate subjects match the PKI whitelist. If not, the authentication fails.\nAfter PKI whitelist check is disabled from an IKE peer using the pki whitelist disable command and the IKE peer receives certificate authentication packets from a remote device, the IKE peer does not check whether the common names in the remote certificate subjects match the PKI whitelist.\nPrecautions\nThe common names are case-sensitive.\nThe changes in the PKI whitelist check status of an IKE peer do not affect IPsec tunnels that have been established.\nIf the pki whitelist enable or pki whitelist disable command has been run in the IKE peer view, the configuration in the IKE peer view takes effect, regardless of whether global PKI whitelist check is enabled."
}