{
    "PageTitle": "rule (PKI access configuration view)",
    "FuncDef": "The rule command configures the control rule for certificate attributes.\nThe undo rule command deletes the control rule for certificate attributes.\nBy default, no control rule is configured for certificate attributes.",
    "CLIs": [
        "rule <id> { deny | permit } <group-name>",
        "undo rule <id>",
        "undo rule all"
    ],
    "ParentView": [
        "PKI access configuration view"
    ],
    "ParaDef": [
        {
            "Parameters": "id",
            "Info": "Indicates the number of the access control policy of certificate attributes.\nIt is an integer ranging from 1 to 256."
        },
        {
            "Parameters": "deny",
            "Info": "Indicates that when the certificate matches the configured attributes in the attribute group, the certificate is invalid and cannot pass the check of the access control policy.\n-"
        },
        {
            "Parameters": "permit",
            "Info": "Indicates that when the certificate matches the configured attributes in the attribute group, the certificate is valid and passes the check of the access control policy.\n-"
        },
        {
            "Parameters": "group-name",
            "Info": "Indicates the name of the existing certificate attribute group.\nIt is a string of 1 to 31 case sensitive characters."
        },
        {
            "Parameters": "all",
            "Info": "Indicates all access control rules for certificate attributes.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] pki certificate attribute-group group1",
            "[*HUAWEI-pki-attribute-group1] quit",
            "[*HUAWEI] pki certificate access-control-policy policy1",
            "[*HUAWEI-pki-access-policy1] rule 1 permit group1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo verify the contents of the certificate, you can configure an attribute rule of the certificate, and reference this rule in the certificate attribute control rule, ensuring that the certificate meeting specific conditions passes the verification.\nIf multiple control rules are configured in a certificate attribute access control policy, the relationship among the rules is \"or\". That is, related action defined in the access control rule is implemented immediately after the certificate to be authenticated match one rule, and other rules are not matched."
}