{
    "PageTitle": "pki import whitelist",
    "FuncDef": "The pki import whitelist command imports the PKI whitelist in a specified XML file to a device.\nThe undo pki import whitelist command deletes the PKI whitelist in a specified XML file from a device.\nThe undo pki import whitelist all command deletes all PKI whitelists.\nBy default, the PKI whitelist in an XML file is not imported to a device.",
    "CLIs": [
        "pki import whitelist file-name <filename>",
        "undo pki import whitelist file-name <filename>",
        "undo pki import whitelist all"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "file-name filename",
            "Info": "Specifies the name of an XML file.You can import a whitelist to the root directory or level-1 directory. For example:\npki import whitelist filename aaa.xml.\npki import whitelist filename bbb/aaa.xml.\nThe value is a string of 1 to 127 characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] pki import whitelist file-name test.xml"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] undo pki import whitelist all"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn LTE scenarios, a security gateway and base stations use certificates to negotiate IPsec tunnels. The PKI whitelist on the security gateway can be used to uniformly manage certificates of base stations. If PKI whitelist check is enabled on the security gateway, the common names in the certificate subjects of base stations must be imported to the security gateway's PKI whitelist for certificate verification of the base stations. To import the PKI whitelist in a specified XML file to a device, run the pki import whitelist command.\nPrecautions\nBefore importing the PKI whitelist in a specified XML file to a device, ensure that the XML file has been saved on the main control board's CF card.\nThe XML file is 7-bit ASCII-encoded in the following format:\nCN-on-Certificate_of-RBS-1\nCN-on-Certificate_of-RBS-2\nDeleting XML files that have been imported to a device is not allowed. If you forcibly delete such an XML file, the PKI whitelists imported through this XML file cannot be deleted.\nDifferent XML files can contain the same PKI whitelists. A PKI whitelist is deleted only after all XML files containing this PKI whitelist are deleted."
}