{
    "PageTitle": "display multicast-domain invalid-packet",
    "FuncDef": "The display multicast-domain invalid-packet command displays the statistics about the received invalid MDT switch messages and details about these messages.",
    "CLIs": [
        "display multicast-domain vpn-instance <vpn-instance-name> invalid-packet",
        "display multicast-domain all-instance invalid-packet",
        "display multicast-domain invalid-packet [ <packet-number> ] verbose"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "all-instance",
            "Info": "Displays the statistics about the received invalid MDT switch messages in all VPN instances.\n-"
        },
        {
            "Parameters": "packet-number",
            "Info": "Displays details about a specified number of recently received invalid MDT switch messages.\nThe value is an integer ranging from 1 to 100. By default, details about all the invalid MDT switch messages currently stored are displayed."
        },
        {
            "Parameters": "verbose",
            "Info": "Displays details about invalid MDT switch messages.\n-"
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Displays the statistics about the received invalid MDT switch messages in a specified VPN instance. vpn-instance-name specifies the VPN instance name.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display multicast-domain vpn-instance vpn1 invalid-packet",
            "             Statistics of invalid packets for vpn1:            ",
            "--------------------------------------------------------------------            ",
            "MDT Switch invalid packet:",
            "Fault Length            : 0           Invalid Message Type    : 0",
            "Invalid Multicast Source: 0           Invalid Multicast Group : 0",
            "Invalid Switch Group    : 0                 ",
            "--------------------------------------------------------------------"
        ],
        [
            "<HUAWEI> display multicast-domain invalid-packet 1 verbose",
            "       Detailed information of invalid packets                                      ",
            "-----------------------------------------------------                           ",
            "Packet information (Index 1):                                                    ",
            "-----------------------------------------------------                           ",
            "Neighbor            :  1.1.1.1",
            "Time                :  2011-8-9 10:50:08 UTC-08:00",
            "Message Length      :  16",
            "Invalid Type        :  Invalid Switch Group",
            "0000: 01 00 10 00 64 64 64 64 e8 00 00 00 0a 00 00 00                                       ",
            "-----------------------------------------------------"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nYou can run the display multicast-domain invalid-packet command to view the statistics about the received invalid MDT switch messages and details about these messages for fault location and rectification.\nIf a shortest path tree (SPT) fails to be set up in a VPN instance on a multicast network, you can run the display multicast-domain invalid-packet command to check whether devices have received invalid MDT switch messages. If the command output contains statistics about invalid MDT switch messages, run the display multicast-domain invalid-packet verbose command to view details about these messages to locate the fault.\nYou can run the following related commands to view statistics about the received invalid MDT switch messages in a specified VPN instance and details about these messages:\nRun the display multicast-domain vpn-instance invalid-packet command to view statistics about the received invalid MDT switch messages in a specified VPN instance.Run the display multicast-domain invalid-packet verbose command to view details about recently received invalid MDT switch messages."
}