{
    "PageTitle": "display multicast-domain vpn-instance switch-group send",
    "FuncDef": "The display multicast-domain vpn-instance switch-group send command displays the Switch-Group information sent by a specified VPN instance in a multicast domain (MD).",
    "CLIs": [
        "display multicast-domain vpn-instance <vpn-instance-name> switch-group send [ group <groupAddr> | reuse <interval> | <vpnSrcAddr> [ mask { <srcMaskLen> | <srcMask> } ] | <vpnGrpAddr> [ mask { <grpMaskLen> | <grpMask> } ] ] *"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "group groupAddr",
            "Info": "Displays information about the Switch-Group related to a multicast group G. groupAddr specifies the address of the multicast group.\nThe value ranges from 224.0.1.0 to 239.255.255.255, in dotted decimal notation."
        },
        {
            "Parameters": "reuse interval",
            "Info": "Displays information about the Switch-Group reused in an MD in a specified period.\nThe value is an integer ranging from 1 to 2147483647, in seconds."
        },
        {
            "Parameters": "vpnSrcAddr",
            "Info": "Displays information about the Switch-Group related to a specified VPN multicast source.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "mask",
            "Info": "Indicates the mask of the VPN multicast group or source address.\n-"
        },
        {
            "Parameters": "srcMaskLen",
            "Info": "Specifies the mask length of the VPN multicast source address.\nThe value is an integer ranging from 0 to 32."
        },
        {
            "Parameters": "srcMask",
            "Info": "Specifies the mask of the VPN multicast source address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "vpnGrpAddr",
            "Info": "Displays information about the Switch-Group related to a specified VPN multicast group.\nThe value ranges from 224.0.1.0 to 239.255.255.255, in dotted decimal notation."
        },
        {
            "Parameters": "grpMaskLen",
            "Info": "Specifies the mask length of the VPN multicast group address.\nThe value is an integer ranging from 4 to 32."
        },
        {
            "Parameters": "grpMask",
            "Info": "Specifies the mask of the VPN multicast group address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies a VPN instance. vpn-instance-name specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display multicast-domain vpn-instance VPN1 switch-group send",
            "MD switch-group information sent by VPN-Instance: VPN1",
            "  226.1.1.0 reference_count: 3",
            "    (192.168.1.5, 239.1.1.1)                switch time: 00:00:21",
            "    (192.168.1.5, 239.1.1.158)              switch time: 00:00:21",
            "    (192.168.1.5, 239.1.2.50)               switch time: 00:00:05",
            "  226.1.1.1 reference_count: 3",
            "    (192.168.1.2, 225.1.1.1)                switch time: 00:00:21",
            "    (192.168.1.2, 225.1.2.50)               switch time: 00:00:05",
            "    (192.168.1.5, 239.1.1.159)              switch time: 00:00:21"
        ],
        [
            "<HUAWEI> display multicast-domain vpn-instance VPN1 switch-group send reuse 30",
            "MD switch-group information sent by VPN-Instance: VPN1",
            "  226.1.1.0 reuse_count: 1",
            "  226.1.1.1 reuse_count: 1",
            "  226.1.1.2 reuse_count: 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe display multicast-domain vpn-instance switch-group send command is used to display the Switch-Group information sent by the local router.\nEach VPN instance corresponds to one MD. If a VPN instance is specified by vpn-instance-name, an MD is specified accordingly. Therefore, the command can be used to display the information about the Switch-Group of a specified MD.The Switch-Group information is displayed in an ascending order of VPN (S, G) entries.If reuseIntv is specified, only the information about the Switch-Group that is reused in a specified interval is displayed in an ascending order of the Switch-Group address."
}