{
    "PageTitle": "display multicast-domain vpn-instance share-group",
    "FuncDef": "The display multicast-domain vpn-instance share-group command displays information about the Share-Group of a specified VPN instance in a multicast domain (MD).",
    "CLIs": [
        "display multicast-domain vpn-instance <vpn-instance-name> share-group [ local | remote ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance-name",
            "Info": "Specifies the name of a VPN instance. vpn-instance-name specifies the VPN instance name.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "local",
            "Info": "Indicates the locally configured Share-Group address.\n-"
        },
        {
            "Parameters": "remote",
            "Info": "Indicates the Share-Group address learned through BGP Update packets.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display multicast-domain vpn-instance BLUE share-group",
            "MD local share-group information for VPN-Instance: BLUE",
            "  Share-group: 232.2.2.0",
            "  MTunnel address: 3.3.3.3",
            "MD remote share-group information for VPN-Instance: BLUE",
            "  Share-group     Peer-address",
            "  232.2.2.0       1.1.1.1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe display multicast-domain vpn-instance share-group command displays information about the Share-Group of the remote peer, and peer IP address, which facilitates you to determine whether the multicast tunnel is correctly established to forward multicast services.\nWhen the display multicast-domain vpn-instance share-group command is used, the following situations occur:\nIf local is specified, only the information about the locally configured Share-Group is displayed.If remote is specified, the Share-Group information learned through the BGP Update packets is displayed.If local and remote are not specified, the information about all Share-Groups is displayed."
}