{
    "PageTitle": "multicast-domain source-interface",
    "FuncDef": "The multicast-domain source-interface command configures the IP address of a specified interface as the default IP address of a multicast tunnel interface (MTI).\nThe undo multicast-domain source-interface command restores the default setting.\nBy default, no IP address of a specified interface is configured as the default IP address of an MTI.",
    "CLIs": [
        "multicast-domain source-interface { <interface-type> <interface-number> | <srcif-name> }",
        "undo multicast-domain source-interface"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "interface-type",
            "Info": "Specifies the type of an interface.\n-"
        },
        {
            "Parameters": "interface-number",
            "Info": "Specifies the number of an interface.\n-"
        },
        {
            "Parameters": "srcif-name",
            "Info": "Specifies the name of an interface.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] interface LoopBack1",
            "[*HUAWEI-LoopBack1] quit",
            "[*HUAWEI] multicast-domain source-interface loopback 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo enable automatic configuration of an MTI IP address, run the multicast-domain source-interface command.\nPrerequisites\nMulticast routing has been enabled.\nPrecautions\nIf the multicast-domain source-interface command is run in the system view, the setting takes effect globally. The command run in the VPN instance view or VPN IPv4 address family view takes precedence over that run in the system view.\nA manually configured IP address on an MTI takes precedence over that configured using the multicast-domain source-interface command. If an IP address is manually configured on an MTI, the address configured using this command does not take effect.\nThe multicast-domain source-interface command is mutually exclusive with the mvpn command."
}