{
    "PageTitle": "multicast-vpn slot",
    "FuncDef": "The multicast-vpn slot command specifies an interface board for integrated multicast VPN service processing.\nThe undo multicast-vpn slot command cancels the configuration.\nBy default, no centralized multicast VPN service board is configured.",
    "CLIs": [
        "multicast-vpn slot <slot-id>",
        "undo multicast-vpn slot <slot-id>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "slot-id",
            "Info": "Specifies the slot of the interface board in position for integrated multicast VPN service processing.\nThe value is a string of 1 to 15 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast-vpn slot 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA device supports two multicast VPN service processing modes: distributed and integrated.\nDistributed mode: Interface boards support the complete multicast VPN function and therefore can independently implement multicast packet processing among VPNs.Integrated mode: For the interface boards that do not support the multicast VPN function, they only send packets to a service board for integrated multicast VPN service processing.\nFor the integrated mode, you must run the multicast-vpn slot command to specify an interface board.\nExcept for the scenarios where the integrated mode must be used because trunk interfaces do not support the distributed mode, the distributed mode is recommended in other scenarios.\n\nPrerequisites\nBoards that support multicast VPN have been installed correctly.\nOn trunk interfaces, a board supports centralized multicast VPN but does not support distributed multicast VPN.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nIn the case of a trunk interface, the board supports only centralized forwarding of multicast VPN services and does not support distributed forwarding of multicast services."
}