{
    "PageTitle": "reset multicast-domain control-message counters",
    "FuncDef": "The reset multicast-domain control-message counters command clears statistics about the sent and received MDT switch messages in a specified VPN instance or all VPN instances.",
    "CLIs": [
        "reset multicast-domain vpn-instance <vpn-instance-name> control-message counters",
        "reset multicast-domain all-instance control-message counters"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "all-instance",
            "Info": "Clears statistics about the sent and received MDT switch messages in all VPN instances.\n-"
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Clears statistics about the sent and received MDT switch messages in a specified VPN instance. vpn-instance-name specifies the VPN instance name.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset multicast-domain vpn-instance red control-message counters"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nSome multicast VPN faults are caused by incorrect MDT switch message transmission. If the device already records a large number of statistics about MDT switch messages, you can run the reset multicast-domain control-message counters command to clear statistics about the sent and received MDT switch messages in a specified VPN instance or all VPN instances. And then run the display multicast-domain control-message counters command to check whether the count of MDT switch messages increases to locate a fault.\nPrecautions\nAll statistics about MDT switch messages will be deleted if you run the reset multicast-domain control-message counters command. Exercise caution when running the command."
}