{
    "PageTitle": "agg-rate-limit",
    "FuncDef": "This command define a subscriber aggregate limit when the subscriber profile is directly associated with an egress port based scheduler instead of a scheduler policy. The optional queue-frame-based-accounting keyword allows the subscriber queues to operate in the frame based accounting mode.",
    "CLIs": [
        "agg-rate-limit { max | <kilobits-per-second> } [ queue-frame-based-accounting ]",
        "no agg-rate-limit"
    ],
    "ParentView": [
        "config>subscr-mgmt>sub-prof>egress"
    ],
    "ParaDef": [
        {
            "Parameters": "{max | kilobits-per-second}",
            "Info": "Specifies the egress aggregate rate limit. The max keyword and kilobits-per-second parameter are mutually exclusive. Either max or a value for kilobits-per-second must follow the egress-agg-rate-limit command."
        },
        {
            "Parameters": "max",
            "Info": "Specifies that the egress aggregate rate limit for the subscriber is unlimited. Scheduling for the subscriber queues will only be governed by the individual queue parameters and any congestion on the port relative to each queues scheduling priority."
        },
        {
            "Parameters": "kilobits-per-second",
            "Info": "Specifies an actual egress aggregate rate to which all queues associated with the sub-profile is limited. The limit is managed per subscriber associated with the sub-profile. The value must be defined as an integer and is representative of increments of 1000 bits per second. Values-1 to 800000000, max. ParamDefault: Default- max"
        },
        {
            "Parameters": "queue-frame-based-accounting",
            "Info": "Enables frame based accounting on all queues associated with the subscriber profile. If frame based accounting is required when a subscriber aggregate limit is not necessary, the max keyword should precede the queue-frame-based-accounting keyword. If frame based accounting must be disabled, execute the egress-agg-rate-limit command without the queue-frame-based-accounting keyword present. ParamDefault: Default- Frame based accounting is disabled by default."
        },
        {
            "Parameters": "queue-frame-based-accounting",
            "Info": "Specifies whether to use frame-based accounting when evaluating the aggregation rate limit for the egress queues for this SAP."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}