{
    "PageTitle": "authentication-key",
    "FuncDef": "This command configures the authentication key used between this node and the multi-chassis peer. The authentication key can be any combination of letters or numbers.",
    "CLIs": [
        "authentication-key [ authentication-key | <hash-key> ] [ hash | hash2 ]",
        "no authentication-key"
    ],
    "ParentView": [
        "config>redundancy>multi-chassis>peer"
    ],
    "ParaDef": [
        {
            "Parameters": "authentication-key",
            "Info": "Specifies the authentication key. Allowed values are any string up to 20 characters long composed of printable, 7-bit ASCII characters. If the string contains special characters (#, $, spaces, and so on), the entire string must be enclosed within double quotes."
        },
        {
            "Parameters": "hash-key",
            "Info": "Specifies the hash key. The key can be any combination of ASCII characters up to 33 (hash1-key) or 55 (hash2-key) characters (encrypted). If spaces are used in the string, enclose the entire string in quotation marks (\" \")."
        },
        {
            "Parameters": "hash",
            "Info": "Specifies that the key is entered in an encrypted form. If the hash or hash2 parameter is not used, the key is assumed to be in an unencrypted, clear text form. For security, all keys are stored in encrypted form in the configuration file with the hash or hash2 parameter specified."
        },
        {
            "Parameters": "hash2",
            "Info": "Specifies that the key is entered in a more complex encrypted form that involves more variables than the key value alone, meaning that the hash2 encrypted variable cannot be copied and pasted. If the hash or hash2 parameter is not used, the key is assumed to be in an unencrypted, clear text form. For security, all keys are stored in encrypted form in the configuration file with the hash or hash2 parameter specified."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}