{
    "PageTitle": "client-application",
    "FuncDef": "This command defines the client application that uses the local address server to perform address assignment. This feature is relies on RADIUS or local-user-database to return a pool name. The pool name is matched again the pools defined in the local-dhcp6-server configuration. The name of the local-dhcp6-server must also be provisioned.",
    "CLIs": [
        "client-application [ ppp-slaac ] [ ipoe-wan ] [ ipoe-slaac ]",
        "no client-application"
    ],
    "ParentView": [
        "config>service>vprn>sub-if>grp-if>lcl-addr-assign>ipv6",
        "config>service>vprn>sub-if>grp-if>lcl-addr-assign>ipv6"
    ],
    "ParaDef": [
        {
            "Parameters": "ppp-slaac",
            "Info": "Indicates using the local DHCPv6 prefix pool to assign SLAAC prefixes for hosts. The pool name where the prefixes are used for SLAAC prefix assignment are obtained from RADIUS or local-user-database during the authentication process. The RADIUS attribute Alc-slaac-ipv6-pool is used to indicate the SLAAC pool name for PPPoE hosts."
        },
        {
            "Parameters": "ipoe-wan",
            "Info": "Indicates using the local DHCPv6 pool for IA_NA address assignment and a static pre-defined prefixes for IA_PD. Both the IA_NA pool name and the IA_PD static framed-prefix are either obtained from RADIUS or LUDB during authentication. With RADIUS, it must return both IA_NA Framed-IPv6-Pool and IA_PD Delegated-IPv6-Prefix after a successful authentication. With LUDB, it must have ipv6-wan-address-pool and ipv6-delegated-prefix populated. This feature is specific to this use case and is not required for other combinations of DHCPv6 assignments such as IA_NA and IA_PD address assignment through RADIUS or LUDB."
        },
        {
            "Parameters": "ipoe-slaac",
            "Info": "Indicates using the local DHCPv6 prefix pool to assign SLAAC prefixes for hosts. The pool name where the prefixes are used for SLAAC prefix assignment are obtained from RADIUS or local-user-database during the authentication process. The RADIUS attribute Alc-slaac-ipv6-pool is used to indicate the SLAAC pool name for PPPoE hosts."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}