{
    "PageTitle": "encapsulation",
    "FuncDef": "This command is a SAP level command that either statically sets or enable dynamic detection of the encapsulation.",
    "CLIs": [
        "encapsulation [ aal5auto | aal5nlpid-ppp | aal5mux-ppp | aal5snap-bridged | aal5mux-bridged-eth-nofcs ]",
        "no encapsulation"
    ],
    "ParentView": [
        "config>service>ies>sub-if>grp-if>sap>atm",
        "config>service>vprn>sub-if>grp-if>sap>atm",
        "config>service>vpls>sap>atm"
    ],
    "ParaDef": [
        {
            "Parameters": "aal5auto",
            "Info": "This option is available only in max16k-vc mode on dynamic or static SAPs. Enables automatic detection of one of the four supported encapsulation types."
        },
        {
            "Parameters": "aal5mux-bridged-eth-nofcs",
            "Info": "This option already exist outside of the ESM context on regular interfaces. Within the ESM context (group-interfaces and capture SAPs), this option is available only in max16K-vc mode. The encapsulation is statically set to VC-MUX bridged Ethernet with no FCS. This is a valid encapsulation only for PPPoEoA."
        },
        {
            "Parameters": "aal5mux-ppp",
            "Info": "This option is available only in max16k-vc mode on dynamic or static SAPs. The encapsulation is statically set VC-MUX PPP encapsulation. This is a valid encapsulation only for PPPoA."
        },
        {
            "Parameters": "aal5nlpid-ppp",
            "Info": "dynamic or static SAPs. The encapsulation is statically set to NLPID (LLC) PPP encapsulation. This is a valid encapsulation only for PPPoA."
        },
        {
            "Parameters": "aal5snap-bridged",
            "Info": "This option already exist outside of the ESM context on regular interfaces. Within the ESM context (group-interfaces and capture SAPs), this option is available only in max16k-vc mode. The encapsulation is statically set to bridged Ethernet with or without FCS. Both PIDs (0x 00-01 and 0x 00-07) are accepted on ingress and use this to determine whether to strip four bytes from the end of the encapsulated Ethernet frame. The inner FCS is not checked. This is a valid encapsulation only for PPPoEoA."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}