{
    "PageTitle": "host-connectivity-verify",
    "FuncDef": "This command enables subscriber host connectivity verification on a given SAP within a service. This tool periodically scans all known hosts (from dhcp-state) and perform UC ARP requests. The subscriber host connectivity verification maintains state (connected versus. not-connected) for all hosts.",
    "CLIs": [
        "host-connectivity-verify [ interval <interval> ] [ action { remove | alarm } ] [ timeout <retry-timeout> ] [ retry-count <count> ] [ family <family> ]"
    ],
    "ParentView": [
        "config>service>ies>sub-if>grp-if",
        "config>service>vprn>sub-if>grp-if"
    ],
    "ParaDef": [
        {
            "Parameters": "interval",
            "Info": "Specifies the interval, in minutes, which specifies the time interval which all known sources should be verified. The actual rate is then dependent on the number of known hosts and interval. Values-1 to 6000."
        },
        {
            "Parameters": "action {remove | alarm}",
            "Info": "Defines the action taken on a subscriber host connectivity verification failure for a given host. The remove keyword raises an alarm and removes dhcp-state and releases all allocated resources (queues, table entries and so on). DHCP-RELEASE is signaled to corresponding DHCP server. Static hosts is never removed. The alarm keyword raises an alarm indicating that the host is disconnected."
        },
        {
            "Parameters": "retry-timeout",
            "Info": "Specifies the retry timeout. Values-10 to 60 seconds."
        },
        {
            "Parameters": "count",
            "Info": "Specifies the number of retry requests. Values-2 to 29."
        },
        {
            "Parameters": "family",
            "Info": "Allows the host connectivity checks to be performed for IPv4 endpoint, IPv6 endpoint or both. With family IPv6 configured, host connectivity checks is performed on the global unicast address (assigned via SLAAC or DHCPv6 IA_NA) and link-local address of a Layer 3 RG or bridged hosts. In case of SLAAC assignment, host connectivity can only be performed if the /128 is known (via downstream ND). DHCPv6 PD assigned prefixes is removed if link-local address is determined to be unreachable via host connectivity check\" Reachability checks for GUA and link-local address is done simultaneously. Values-ipv4, ipv6, both."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}