{
    "PageTitle": "host",
    "FuncDef": "This command creates a static subscriber host for the SAP. Static subscriber hosts may be used by the system for various purposes. Applications within the system that make use of static host entries include anti-spoof, ARP reply agent and source MAC population into the VPLS forwarding database.",
    "CLIs": [
        "host { ip <ip-address> [ mac <mac-address> ] } [ subscriber-sap-id | subscriber <sub-ident-string> ] [ sub-profile <sub-profile-name> ] [ sla-profile <sla-profile-name> ] [ ancp-string <ancp-string> ] [ app-profile <app-profile-name> ] [ inter-dest-id <intermediate-destination-id> ]",
        "no host { [ ip <ip-address> ] [ mac <ieee-address> ] }",
        "no host all"
    ],
    "ParentView": [
        "config>service>vpls>sap",
        "config>service>ies>sub-if>grp-if>sap",
        "config>service>ies>if>sap",
        "config>service>vprn>sub-if>grp-if>sap"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address",
            "Info": "Specifies an association with a subscriber with the static subscriber host. Only one static host can be configured on the SAP with a given IP address."
        },
        {
            "Parameters": "mac-address",
            "Info": "Specifies the MAC address to define a static host. The MAC address must be specified for anti-spoof mac, anti-spoof ip-mac and arp-reply-agent (the arp-reply-agent is supported by the 7450 ESS only). Multiple static hosts may be configured with the same MAC address given that each definition is distinguished by a unique IP address."
        },
        {
            "Parameters": "sub-ident-string",
            "Info": "Specifies an existing subscriber identification profile to be associated with the static subscriber host. The subscriber identification profile is configured in the config>subscr-mgmt>sub-ident-pol context. The subscriber information is used by the VPLS SAP arp-reply-agent to determine the proper handling of received ARP requests from subscribers."
        },
        {
            "Parameters": "sub-profile sub-profile-name",
            "Info": "Specifies an existing subscriber profile name to be associated with the static subscriber host. The subscriber profile is configured in the config>subscr-mgmt>sub-profile context."
        },
        {
            "Parameters": "sla-profile sla-profile-name",
            "Info": "Specifies an existing SLA profile name to be associated with the static subscriber host. The SLA profile is configured in the config>subscr-mgmt>sla-profile context."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}