{
    "PageTitle": "host",
    "FuncDef": "This command creates a static subscriber host for the SAP. Static subscriber hosts may be used by the system for various purposes. Applications within the system that make use of static host entries include anti-spoof filters and ARP cache population.",
    "CLIs": [
        "host ip <ip-address> [ mac <ieee-address> ] [ subscriber <sub-ident-string> ] [ sub-profile <sub-profile-name> ] [ sla-profile <sla-profile-name> ]",
        "no host { [ ip <ip-address> ] [ mac <ieee-address> ] }",
        "no host all"
    ],
    "ParentView": [
        "config>service>ies>sub-if>grp-if>sap",
        "config>service>ies>if>sap",
        "config>service>ies>sub-if>grp-if>sap",
        "config>service>vprn>sub-if>grp-if>sap"
    ],
    "ParaDef": [
        {
            "Parameters": "anti-spoof",
            "Info": "When enabled, this feature uses static and dynamic host information to populate entries into an anti-spoof filter table. The anti-spoof filter entries generated the same type as specified in the anti-spoof type parameter. If the SAP anti-spoof filter is defined as ip, each static host definition must specify an IP address. If the SAP anti-spoof filter is defined as ip-mac, each static host definition must specify both an IP address and MAC address. If definition of a static host is attempted without the appropriate addresses specified for the enabled anti-spoof filter, the static host definition fails."
        },
        {
            "Parameters": "arp-populate",
            "Info": "When enabled, this feature uses static and dynamic host information to populate entries in the system ARP cache."
        },
        {
            "Parameters": "ip-address",
            "Info": "Specifies this optional parameter when defining a static host. The IP address must be specified for anti-spoof ip, anti-spoof ip-mac and arp-populate. Only one static host may be configured on the SAP with a given IP address."
        },
        {
            "Parameters": "mac-address",
            "Info": "Specifies this optional parameter when defining a static host. The MAC address must be specified for anti-spoof ip-mac and arp-populate. Multiple static hosts may be configured with the same MAC address given that each definition is distinguished by a unique IP address."
        },
        {
            "Parameters": "sub-ident-string",
            "Info": "Specify this optional parameter to specify an existing subscriber identification profile to be associated with the static subscriber host. The subscriber identification profile is configured in the config>subscr-mgmt>sub-ident-pol context. The subscriber information is used by the VPRN SAP arp-reply-agent to determine the proper handling of received ARP requests from subscribers."
        },
        {
            "Parameters": "sub-profile-name",
            "Info": "Specify this optional parameter to specify an existing subscriber profile name to be associated with the static subscriber host. The subscriber profile is configured in the config>subscr-mgmt>sub-profile context."
        },
        {
            "Parameters": "sla-profile-name",
            "Info": "Specify this optional parameter to specify an existing SLA profile name to be associated with the static subscriber host. The SLA profile is configured in the config>subscr-mgmt>sla-profile context."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}