{
    "PageTitle": "on-failure",
    "FuncDef": "This command is applicable only to the R16.0R4 or later implementation of Diameter base in the SR OS.",
    "CLIs": [
        "on-failure [ failover { enabled | disabled } ] [ handling { continue | retry-and-terminate | terminate } ]",
        "no on-failure"
    ],
    "ParentView": [
        "config>subscr-mgmt>diam-appl-plcy"
    ],
    "ParaDef": [
        {
            "Parameters": "failover enabled",
            "Info": "Specifies that application session is allowed to retransmit the request message (CCR)."
        },
        {
            "Parameters": "failover disabled",
            "Info": "Specifies that the The application session is not allowed to retransmit the request message (CCR)."
        },
        {
            "Parameters": "handling continue",
            "Info": "Specifies that the sessions will continue to exist if the response to a transmitted CCR message is not received. Whether the transmitted message is re-transmitted depends on the failover configuration. In case of session initiation procedure in the Gx case (CCR-I timeout), the subscriber host is nonetheless instantiated with the default parameters, assuming that they are provided. If the default parameter are not provided, the subscriber host initiation fails."
        },
        {
            "Parameters": "handling retry-and-terminate",
            "Info": "Specifies that the message is re-transmitted in case that the failover is enabled. If the response to the retransmitted request message is not received (re-transmission times out), the application session is terminated."
        },
        {
            "Parameters": "handling terminate",
            "Info": "Specifies that the session is terminated if the response to the original request message is not received. No re-transmissions will be attempted, regardless of whether or not the failover is enabled."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: on-failure failover enabled handling terminate"
}