{
    "PageTitle": "parent-location",
    "FuncDef": "This command determines the expected location of the parent schedulers for queues configured with a parent command within the SAP egress policy. All parent schedulers must be configured within a scheduler policy applied at the location corresponding to the parent-location parameter.",
    "CLIs": [
        "parent-location { default | sla }",
        "no parent-location"
    ],
    "ParentView": [
        "config>qos>sap-egress"
    ],
    "ParaDef": [
        {
            "Parameters": "default",
            "Info": "Specifies that the queues should look for their in the SAP's egress scheduler-policy or the multi-service-site's egress scheduler policy depending on which is configured and Subscriber queues looks for their parents in the subscriber-profile's egress scheduler-policy.When the SAP egress policy is applied to an SLA profile for a subscriber, the parent schedulers of the queues must be configured in the scheduler policy applied to the subscriber s SUB profile. \nWhen the SAP egress policy is applied to a SAP, the parent schedulers of the queues need to be configured in the scheduler policy applied to the SAP or the multi-service site."
        },
        {
            "Parameters": "sla",
            "Info": "Specifies that the queues should look for their parent in the SLA-profile's egress scheduler-policy; all queues that are not port-parented and to which SLA-profile is not applicable behaves as orphans in this case.When the SAP egress policy is applies to an SLA profile for a subscriber, the parent schedulers of the queues must be configured in the scheduler policy applied to the same SLA profile.\nIf this parameter is configured within a SAP egress policy that is applied to any object except of the egress of an SLA profile, the configured parent schedulers are not found and so the queues are not parented and are orphaned."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: parent-location default"
}