{
    "PageTitle": "per-host-replication",
    "FuncDef": "This command enables per-host-replication in IPoE model. For PPPoX, per-host-replication is the only mode of operation. In the per-host-replication mode, multicast traffic is replicated per each host within the subscriber irrespective of the fact that some hosts may be subscribed to the same multicast stream. As a result, in case that multiple hosts within the subscriber are registered for the same multicast group, the multicast streams of that group is generated. The destination MAC address of multicast streams is changed to unicast so that each host receives its own copy of the stream. Multicast traffic in the per-host-replication mode can be classified via the existing QoS CLI structure. As such the multicast traffic will flow through the subscriber queues. HQoS Adjustment is not needed in this case.",
    "CLIs": [
        "per-host-replication [ uni-mac | mcast-mac ]",
        "no per-host-replication"
    ],
    "ParentView": [
        "config>subscr-mgmt>igmp-policy"
    ],
    "ParaDef": [
        {
            "Parameters": "uni-mac",
            "Info": "Specifies that multicast traffic is sent with a unicast MAC and multicast IP."
        },
        {
            "Parameters": "mcast-mac",
            "Info": "Specifies that multicast traffic is sent with a multicast MAC and IP."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: no per-host-replication - By default there is no per host replication and replication is done per SAP. This mode utilizes the SAP queues. With per-host-replication it will allow the use of the subscriber queues. Per-host-replication uses unicast MAC and multicast IP to deliver multicast content to end hosts. This is useful for multi host per SAP cases. To interoperate with end devices that do not support unicast MAC, there is an option to use per-host-replication with a multicast MAC. The traffic is the same as replication per SAP but the difference of using the subscriber queues."
}