{
    "PageTitle": "server",
    "FuncDef": "This command adds a RADIUS server and configures the RADIUS server IP address, index, and key values.",
    "CLIs": [
        "server <server-index> address <ip-address> secret <key> [ hash | hash2 ] [ port <port-num> ] [ coa-only ] [ pending-requests-limit <limit> ]",
        "no server <index>"
    ],
    "ParentView": [
        "config>subscr-mgmt>auth-policy>radius-auth-server",
        "config>subscr-mgmt>acct-plcy>server"
    ],
    "ParaDef": [
        {
            "Parameters": "server-index",
            "Info": "Specifies the index for the RADIUS server. The index determines the sequence in which the servers are queried for authentication requests. Servers are queried in order from lowest to highest index. Values-1 to 16 (a maximum of 5 authentication servers)."
        },
        {
            "Parameters": "ip-address",
            "Info": "Specifies the IP address of the RADIUS server. Two RADIUS servers cannot have the same IP address. An error message is generated if the server address is a duplicate."
        },
        {
            "Parameters": "key",
            "Info": "Specifies the secret key to access the RADIUS server. This secret key must match the password on the RADIUS server. Values-secret-key: Up to 20 characters.."
        },
        {
            "Parameters": "hash",
            "Info": "Specifies the key is entered in an encrypted form. If the hash or hash2 parameter is not used, the key is assumed to be in an unencrypted, clear text form. For security, all keys are stored in encrypted form in the configuration file with the hash or hash2 parameter specified."
        },
        {
            "Parameters": "hash2",
            "Info": "Specifies the key is entered in a more complex encrypted form that involves more variables than the key value alone, meaning that the hash2 encrypted variable cannot be copied and pasted. If the hash or hash2 parameter is not used, the key is assumed to be in an unencrypted, clear text form. For security, all keys are stored in encrypted form in the configuration file with the hash or hash2 parameter specified."
        },
        {
            "Parameters": "port-num",
            "Info": "Specifies the UDP port number on which to contact the RADIUS server for authentication. Values-1 to 65535."
        },
        {
            "Parameters": "coa-only",
            "Info": "Specifies Change-of-Authorization Messages only. Servers that are marked with the coa-only flag will not be used for authentication, but they is able to accept RADIUS CoA messages, independent of the accept-authorization-change setting in the authentication policy."
        },
        {
            "Parameters": "limit",
            "Info": "Specifies the maximum number of outstanding RADIUS authentication requests for this authentication server. Values-1 to 4096. ParamDefault: Default- The default value when not configured is 4096"
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}