{
    "PageTitle": "trigger-packet",
    "FuncDef": "This command enables triggering packet to initiate RADIUS authentication that provides a service context. The authentication, together with the service context for this request, creates a managed SAP. The VLAN is the same as the triggering packet. This SAP behaves as a regular SAP but the configuration is not user-editable and not maintained in the configuration file. The managed SAP remains active as long as the session is active.",
    "CLIs": [
        "trigger-packet [ dhcp ] [ pppoe ] [ arp ] [ dhcp6 ] [ ppp ] [ rtr-solicit ] [ data ]",
        "no trigger-packet"
    ],
    "ParentView": [
        "config>service>vpls>sap"
    ],
    "ParaDef": [
        {
            "Parameters": "dhcp",
            "Info": "Specifies whether the receipt of DHCP trigger packets on this VPLS SAP when the keyword capture-sap is specified in the sap command creation string, will result in a RADIUS authentication that will provide a service context and the creation of a SAP with a value of managed."
        },
        {
            "Parameters": "pppoe",
            "Info": "Specifies whether the receipt of PPPoE trigger packets on this VPLS SAP when the keyword capture-sap is specified in the sap command creation string, will result in a RADIUS authentication that will provide a service context and the creation of a SAP with a value of managed."
        },
        {
            "Parameters": "arp",
            "Info": "Indicates that ARP is the type of trigger packets for this entry."
        },
        {
            "Parameters": "dhcp6",
            "Info": "Indicates that DHCP6 is the type of trigger packets for this entry."
        },
        {
            "Parameters": "ppp",
            "Info": "Indicates that PPP is the type of trigger packets for this entry."
        },
        {
            "Parameters": "rtr-solicit",
            "Info": "Indicates that router solicit is the type of trigger packets for this entry."
        },
        {
            "Parameters": "data",
            "Info": "Indicates that data is the type of trigger packets for this entry."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}