{
    "PageTitle": "user-name-format",
    "FuncDef": "This command defines the format of the \"user-name\" field in the session authentication request sent to the RADIUS server.",
    "CLIs": [
        "user-name-format <format> [ mac-format <mac-format> ]",
        "user-name-format <format> append [ <domain-name> ] [ mac-format <mac-format> ]",
        "user-name-format <format> append <domain-name>",
        "user-name-format <format> default-domain <domain-name> [ mac-format <mac-format> ]",
        "user-name-format <format> replace <domain-name> [ mac-format <mac-format> ]",
        "user-name-format <format> strip [ mac-format <mac-format> ]",
        "no user-name-format"
    ],
    "ParentView": [
        "config>subscr-mgmt>auth-policy"
    ],
    "ParaDef": [
        {
            "Parameters": "format",
            "Info": "Specifies the user name format in RADIUS message. Values-ascii-converted-circuit-id, ascii-converted-tuple, circuit-id, dhcp-client-vendor-opts, mac, mac-giaddr, tuple."
        },
        {
            "Parameters": "mac-format",
            "Info": "Specifies how a MAC address is represented when contacting a RADIUS server. This is only used while the value of is equal to the DHCP client vendor options and if the MAC address is used by default of the DHCP client vendor options."
        },
        {
            "Parameters": "append",
            "Info": "Specifies the data type which is an enumerated integer that indicates what needs to be appended to the user-name sent to the RADIUS server. Values-1 - nothing\n2 - domain name."
        },
        {
            "Parameters": "domain",
            "Info": "Specifies to user the domain name. In some instances it is desired to add a domain only to usernames which have omitted the domain (@domain). In these instances a default-domain can be appended to usernames which lack a @domain."
        },
        {
            "Parameters": "append",
            "Info": "Adds a \"@\" delimiter and the specified string after the PAP/CHAP username. No allowance is made for the presence of an existing domain or @ delimited."
        },
        {
            "Parameters": "replace",
            "Info": "Replaces the character-string after the \"@\" delimiter with the string specified."
        },
        {
            "Parameters": "strip",
            "Info": "Removes all characters after and including the \"@\" delimiter."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: By default, the MAC source address of the DHCPv4 DISCOVER or DCHPv6 SOLICIT message is used in the user-name field."
}