{
    "PageTitle": "ies",
    "FuncDef": "This command configures which IES service interfaces' flow data is being sent to this collector.",
    "CLIs": [
        "[ no ] ies <service-id> interface <ip-int-name>",
        "[ no ] ies <service-id> subscriber-interface <ip-int-name> group-interface <ip-int-name>"
    ],
    "ParentView": [
        "config>cflowd>collector>exp-filter>if-list>svc"
    ],
    "ParaDef": [
        {
            "Parameters": "service-id",
            "Info": "Specifies the unique service identification number or string identifying the service in the service domain. This ID must be unique to this service and may not be used for any other service of any type. The service-id must be the same number used for every SR OS on which this service is defined. Values-service-id:\t1 to 2147483647."
        },
        {
            "Parameters": "interface ip-int-name",
            "Info": "Specifies the name of the IP interface. Interface names must be unique within the group of defined IP interfaces for config router interface and config service ies interface commands. An interface name cannot be in the form of an IP address. Interface names can be from 1 to 32 alphanumeric characters and must start with a letter. If the string contains special characters (#, $, spaces, and so on), the entire string must be enclosed within double quotes."
        },
        {
            "Parameters": "subscriber-interface ip-int-name",
            "Info": "Specifies the interface name of a subscriber interface. If the string contains special characters (#, $, spaces, and so on), the entire string must be enclosed within double quotes and must start with a letter."
        },
        {
            "Parameters": "group-interface ip-int-name",
            "Info": "Specifies the interface name of a group interface. If the string contains special characters (#, $, spaces, and so on), the entire string must be enclosed within double quotes and must start with a letter."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}