{
    "PageTitle": "umh-select highest-ip (VPN instance IPv6 address family MVPN view)",
    "FuncDef": "The umh-select highest-ip command enables the highest IP address to be selected as the upstream multicast hop (UMH) in an MVPN instance.\nThe undo umh-select highest-ip command disables the highest IP address from being selected as the UMH in an MVPN instance.\nBy default, a preferred unicast route is selected as the UMH in an MVPN instance.",
    "CLIs": [
        "umh-select highest-ip",
        "undo umh-select highest-ip"
    ],
    "ParentView": [
        "VPN instance IPv6 address family MVPN view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast ipv6 mvpn 2.2.2.2",
            "[*HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ipv6-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv6] route-distinguisher 1:1",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv6] multicast ipv6 routing-enable",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv6] mvpn",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv6-mvpn] umh-select highest-ip"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn an IPv6 NG MVPN, when multiple sender PEs exist, receiver PEs select routes based on preferred unicast routes by default. As a result, different receiver PEs may select different sender PEs as their root nodes. To enable receiver PEs to select the same sender PE as their root node during VPN route selection, run the umh-select command to enable the highest IP address to be selected as the UMH on the receiver PEs.\nPrecautions\nAfter the umh-select highest-ip command is run, load splitting calculation cannot be performed on (*, G) and (S, G) entries for a VPN across a public network, even if load splitting is configured.After the umh-select highest-ip command is run, all root PEs that advertise multicast sources or RPs must have MVPN capabilities. Otherwise, multicast traffic may fail to be forwarded.After the umh-select highest-ip command is run, the existing NG MVPN services may be interrupted and then recover, because the upstream neighbor may change.When the umh-select highest-ip configuration and multicast load splitting coexist, if the route to the multicast source or RP is not a remote route, the current load splitting algorithm is used to calculate the RPF route. If the route to the multicast source or RP is a remote route, the highest IP address is selected as the UMH. In this case, load splitting cannot be performed."
}