{
    "PageTitle": "spt-only mode (VPN instance IPv6 address family MVPN view)",
    "FuncDef": "The spt-only mode command configures PIM-SM MDTs to be set up not across the public network.\nThe undo spt-only mode command restores the default configuration.\nBy default, PIM-SM MDTs cannot be set up.",
    "CLIs": [
        "spt-only mode",
        "undo spt-only mode"
    ],
    "ParentView": [
        "VPN instance IPv6 address family MVPN view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast ipv6 mvpn 2.2.2.2",
            "[*HUAWEI] ip vpn-instance mcast1",
            "[*HUAWEI-vpn-instance-mcast1] ipv6-family",
            "[*HUAWEI-vpn-instance-mcast1-af-ipv6] route-distinguisher 100:100",
            "[*HUAWEI-vpn-instance-mcast1-af-ipv6] multicast ipv6 routing-enable",
            "[*HUAWEI-vpn-instance-mcast1-af-ipv6] mvpn",
            "[*HUAWEI-vpn-instance-mcast1-af-ipv6-mvpn] spt-only mode"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn NG MVPN, PIM-SM MDTs can be set up using the following two modes:\nPIM-SM MDT setup across the public network: PIM-SM MDT information is transmitted to the remote PE through the public network. Either a PE or CE can be configured as a VPN instance's rendezvous point (RP). A switchover from a rendezvous point tree (RPT) to a shortest path tree (SPT) may occur on the public network. Therefore, a PE needs to maintain a large amount of status information.\nIn this mode, VPN instances support only static RPs.\nPIM-SM MDT setup not across the public network: PIM-SM MDT information is transmitted to the remote PE not through the public network. A switchover from an RPT to an SPT does not occur on the public network, reducing the workload and amount of status information to be maintained on the PE.\nIn this mode, VPN instances support both dynamic and static RPs. Either a PE or CE can be configured as a VPN instance's RP. If a CE is configured as a VPN instance's RP, the CE needs to set up an MSDP peer relationship with its connected PE.\nBy default, PIM-SM MDTs cannot be set up.\nIf you want PIM-SM MDTs to be set up not across the public network, run the spt-only mode command.If you want PIM-SM MDTs to be set up across the public network, run the rpt-spt mode command.\n\nPrecautions\nPEs in the same MVPN instance must use the same PIM-SM MDT setup mode."
}