{
    "PageTitle": "congest-alarm trigger-condition duration (up)",
    "FuncDef": "The congest-alarm trigger-condition duration command configures a packet congestion duration for a CUSP connection.\nThe undo congest-alarm trigger-condition duration command restores the default packet congestion duration of a CUSP connection.\nThe default packet congestion duration of a CUSP connection is 5 minutes.",
    "CLIs": [
        "congest-alarm trigger-condition duration <duration>",
        "undo congest-alarm trigger-condition duration [ duration ]"
    ],
    "ParentView": [
        "CUSP-forwarder view"
    ],
    "ParaDef": [
        {
            "Parameters": "duration",
            "Info": "Specifies a packet congestion duration (min) .\nThe value is an integer ranging from 1 to 10, in minutes, default 5."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] cu-controller",
            "[~HUAWEI-cu-controller] up 1024",
            "[~HUAWEI-cu-controller-up1024] config",
            "[~HUAWEI-cu-controller-up1024-config] cusp agent huawei",
            "[~HUAWEI-cu-controller-up1024-config-cusp-agent-huawei] congest-alarm trigger-condition duration 3"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn a CU separation scenario, you can run the congest-alarm trigger-condition duration command to configure a packet congestion duration for a CUSP connection. If packet congestion continuously occurs in the duration, an alarm is reported. By adjusting the packet congestion duration, you can monitor the packet congestion status of the CUSP connection based on alarms.\nHeavier service traffic indicates severer packet congestion. To prevent frequent alarm reporting, you can set the packet congestion duration to a larger value. Use the default value unless otherwise specified.\nPrecautions\nHeavier service traffic indicates severer packet congestion. To prevent frequent alarm reporting, you can set the packet congestion duration to a larger value. Use the default value unless otherwise specified.\nIn VS mode, this command is supported only by the admin VS."
}