{
    "PageTitle": "cu-mode access-type",
    "FuncDef": "The cu-mode access-type layer3 command reports an interface to the vBRAS-CP. The vBRAS-CP then manages the interface and sets the access mode of the interface to Layer 3 access.\nThe undo cu-mode access-type layer3 command deletes the configuration.\nThe cu-mode access-type layer3-leased-line command reports an interface to the vBRAS-CP. The vBRAS-CP then manages the interface and sets the access mode of the interface to Layer 3 leased access.\nThe undo cu-mode access-type layer3-leased-line command deletes the configuration.\nBy default, interfaces are not reported to the vBRAS-CP.",
    "CLIs": [
        "cu-mode access-type layer3",
        "cu-mode access-type layer3-leased-line",
        "undo cu-mode access-type layer3",
        "undo cu-mode access-type layer3-leased-line"
    ],
    "ParentView": [
        "100GE interface view",
        "10G LAN interface view",
        "10G WAN interface view",
        "50GE interface view",
        "50|100GE interface view",
        "Eth-Trunk interface view",
        "GE electrical interface view",
        "XGE interface view",
        "Sub-interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system",
            "[~HUAWEI] interface GigabitEthernet 1024/3/0/1",
            "[~HUAWEI-GigabitEthernet1024/3/0/1] bas",
            "[~HUAWEI-GigabitEthernet1024/3/0/1] access-type layer3-subscriber"
        ],
        [
            "<HUAWEI> system",
            "[~HUAWEI] interface GigabitEthernet 3/0/1",
            "[~HUAWEI-GigabitEthernet3/0/1] display this",
            "[~HUAWEI-GigabitEthernet3/0/1]",
            "#",
            "interface GigabitEthernet3/0/1",
            " undo shutdown",
            " cu-mode access-type layer3",
            "#"
        ]
    ],
    "ExtraInfo": "In the CU separation scenario, the BRAS service needs to be configured on the vBRAS-CP and delivered to the vBRAS-UP. After the access-type layer3-subscriber or access-type layer3-leased-line command is run in the BAS interface view on the vBRAS-CP, the cu-mode access-type layer3 or cu-mode access-type layer3-leased-line command is delivered to the corresponding interface on the vBRAS-UP. When the access-type layer3-subsvriber or access-type layer3-leased-line command is deleted from the BAS interface view on the vBRAS-CP, the cu-mode access-type layer3 or cu-mode access-type layer3-leased-line command is deleted from the corresponding interface on the vBRAS-UP."
}