{
    "PageTitle": "ip vpn-instance",
    "FuncDef": "The ip vpn-instance command creates a VPN instance and displays the VPN instance view.\nThe undo ip vpn-instance command deletes a specified VPN instance.\nBy default, no VPN instance is created.",
    "CLIs": [
        "ip vpn-instance <vpn-instance-name>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance-name",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string.\n_public_ refers to a public network VPN instance.\nIt is recommended that the VPN instance name not match any abbreviation of \"verbose\", \"import-vt\", and \"tunnel-info\" keywords based on a forward matching rule (for example, the name cannot be \"ver\", \"imp\", or \"tun\"). Otherwise, the command for querying the VPN instance name through a specified instance conflicts with the command keyword. In forward matching, the value is case insensitive and the number of characters is not distinguished."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vrf1",
            "[*HUAWEI-vpn-instance-vrf1]"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf private network data needs to travel across a public network, you must configure VPN instances on public network PEs. The public network mentioned here is an MPLS backbone network.\nVPN instances are required for all L3VPN configurations.\nConfiguration Impact\nAfter the ip vpn-instance command is run on a PE, a virtual routing table is created on the PE and consumes resources on the PE.\nFollow-up Procedure\nAfter creating a VPN instance, perform the following configurations in the VPN instance view:\nEnable the IPv4 or IPv6 address family for the VPN instance. A VPN instance supports the IPv4 and IPv6 address families. You need to run the ipv4-family (VPN instance view) or ipv6 family (VPN instance view) command to enable the IPv4 or IPv6 address family based on the type of the protocol stack used to advertise VPN routes in the VPN instance.Configure a Route Distinguisher (RD) for the IPv4 or IPv6 address family of the VPN instance. You are allowed to perform VPN configurations in the address family view only after using the route-distinguisher command to configure an RD for the address family.Configure a VPN target for the IPv4 or IPv6 address family of the VPN instance using the vpn-target command. VPN targets control route learning between VPN instances.Bind the VPN instance to a VPN-connected interface on the PE using the ip binding vpn-instance command.\n\nPrecautions\nAfter a VPN instance is deleted using the undo ip vpn-instance command, configurations in the VPN instance as well as the VPN instance-related configurations in the BGP view will be deleted. Therefore, exercise caution when you run this command.\nDCN VPN is created by default for the system and cannot be created or deleted manually."
}