{
    "PageTitle": "ip binding vpn-instance (Mtunnel view)",
    "FuncDef": "The ip binding vpn-instance command associates an interface on a PE with a VPN instance.\nThe undo ip binding vpn-instance command disables the association between a VPN instance and an interface.\nBy default, an interface is a public network interface and is not associated with any VPN instance.",
    "CLIs": [
        "ip binding vpn-instance <vpn-instance-name>"
    ],
    "ParentView": [
        "MTI interface view",
        "Mtunnel view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance-name",
            "Info": "Specifies the name of the VPN instance to be associated with the interface.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vrf1",
            "[*HUAWEI-vpn-instance-vrf1] ipv4-family",
            "[*HUAWEI-vpn-instance-vrf1-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vrf1-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vrf1] quit",
            "[*HUAWEI] commit",
            "[~HUAWEI] interface MTunnel 10",
            "[~HUAWEI-MTunnel10] ip binding vpn-instance vrf1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter creating a VPN instance, you must associate the PE interface connecting to the VPN with the VPN instance. Then, the interface is used as a private network interface on which a private network address and a private network routing protocol can be configured.\nPrerequisites\nA VPN instance has been configured using the ip vpn-instance command.\nConfiguration Impact\nAfter an interface is associated with a VPN instance or an interface is disassociated from a VPN instance, the Layer 3 features on this interface, such as the IP address and routing protocol, are deleted. The Layer 3 features need to be reconfigured if required.\nPrecautions\nUsing the undo ipv4-family or undo ipv6 family command to disable the IPv4 or IPv6 address family also deletes the IPv4 or IPv6 configurations of the interfaces bound to the VPN instance."
}