{
    "PageTitle": "ip direct-routing-table",
    "FuncDef": "The ip direct-routing-table command applies a routing policy to direct in the VPN instance IPv4 address family.\nThe undo ip direct-routing-table command cancels the routing policy that is applied to direct in the VPN instance IPv4 address family.\nBy default, no routing policy is applied to direct in the VPN instance IPv4 address family.",
    "CLIs": [
        "ip direct-routing-table route-policy <route-policy-name>",
        "undo ip direct-routing-table"
    ],
    "ParentView": [
        "VPN instance IPv4 address family view",
        "VPN instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "route-policy route-policy-name",
            "Info": "Specifies the name of a route-policy.\nThe name is a string of 1 to 200 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip ip-prefix pr1 index 10 permit 10.1.1.1 32",
            "[*HUAWEI] route-policy ip_qos_rp permit node 10",
            "[*HUAWEI-route-policy] if-match ip-prefix pr1",
            "[*HUAWEI-route-policy] apply qos-local-id 123",
            "[*HUAWEI-route-policy] commit",
            "[~HUAWEI-route-policy] quit",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] vpn-target 1:1",
            "[*HUAWEI-vpn-instance-vpna-af-ipv4] ip direct-routing-table route-policy ip_qos_rp"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo perform traffic statistics collection, authentication, and accounting based on direct routes, run the ip direct-routing-table command to apply a routing policy to direct in the VPN instance IPv4 address family so that QoS information, such as the traffic behavior or local ID that is associated with the direct routes, can be set for QoS information management.\nPrerequisites\n The routing policy has been configured using the route-policy command. For direct routes, they are categorized based on the ACL and address prefix list.\n\nPrecautions\nTo apply a routing policy to direct in the VPN instance IPv4 address family, run the ip route-policy (VPN instance IPv4 address family view) command. To apply a routing policy to direct in the public network routing table, run the ip route-policy (system view) command."
}