{
    "PageTitle": "peer advertise route-reoriginated vpnv4 (BGP-VPNv4 address family view) (IPv6)",
    "FuncDef": "The peer advertise route-reoriginated vpnv4 command enables a device to advertise regenerated routes in the VPNv4 address family to a BGP VPNv4 peer.\nThe undo peer advertise route-reoriginated vpnv4 command restores the default configuration.\nBy default, the local device does not advertise regenerated routes in the VPNv4 address family to a BGP VPNv4 peer.",
    "CLIs": [
        "peer <peerIpv6Addr> advertise route-reoriginated vpnv4",
        "undo peer <peerIpv6Addr> advertise route-reoriginated vpnv4"
    ],
    "ParentView": [
        "BGP-VPNv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "peerIpv6Addr",
            "Info": "Specifies an IPv6 address for a BGP VPNv4 peer.\nThe address is a 32-bit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 1::1 as-number 100",
            "[*HUAWEI-bgp] ipv4-family vpnv4",
            "[*HUAWEI-bgp-af-vpnv4] peer 1::1 enable",
            "[*HUAWEI-bgp-af-vpnv4] peer 1::1 advertise route-reoriginated vpnv4"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn an HVPN scenario, different UPEs communicate with each other through SPEs and NPEs. When there are a large number of UPEs, if the per instance per label mode is configured for the VPN instances and the per next hop per label mode is configured for the VPNv4 address family of the SPEs, the UPEs have to receive a large number of labels. If the UPEs have comparatively low capacity, a traffic forwarding error may occur.\nTo solve this problem, import the VPNv4 routes received by the SPEs into the VPN instances. The VPN instances regenerate these routes and then advertise them to the VPNv4 address family. Because the per instance per label mode is configured for the VPN instances, one label is allocated per VPN instance when the regenerated routes are advertised to the UPEs, which reduces the number of VPN labels assigned to VPNv4 routes. To enable an SPE to advertise the regenerated routes in the VPNv4 address family to a BGP VPNv4 peer, run the peer advertise route-reoriginated vpnv4 command.\nPrecautions\nBefore running this command, you can run the advertise [ best-route | valid-routes ] route-reoriginate command to configure a VPN instance to advertise regenerated routes to the VPNv4 address family."
}