{
    "PageTitle": "apply-label pop-go (VPN instance IPv4 address family view)",
    "FuncDef": "The apply-label per-route pop-go command configures a device to assign labels to VPNv4 routes sent to its peer, removes such a label in a data packet received from the peer, and forward the data packet through the outbound interface found in the ILM table. With this command configuration, the device uses the per-route label allocation mode, so that it assigns a unique label to each VPNv4 route.\nThe undo apply-label per-route pop-go command restores the default configuration.\nThe apply-label per-nexthop pop-go command configures a device to assign labels to VPNv4 routes sent to its peer, removes such a label in a data packet received from the peer, and forward the data packet through the outbound interface found in the ILM table. With this command configuration, the device uses the per-route label allocation mode, so that it assigns a unique label to each VPNv4 route.\nThe undo apply-label per-nexthop pop-go command restores the default configuration.\nBy default, after a device receives a labeled data packet, the device removes the label of the data packet and forwards the packet based on a forwarding entry found in its IP forwarding table.",
    "CLIs": [
        "apply-label { per-nexthop | per-route } pop-go",
        "undo apply-label { per-nexthop | per-route } pop-go"
    ],
    "ParentView": [
        "VPN instance IPv4 address family view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ipv4-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] apply-label per-nexthop pop-go"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ipv4-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] apply-label per-route pop-go"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, after the local device in the BGP/MPLS VPN networking receives a labeled data packet from a VPN instance, the local device removes the label, searches the IP forwarding table for a forwarding entry according to the longest-match rule, and sends the packet based on the found forwarding entry.\nAfter the apply-label per-route pop-go command is configured, the local device records in the ILM table the mapping between the label assigned to each VPNv4 route and the outbound interface of the route. Then, after the local device receives a labeled data packet from its BGP VPNv4 peer, the local device directly searches the ILM table for an outbound interface based on label information carried in the packet and forwards the packet through the found outbound interface after removing its label. This implementation significantly accelerates packet forwarding.\nAfter the apply-label per-nexthop pop-go command is run, the local device records in the ILM table the mapping between the label assigned to BGP VPNv4 routes with the same next-hop address and the outbound interface of the route. After the local device receives a labeled data packet from its peer, the local device directly searches the ILM table for an outbound interface based on label information carried in the packet and forwards the packet through the found outbound interface after removing its label. This implementation significantly accelerates packet forwarding.\nPrerequisites\nAn RD has been configured using the route-distinguisher command in the VPN instance IPv4 address family view.\nPrecautions\nThe apply-label pop-go command is mutually exclusive with the apply-label command in the VPN instance IPv4 address family. The latest configuration overrides the previous one.\nAfter the apply-label pop-go command is run, the device removes the label, searches the ILM table for the corresponding outbound interface, and forwards the data packet, without querying the IP forwarding table. The apply-label command, however, needs the device to query the IP forwarding table for forwarding."
}