{
    "PageTitle": "import route-policy (VPN instance view)",
    "FuncDef": "The import route-policy command associates the current VPN instance IPv4 address family with an import route-policy.\nThe undo import route-policy command disassociates the current VPN instance IPv4 address family from an import route-policy.\nBy default, the current VPN instance IPv4 address family is not associated with any import route-policy.",
    "CLIs": [
        "import route-policy <policy-name>",
        "undo import route-policy"
    ],
    "ParentView": [
        "VPN instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "policy-name",
            "Info": "Specifies the name of the import route-policy to be associated with a VPN instance IPv4 address family.\nThe name is a string of 1 to 200 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] route-policy poly-1 permit node 10",
            "[*HUAWEI-route-policy] quit",
            "[*HUAWEI] ip vpn-instance vrf1",
            "[*HUAWEI-vpn-instance-vrf1] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vrf1-af-ipv4] import route-policy poly-1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf no import route-policy is configured, routes can only be filtered based on export VPN targets. The routes whose export VPN targets match the import VPN target of the local VPN instance IPv4 address family are added to the VPN instance IPv4 address family. To control the import of the routes into the VPN instance IPv4 address family more precisely, use the import route-policy. The import route-policy is used to filter the imported routing information and to set the routing attributes of the routes that pass the filtering.\nThe import route-policy command controls the VPN routes that are added to a VPN instance IPv4 address family. The peer route-policy command or the filter-policy command run in the BGP VPN instance IPv4 address family view filters routes of a VPN instance IPv4 address family advertised to or received from CE neighbors.\nPrerequisites\nIf the import route-policy to be associated with a VPN instance IPv4 address family does not exist, configure the import route-policy first.\nConfiguration Impact\nThe current VPN instance IPv4 address family can be associated with only one import route-policy. If the import route-policy command is run more than once, the latest configuration overrides the previous one."
}