{
    "PageTitle": "import-rib protocol vlink-direct-route",
    "FuncDef": "The import-rib protocol vlink-direct-route command imports public network or other VPN instance routes to a VPN instance routing table.\nThe undo import-rib protocol vlink-direct-route command restores the default configuration.\nBy default, public network or other VPN instance routes are not imported to VPN instance routing tables.",
    "CLIs": [
        "import-rib { public | vpn-instance <vpn-instance-name> } protocol vlink-direct-route [ route-policy <route-policy-name> | route-filter <route-filter-name> ]",
        "undo import-rib { public | vpn-instance <vpn-instance-name> } protocol vlink-direct-route [ route-policy <route-policy-name> | route-filter <route-filter-name> ]"
    ],
    "ParentView": [
        "VPN instance IPv4 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "public",
            "Info": "Specifies the public network route.\n-"
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "route-policy route-policy-name",
            "Info": "Specifies a route-policy to filter routes to be imported.\nThe name is a string of 1 to 200 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "route-filter route-filter-name",
            "Info": "Specifies the name of a route-filter.\nThe value is a string of 1 to 200 case-sensitive characters, spaces not supported. If parameters are included in the referenced route-filter, specify values for them in the format of (var1, var2, ...var8) behind the route-filter name. A maximum of eight parameters can be specified, and each value ranges from 1 to 200 characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vrf1",
            "[*HUAWEI-vpn-instance-vrf1] ipv4-family import-rib public protocol vlink-direct-route"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn a BGP/MPLS IP VPN scenario, one VPN can communicate with another VPN if they have matching VPN targets, but VPNs cannot communicate with the public network. To enable a VPN to communicate with the public network, you have to ensure that the VPN and public network can obtain routes to each other. To import public network routes to a VPN instance, run the import-rib protocol vlink-direct-route command.\nIn an intelligent traffic control scenario, traffic of different users are distributed to different VPNs. To enable the traffic to reach the public network, run the import-rib protocol vlink-direct-route command to import public network routes to each VPN instance routing table.\nTraffic forwarding relies on direct routes (Vlink direct routes) generated based on user entries. When QinQ or Dot1q VLAN tag termination sub-interfaces are used for route import between VPN and public network, Vlink direct routes cannot be imported. As a result, traffic forwarding is interrupted. To solve this problem, route import between VPN and public network newly supports import of Vlink direct routes.\nPrecautions\nIf you run the import-rib protocol vlink-direct-route command on a device without adding the valid-route keyword, the device will import all routes of the specified type from the public network instance's corresponding routing table to the specified VPN instance. If an imported route is preferred in this routing table, the device will advertise the route to other devices and deliver the route to the VPN instance's IP routing table to guide traffic forwarding.\nIf you run the import-rib protocol vlink-direct-route command with only the valid-route keyword added, the device will import the valid IP routes of the specified type from the public network instance's corresponding routing table to the specified VPN instance. If the imported routes are preferred in this routing table, the device will advertise these routes to other devices and deliver these routes to the VPN instance's IP routing table to guide traffic forwarding."
}