{
    "PageTitle": "route-filter (BGP-IPv4 multicast address family view)",
    "FuncDef": "The route-filter command filters the routes to be received and advertised .\nThe undo route-filter command restores the default configuration.\nBy default, the routes to be received are not filtered, the routes to be advertised are not filtered.",
    "CLIs": [
        "route-filter <route-filter-name> { import | export [ direct | isis <process-id> | ospf <process-id> | rip <process-id> | static ] }",
        "undo route-filter <route-filter-name> { import | export [ direct | isis <process-id> | ospf <process-id> | rip <process-id> | static ] }"
    ],
    "ParentView": [
        "BGP-IPv4 multicast address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "route-filter-name",
            "Info": "Specifies the name of a route-filter.\nThe value is a string of 1 to 200 case-sensitive characters, spaces not supported. If parameters are included in the referenced route-filter, specify values for them in the format of (var1, var2, ...var8) behind the route-filter name. A maximum of eight parameters can be specified, and each value ranges from 1 to 200 characters."
        },
        {
            "Parameters": "import",
            "Info": "Filter incoming routing updates.\n-"
        },
        {
            "Parameters": "export",
            "Info": "Filter outgoing routing updates.\n-"
        },
        {
            "Parameters": "direct",
            "Info": "Filters the direct routes to be advertised.\n-"
        },
        {
            "Parameters": "isis process-id",
            "Info": "Filters the IS-IS routes to be advertised. process-id indicates the process ID of ISIS protocol.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "ospf process-id",
            "Info": "Filters the OSPF routes to be advertised. process-id indicates the process ID of OSPF protocol.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "rip process-id",
            "Info": "Filters the RIP routes to be advertised. process-id indicates the process ID of RIP protocol.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "static",
            "Info": "Filters the static routes to be advertised.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv4-family multicast",
            "[*HUAWEI-bgp-af-multicast] route-filter aaa import"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv4-family multicast",
            "[*HUAWEI-bgp-af-multicast] route-filter aaa export"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo filter the routes to be received by MBGP, run the route-filter import command. MBGP adds only the received routes that match the route-filter to the MBGP routing table.\nTo filter the routes to be advertised using a route-filter, run the route-filter export command.\nIf you specify a route protocol in the command, MBGP filters only the routes of this protocol before advertising them.If you do not specify any protocol in the command, MBGP filters all routes before advertising them."
}