{
    "PageTitle": "preference (BGP-IPv4 multicast address family view)",
    "FuncDef": "The preference command sets protocol preferences for EBGP routes, IBGP routes, and local routes.\nThe undo preference command restores the default setting.\nBy default, the protocol preferences of EBGP routes, IBGP routes, and local routes are all 255.",
    "CLIs": [
        "preference { <external-preference> <internal-preference> <local-preference> | route-policy <route-policy-name> }",
        "preference route-filter <route-filter-name>",
        "undo preference"
    ],
    "ParentView": [
        "BGP-IPv4 multicast address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "external-preference",
            "Info": "Specifies the protocol preference of an EBGP route. An EBGP route is the optimal route learned from a peer outside the local AS.\nThe value is an integer ranging from 1 to 255."
        },
        {
            "Parameters": "internal-preference",
            "Info": "Specifies the protocol preference of an IBGP route. An IBGP route is a route learned from a peer inside the local AS.\nThe value is an integer ranging from 1 to 255."
        },
        {
            "Parameters": "local-preference",
            "Info": "Specifies the protocol preference of a local MBGP route.\nThe value is an integer ranging from 1 to 255."
        },
        {
            "Parameters": "route-policy route-policy-name",
            "Info": "Specifies the name of a route-policy.\nThe name is a string of 1 to 200 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "route-filter route-filter-name",
            "Info": "Specifies the name of a route-filter.\nThe value is a string of 1 to 200 case-sensitive characters, spaces not supported. If parameters are included in the referenced route-filter, specify values for them in the format of (var1, var2, ...var8) behind the route-filter name. A maximum of eight parameters can be specified, and each value ranges from 1 to 200 characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv4-family multicast",
            "[*HUAWEI-bgp-af-multicast] preference 2 2 20"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nUsers can run this command to change the priorities of external routes, internal routes, and local routes."
}