{
    "PageTitle": "display bgp multicast peer verbose",
    "FuncDef": "The display bgp multicast peer verbose command displays information about a specified MBGP peer.",
    "CLIs": [
        "display bgp multicast peer verbose",
        "display bgp multicast peer <peerIpv4Addr> verbose"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "peerIpv4Addr",
            "Info": "Specifies the IP address of an MBGP peer.\nThe address is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display bgp multicast peer",
            "BGP local router ID : 1.1.1.1",
            " Local AS number : 1",
            " Total number of peers : 1                 Peers in established state : 1",
            "",
            "  Peer            V    AS  MsgRcvd  MsgSent  OutQ  Up/Down       State PrefRcv",
            "",
            "  10.2.1.2        4     2       36       37     0 00:15:35 Established      24"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe display bgp multicast peer command displays BGP peer information. You can implement the following operations based on the command output:\nTo check the status of MBGP connectionsTo check information about a BGP peerTo check whether a MBGP peer is configured using the peer as-number commandTo check whether a MBGP peer is deleted using the undo peer as-number command\nThe display bgp multicast peer command can be used for troubleshooting, with details as follows: If MBGP peers are disconnected, specify log-info in the command to check the log information of the specified peer. In the command output, Date/Time indicates the time when the peers were disconnected, and Error Code and Error Subcode indicate the cause of the disconnection.\n\nPrecautions\nBGP has multiple address and sub-address families. By default, the display bgp peer command displays information about BGP peers in IPv4 unicast address family only. If you want to view information about BGP peers in another address family, specify its address family parameter.\nTo view detailed information about a BGP peer, such as information about BGP timers, the number of sent and received routes, capacities supported, the number of sent and received BGP messages, and enabled functions, specify verbose in the command."
}