{
    "PageTitle": "peer route-limit (BGP-IPv4 multicast address family view) (group)",
    "FuncDef": "The peer route-limit command sets the maximum number of routes that can be received from a peer group.\nThe undo peer route-limit command cancels the configuration.\nBy default, there is no limit on the number of routes that can be received from a peer.",
    "CLIs": [
        "peer <peerGroupName> route-limit <limit> [ <percentage> ] [ alert-only | idle-forever | idle-timeout <times> ]",
        "undo peer <peerGroupName> route-limit"
    ],
    "ParentView": [
        "BGP-IPv4 multicast address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "peerGroupName",
            "Info": "Specifies the name of an MBGP peer group.\nThe value is a string of 1 to 47 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "limit",
            "Info": "Specifies the maximum number of routes that can be received from a peer.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "percentage",
            "Info": "Specifies the ratio of the number of received routes to the maximum number of routes allowed (limit) when the router starts to generate alarms.\nThe value is an integer ranging from 1 to 100. The default value is 75."
        },
        {
            "Parameters": "alert-only",
            "Info": "Indicates that if the number of received routes exceeds the limit, an alarm will be generated and no additional routes will be accepted.\n-"
        },
        {
            "Parameters": "idle-forever",
            "Info": "Indicates that after the number of routes exceeds the limit, no connection is established automatically.\n-"
        },
        {
            "Parameters": "idle-timeout times",
            "Info": "Specifies the value of the timeout timer. The connection, which is closed because the number of routes exceeds the threshold, is automatically re-established in the period specified by the timeout timer.\nThe value is an integer ranging from 1 to 1200, in minutes."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer test as-number 100",
            "[*HUAWEI-bgp] ipv4-family multicast",
            "[*HUAWEI-bgp-af-multicast] peer test enable",
            "[*HUAWEI-bgp-af-multicast] peer test route-limit 10000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe peer route-limit command is used to set the maximum number of routes that an MBGP device is allowed to receive from its peer. This adds a mechanism for controlling the routes received from peers in addition to distribution lists, filtering lists, and route mappings.\nIf the peer relationship between two peers is in the Established state, the following situations occur:\nIf the number of routes received by the router exceeds the maximum limit after you run the peer route-limit command for the first time or run the command to reduce the maximum limit:If you specified alert-only in the command, the router does not disconnect its BGP peer. The received routes are not removed, and no additional routes will be accepted.If you specified idle-forever in the command, the router disconnects its BGP peer. To re-establish the connection, run the reset bgp command.If you specified idle-timeout in the command, the router disconnects its BGP peer and re-establishes its BGP peer relationship automatically after the timeout timer expires. To re-establish the connection before the timeout timer expires, run the reset bgp command.If the upper limit set on the router is increased to be greater than the number of received routes, the router sends Refresh packets to receive routes again. If the router does not support the route-refresh capability, the router needs to re-establish the connection with its peer.If the upper limit set on the router is reduced but is still greater than the number of received routes, only configuration parameters need to be modified.\nAssume that none of alert-only, idle-forever, and idle-timeout is configured. If the number of routes exceeds the upper limit, an alarm is generated and recorded in the log. Then, the peer relationship is disconnected. The devices try to re-establish the peer relationship after 30 seconds."
}