{
    "PageTitle": "reset bgp multicast flap-info",
    "FuncDef": "The reset bgp multicast flap-info command clears route flapping statistics.",
    "CLIs": [
        "reset bgp multicast flap-info <ipv4-address> [ <mask> | <mask-length> ]",
        "reset bgp multicast <ip-address> flap-info",
        "reset bgp multicast flap-info",
        "reset bgp multicast flap-info as-path-filter { <as-path-filter-num> | <as-path-filter-name> }",
        "reset bgp multicast flap-info regexp <regexp>"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv4-address",
            "Info": "Specifies a network address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "mask",
            "Info": "Specifies the mask of a network address.\nIt is in dotted decimal notation."
        },
        {
            "Parameters": "mask-length",
            "Info": "Specifies the mask length of a network address.\nThe value is an integer ranging from 0 to 32."
        },
        {
            "Parameters": "ip-address",
            "Info": "Specifies the IP address of an MBGP peer.\nThe address is in dotted decimal notation."
        },
        {
            "Parameters": "flap-info",
            "Info": "Clear the flap-info of all the routes.\n-"
        },
        {
            "Parameters": "as-path-filter",
            "Info": "Clear the flap-info based on AS path filter list.\n-"
        },
        {
            "Parameters": "as-path-filter-num",
            "Info": "Clear the flap-info matching this AS path filter list number.\nThe value is an integer ranging from 1 to 256."
        },
        {
            "Parameters": "as-path-filter-name",
            "Info": "Specifies the AS path filter name.\nThe value is a string of 1 to 51 case-sensitive characters and spaces not supported, which cannot contain only numbers."
        },
        {
            "Parameters": "regexp regexp",
            "Info": "Clears flapping statistics about the routes that match the AS_Path regular expression.\nThe value is a string of 1 to 80 characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset bgp multicast flap-info as-path-filter 10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe process of adding a route to and then deleting the route from a routing table is called route flapping.\nWhen route flapping occurs, the routing protocol sends Update packets to neighbors. The neighbors that receive the Update packets need to recalculate routes and modify its routing table. Therefore, frequent route flapping consumes great bandwidth and CPU resources and even seriously affects network operations.\nThe reset bgp multicast flap-info command is used to clear the flapping information about routes. This allows the router to re-collect statistics about flapping routes and helps to monitor route changes and locate network problems.\nPrerequisites\nYou can use display bgp multicast routing-table flap-info command to view the information about BGP route flapping.\nIf there are a large number of flapping routes, define an AS_Path filter or an AS_Path regular expression to be referenced in the reset bgp multicast flap-info command. The flapping statistics of the routes matching the AS_Path filter or the AS_Path regular expression are then cleared.\nConfiguration Impact\nAfter the reset bgp multicast flap-info command is run, the flapping statistics of routes are reset and cannot be displayed.\nFollow-up Procedure\nAfter the flapping statistics of routes are cleared, run the display bgp multicast routing-table flap-info command again to display the flapping statistics about MBGP routes in order to locate problems."
}