{
    "PageTitle": "pcp server (NAT instance view)",
    "FuncDef": "The pcp server command specifies a PCP server address in a specific NAT instance.\nThe undo pcp server command deletes the PCP server address in a specific NAT instance.\nBy default, no PCP server address is specified for a NAT instance.",
    "CLIs": [
        "pcp server ipv4 <ipv4-address> { <mask> | <mask-len> }",
        "undo pcp server ipv4 [ <ipv4-address> { <mask> | <mask-len> } ]"
    ],
    "ParentView": [
        "NAT instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "mask",
            "Info": "Specifies the IPv4 address mask of a PCP server.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "mask-len",
            "Info": "Specifies the mask length of a PCP server IPv4 address.\nThe value is an integer ranging from 1 to 32."
        },
        {
            "Parameters": "ipv4 ipv4-address",
            "Info": "Specifies the IPv4 address of a PCP server.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nat instance nat1 id 1",
            "[*HUAWEI-nat-instance-nat1] pcp server ipv4 10.10.10.10 24"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA CGN device (PCP server) must be assigned an IP address so that a CPE (PCP client) can send a request to establish a PCP connection to the CGN device.\nPrecautions\nThe pcp server command is mutually exclusive with interface addresses, tunnel addresses, PCP addresses in the other instances, the local global addresses of servers in a local instance, addresses in an address pool of a local instance, global addresses of servers in the other instances, addresses used in a DS-Lite instance, static-algorithm global addresses, addresses in NAT64 address pools and global address pools, interface addresses in the same network segment, addresses in address pools configured on a DHCP server and a BRAS, and NAT IP addresses in a dual-device scenario.\nA single PCP server IPv4 address can be specified in each NAT instance, and the specified address cannot be used as a physical interface address, a loopback interface address, or an address in an address pool."
}