{
    "PageTitle": "pcp server (DS-Lite instance view)",
    "FuncDef": "The pcp server command specifies a PCP server address in a specific DS-Lite instance.\nThe undo pcp server command deletes the PCP server address configured in the specific DS-Lite instance.\nBy default, no PCP server address is specified for a DS-Lite instance.",
    "CLIs": [
        "pcp server ipv4 <ipv4-address> { <mask> | <mask-len> }",
        "pcp server ipv6 <ipv6-address> <prefix-length>",
        "undo pcp server ipv4 <ipv4-address> { <mask> | <mask-len> }",
        "undo pcp server ipv6 <ipv6-address> <prefix-length>",
        "undo pcp server { ipv4 | ipv6 }"
    ],
    "ParentView": [
        "DS-Lite instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "mask",
            "Info": "Specifies the IPv4 address mask of a PCP server.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "mask-len",
            "Info": "Specifies the mask length of an IPv4 address of a PCP server.\nThe value is an integer ranging from 1 to 32."
        },
        {
            "Parameters": "ipv6 ipv6-address",
            "Info": "Specifies the IPv6 address of a PCP server.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "prefix-length",
            "Info": "Specifies the mask length of an IPv6 address of a PCP server.\nThe value is an integer ranging from 1 to 128."
        },
        {
            "Parameters": "ipv4 ipv4-address",
            "Info": "Specifies the IPv4 address of a PCP server.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ds-lite instance dslite1 id 1",
            "[*HUAWEI-ds-lite-instance-dslite1] pcp server ipv4 10.10.10.10 24"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ds-lite instance dslite1 id 1",
            "[*HUAWEI-ds-lite-instance-dslite1] pcp server ipv6 2001:db8::1:1 20"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA CGN device (PCP server) must be assigned an IP address so that a CPE (PCP client) can send a request to establish a PCP connection to the CGN device. The destination IP address of a PCP request packet is the IP address of the PCP server. After a PCP server is configured on a CGN device, PCP request packets are directed to the CGN device for processing. In a DS-Lite instance, to specify an IP address for a PCP server, run the pcp server command. A PCP server can also use a local IP address, not a configured one.\nPrecautions\nThe pcp server command is mutually exclusive with the addresses in a DS-Lite common address pool, interface addresses, global address of a DS-Lite server, and addresses in a BAS IP address pool.\nSetting an IP address for a PCP server is optional. Alternatively, the local IP address of a DS-Lite instance can be used as a PCP server address. Alternatively, configure a PCP server address as planned.\nA single PCP server IPv4 address and a single PCP server IPv6 address can be specified in each DS-Lite instance. The specified address cannot be used as a physical interface address, a loopback interface address, or an address in an address pool."
}