{
    "PageTitle": "te bandwidth change thresholds",
    "FuncDef": "The te bandwidth change thresholds command sets a link information flooding threshold for the ratio of the bandwidth occupied or released by TE tunnels to the remaining bandwidth in the TEDB.\nThe undo te bandwidth change thresholds command restores the default setting.\nBy default, if the ratio of the bandwidth occupied or released by TE tunnels to the remaining bandwidth in the TEDB is greater than or equal to 10%, an IGP floods link information, and CSPF updates the TEDB.",
    "CLIs": [
        "te bandwidth change thresholds up <percent-up>",
        "te bandwidth change thresholds down <percent-down>",
        "undo te bandwidth change thresholds up",
        "undo te bandwidth change thresholds up <percent-up>",
        "undo te bandwidth change thresholds down",
        "undo te bandwidth change thresholds down <percent-down>"
    ],
    "ParentView": [
        "40GE interface view",
        "IP-Trunk interface view",
        "GE electrical interface view",
        "Eth-Trunk sub-interface view",
        "GMPLS-UNI interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "POS sub-interface view",
        "GE sub-interface view",
        "XGE interface view",
        "25GE sub-interface view",
        "100GE interface view",
        "XGE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "25GE interface view",
        "100ge sub-interface view",
        "Eth-Trunk interface view",
        "40GE sub-interface view",
        "10GE sub-interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "down percent-down",
            "Info": "Sets a link information flooding threshold based on the ratio of the bandwidth occupied by TE tunnels to the remaining bandwidth in the TEDB. When the ratio of the bandwidth occupied by TE tunnels to the remaining link bandwidth in the TEDB is greater than or equal to the threshold, an IGP floods link information, and CSPF updates the TEDB.\nThe value is an integer ranging from 0 to 100, in percentage."
        },
        {
            "Parameters": "up percent-up",
            "Info": "Sets a link information flooding threshold based on the ratio of the bandwidth released by TE tunnels to the remaining bandwidth in the TEDB. When the ratio of the bandwidth released by TE tunnels to the remaining link bandwidth in the TEDB is greater than or equal to the threshold, an IGP floods link information, and CSPF updates the TEDB.\nThe value is an integer ranging from 0 to 100, in percentage. The default value is 10."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] te attribute enable",
            "[*HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] te bandwidth change thresholds up 25",
            "[*HUAWEI-GigabitEthernet1/0/0] te bandwidth change thresholds down 10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen the bandwidth changes slightly, flooding the link information wastes network resources. Assume that the bandwidth of a link is 100 Mbit/s. When 100 TE tunnels each with the bandwidth of 1 Mbit/s are set up, the system floods link information 100 times. If the flooding threshold is set to 10%, no bandwidth is flooded when the first nine tunnels 1 to 9 are created. After tunnel 10 is created, the bandwidth of tunnels 1 to 10 (10 Mbit/s in total) is flooded. Similarly, no bandwidth is flooded when tunnels 11 to 19 are created. After tunnel 20 is created, the bandwidth of tunnels 11 to 20 is flooded. The rest is done in the same manner.\nPrecautions\nMPLS TE-related commands apply only to MPLS TE and SR-MPLS TE. However, this command applies to SRv6 TE Policies, besides MPLS TE and SR-MPLS TE."
}