{
    "PageTitle": "te bandwidth dynamic (Interface view)",
    "FuncDef": "The te bandwidth dynamic command sets the proportion of the BC0 dynamic reservable bandwidth to the maximum reservable bandwidth.\nBy default, the proportion of the BC0 dynamic reservable bandwidth to the maximum reservable bandwidth is not set.",
    "CLIs": [
        "te bandwidth dynamic bc0 <bc0-bw-percentage>"
    ],
    "ParentView": [
        "40GE interface view",
        "IP-Trunk interface view",
        "GE electrical interface view",
        "Eth-Trunk sub-interface view",
        "GMPLS-UNI interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "POS sub-interface view",
        "GE sub-interface view",
        "XGE interface view",
        "25GE sub-interface view",
        "100GE interface view",
        "XGE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "25GE interface view",
        "100ge sub-interface view",
        "Eth-Trunk interface view",
        "40GE sub-interface view",
        "10GE sub-interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "bc0 bc0-bw-percentage",
            "Info": "Specifies the proportion of the BC0 dynamic reservable bandwidth to the maximum reservable bandwidth.\nThe value is an integer ranging from 1 to 100, in percentage."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] te attribute enable",
            "[*HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] te bandwidth max-reservable-bandwidth dynamic 80",
            "[*HUAWEI-GigabitEthernet1/0/0] te bandwidth dynamic bc0 60"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe reservable bandwidth values set on the interfaces along a TE tunnel are used by the TE module to check whether a link meets all bandwidth requirements. If a fixed bandwidth value is set on an interface and the available physical bandwidth changes on the interface, the TE module cannot correctly evaluate link bandwidth resources if the available bandwidth is different than the configured reservable bandwidth.\nTo address this issue, you can set the dynamic maximum reservable bandwidth and the BC0 dynamic reservable bandwidth. The maximum reservable bandwidth can be determined by setting the proportion of the maximum reservable bandwidth to the actual physical bandwidth. The BC0 dynamic reservable bandwidth can be determined by setting the proportion of the BC0 dynamic reservable bandwidth to the maximum reservable bandwidth. In this manner, the TE module can be aware of physical bandwidth changes on the interfaces along a tunnel.\nTo set the proportion of the BC0 dynamic reservable bandwidth to the maximum reservable bandwidth, run the te bandwidth dynamic command.\nPrerequisites\nEither of the following steps must be performed before you run the te bandwidth dynamic command:\nRun the te bandwidth max-reservable-bandwidth command to set the maximum reservable bandwidth.Run the te bandwidth max-reservable-bandwidth dynamic command to set the dynamic maximum reservable bandwidth.\n\nConfiguration Impact\nWhen both the te bandwidth dynamic command and the te bandwidth command are run in the same interface view, only the later executed command takes effect.\nPrecautions\nMPLS TE-related commands apply only to MPLS TE and SR-MPLS TE. However, this command applies to SRv6 TE Policies, besides MPLS TE and SR-MPLS TE."
}