{
    "PageTitle": "host-connectivity-verify",
    "FuncDef": "This command enables subscriber host connectivity verification on a specified SAP within a VPLS service. This tool will periodically scan all known hosts (from dhcp-state) and perform a UC ARP request. The subscriber host connectivity verification will maintain state (connected vs. not-connected) for all hosts.",
    "CLIs": [
        "host-connectivity-verify source-ip <ip-address> [ source-mac <ieee-address> ] [ interval <interval> ] [ action { remove | alarm } ] [ action remove | alarm ] [ timeout <retry-timeout> ] [ retry-count <count> ]"
    ],
    "ParentView": [
        "config>service>vpls",
        "config>service>vpls>sap"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address",
            "Info": "Specifies an unused IP address in the same network for generation of subscriber host connectivity verification packets."
        },
        {
            "Parameters": "ieee-address",
            "Info": "Specifies the source MAC address to be used for generation of subscriber host connectivity verification packets."
        },
        {
            "Parameters": "interval",
            "Info": "Specifies the interval, in minutes, which specifies the time interval in which all known sources should be verified. The actual rate is then dependent on number of known hosts and interval. Values-1 to 6000\nA zero value can be used by the SNMP agent to disable host-connectivity-verify.."
        },
        {
            "Parameters": "action {remove | alarm}",
            "Info": "Defines the action taken on a subscriber host connectivity verification failure for a specified host. The remove keyword raises an alarm and removes dhcp-state and releases all allocated resources (queues, table entries, and so on). DHCP release will be signaled to corresponding DHCP server. Static host will be never removed. The alarm keyword raises an alarm indicating that the host is disconnected."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: no host-connectivity-verify"
}