{
    "PageTitle": "qos",
    "FuncDef": "This command associates a Quality of Service (QoS) policy with an ingress Service Access Point (SAP).",
    "CLIs": [
        "qos <policy-id> [ shared-queuing | multipoint-shared ] [ fp-redirect-group <queue-group-name> instance <instance-id> ]",
        "no qos"
    ],
    "ParentView": [
        "config>service>vpls>sap>ingress"
    ],
    "ParaDef": [
        {
            "Parameters": "policy-id",
            "Info": "The ingress policy ID to associate with SAP or IP interface on ingress. The policy ID must already exist. Values-1 to 65535."
        },
        {
            "Parameters": "shared-queuing",
            "Info": "This keyword can only be specified on SAP ingress. Specify the ingress shared queue policy used by this SAP. When the value of this object is null, the SAP will use individual ingress QoS queues, instead of the shared ones."
        },
        {
            "Parameters": "multipoint-shared",
            "Info": "This keyword can only be specified on SAP ingress. Multipoint shared queuing is a superset of shared queuing. When multipoint shared queuing keyword is set, as well as the unicast packets, multipoint packets also used shared queues. Values-Multipoint or not present. ParamDefault: Default- Present (the queue is created as non-multipoint)"
        },
        {
            "Parameters": "fp-redirect-group",
            "Info": "Creates an instance of a named queue group template on the ingress forwarding plane of a specified IOM/IMM/XMA. The queue-group-name and instance instance-id are mandatory parameters when executing the command. The named queue group template can contain only policers. If it contains queues, then the command will fail."
        },
        {
            "Parameters": "queue-group-name",
            "Info": "Specifies the name of the queue group template to be instantiated on the forwarding plane of the IOM/IMM/XMA, up to 32 characters in length. The queue-group-name must correspond to a valid ingress queue group template name, configured under config>qos>queue- group-templates."
        },
        {
            "Parameters": "instance-id",
            "Info": "Specifies the instance of the named queue group to be created on the IOM/IMMXMA ingress forwarding plane."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: none"
}