{
    "PageTitle": "rate",
    "FuncDef": "This command within the SAP ingress and egress policer-overrides contexts is used to override the sap-ingress and sap-egress QoS policy configured rate parameters for the specified policer-id.",
    "CLIs": [
        "rate { rate | max } [ cir { max | rate } ]"
    ],
    "ParentView": [
        "config>service>vpls>sap>egress>policer-override>policer",
        "config>service>vpls>sap>ingress>policer-override>policer"
    ],
    "ParaDef": [
        {
            "Parameters": "{rate | max}",
            "Info": "Specifying the keyword max or an explicit kilobits per second parameter directly following the rate override command is required and identifies the policer instance s metering rate for the PIR leaky bucket. The kilobits per second value must be expressed as an integer and defines the rate in kilobits per second. The integer value is multiplied by 1,000 to derive the actual rate in bits per second. When max is specified, the maximum policer rate used will be equal to the maximum capacity of the card on which the policer is configured. If the policer rate is set to a value larger than the maximum rate possible for the card, then the PIR used is equivalent to max. Values-1 to 2000000000, max."
        },
        {
            "Parameters": "cir {max | rate}",
            "Info": "The optional cir keyword is used to override the policy derived profiling rate of the policer. Specifying the keyword max or an explicit kilobits per second parameter directly following the cir keyword is required. The kilobits per second value must be expressed as an integer and defines the rate in kilobits per second. The integer value is multiplied by 1,000 to derive the actual rate in bits per second. When max is specified, the maximum policer rate used will be equal to the maximum capacity of the card on which the policer is configured. If the policer rate is set to a value larger than the maximum rate possible for the card, then the CIR used is equivalent to max. Values-0 to 2000000000, max."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}