{
    "PageTitle": "bras access remark mac",
    "FuncDef": "The bras access remark mac command marks a specified MAC address as an odd or even MAC address.\nThe undo bras access remark mac command cancels the configuration.\nBy default, no MAC address is marked.",
    "CLIs": [
        "bras access remark mac <mac-address> { odd-mac | even-mac }",
        "undo bras access remark mac [ <mac-address> [ odd-mac | even-mac ] ]"
    ],
    "ParentView": [
        "Remote backup profile view"
    ],
    "ParaDef": [
        {
            "Parameters": "mac-address",
            "Info": "Specifies a MAC address.\nThe value is a 12-digit hexadecimal number, in the format of H-H-H. Each H is 4 digits. If an H contains fewer than 4 digits, the left-most digits are padded with zeros. For example, e0 is displayed as 00e0. The MAC address cannot be set to FFFF-FFFF-FFFF."
        },
        {
            "Parameters": "odd-mac",
            "Info": "Marks a MAC address as an odd MAC address.\n-"
        },
        {
            "Parameters": "even-mac",
            "Info": "Marks a MAC address as an even MAC address.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[*HUAWEI] remote-backup-profile p1",
            "[*HUAWEI-rm-backup-prf-p1] bras access remark mac 0000-a0b0-0000 odd-mac"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nLoad balancing is implemented based on a hash algorithm. In a dual-device hot backup scenario where load balancing is performed based on odd and even MAC addresses, to mark a specified MAC address as an odd or even MAC address, run the bras access remark mac command so that the user with the MAC address can go online from the corresponding device.\nPrerequisites\nA hash algorithm has been configured in the remote backup profile view for load balancing based on odd and even MAC addresses in dual-device hot backup scenarios.\nThe configurations on the master and backup devices are the same.\nUsers have been logged out.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}