{
    "PageTitle": "frame-route metric",
    "FuncDef": "The frame-route metric command configures a cost value for user routes in a remote backup profile (RBP) on the master device.\nThe undo frame-route metric command deletes the cost value configured for user routes in an RBP on the master device.\nBy default, no cost value is configured for user routes in an RBP on the master device.",
    "CLIs": [
        "frame-route metric <metric-num>",
        "undo frame-route metric <metric-num>"
    ],
    "ParentView": [
        "Remote backup profile view"
    ],
    "ParaDef": [
        {
            "Parameters": "metric-num",
            "Info": "Specifies a cost value for user routes in an RBP on the master device. A smaller value indicates a higher priority.\nThe value is an integer ranging from 1 to 65535."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] remote-backup-profile hello",
            "[*HUAWEI-rm-backup-prf-hello] service-type bras",
            "[*HUAWEI-rm-backup-prf-hello] commit",
            "[~HUAWEI-rm-backup-prf-hello] frame-route metric 3"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn RUI scenarios, a remote backup service (RBS) cannot be used to control gateway routes if no address pool is configured. To control the cost value of user routes, run the frame-route metric command.\nThe impact of this command on the cost value depends on the type of user routes.\nIf user routes are framed IPv4 or IPv6 routes:Master device: The cost value is the sum of the cost value delivered by a RADIUS server and the cost value configured using the frame-route metric command.Backup device: The cost value is 65535.If user routes are network segment routes used when a RADIUS server delivers masks:Master device: The cost value is the cost value configured using the frame-route metric command.Backup device: The cost value is 65535.\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}