{
    "PageTitle": "ipv6-pool(Remote backup profile view)",
    "FuncDef": "The ipv6-pool command binds an IPv6 address pool to an RBP.\nThe undo ipv6-pool command unbinds an IPv6 address pool from an RBP.\nBy default, no IPv6 address pool is bound to an RBP.",
    "CLIs": [
        "ipv6-pool <pool-name>",
        "undo ipv6-pool <pool-name>"
    ],
    "ParentView": [
        "Remote backup profile view"
    ],
    "ParaDef": [
        {
            "Parameters": "pool-name",
            "Info": "Specifies the name of an IPv6 address pool.\nThe value is a string of 1 to 32 case-insensitive characters, spaces not supported. The value can be any combination of letters, digits, dots (.), hyphens (-), and underscores (_)."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 pool test bas remote",
            "[~HUAWEI-ipv6-pool-test] quit",
            "[~HUAWEI] ipv6 prefix test local",
            "[~HUAWEI-ipv6-pool-test] quit",
            "[~HUAWEI] ipv6 pool test bas remote",
            "[~HUAWEI-ipv6-pool-test] prefix test",
            "[~HUAWEI-ipv6-pool-test] quit",
            "[~HUAWEI] remote-backup-profile-rui",
            "[*HUAWEI-rm-backup-prf-rui] commit",
            "[~HUAWEI-rm-backup-prf-rui] ipv6-pool test"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn a dual device hot backup scenario, an exclusively used address pool is bound to an RBP backup group. To control network-to-user traffic, user packets must be properly forwarded on the network so that the device through which users go online forwards the traffic to the users properly. An exclusively used address pool allows a network segment route to be advertised to the network using an IGP. In this mode, the master and backup devices cannot advertise the same network segment route at the same time. Advertising the same network segment route will cause load balancing on the network and network-to-user traffic to be forwarded incorrectly.\nTo resolve this problem, run the ipv6-pool command to achieve the RBP controls the advertisement and withdrawal of network segment routes of the address pool. When the RBP is in the master state, the RBP advertises network segment routes of the address pool to the network side. When the RBP is not in the master state, the RBP withdraws network segment routes of the address pool. In this way, correct routes can be learned on the network side to guide the proper forwarding of network-to-user traffic.\nPrerequisites\nEnsure that the following operations have been performed:\nAn IPv6 address pool (the destination address pool) has been created using the ipv6 poolbas local command in the system view. An IPv6 prefix pool has been bound to the IPv6 address pool using the prefix / command in the IPv6 address pool view.Prefixes have been configured in the IPv6 prefix pool using the prefix command in the IPv6 prefix pool view.\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}