{
    "PageTitle": "l2tp protect-tunnel disable",
    "FuncDef": "The l2tp protect-tunnel disable command disables the L2TP traffic protection mechanism so that traffic during a master/backup switchover is not forwarded to a backup device through an L2TP protection tunnel. After the L2TP traffic protection mechanism is disabled, packets are discarded until the switchover is complete. The configuration file information is displayed after the command is run.\nThe undo l2tp protect-tunnel disable command restores the default configuration.\nBy default, the L2TP traffic protection mechanism is enabled, and no configuration file information is displayed. Traffic during a master/backup switchover is forwarded to a backup device through an L2TP protection tunnel, and no packets are discarded.",
    "CLIs": [
        "l2tp protect-tunnel disable",
        "undo l2tp protect-tunnel disable"
    ],
    "ParentView": [
        "Remote backup service view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] remote-backup-service ab",
            "[*HUAWEI-rm-backup-srv-ab] commit",
            "[~HUAWEI-rm-backup-srv-ab] l2tp protect-tunnel disable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the bandwidth of the protection tunnel is sufficient, you do not need to run this command. If the bandwidth of the protection tunnel is insufficient, you can run the l2tp protect-tunnel disable command to disable the L2TP traffic protection mechanism so that traffic during a master/backup switchover is not forwarded to a backup device through the L2TP protection tunnel. Before running this command, ensure that a master/backup device switchover can be triggered when a fault occurs on the device. Otherwise, L2TP traffic is interrupted and users are logged out.\nIf you do not want L2TP traffic to be forwarded through a hot backup protection tunnel, perform the following operations:\n Run the l2tp protect-tunnel disable command in the RBS view to prevent L2TP traffic from being forwarded through the protection tunnel. Monitor the network-side and user-side interfaces of the RBS tunnel to ensure that the priority of the LAC-side route can be reduced in the case of a user-side or network-side fault. After the fault is rectified, the route priority on the LAC side is restored. Configure a delay for the user-side interface to go up and monitor the network-side interface to ensure that the user-side interface can detect the fault when the network-side interface fails. When the user-side interface recovers, an RBP switchover is performed after a delay, reserving time for user information backup.\n\nPrerequisites\nL2TP LAC two-node hot backup has been configured.\nConfiguration Impact\nAfter the l2tp protect-tunnel disable command is run to disable the L2TP traffic protection mechanism, no L2TP protection tunnel is automatically established and traffic during a master/backup switchover is not forwarded to a backup device.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}