{
    "PageTitle": "load-balance hash-arithmetic (Remote backup profile view)",
    "FuncDef": "The load-balance hash-arithmetic command configures a hash algorithm on an interface board for load balancing based on odd and even MAC addresses in dual-device hot backup scenarios.\nThe undo load-balance hash-arithmetic command cancels the configuration.\nBy default, no hash algorithm for load balancing based on odd and even MAC addresses is configured.",
    "CLIs": [
        "load-balance hash-arithmetic { arithmetic1 | arithmetic2 } [ hash-fields mac offset <mac-offset> ]",
        "undo load-balance hash-arithmetic [ { arithmetic1 | arithmetic2 } [ hash-fields mac offset <mac-offset> ] ]"
    ],
    "ParentView": [
        "Remote backup profile view"
    ],
    "ParaDef": [
        {
            "Parameters": "arithmetic1",
            "Info": "The first hash-arithmetic.\n-"
        },
        {
            "Parameters": "arithmetic2",
            "Info": "The second hash-arithmetic.\n-"
        },
        {
            "Parameters": "hash-fields",
            "Info": "Sets the hash fields of Load-balance.\n-"
        },
        {
            "Parameters": "mac",
            "Info": "Sets the hash fields of Load-balance of mac mode.\n-"
        },
        {
            "Parameters": "offset mac-offset",
            "Info": "Specifies the offset value of a user MAC address.\nThe value is an integer that ranges from 1 to 5 ."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[*HUAWEI] remote-backup-profile p1",
            "[*HUAWEI-rm-backup-prf-p1] load-balance hash-arithmetic arithmetic1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nLoad balancing is implemented based on a hash algorithm.\nIn dual-device hot backup scenarios where load balancing is performed based on odd and even MAC addresses, if terminals with odd and even MAC addresses are unevenly distributed on the master and backup devices, run the load-balance hash-arithmetic command to enable a specified hash algorithm so that users can be evenly distributed on the master and backup devices.\nBecause this algorithm performs load balancing based on MAC addresses, traffic cannot be evenly distributed for users with one-to-many mapping between one MAC address and multiple sessions enabled.\nPrerequisites\nThe configurations on the master and backup devices are the same.\nUsers have been logged out.\nConfiguration Impact\nIf the load-balance hash-arithmetic command is run more than once, the latest configuration overrides the previous one. After the command is run, hash calculation is performed based on the new hash algorithm."
}