{
    "PageTitle": "peer-backup route-cost",
    "FuncDef": "The peer-backup route-cost auto-advertising command enables a device to automatically control a route's cost preference when the address pool UNR or the route to a loopback interface is generated.\nThe undo peer-backup route-cost command disables a device from automatically controlling a route's cost preference when the address pool UNR or the route to a loopback interface is generated.\nBy default, this function is disabled.",
    "CLIs": [
        "peer-backup route-cost auto-advertising [ exclude loopback ]",
        "undo peer-backup route-cost"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] peer-backup route-cost auto-advertising"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] peer-backup route-cost auto-advertising exclude loopback"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe peer-backup route-cost auto-advertising command enables a device to automatically control a route's cost preference when the address pool UNR or the route to a loopback interface is generated.\nThe peer-backup route-cost auto-advertising exclude loopback command enables a device to automatically control a route's cost preference when the address pool UNR is generated and disables a device from automatically controlling a route's cost preference when the route to a loopback interface is generated.\nIn the dual-system hot backup scenario, if two BRASs work in load balancing mode, each BRAS is configured with two address pools. One is the primary address pool and the other is the secondary address pool. The primary address pool is on the master BRAS, and the secondary address pool is on the slave BRAS. The cost value of the primary address pool must be smaller than that of the secondary address pool on the same BRAS. The cost values can be set in a routing policy, which allows the UNR of the primary address pool to have higher route precedence than that of the secondary address pool.\nWhen BRAS L2TP dual-system hot backup is configured, a LAC uses a loopback interface to establish an L2TP tunnel with LNS. If two LACs work in load balancing mode, they are configured with different loopback IP addresses. The master LAC advertises the cost value of the route to the loopback IP address is smaller than that the slave LAC advertises, allowing the route to the loopback address on the master LAC to be preferentially used.\nThis manual control requires more complex deployment. If a fault occurs when a master/slave LAC switchover is implemented, the route to the loopback IP address cannot be automatically advertised after the BRAS recovers, causing the link reliability to deteriorate.\nThe peer-backup route-cost command enables default cost value to control route preference. Cost values can be specified when the address pool is bound to the RBS, or you can use the default value. If dual-system hot backup is configured on BRASs, a routing protocol imports UNRs and trusts UNR preference values. This allows the network segment route of the primary address pool to have higher route precedence than that of the secondary address pool. If dual-system hot backup is configured on L2TP, a routing protocol imports routes to loopback IP addresses of the LACs and trusts its preference values. This allows the route to the loopback IP address of the master LAC to have higher route precedence than that to the loopback IP address of the slave LAC.\nIn non-L2TP hot backup scenarios, when exclude loopback is specified, the device controls the address pool UNR instead of the route to a loopback interface. In L2TP hot backup scenarios, exclude loopback cannot be configured and only the peer-backup route-cost auto-advertising command can be used.\nWhen the peer-backup route-cost command is run to enable default cost values to control route priority values, the rules for advertising IP address pool routes are as follows:\nThe cost value for advertising local/remote address pool routes is 10, and the cost value for advertising slave address pool routes is 20 (if a cost value is manually configured, address pool routes are advertised based on the configured cost value).If a fault occurs on the network side, the cost value for advertising local/remote address pool routes is changed to 65535, but the cost value for advertising slave address pool routes is still 20.\nWhen the undo peer-backup route-cost command is run to disable default cost values to control route priority values, the rules for advertising address pool routes are as follows:\nThe cost value for advertising local/remote address pool routes is 0, and the cost value for advertising slave address pool routes is 0 (if a cost value is manually configured, address pool routes are advertised based on the configured cost value).If a fault occurs on the network side, local/remote address pool routes are withdrawn, and the cost value for advertising slave address pool routes is still 0.\nWhen the default cost values are used to control the route priority function, address pool routes are not updated in real time. Route control takes effect only when an address pool is rebound to an RBS.\n\nFollow-up Procedure\nConfigure the device to inherit UNR cost values of UNR routes or loopback routes in a routing protocol.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nIf a cost value is specified or configured using a routing policy, its priority is higher than that inherited using the peer-backup route-cost command."
}