{
    "PageTitle": "peer-backup rui-trigger-speed",
    "FuncDef": "The peer-backup rui-trigger-speed command configures an upper threshold for the user access rate on the backup device in a dual-device hot backup scenario.\nThe undo peer-backup rui-trigger-speed command deletes the configuration of the upper threshold for the user access rate on the backup device in a dual-device hot backup scenario.\nThe default upper threshold for user access rate on the backup device is 128 users per second.",
    "CLIs": [
        "peer-backup rui-trigger-speed <trigger-speed>",
        "undo peer-backup rui-trigger-speed <trigger-speed>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "rui-trigger-speed trigger-speed",
            "Info": "Specifies an upper threshold for the user access rate on the backup device.\nThe value ranges from 0 to 400 users per second."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] peer-backup rui-trigger-speed 400"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn a dual-device hot backup scenario, after users access the master device, they will access the backup device. To change the upper threshold of the user access rate on the backup device, run the peer-backup rui-trigger-speed command.\nConfiguration Impact\nAfter this command is run, the user access rate on the backup device does not exceed the value. If the CPU usage is high, the system automatically reduces the access rate. If the CPU usage becomes normal, the system restores the original access rate.\nThis command causes the RBS's batch backup rate to be changed to the value plus 10.\nBatch backup achieves data synchronization between the master and backup devices, allowing the devices to periodically back up user information to each other.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nThis command must be run on both the master and backup devices. Otherwise, the user access rates on the master and backup devices are different, adversely affecting the batch backup function."
}