{
    "PageTitle": "protect redirect",
    "FuncDef": "The protect redirect command configures a protection path between the master and slave devices for network-side traffic with the IP redirection type (for public users).\nThe undo protect redirect command cancels the configured protection path with the IP redirection type (for public users).\nBy default, no protection path with the IP redirection type (for public users) is configured for network-side traffic.",
    "CLIs": [
        "protect redirect ip-nexthop <ip-address> interface { <interface-name> | <interface-type> <interface-num> }",
        "undo protect redirect"
    ],
    "ParentView": [
        "Remote backup service view"
    ],
    "ParaDef": [
        {
            "Parameters": "interface interface-type",
            "Info": "Specifies the interface type of an outbound interface.\n-"
        },
        {
            "Parameters": "interface interface-num",
            "Info": "Specifies the interface number of an outbound interface.\n-"
        },
        {
            "Parameters": "interface interface-name",
            "Info": "Specifies the interface name of an outbound interface.\n-"
        },
        {
            "Parameters": "ip-nexthop ip-address",
            "Info": "Indicates the next hop IP address.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] remote-backup-service rbs",
            "[*HUAWEI-rm-backup-srv-rbs] commit",
            "[*HUAWEI-rm-backup-srv-rbs] protect redirect ip-nexthop 2.2.2.2 interface GigabitEthernet 1/0/0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure a protection path between the master and slave devices for network-side traffic, run the protect redirect command. In case of an access-side link fault, the network-to-user traffic can be switched to the slave device over the protection path and then forwarded to users.\nIn the remote backup service view, a protection path of the IP redirection can be specified for public network users. IP redirection requires that the next hop of the protection path be reachable to the slave device.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}