{
    "PageTitle": "protect ip-vpn-instance",
    "FuncDef": "The protect ip-vpn-instance command configures a protection path between the master and slave devices for network-side traffic with the VPN type (for VPN users).\nThe undo protect ip-vpn-instance command cancels the configured protection path with the VPN type (for VPN users).\nBy default, no protection path with the VPN type (for VPN users) is configured for network-side traffic.",
    "CLIs": [
        "protect ip-vpn-instance <vpn-instance-name> peer-ip <ip-address> [ interface { <interface-name> | <interface-type> <interface-number> } ]",
        "undo protect ip-vpn-instance <vpn-instance-name>"
    ],
    "ParentView": [
        "Remote backup service view"
    ],
    "ParaDef": [
        {
            "Parameters": "peer-ip ip-address",
            "Info": "Specifies the peer IP address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "interface interface-type",
            "Info": "Specifies the interface type of an outbound interface.\n-"
        },
        {
            "Parameters": "interface interface-number",
            "Info": "Specifies the interface number of an outbound interface.\n-"
        },
        {
            "Parameters": "interface interface-name",
            "Info": "Specifies the interface name of an outbound interface.\n-"
        },
        {
            "Parameters": "ip-vpn-instance vpn-instance-name",
            "Info": "Specifies the name of an IPv4 VPN instance.\nThe value is a string of 1 to 31 characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] remote-backup-service rbs",
            "[*HUAWEI-rm-backup-srv-rbs] commit",
            "[*HUAWEI-rm-backup-srv-rbs] protect ip-vpn-instance vpna peer 2.2.2.2 interface GigabitEthernet 1/0/0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure a protection path between the master and slave devices for network-side traffic, run the protect command. In case of an access-side link fault, the network-to-user traffic can be switched to the slave device over the protection path and then forwarded to users.\nFor VPN users, MPLS + BGP needs to be deployed between the master and slave devices, and then an LDP path needs to be established for each VPN.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}