{
    "PageTitle": "rui-option",
    "FuncDef": "The rui-option command configures an option code carried in user packets when rui-slave type address pools are applying for an address to a remote DHCP server in a multi-device backup scenario.\nundo rui-option command restores the default configuration.\nThe rui-option dhcpv6 command configures an option code carried in user packets when rui-slave type IPv6 address pools are applying for an address to a remote DHCPv6 server in a multi-device backup scenario.\nundo rui-option dhcpv6 command restores the default configuration.\nBy default, the value of the option code is 151.",
    "CLIs": [
        "rui-option <option-code>",
        "rui-option dhcpv6 <dhcpv6option-code>",
        "undo rui-option",
        "undo rui-option dhcpv6"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "option-code",
            "Info": "Specifies the value of the IPv4 option code.\nThe value is an integer ranging from 151 to 174."
        },
        {
            "Parameters": "dhcpv6 dhcpv6option-code",
            "Info": "Specifies the value of the IPv6 option code.\nThe value is an integer ranging from 151 to 174."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] rui-option dhcpv6 174"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] rui-option 174"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn a multi-device backup scenario, the option code needs to be carried in user packets when rui-slave type IPv4 address pools or IPv6 address pools are applying for an address to a remote DHCP server or a remote DHCPv6 server. This command specifies the value of the option code.\nThe default value of rui-option command is option code 151. If 151 has already been used by the option code command, the default value of this command cannot be used, and the rui-option command needs to be run to change the specified option code.The default value of rui-option dhcpv6 command is option code 151. If 151 has already been used by the option code command, the default value of this command cannot be used, and the rui-option dhcpv6 command needs to be run to change the specified option code.\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nIn a multi-device backup scenario, both master and slave devices that use rui-slave type address pools need to be configured with the same option code, which must be different from that configured in the option code command.In a multi-device backup scenario, both master and slave devices that use rui-slave type IPv6 address pools need to be configured with the same option code, which must be different from that configured in the option code command."
}