{
    "PageTitle": "traffic backup",
    "FuncDef": "The traffic backup command sets the interval for backing up access user traffic or the traffic threshold.\nThe undo traffic backup command cancels the setting.\nBy default, the interval for backing up traffic is 10 minutes, and the traffic threshold is 50 MB.",
    "CLIs": [
        "traffic backup { interval <interval-value> | threshold <threshold-value> }",
        "traffic backup interval <interval-value> threshold <threshold-value>",
        "traffic backup threshold <threshold-value> interval <interval-value>",
        "undo traffic backup"
    ],
    "ParentView": [
        "Remote backup profile view"
    ],
    "ParaDef": [
        {
            "Parameters": "interval interval-value",
            "Info": "Specifies the interval for backing up traffic.\nThe value is an integer ranging from 0 to 1440, in minutes."
        },
        {
            "Parameters": "threshold threshold-value",
            "Info": "Specifies the traffic threshold.\nThe value is an integer ranging from 0 to 100000, in MB."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] remote-backup-profile kouki",
            "[*HUAWEI-rm-backup-prf-kouki] commit",
            "[~HUAWEI-rm-backup-prf-kouki] traffic backup interval 10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThis command sets the interval for backing up access user traffic or the traffic threshold.\nPrerequisites\nBefore using this command, you need to enable remote backup of the BRAS service.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nNote the following notices:\nIf only the interval for backing up traffic is set, online user traffic on the remote backup profile is backed up at the specified interval.If only the traffic threshold is set, user traffic is backed up only when the traffic volume reaches the threshold.If both the interval for backing up traffic and the traffic threshold are set, the user traffic is backed up at the specified interval or when the traffic volume reaches the threshold.If both the interval for backing up traffic and the traffic threshold are set to 0, the user traffic is not backed up."
}