{
    "PageTitle": "address",
    "FuncDef": "This command assigns an IPv6 address to the interface. Up to 16 total primary and secondary IPv4 and IPv6 addresses can be assigned to network interfaces, and up to 256 to access interfaces.",
    "CLIs": [
        "address { <ipv6-address/prefix-length> } [ eui-64 ] [ track-srrp <srrp-instance> ] [ modifier <cga-modifier> ] [ dad-disable ] [ primary-preference <primary-preference> ]",
        "no address { <ipv6-address/prefix-length> }"
    ],
    "ParentView": [
        "config>router>if>ipv6"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv6-address/prefix-length",
            "Info": "Specifies the IPv6 address on the interface. Values-ipv6-address/prefix:| ipv6-address|x:x:x:x:x:x:x:x (eight 16-bit pieces), ||x:x:x:x:x:x:d.d.d.d, ||x [0 to FFFF]H, ||d [0 to 255]D, |prefix-length|1 to 128."
        },
        {
            "Parameters": "eui-64",
            "Info": "When the eui-64 keyword is specified, a complete IPv6 address from the supplied prefix and 64-bit interface identifier is formed. The 64-bit interface identifier is derived from MAC address on Ethernet interfaces. For interfaces without a MAC address, for example POS interfaces, the Base MAC address of the chassis should be used."
        },
        {
            "Parameters": "track-srrp",
            "Info": "Specifies the SRRP instance ID that this interface route needs to track."
        },
        {
            "Parameters": "srrp-instance",
            "Info": "Indicates the unique identifier of the tracked SRRP instance. Values-1 to 4294967295."
        },
        {
            "Parameters": "modifier cga-modifier",
            "Info": "Sets the modifier for cryptographically-assigned addresses. Values-0x0..0xFFFFFFFF...(32 hex nibbles)."
        },
        {
            "Parameters": "dad-disable",
            "Info": "Disables Duplicate Address Detection (DAD) and sets the address to preferred, even if there is a duplicated address."
        },
        {
            "Parameters": "primary-preference primary-preference",
            "Info": "Specifies a primary-preference index to an IPv6 address of the interface to enforce the order in which the address is used by control plane protocols and applications which require a fixed address of the interface. These include LDP and Segment Routing. Values-1 to 4294967295."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}