{
    "PageTitle": "aggregate",
    "FuncDef": "This command creates an aggregate route.",
    "CLIs": [
        "aggregate <ip-prefix/ip-prefix-length> [ summary-only ] [ as-set ] [ aggregator <as-number:ip-address> ] [ black-hole [ generate-icmp ] ] [ community <comm-id> [ <comm-id> <...> <(> <up> <to> <12> <max> <)> ] ] [ description <description> ] [ local-preference <local-pref> ]",
        "aggregate <ip-prefix/ip-prefix-length> [ summary-only ] [ as-set ] [ aggregator <as-number:ip-address> ] [ community <comm-id> [ <comm-id> <...> <(> <up> <to> <12> <max> <)> ] ] [ indirect <ip-address> ] [ description <description> ] [ local-preference <local-pref> ]",
        "no aggregate <ip-prefix/ip-prefix-length>"
    ],
    "ParentView": [
        "config>router"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-prefix",
            "Info": "The destination address of the aggregate route in dotted decimal notation. Values-The following values apply to the 7750 SR and 7950 XRS:."
        },
        {
            "Parameters": "ip-prefix-length",
            "Info": "The mask associated with the network address expressed as a mask length. Values-0 to 32."
        },
        {
            "Parameters": "summary-only",
            "Info": "This optional parameter suppresses advertisement of more specific component routes for the aggregate."
        },
        {
            "Parameters": "as-set",
            "Info": "This optional parameter is only applicable to BGP and creates an aggregate where the path advertised for this route will be an AS_SET consisting of all elements contained in all paths that are being summarized. Use this feature carefully as it can increase the amount of route churn due to best path changes."
        },
        {
            "Parameters": "aggregator as-number:ip-address",
            "Info": "This optional parameter specifies the BGP aggregator path attribute to the aggregate route. When configuring the aggregator, a two-octet AS number used to form the aggregate route must be entered, followed by the IP address of the BGP system that created the aggregate route."
        },
        {
            "Parameters": "community",
            "Info": "This configuration option associates a BGP community with the aggregate route. The community can be matched in route policies and is automatically added to BGP routes exported from the aggregate route."
        },
        {
            "Parameters": "comm-id",
            "Info": "Specifies a BGP community value, up to 72 characters. A maximum of twelve comm-ids can be specified in a single statement. Values-[as-num:comm-val | well-known-comm | ext-comm | large-comm]."
        },
        {
            "Parameters": "black-hole",
            "Info": "This optional parameter installs the aggregate route, when activated, in the FIB with a black-hole next-hop, where packets matching this route are discarded."
        },
        {
            "Parameters": "generate-icmp",
            "Info": "Mandatory keyword to generate an ICMP."
        },
        {
            "Parameters": "indirect ip-address",
            "Info": "This configuration option specifies that the aggregate route should be installed in the FIB with a next-hop taken from the route used to forward packets to ip-address. Values-The following values apply to the 7750 SR and 7950 XRS:."
        },
        {
            "Parameters": "local-preference local-pref",
            "Info": "Specifies a BGP local-preference value with the aggregate route. The local-preference overrides the default local preference value of a BGP route originated by exporting the aggregate route. Values-0 to 4294967295."
        },
        {
            "Parameters": "description description",
            "Info": "Specifies a text description stored in the configuration file for a configuration context, up to 80 characters."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: No aggregate routes are defined."
}