{
    "PageTitle": "interface",
    "FuncDef": "This command creates a logical IP routing or unnumbered MPLS-TP interface. Once created, attributes like IP address, port, or system can be associated with the IP interface.",
    "CLIs": [
        "interface <interface-name> [ unnumbered-mpls-tp ]",
        "interface <interface-name> control-tunnel",
        "interface <interface-name> gmpls-loopback",
        "interface <interface-name> pdn",
        "no interface <interface-name>"
    ],
    "ParentView": [
        "config>router"
    ],
    "ParaDef": [
        {
            "Parameters": "interface-name",
            "Info": "The name of the IP interface. Interface names must be unique within the group of defined IP interfaces for config router interface and config service ies interface commands. An interface name cannot be in the form of an IP address. If the string contains special characters (#, $, spaces, and so on), the entire string must be enclosed within double quotes. Values-1 to 32 alphanumeric characters.."
        },
        {
            "Parameters": "unnumbered-mpls-tp",
            "Info": "Specifies that an interface is an unnumbered MPLS-TP. An unnumbered MPLS-TP interface is a special type of interface that is only intended for MPLS-TP LSPs. IP routing protocols are blocked on interfaces of this type. If an interface is configured as unnumbered-mpls-tp, then it can only be associated with an Ethernet port or VLAN, using the port command. A unicast, multicast, or broadcast remote MAC address can be configured using the static-arp command. Only static ARP is supported."
        },
        {
            "Parameters": "gmpls-loopback",
            "Info": "Specifies that the interface is a loopback interface for GMPLS control plane packets."
        },
        {
            "Parameters": "control-tunnel",
            "Info": "Specifies that the interface represents a loopback interface for a GRE tunnel to be used for the GMPLS IPCC."
        },
        {
            "Parameters": "pdn",
            "Info": "Specifies that the interface is a PDN."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: No interfaces or names are defined within the system."
}