{
    "PageTitle": "secondary",
    "FuncDef": "This command assigns additional IP addresses to the interface. Up to 16 total primary and secondary IPv4 and IPv6 addresses can be assigned to network interfaces, and up to 256 to access interfaces. Each address can be configured in an IP address, IP subnet, or broadcast address format.",
    "CLIs": [
        "secondary { <ip-address/mask> | <ip-address> <netmask> } [ broadcast { <all-ones> | <host-ones> } ] [ igp-inhibit ] [ track-srrp <srrp-instance> ]",
        "no secondary { <ip-address/mask> | <ip-address> <netmask> }"
    ],
    "ParentView": [
        "config>router>if"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address",
            "Info": "Specifies the IP address of the IP interface. The ip-address portion of the address command specifies the IP host address that will be used by the IP interface within the subnet. This address must be unique within the subnet and specified in dotted decimal notation. Values-1.0.0.0 to 223.255.255.255."
        },
        {
            "Parameters": "/",
            "Info": "The forward slash is a parameter delimiter that separates the ip-address portion of the IP address from the mask that defines the scope of the local subnet. No spaces are allowed between the ip-addr, the \"/\" and the mask-length parameter. If a forward slash does not immediately follow the ip-addr, a dotted decimal mask must follow the prefix."
        },
        {
            "Parameters": "mask-length",
            "Info": "Specifies the subnet mask length when the IP prefix is specified in CIDR notation. When the IP prefix is specified in CIDR notation, a forward slash (/) separates the ip-address from the mask-length parameter. The mask length parameter indicates the number of bits used for the network portion of the IP address; the remainder of the IP address is used to determine the host portion of the IP address. Allowed values are integers in the range 1 to 32. A mask length of 32 is reserved for system IP addresses. Values-1 to 32."
        },
        {
            "Parameters": "mask",
            "Info": "Specifies the subnet mask in dotted decimal notation. When the IP prefix is not specified in CIDR notation, a space separates the ip-addr from a traditional dotted decimal mask. The mask parameter indicates the complete mask that will be used in a logical  AND  function to derive the local subnet of the IP address. A mask of 255.255.255.255 is reserved for system IP addresses. Values-128.0.0.0 to 255.255.255.255."
        },
        {
            "Parameters": "broadcast{ all-ones | host-ones}",
            "Info": "The optional broadcast parameter overrides the default broadcast address used by the IP interface when sourcing IP broadcasts on the IP interface. If no broadcast format is specified for the IP address, the default value is host-ones, which indicates a subnet broadcast address. Use this parameter to change the broadcast address to all-ones or revert back to a broadcast address of host-ones."
        },
        {
            "Parameters": "igp-inhibit",
            "Info": "The secondary IP address should not be recognized as a local interface by the running IGP."
        },
        {
            "Parameters": "track-srrp",
            "Info": "Specifies the SRRP instance ID that this interface route needs to track."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}