{
    "PageTitle": "tos-marking-state",
    "FuncDef": "This command is used on a network IP interface to alter the default trusted state to a non-trusted state. When unset or reverted to the trusted default, the ToS field will not be remarked by egress network IP interfaces unless the egress network IP interface has the remark-trusted state set, in which case the egress network interface treats all IES and network IP interface as untrusted. \nWhen the ingress network IP interface is set to untrusted, all egress network IP interfaces will remark IP packets received on the network interface according to the egress marking definitions on each network interface. The egress network remarking rules also apply to the ToS field of IP packets routed using IGP shortcuts (tunneled to a remote next-hop). However, the tunnel QoS markings are always derived from the egress network QoS definitions.\nEgress marking and remarking is based on the internal forwarding class and profile state of the packet once it reaches the egress interface. The forwarding class is derived from ingress classification functions. The profile of a packet is either derived from ingress classification or ingress policing.\nThe default marking state for network IP interfaces is trusted. This is equivalent to declaring no tos-marking-state on the network IP interface. When undefined or set to tos-marking-state trusted, the trusted state of the interface will not be displayed when using show config or show info unless the detail parameter is given. Thesave configcommand will not store the default tos-marking-state trusted state for network IP interfaces unless the detail parameter is also specified.",
    "CLIs": [
        "tos-marking-state { trusted | untrusted }",
        "no tos-marking-state"
    ],
    "ParentView": [
        "config>router>if"
    ],
    "ParaDef": [
        {
            "Parameters": "trusted",
            "Info": "Specifies that the default prevents the ToS field to not be remarked by egress network IP interfaces unless the egress network IP interface has the remark-trusted state set."
        },
        {
            "Parameters": "untrusted",
            "Info": "Specifies that all egress network IP interfaces will remark IP packets received on the network interface according to the egress marking definitions on each network interface."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: tos-marking-state trusted"
}