{
    "PageTitle": "aps track bfd-session",
    "FuncDef": "The aps track bfd-session command binds an MC-LMSP group to a BFD session.\nThe undo aps track bfd-session command removes the binding between an MC-LMSP group and a BFD session.\nBy default, an MC-LMSP group is not bound to a BFD session.",
    "CLIs": [
        "aps track bfd-session session-name <bfd-session-name>",
        "undo aps track bfd-session"
    ],
    "ParentView": [
        "CPOS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "session-name bfd-session-name",
            "Info": "Specifies the name of a BFD session.\nThe name is a string of 1 to 64 case-insensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] controller cpos 1/0/0",
            "[~HUAWEI-Cpos1/0/0] aps group 1",
            "[*HUAWEI-Cpos1/0/0] aps track bfd-session session-name test-bfd"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo monitor an MC-LMSP group, configure a BFD session to monitor an mPW between the working and protection interfaces on the AC side, and bind the MC-LMSP group to another BFD session. If faults occur, the working and protection devices can use BFD to notify each other of the faults and implement rapid traffic switchovers between the working and protection devices.\nPrerequisites\nAn MC-LMSP group has been configured using the aps group group-id command.\nFor example, BFD is configured to track a working interface. This configuration is similar to the configuration for BFD to track a protection interface. The configuration procedure is as follows:\nEstablish an mPW between MC-LMSP-enabled devices.Run the bfd bfd-name bind pw command on the device with a working interface to configure a BFD session to monitor the mPW and bind the BFD session to the working interface.Run the bfd bfd-name bind pw command on the device with a protection interface to specify the interface board where the BFD session is configured to monitor the mPW.Run the aps track bfd-session command on the device with the protection interface to bind the interface to the BFD session.\n\nPrecautions\nThe aps track bfd-session command can only be used on the working and protection interfaces of an MC-LMSP group.\nAfter the undo aps group command is run to delete the MC-LMSP group configuration, the binding between the MC-LMSP group and a BFD session is also deleted."
}