{
    "PageTitle": "aps protect",
    "FuncDef": "The aps protect command configures an interface as a protection interface in an LMSP group.\nThe undo aps protect command cancels the protection interface configuration.\nBy default, an interface does not function as a protection interface in an LMSP group.",
    "CLIs": [
        "aps protect <peer-ip> <local-ip>",
        "aps protect",
        "undo aps protect"
    ],
    "ParentView": [
        "CPOS interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "peer-ip",
            "Info": "Specifies the IP address of the Router on which the working interface in the same LMSP group as the protect group is located. The value is the IP address of a loopback interface on the Router.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "local-ip",
            "Info": "Specifies the IP address of a local Router. The value is the IP address of a loopback interface on the Router.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] controller cpos 1/0/0",
            "[~HUAWEI-Cpos1/0/0] aps group 1",
            "[*HUAWEI-Cpos1/0/0] aps working",
            "[*HUAWEI-Cpos1/0/0] commit",
            "[~HUAWEI-Cpos1/0/0] quit",
            "[~HUAWEI] controller cpos 2/0/0",
            "[~HUAWEI-Cpos2/0/0] aps group 1",
            "[*HUAWEI-Cpos2/0/0] aps protect"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure a protection interface in an LMSP group, run the aps protect command. A protection interface must be configured on each end of a protection link. If the working link fails, data is switched to the protection link.\nPrerequisites\nBefore you configure an interface as the protection interface of an LMSP group, add the interface to the LMSP group.\nIf single-chassis LMSP is used, you must specify the working interface for an LMSP group before configuring an interface as the protection interface of the LMSP group.\nPrecautions\nIn the case of single-chassis LMSP, particularly when the working and protection interfaces of an LMSP group are on the same Router, you do not need to configure or when specifying the protection interface for an LMSP group.\nThe POS interface view does not support the peer-ip or local-ip parameter.\nA global IMA-group interface cannot be configured in an LMSP group working in 1+1 unidirectional mode or dual-system mode. An LMSP protection interface, however, is by default working in 1+1 unidirectional mode. If a global IMA-group interface is configured on a trunk interface to which an LMSP group member interface belongs, remove the LMSP group member interface from the trunk interface."
}