{
    "PageTitle": "active port-basic",
    "FuncDef": "The active port-basic command activates interface-specific basic hardware licenses.\nThe undo active port-basic command deactivates interface-specific basic hardware licenses.\nBy default, the interface-specific basic hardware licenses is deactivate.",
    "CLIs": [
        "active port-basic slot <slotid> card <cardid> port <port-list>",
        "undo active port-basic slot <slotid> card <cardid> [ port <port-list> ]"
    ],
    "ParentView": [
        "License view"
    ],
    "ParaDef": [
        {
            "Parameters": "card cardid",
            "Info": "Specifies the ID of a controlled subcard.\nThe value is an integer that ranges from 0 to 4294967295."
        },
        {
            "Parameters": "port port-list",
            "Info": "Specifies the port list mapped to the license type on a subcard.\nThe value is a string, the length of the string ranges from 1 to 256."
        },
        {
            "Parameters": "slot slotid",
            "Info": "Specifies the slot ID of a controlled board.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] license",
            "[*HUAWEI-license] active port-basic slot 1 card 0 port 0-8",
            "Info: Use the display command to check the activation status of the port-basic licenses after committing the command."
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo properly use interfaces, you must activate interface-specific basic hardware licenses. If the licenses are not activated, the interface bandwidth is limited, and the enhanced hardware licenses of other services fail to be activated. To activate interface-specific basic hardware licenses, run the active port-basic command. You can deactivate interface-specific basic hardware licenses either for a single interface or for a batch of interfaces on a specified subcard.\nPrecautions\nThis command applies only to boards in CM mode.This command cannot be run if the specified board/subcard is offline.This command applies only to the Admin-VS.For E1 subcards in CM mode, if the basic hardware license is not activated or no resource is available after the activation, the channel-set or using e1 command is limited to create the serial interface. When you run this command to activate basic hardware licenses on the interface and the system has available basic hardware licenses on the interface, the basic hardware status of the interface can be changed to activated and the channel-set or using e1 command can be executed normally.\n\nThis command applies only to boards in CM mode.This command cannot be run if the specified board/subcard is offline.This command applies only to the Admin-VS.For E1 subcards in CM mode, if the basic hardware license is not activated or no resource is available after the activation, the channel-set or using e1 command is limited to create the serial interface. When you run this command to activate basic hardware licenses on the interface and the system has available basic hardware licenses on the interface, the basic hardware status of the interface can be changed to activated and the channel-set or using e1 command can be executed normally.In cloud mode, the activated hardware RTU is bound to the hardware and cannot be released for use with other boards. Exercise caution when activating the hardware RTU to prevent the RTU from being bound by mistake.In cloud mode, you can run the display license resource usage rtu-extend-information command to view detailed authorization information about the bound hardware RTU control item."
}