{
    "PageTitle": "check patch",
    "FuncDef": "The check module command checks module package integrity.\nThe check patch command checks the integrity of a patch package.",
    "CLIs": [
        "check patch { <file-name> | startup }",
        "check module { <file-name> | startup }"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "file-name",
            "Info": "Specifies the name of the patch package to be checked.\nThe value is a string of 5 to 127 case-sensitive characters without spaces. The value of the patch name is a string of 5 to 63 characters."
        },
        {
            "Parameters": "startup",
            "Info": "Checks the integrity of the patch package used for the next startup.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> check patch xxxx.PAT",
            "Warning: Patch package verification consumes system CPU resources. Continue?[Y/N]: Y"
        ],
        [
            "<HUAWEI> check patch startup",
            "Warning: Patch package verification consumes system CPU resources. Continue? [Y/N]: Y"
        ],
        [
            "<HUAWEI> check module startup",
            "Error: No module exists."
        ],
        [
            "<HUAWEI> check module startup",
            "Warning: Package verification consumes system CPU resources. Continue? [Y/N]: Y",
            "Info: Prepare to check file cfcard:/$_install_mod/TEST.MOD, please wait...done.",
            "Info: Digital signature verification of the system module succeeded."
        ],
        [
            "<HUAWEI> check module TEST.MOD",
            "Warning: Package verification consumes system CPU resources. Continue? [Y/N]: Y",
            "Info: Prepare to check file cfcard:/$_install_mod/TEST.MOD, please wait...done. ",
            "Info: Digital signature verification of the system module succeeded."
        ],
        [
            "<HUAWEI> check module startup",
            "Warning: Package verification consumes system CPU resources. Continue? [Y/N]: Y",
            "Info: Prepare to check file cfcard:/$_install_mod/TEST.MOD, please wait...done.",
            "Info: The module is complete."
        ],
        [
            "<HUAWEI> check module TEST.MOD",
            "Warning: Package verification consumes system CPU resources. Continue? [Y/N]: Y",
            "Info: Prepare to check file cfcard:/$_install_mod/TEST.MOD, please wait...done.",
            "Info: The module is complete."
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBefore you load a module package, run the check module command to check whether the package is damaged. If the module package is not damaged, a message is displayed indicating that the package is complete. Otherwise, a message is displayed indicating that the package is incomplete. If the specified module package name does not exist, a message is displayed indicating that the package does not exist. If you specify the startup parameter without setting any next-startup module package, a message is displayed indicating that the required module package does not exist. In this case, run the install-module [ next-startup ] command to specify the next-startup module package.\nTo check whether the patch package is damaged before installing it, run the check patch command. If the patch package is not damaged, a message indicating that the patch package is complete is displayed. Otherwise, a message indicating that the patch package is incomplete is displayed. If the specified patch package does not exist, a message indicating that the patch package does not exist is displayed. If you specify the startup parameter without setting any next-startup patch file, a message is displayed indicating that the required patch file does not exist. In this case, run the startup patch all command to specify a next-startup patch package.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}