{
    "PageTitle": "software crl load",
    "FuncDef": "The software crl load command loads a digital signature certificate revocation list (CRL) file to the main control board. The command also supports verifying whether the digital signature of the big package or patch (module) package expires and echoes the prompt on the command line.",
    "CLIs": [
        "software crl load <crlName>"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "crlName",
            "Info": "Specifies a CRL name.\nThe value is a string of 5 to 63 case-insensitive characters, spaces not supported.\nThe file name is determined by the uploaded file and must be the same as the name of the uploaded file.\nThe CRL file must be in the home directory of the main control board."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> software crl load xxx.crl",
            "Info: Operating, please wait for a moment....",
            "Info: Succeeded in loading the CRL.",
            "Warning: The code signature verification of the VRPV800RXXCXX.cc package in the slot 17 failed."
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe lifetime of a certificate is limited. A certificate authority (CA) can revoke a certificate to shorten its lifetime. A CRL is a list of certificates that have been revoked, and therefore should not be relied upon. The CRL is issued by a CA. If a CA revokes a certificate, the key pair defined in the certificate can no longer be used even if the certificate does not expire. After a certificate in a CRL expires, the certificate is deleted from the CRL to shorten the CRL.\nIf an issued digital signature certificate needs to be revoked due to key disclosure or other reasons, a third-party tool can be used to mark the certificate invalid and add the certificate to a digital certificate CRL. To load the latest digital signature CRL file to a device, run the software crl load command.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}