{
    "PageTitle": "software-package",
    "FuncDef": "The integrate software-package command combines the original software package and source version package to generate an integrated software package.\nThe restore software-package command restores the integrated software package to the original software package.\nBy default, no integrated software package is generated.",
    "CLIs": [
        "integrate software-package <original-package> <integrated-package>",
        "restore software-package <integrated-package>"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "original-package",
            "Info": "Specifies the name of an original software package that is stored in the CF card.\nThe value is a string of 1 to 127 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "integrated-package",
            "Info": "Specifies the name of an integrated software package that is stored in the CF card.\nThe value is a string of 1 to 127 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> integrate software-package xxxx-v2.cc xxxx-v1.cc",
            "Info: During this operation, please do not operate the software package, otherwise it will cause failure.",
            "Caution!!! This operation will modify the contents of the software package, confirm to integrate! Continue? [Y/N]: Y",
            "Info: Prepare to integrate software package xxxx-v2.cc with xxxx-v1.cc, please wait ............",
            "Info: step result",
            "Info: Integrate software package passed!"
        ],
        [
            "<HUAWEI> restore software-package xxxx.cc",
            "Info: During this operation, please do not operate the software package, otherwise it will cause failure.",
            "Caution!!! This operation will restore the software package, confirm to restore! Continue? [Y/N]: Y",
            "Info: Prepare to restore software package xxxx.cc, please wait ............",
            "Info: step result",
            "Info: Restore software package passed!"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nDuring device upgrade, if the software package to be used is an original software package, run the integrate software-package command to combine the original software package and source version package to generate an integrated software package.\nTo restore an integrated software package to an original software package, run the restore software-package command."
}