{
    "PageTitle": "patch load (User view)",
    "FuncDef": "The patch load command loads a matching patch in the patch package to the current system.",
    "CLIs": [
        "patch load <file-name> all run"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "file-name",
            "Info": "Specifies the storage path and file name of a patch package. The path name is an absolute path name or a relative path name.\nThe value is a string of 5 to 127 case-sensitive characters without spaces. The value of the patch name is a string of 5 to 63 characters."
        },
        {
            "Parameters": "all",
            "Info": "Installs patches on all boards.\n-"
        },
        {
            "Parameters": "run",
            "Info": "Runs a patch after the patch is loaded.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> patch load XXX.PAT all run",
            "Info: Operating, please wait for a moment...",
            "****************************************************************************",
            "* Warning: Perform the following operations to deal with the cold patch.   * ",
            "****************************************************************************",
            "----------------------------------------",
            "Device    Type    Upgrade mode        ",
            "----------------------------------------",
            "17         MPU     reset board          ",
            "18         MPU     reset board          ",
            "----------------------------------------",
            "Info: Succeeded in running the patch."
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBefore loading a patch, the system resolves the patch package to check the validity of patch files and obtain the attributes of patch files.\nWhen loading a patch to the current system, the system searches the patch package for a matching patch file according to the attributes of the patch file.\nIf a matching patch file is found in the patch package, the system loads the patch.If no matching patch file is found in the patch package, the system does not load the patch.\n\nPrerequisites\nThe desired patch file has been uploaded to the main control board of the device.\nConfiguration Impact\nAfter the patch load command is run, the system loads all types of patches in the patch package.\nIf the parameter run is used in the patch load command, the system runs the patch file after loading it.\n\nPrecautions\nIf a patch operation is performed when the CPU or memory usage is too high, risks may exist.\nThe device is reset before a cold patch takes effect.\nThis command applies only to the admin VS but takes effect on all VSs."
}