{
    "PageTitle": "set flash-lock",
    "FuncDef": "The set flash-lock command enables secure startup.\nBy default, the secure startup function is disable.",
    "CLIs": [
        "set flash-lock immediately",
        "set flash-lock delay <day> days"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "delay",
            "Info": "Delay enable secure startup function.\n-"
        },
        {
            "Parameters": "day days",
            "Info": "Specifies the days after which secure startup is enabled.\nThe value is an integer ranging from 1 to 90, in days."
        },
        {
            "Parameters": "immediately",
            "Info": "Enables secure startup immediately.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] set flash-lock immediately"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] set flash-lock delay 90 days"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA communication device is composed of multiple embedded computer systems. The software of the device may be attacked by viruses, or may be tampered with or attacked by Trojan horses by means of vulnerabilities.\nRun the set flash-lock command to enable the secure startup function prohibits system startup when system software is damaged, improving system security and reliability.\nConfiguration Impact\nAfter secure startup is enabled, the device cannot be rolled back to any version that does not support secure startup.\nPrecautions\nTo enable the secure startup function immediately, run the set flash-lock immediately command. If this function is enabled and the rollback command is run to roll back the device version to one that does not support secure startup, the system displays a message indicating that the rollback operation fails, but the running services and functions are not affected.\nTo enable the secure startup function after a specified delay, run the set flash-lock delay days command. The delay can be set to a value ranging from 1 to 90, in days. Within the specified delay, the device version can be rolled back to one that does not support secure startup. After the specified delay, the secure startup function is automatically enabled on the device."
}