{
    "PageTitle": "startup downgrade",
    "FuncDef": "The startup downgrade command specifies a PAF or license file used when the system downgrades to the VRP V5 version at the next startup.\nBy default, the PAF file provided by the system is used.",
    "CLIs": [
        "startup downgrade { paf | license } { <file-name> | default }"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "paf",
            "Info": "Indicates that the system uses a PAF file to downgrade to the VRP V5 version.\n-"
        },
        {
            "Parameters": "license",
            "Info": "Indicates that the system uses a license file to downgrade to the VRP V5 version.\n-"
        },
        {
            "Parameters": "file-name",
            "Info": "Specifies the name of a PAF or license file.\nThe value is a string of 5 to 48 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "default",
            "Info": "Obtains the file in the downgrade package by default.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> startup downgrade paf paf_400k.bin.txt",
            "Warning: Check that the paf file version matches the version of the next-startup system software package.",
            "Info: Successfully set the startup paf file used for the downgrade."
        ],
        [
            "<HUAWEI> startup downgrade license license_400k.bin.txt",
            "Warning: Check that the license file version matches the version of the next-startup system software package.",
            "Info: Successfully set the startup license file used for the downgrade."
        ],
        [
            "<HUAWEI> startup downgrade paf default",
            "Warning: Check that the paf file version matches the version of the next-startup system software package.",
            "Info: Successfully set the startup paf file used for the downgrade.",
            "<HUAWEI> startup downgrade license default",
            "Warning: Check that the license file version matches the version of the next-startup system software package.",
            "Info: Successfully set the startup license file used for the downgrade."
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThis command is used only when you downgrade the system to the VRP V5 version. Because the VRP V8 version does not check validity of the VRP V5 PAF or license file, you must ensure that the configured VRP V5 PAF or license file matches the VRP V5 package used for downgrade.\nThis command supports only the default PAF and license file or the PAF and license file with the file name extension .txt, and such files must be saved in the system root directory. To view PAF and license file configurations, run the display startup command.\nPrerequisites\nYou have uploaded the PAF or license file to the directory on the CF card of the master main control boards.\nConfiguration Impact\nAfter this command is run, the device automatically synchronizes the PAF or license file to the slave main control boards.\nPrecautions\nThis command can only specify the same PAF file for all boards at the next startup.\nIn VS mode, this command is supported only by the admin VS."
}