{
    "PageTitle": "memory-usage reliability",
    "FuncDef": "The memory-usage reliability command sets thresholds for memory usage reliability.\nThe undo memory-usage reliability command restores the default thresholds for memory usage reliability.\nThe threshold value of notice is 85. The threshold value of overload is 90.",
    "CLIs": [
        "memory-usage reliability notice-threshold <notice-threshold-value> overload-threshold <overload-threshold-value> [ slot <slotId> ]",
        "undo memory-usage reliability [ notice-threshold <notice-threshold-value> overload-threshold <overload-threshold-value> ] [ slot <slotId> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "overload-threshold overload-threshold-value",
            "Info": "Memory reliability overload threshold.\nThe value is an integer that ranges from 86 to 100."
        },
        {
            "Parameters": "slot slotId",
            "Info": "slot id.\n-"
        },
        {
            "Parameters": "notice-threshold notice-threshold-value",
            "Info": "Memory reliability notice threshold.\nThe value is an integer that ranges from 85 to 99."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] memory-usage reliability switch on",
            "[~HUAWEI] memory-usage reliability notice-threshold 75 overload-threshold 88 slot 17"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter enabling memory usage reliability, run the memory-usage reliability command to set thresholds for memory usage reliability on a board. If the memory usage of the board exceeds the threshold (level-1 overload threshold) specified by notice-threshold notice-threshold-value, the system notifies the top 3 components of the process with the highest memory usage. If the memory usage of the board exceeds the threshold (level-2 overload threshold) specified by overload-threshold overload-threshold-value, the system notifies the process with the highest memory usage. If the process is PROTO1, the system resets PROTO1.\nPrerequisites\nMemory usage reliability has been enabled using the memory-usage reliability switch on command."
}