{
    "PageTitle": "startup system-software slave-board",
    "FuncDef": "The startup system-software slave-board command specifies the name of the system software file to be loaded for the next startup for the slave main control boards.\nBy default, no system software file to be used at the next startup is specified for the slave main control boards .",
    "CLIs": [
        "startup system-software <system-file> slave-board [ integrity ]"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "system-file",
            "Info": "Specify a system software name.\nThe value is a string of 4 to 127 characters."
        },
        {
            "Parameters": "slave-board",
            "Info": "Specifies the system file of the slave main control boards for the next startup. If not, it specifies the system file of the master main control boards for the next startup.\n-"
        },
        {
            "Parameters": "integrity",
            "Info": "Performs CRC check on all the contents of the system software to be started.If you do not specify this parameter, the device performs CRC check only on some contents of the system software, which cannot guarantee the correctness and integrity of system software completely.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> startup system-software software.cc slave-board"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the device needs to be automatically upgraded after restart, you can run the startup system-software slave-board command to specify the name of the system software file to be loaded for the next startup for the slave main control boards.\nConfiguration Impact\nIf the startup system-software slave-board command is used, the device automatically loads the system software file specified by system-file after being restarted.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nTo make the startup system-software command take effect, you need to restart the device. If you restart the device, the system will prompt you whether to save the current configurations, and you can respond as required.\nVersions of the system software on the master main control boards and slave main control boards must be the same. Otherwise, the device will go Down after being restarted.\nIf the module files to be dynamically loaded for the next startup has been configured on the current device, the startup system-software command will fail to configure the system software package of V800R300 or an earlier version as the next-startup system software package. In this case, run the uninstall-module next-startup all command to remove all module files and then the startup system-software command to configure the next-startup system software package.\nBefore you run the startup system-software command, run the check system-software command to check the specified target system software to ensure that the software is secure."
}