{
    "PageTitle": "license emergency",
    "FuncDef": "The license emergency command enables the emergency state of a global trotter license (GTL) file.",
    "CLIs": [
        "license emergency"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> license emergency",
            "Warning: This operation will cause LCS into the EMERGENCY state. Continue? [Y/N]:y",
            "Info: The emergency has been started. You can stop it only by activating a new license file."
        ]
    ],
    "ExtraInfo": "Usage Scenario\nSystem configurations are classified into maximum, authorized, and minimum configurations.\nMaximum configurations: The device runs with the maximum configurations of dynamic resources and the license-defined configurations of static resources and functions.Authorized configurations: Software functions and resources are configured based on contract commitments or authorization information. Authorized configurations depend on feature authorization in the GTL file.Minimum configurations: The device runs with default configurations when no active GTL file exists. The minimum configurations vary with devices.\nSystem configurations are classified to limit the bearer capability of the system in different operating status.\nTo enable the emergency state of a GTL file, run the license emergency command to release license control for the system so that the device can run with the maximum configurations of dynamic resources and the license-defined configurations of static resources and functions. When the validity period of the emergency state expires, dynamic resources are controlled by the GTL file again.\nThe emergency state of a GTL file protects users' services against disasters, such as an earthquake.\nAfter you enable the emergency state, pay attention to the following items:\nThe emergency state cannot be manually disabled.For each device version, the emergency state can be enabled only three times, with a 7-day validity period each time.The emergency state of a GTL file can be re-enabled only when the previous emergency state has expired or on the last day before the previous emergency state expires.\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}