{
    "PageTitle": "startup system-software (User view)",
    "FuncDef": "The startup system-software command specifies the name of the system software file to be loaded for the next startup.\nBy default, no system software file to be used at the next startup is specified.",
    "CLIs": [
        "startup system-software <name> [ all | slot <slot-id> ] [ integrity ]"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "all",
            "Info": "Specifies the system file of all main control boards for the next startup. If not, it specifies the system file of the master main control boards for the next startup.\n-"
        },
        {
            "Parameters": "slot slot-id",
            "Info": "Specifies the system file of all main control boards with specified slot number for the next startup. If not, it specifies the system file of the master main control boards for the next startup.\n-"
        },
        {
            "Parameters": "integrity",
            "Info": "Performs CRC check on all the contents of the system software to be started.If you do not specify this parameter, the device performs CRC check only on some contents of the system software, which cannot guarantee the correctness and integrity of system software completely.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> startup system-software software.cc"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the device needs to be automatically upgraded after restart, you can run the startup system-software command to specify the name of the system software file to be loaded for the next startup.\nConfiguration Impact\nIf the startup system-software command is used, the device automatically loads the system software file specified by system-file after being restarted.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nTo make the startup system-software command take effect, you need to restart the device. If you restart the device, the system will prompt you whether to save the current configurations, and you can respond as required.\nVersions of the system software on the master main control boards and slave main control boards must be the same. Otherwise, the device will go Down after being restarted.\nBefore you run the startup system-software command, run the check system-software command to check the specified target system software to ensure that the software is secure."
}