{
    "PageTitle": "set tpm password",
    "FuncDef": "The set tpm password command sets a password for the trusted platform module (TPM).\nThe default password of tpm is random value.",
    "CLIs": [
        "set tpm password { slot <slotId> | all }"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "slot slotId",
            "Info": "Specifies a slot ID.\n-"
        },
        {
            "Parameters": "all",
            "Info": "Indicates all boards.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> set tpm password all",
            "Please configure the authentication password first.",
            " Enter authentication password:",
            "Please configure the password (8-32)",
            "Enter Password:",
            "Confirm Password:",
            "Info: Successfully set the TPM password of the board in slot 17."
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo improve security, run the set tpm password command to change the TPM password.If the device needs to be rolled back to a version that does not support the configuration of the TPM password, run the set tpm password command to restore the preset TPM password before the rollback.\nImplementation Procedure\nWhen you run the set tpm password command to set a new password, you are prompted to input the original password first. After you input the correct original password, the system prompts you to input the new password twice. The new command can be set only when the two new passwords that you input are the same.\nPrecautions\nThe new password set using the set tpm password command contains 8 to 32 characters and must contain at least two types of the following characters: lowercase letters, uppercase letters, digits, and special characters.\nIf the device needs to be rolled back to a version that does not support the configuration of the TPM password, run the set tpm password command to restore the preset TPM password to Changeme_123 before the rollback. Otherwise, the RA function may be unavailable."
}