{
    "PageTitle": "issu check",
    "FuncDef": "The issu check command is used to check the system before an ISSU. The check result determines the ISSU method.",
    "CLIs": [
        "issu check <system-file> [ { patch <patch-name> | paf { <paf-file> | default } } * ]"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "system-file",
            "Info": "The name of system software to be upgraded.\nThe value is a string of 4 to 127 case-sensitive characters, with spaces not supported."
        },
        {
            "Parameters": "patch patch-name",
            "Info": "Specifies the path name and name of the patch package.\nThe value is a string of 5 to 63 case-sensitive characters, with spaces not supported."
        },
        {
            "Parameters": "paf paf-file",
            "Info": "Specifies the paf file.\nThe value is a string of 5 to 63 case-sensitive characters, with spaces not supported."
        },
        {
            "Parameters": "default",
            "Info": "Specifies the default paf file.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> issu check xxxx.cc"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo check whether an ISSU can be performed on the system, you can run the\nissu check command to check the system before the ISSU. The check items include:\nCurrent environment where the system is runningCompleteness and validity of the new system softwareHardware compatibilitySoftware compatibility\nIn VS mode, this command is supported only by the admin VS.\n\nPrerequisites\nThe new system software has been uploaded to the main board on the device.\nConfiguration Impact\nAfter the issu check command is executed, the system imports the new system software information into a database, checks the environment where the system is running, including the CPU usage, disk space, and memory usage, checks whether the new system software is compatible with hardware and with the earlier system software, and checks the ISSU method to be used.\nFollow-up Procedure\nIf no error information is displayed in the output of the issu check command, the check result is success. You can also run the display issu check-result command to view the ISSU check result.\nIf the issu check command output shows that the ISSU is feasible, run the issu start command to start the ISSU.\nPrecautions\nISSU is not supported on VSUF boards or by services"
}