{
    "PageTitle": "upgrade sfu",
    "FuncDef": "The upgrade sfu command upgrades the items of one SFU or multiple SFUs, BootROM, firmware, and MonitorBus included.",
    "CLIs": [
        "upgrade sfu { all | slot <slot-id> } { startup | <filename> } { all-item | firmware | monitorbus } [ force ]"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "all",
            "Info": "Indicates all SFUs that are installed.\n-"
        },
        {
            "Parameters": "slot slot-id",
            "Info": "Upgrades the SFU in a specified slot.\nThe value is the slot number of the in-position SFU."
        },
        {
            "Parameters": "startup",
            "Info": "Upgrades the router to the current startup system software.\n-"
        },
        {
            "Parameters": "filename",
            "Info": "Specifies the name of the system software stored in the Cfcard.\nThe value is a string of 4 to 127 characters, spaces not supported."
        },
        {
            "Parameters": "all-item",
            "Info": "Indicates all items on an SFU.\n-"
        },
        {
            "Parameters": "firmware",
            "Info": "Indicates the firmware of the SFU.\n-"
        },
        {
            "Parameters": "monitorbus",
            "Info": "Upgrades the MonitorBus of the SFU.\n-"
        },
        {
            "Parameters": "force",
            "Info": "Forces the upgrade, regardless of the version consistency.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> upgrade sfu slot 20 startup all-item",
            "*********************************************************",
            "*                     W A R N I N G                     *",
            "*                                                       *",
            "* Please ensure that the configuration has been saved.  *",
            "* And please ensure that the board does not be powered  *",
            "* off or be reseted during the upgrade operation.       *",
            "* Also ensure that any board of this device is not      *",
            "* removed (pull out or plug in) during this process.    *",
            "*                                                       *",
            "*                     W A R N I N G                     *",
            "*********************************************************",
            "Confirm to upgrade.continue? [Y/N]:y"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf an SFU does not operate properly but the display device command output shows that the SFU has successfully registered, run the upgrade sfu command to upgrade the SFU to troubleshoot the fault.\nImplementation Procedure\nWhen using the upgrade sfu command, enter Y or N to determine whether to execute the command.\nConfiguration Impact\nThere are two modes for upgrading the items:\nUpgrade the items without using the parameter force.\nThe system first checks whether the items of the SFU match the system software. Then, it upgrades the unmatched items.\nUpgrade the items using the parameter force.\nThe system directly upgrades all the items of the SFU without checking whether these items match the system software.\nProcedure\nWhen running the upgrade sfu command, enter Y or N to decide whether to run the command.\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}