{
    "PageTitle": "upgrade pdu",
    "FuncDef": "The upgrade pdu command upgrades the CANBUS software of a specified DMU slot.",
    "CLIs": [
        "upgrade pdu slot <slodid> dmu { startup | <filename> } monitorbus [ force ]",
        "upgrade pdu all dmu { startup | <filename> } monitorbus [ force ]"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "startup",
            "Info": "Indicates that the current startup system software is used for the upgrade.\n-"
        },
        {
            "Parameters": "filename",
            "Info": "Specifies the name of the system software stored in the CF card.\nThe value is a string of 4 to 127 characters, spaces not supported."
        },
        {
            "Parameters": "monitorbus",
            "Info": "Upgrades the MonitorBus.\n-"
        },
        {
            "Parameters": "force",
            "Info": "Forces the upgrade, regardless of the version consistency.\n-"
        },
        {
            "Parameters": "all",
            "Info": "Specifies all slot.\n-"
        },
        {
            "Parameters": "slot slodid",
            "Info": "Specifies a PDU slot ID.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> upgrade pdu all dmu startup monitorbus force",
            "*********************************************************                                      ",
            "*                     W A R N I N G                     *                                                                           ",
            "",
            "* Please ensure that the configuration has been saved.  *                                      ",
            "* And please ensure that the board does not be powered  *                                      ",
            "* off or be reseted during the upgrade operation.       *                                      ",
            "* Also ensure that any board of this device is not      *                                      ",
            "* removed (pull out or plug in) during this process.    * ",
            "                                     ",
            "*********************************************************                                      ",
            "Confirm to upgrade.continue? [Y/N]:y"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo check a PDU version, run the check version startup command. If a PDU version is inconsistent with that specified by the system software, run the upgrade pdu command to upgrade the PDU version.\nImplementation Procedure\nDuring upgrade pdu command execution, the system prompts you to enter Y or N for pre-upgrade confirmation.\nConfiguration Impact\nTwo methods are available for upgrading loaded items:\nUpgrading loaded items without using the force parameter. The system checks whether the PDU version is consistent with that specified by the system software and upgrades only loaded items that are inconsistent.Upgrading loaded items using the force parameter. The system directly upgrades all loaded items without checking whether the PDU version is consistent with that specified by the system software.\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}