{
    "PageTitle": "upgrade rollback enable rollback-timer",
    "FuncDef": "The upgrade rollback command enables the version rollback function and sets a timeout period for version rollback.\nThe undo upgrade rollback command disables the version rollback function during version upgrade.\nBy default, the version rollback function is disabled.",
    "CLIs": [
        "upgrade rollback enable rollback-timer <time-value>",
        "undo upgrade rollback"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "time-value",
            "Info": "Specifies a timeout period for a rollback timer.\nThe value is an integer ranging from 10 to 360, in minutes."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> upgrade rollback enable rollback-timer 60",
            "Info: The upgrade rollback function is enabled. The limit time is 20 minutes.",
            "If no User cancels the function, the master MPU will restart by the bootfile cfcard:/VRPV800RxxxCxxBxxx.cc.The slave MPU will restart by the bootfile cfcard:/VRPV800RxxxCxxBxxx.cc."
        ],
        [
            "<HUAWEI> undo upgrade rollback",
            "Info: The state of upgrade rollback is disable."
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf you need to cancel the version upgrade being performed for some reason (for example, a new startup file was damaged), you can run the upgrade rollback command to perform version rollback to restore the version being upgraded to the original version.\nAfter the version rollback function is enabled and the system package is restarted, the system will perform a version rollback to roll back the system package and patch if no users successfully log in to the device in a specified period of time.\nIf the version rollback function is disabled, the system will not perform version rollback whether any users successfully log in to the device in a specified period of time.\nBy default, the version rollback function is disabled. After the version rollback function is performed, the system restores to the default setting.\nConfiguration Impact\nAfter the command is run, the rollback timer of the current system will be reset.\nPrecautions\nIf users successfully log in to the device, the system automatically cancels the timeout period for version rollback.\nThe items that can be rolled back include system software and patch files.\nIn VS mode, this command is supported only by the admin VS"
}