{
    "PageTitle": "issu start",
    "FuncDef": "The issu start command starts an ISSU.",
    "CLIs": [
        "issu start [ rollback-timer [ <timevalue> ] ] <packagename> [ { patch <patchname> | paf { <pafname> | default } } * ]"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "rollback-timer",
            "Info": "Specifies the value of the rollback timer.If rollback-timer is specified but time is not specified, the default value of the rollback timer is used.\n-"
        },
        {
            "Parameters": "timevalue",
            "Info": "Specifies the value of the rollback timer, in minutes. If the timer expires, the system will automatically roll back to the status before the ISSU.\nIf rollback-timer time is specified, the issu confirm command must be executed to confirm the ISSU.\nThe value is an integer ranging from 0 to 2880, in minutes. The value 0 indicates that no rollback timer is set. The default value is 120."
        },
        {
            "Parameters": "packagename",
            "Info": "Specifies the system software file name.\nThe value is a string of 4 to 127 case-sensitive characters, with spaces not supported."
        },
        {
            "Parameters": "patch patchname",
            "Info": "Specifies the path name and name of the patch package.\nThe value is a string of 5 to 63 case-sensitive characters, with spaces not supported."
        },
        {
            "Parameters": "paf",
            "Info": "Specifies the paf file.\n-"
        },
        {
            "Parameters": "pafname",
            "Info": "Specifies the paf file name.\nThe value is a string of 5 to 48 case-sensitive characters, with spaces not supported."
        },
        {
            "Parameters": "default",
            "Info": "Specifies the default paf file.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> issu start xxxx.cc"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nYou must run the issu start command to start an ISSU, no matter whether the issu check command has been executed or not.\nPerform the ISSU check before running the issu start command to start an ISSU in any of the following situations:\nIf rollback-timer time is specified, run the issu confirm command to confirm the ISSU after running the issu start command. Then the system upgrades the new standby plane and clears related files to complete the ISSU.If rollback-timer time is not specified, the system automatically confirms the ISSU, updates the standby plane, and clears related files to complete the ISSU.\n\nPrerequisites\nThe new system software has been uploaded to the main board on the device.\nImplementation Procedure\nIf there are unsaved configurations, the system asks you whether to save the configurations to the configuration file. You can choose Y or N. If you choose N, the ISSU is cancelled. If you choose Y, the system checks whether the ISSU can be performed.\nAfter the check is complete, the system asks you whether to perform the ISSU. You can choose Y or N.\nConfiguration Impact\nAfter the issu start command is executed, the master and slave main control boards and interface boards are upgraded to the target version. During the upgrade, the CLI connections are interrupted, and users need to log in to the device again.\nAfter the command is run, users cannot run configuration commands or maintenance commands that may interrupt traffic.\nPrecautions\nIn VS mode, this command is supported only by the admin VS"
}