{
    "PageTitle": "upgrade pmu",
    "FuncDef": "The upgrade pmu command upgrades a PMU.",
    "CLIs": [
        "upgrade pmu { slot <slotid> | all } { <filename> | startup } monitorbus [ force ]"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "slot slotid",
            "Info": "Upgrades the PMU in a specified slot.\n-"
        },
        {
            "Parameters": "all",
            "Info": "Specifies all slot.\n-"
        },
        {
            "Parameters": "filename",
            "Info": "Specifies the name of the system software stored in the CF card.\nThe value is a string of 4 to 127 characters, spaces not supported."
        },
        {
            "Parameters": "startup",
            "Info": "Upgrades the router to the current startup system software.\n-"
        },
        {
            "Parameters": "monitorbus",
            "Info": "Upgrades the MonitorBus of the SFU.\n-"
        },
        {
            "Parameters": "force",
            "Info": "Forces the upgrade, regardless of the version consistency.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> upgrade pmu slot 17 startup monitorbus force",
            "*********************************************************",
            "*                     W A R N I N G                     *",
            "*                                                       *",
            "* Please ensure that the configuration has been saved.  *",
            "* And please ensure that the board does not be powered  *",
            "* off or be reseted during the upgrade operation.       *",
            "* Also ensure that any board of this device is not      *",
            "* removed (pull out or plug in) during this process.    *",
            "*                                                       *",
            "*                     W A R N I N G                     *",
            "*********************************************************",
            "Confirm to upgrade.continue? [Y/N]:y"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo check the PMU version, run the check version startup command. If the PMU version is inconsistent with that specified by the system software, run the upgrade pmu command to upgrade the PMU version.\nImplementation Procedure\nWhen running the upgrade pmu command, enter Y or N to determine whether to run the command.\nConfiguration Impact\nAn item on a PMU can be upgraded in either of the following modes:\nWithout the parameter force. The system first checks whether all items on the PMU match the system software, and then upgrades the unmatched items.With the parameter force. The system upgrades all items on the PMU without checking whether these items match the system software.\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}