{
    "PageTitle": "service-stream table",
    "FuncDef": "The service-stream table command enables IP traffic monitoring.\nThe undo service-stream table command disables IP traffic monitoring.\nBy default, the IP traffic monitoring function is disabled.",
    "CLIs": [
        "service-stream table sip <source-ip> dip <destination-ip> [ vpn-instance <vpn-name> ]",
        "undo service-stream table sip <source-ip> dip <destination-ip> [ vpn-instance <vpn-name> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "dip destination-ip",
            "Info": "Specifies a destination IP address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "vpn-instance vpn-name",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 characters."
        },
        {
            "Parameters": "sip source-ip",
            "Info": "Specifies a source IP address.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance CDMA-RAN",
            "[*HUAWEI-vpn-instance-CDMA-RAN] quit",
            "[~HUAWEI] service-stream table sip 1.1.1.1  dip  2.2.2.2 vpn-instance CDMA-RAN"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn an IP RAN, if a fault occurs (for example, a base station is disconnected or IP service traffic is interrupted), the fault has to be diagnosed based on collaborative information between routers and wireless controllers or base stations. IP traffic monitoring helps quickly diagnose faults, improving O&M efficiency. IP traffic monitoring implements automatic traffic statistics based on IP addresses. After this function is enabled, you can create an IP service flow table, collect statistics on the number of IP packets, and store the statistics to a CF card periodically. You can use a tool to parse a stored file and display its content in graphics, quickly locating faulty nodes. The statistics are stored in a CF card in .dat format, and the encoding format is UTF-8 without BOM.\nPrecautions\nThis command can be run on the LPUF-50/LPUF-50-L/LPUI-21-L/LPUI-51-L/LPUF-51/LPUF-51-B/LPUI-51/LPUI-51-B/LPUS-51/LPUF-101/LPUF-101-B/LPUI-101/LPUI-101-B/LPUS-101 but does not take effect.\nThis command can be run on the versatile service boards but does not take effect.\nThis command cannot be run in virtual cluster scenarios.\nThis command cannot be run in mirroring service scenarios."
}