{
    "PageTitle": "access group",
    "FuncDef": "This command creates an association between a user group, a security model, and the views that the user group can access. Access parameters must be configured unless security is limited to the preconfigured access groups and views for SNMPv1 and SNMPv2. An access group is defined by a unique combination of the group name, security model and security level.",
    "CLIs": [
        "access group <group-name> security-model <security-model> <security-level> <security-level> [ context <context-name> [ prefix-match ] ] [ read <view-name-1> ] [ write <view-name-2> ] [ notify <view-name-3> ]",
        "no access group <group-name> security-model <security-model> <security-level> <security-level> [ context <context-name> [ prefix-match ] ] [ read <view-name-1> ] [ write <view-name-2> ] [ notify <view-name-3> ]"
    ],
    "ParentView": [
        "config>system>security>snmp"
    ],
    "ParaDef": [
        {
            "Parameters": "group-name",
            "Info": "Specify a unique group name up to 32 characters."
        },
        {
            "Parameters": "security-model {snmpv1 | snmpv2c | usm}",
            "Info": "Specifies the security model required to access the views configured in this node. A group can have multiple security models. For example, one view may only require SNMPv1/ SNMPv2c access while another view may require USM (SNMPv3) access rights."
        },
        {
            "Parameters": "security-level {no-auth-no-priv | auth-no-priv | privacy}",
            "Info": "Specifies the required authentication and privacy levels to access the views configured in this node."
        },
        {
            "Parameters": "security-level no-auth-no-privacy",
            "Info": "Specifies that no authentication and no privacy (encryption) is required. When configuring the user s authentication, select the none option."
        },
        {
            "Parameters": "security-level auth-no-privacy",
            "Info": "Specifies that authentication is required but privacy (encryption) is not required. When this option is configured, both the group and the user must be configured for authentication."
        },
        {
            "Parameters": "security-level privacy",
            "Info": "Specifies that both authentication and privacy (encryption) is required. When this option is configured, both the group and the user must be configured for authentication. The user must also be configured for privacy."
        },
        {
            "Parameters": "context-name",
            "Info": "Specifies a set of SNMP objects that are associated with the context-name."
        },
        {
            "Parameters": "prefix-match",
            "Info": "Specifies the context name prefix-match keywords, exact or prefix. This parameter applies only to the 7750 SR. ParamDefault: Default- exact"
        },
        {
            "Parameters": "view-name",
            "Info": "Specifies the keyword and variable of the view to read the MIB objects. This command must be configured for each view to which the group has read access. ParamDefault: Default- none"
        },
        {
            "Parameters": "view-name",
            "Info": "Specifies the keyword and variable of the view to configure the contents of the agent. This command must be configured for each view to which the group has write access. Values-Up to 32 characters."
        },
        {
            "Parameters": "view-name",
            "Info": "specifies keyword and variable of the view to send a trap about MIB objects. This command must be configured for each view to which the group has notify access. Values-none."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}