{
    "PageTitle": "community",
    "FuncDef": "This command creates SNMP community strings for SNMPv1 and SNMPv2c access. This command is used in combination with the predefined access groups and views. To create custom access groups and views and associate them with SNMPv1 or SNMPv2c access use theusm-communitycommand.",
    "CLIs": [
        "community <community-string> [ hash | hash2 ] <access-permissions> [ version <SNMP-version> ] [ src-access-list <list-name> ]",
        "no community <community-string> [ hash | hash2 ]"
    ],
    "ParentView": [
        "config>system>security>snmp"
    ],
    "ParaDef": [
        {
            "Parameters": "community-string",
            "Info": "Configures the SNMPv1 and/or SNMPv2c community string. Values-community-string - 32 characters maximum."
        },
        {
            "Parameters": "hash",
            "Info": "Specifies the key is entered in an encrypted form. If the hash or hash2 parameter is not used, the key is assumed to be in an unencrypted, clear text form. For security, all keys are stored in encrypted form in the configuration file with the hash or hash2 parameter specified."
        },
        {
            "Parameters": "hash2",
            "Info": "Specifies the key is entered in a more complex encrypted form that involves more variables than the key value alone, meaning that the hash2 encrypted variable cannot be copied and pasted. If the hash or hash2 parameter is not used, the key is assumed to be in an unencrypted, clear text form. For security, all keys are stored in encrypted form in the configuration file with the hash or hash2 parameter specified."
        },
        {
            "Parameters": "access-permissions",
            "Info": "Configures the access permissions for objects in the MIB."
        },
        {
            "Parameters": "version {v1 | v2c | both}",
            "Info": "Configures the scope of the community string to be for SNMPv1, SNMPv2c, or both SNMPv1 and SNMPv2c access. ParamDefault: Default- both"
        },
        {
            "Parameters": "list-name",
            "Info": "Configures the community to reference a specific src-access-list, which will be used to validate the source IP address of all received SNMP requests that use this community. Multiple community, usm-community, or VPRN SNMP community instances can reference the same src-access-list."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}