{
    "PageTitle": "port (Destination group view)",
    "FuncDef": "The ipv4-address port command configures the IPv4 address and port number of a destination collector, and the protocol and encryption mode for data sending.\nThe undo ipv4-address port command deletes the IPv4 address and port number of a destination collector, and the protocol and encryption mode of data sending.\nThe ipv6-address port command configures the IPv6 address and port number of a destination collector, and the protocol and encryption mode for data sending.\nThe undo ipv6-address port command deletes the IPv6 address and port number of a destination collector, and the protocol and encryption mode of data sending.\nBy default, no IP address or port number is configured for a destination collector, and no protocol or encryption mode is configured for data sending.",
    "CLIs": [
        "ipv4-address <ip-address> port <port> [ vpn-instance <vpn-instance> ] [ protocol { grpc [ no-tls ] | udp } ]",
        "ipv6-address <ip-address-ipv6> port <port> [ vpn-instance <vpn-instance> ] [ protocol { grpc [ no-tls ] | udp } ]",
        "undo ipv4-address <ip-address> port <port> [ vpn-instance <vpn-instance> ] [ protocol { grpc [ no-tls ] | udp } ]",
        "undo ipv6-address <ip-address-ipv6> port <port> [ vpn-instance <vpn-instance> ] [ protocol { grpc [ no-tls ] | udp } ]"
    ],
    "ParentView": [
        "Destination group view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address",
            "Info": "Specifies an IPv4 address for the destination collector.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "port port",
            "Info": "Specifies a port number for the destination collector.\nThe value is an integer ranging from 1 to 65535."
        },
        {
            "Parameters": "vpn-instance vpn-instance",
            "Info": "Specifies a VPN instance name for the destination collector.\nThe value is a string of 1 to 31 characters. The VPN instance name specified must exist on the device."
        },
        {
            "Parameters": "protocol",
            "Info": "Indicates the data sending protocol.\n-"
        },
        {
            "Parameters": "grpc",
            "Info": "Indicates that the data sending protocol is gRPC.\n-"
        },
        {
            "Parameters": "no-tls",
            "Info": "Parameter indicating whether to use TLS encryption.\nIf this parameter is set, TLS encryption is not used.If this parameter is not set, TLS encryption can be used.\n-"
        },
        {
            "Parameters": "udp",
            "Info": "Indicates that the data sending protocol is UDP.\n-"
        },
        {
            "Parameters": "ip-address-ipv6",
            "Info": "Specifies an IPv6 address for the destination collector.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] telemetry",
            "[~HUAWEI-telemetry] destination-group test",
            "[*HUAWEI-telemetry-destination-group-test] ipv4-address 10.1.1.1 port 10001 protocol grpc no-tls"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] telemetry",
            "[~HUAWEI-telemetry] destination-group test",
            "[*HUAWEI-telemetry-destination-group-test] ipv6-address 2001:DB8:2::1 port 10001 protocol grpc no-tls"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo set the IP address, port number, protocol, and encryption mode after a destination group is created, run the ipv4-address port or ipv6-address port command.\nPrecautions\nThis command can be run for no more than five times for each destination group.\nBoth this command and the protocol command in the Subscription view can be run to configure a protocol and encryption mode for the target collector. If the target collector is associated with the subscription, command configurations take effect based on the following rules:\nIf the protocol command has been run in the Subscription view, the protocol and encryption mode configured in the Subscription view take effect.If the protocol command is not run in the Subscription view, the protocol and encryption mode configured in the Destination-group view take effect."
}