{
    "PageTitle": "op-field",
    "FuncDef": "The op-field command configures a filter criterion for telemetry sampling.\nThe undo op-field command restores the default configuration.\nBy default, no filter criterion is configured for telemetry sampling.",
    "CLIs": [
        "op-field <field> op-type { eq | gt | ge | lt | le } op-value <value>",
        "undo op-field <field> op-type { eq | gt | ge | lt | le } op-value <value>"
    ],
    "ParentView": [
        "Telemetry filter view"
    ],
    "ParaDef": [
        {
            "Parameters": "field",
            "Info": "Specifies the field for filtering sampled data.\nThe value is a string of 1 to 63 case-sensitive characters.\nThe field that can be specified is a unit32 node in the YANG model corresponding to the sampling path."
        },
        {
            "Parameters": "op-type",
            "Info": "Specifies an operator.\nThe value is a character string, which can be:\neq: equal toge: greater than or equal togt: greater thanle: less than or equal tolt: less than"
        },
        {
            "Parameters": "op-value value",
            "Info": "Specifies a value involved in filter criterion operation.\nThe value is an integer ranging from 0 to 4294967295.\nThe value range is the same as that defined in the YANG model for the field option."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] telemetry",
            "[~HUAWEI-telemetry] sensor-group 1",
            "[~HUAWEI-telemetry-sensor-group-1] sensor-path huawei-ifm:ifm/interfaces/interface  self-defined-event",
            "[*HUAWEI-telemetry-sensor-group-1-self-defined-event-path] filter abc",
            "[*HUAWEI-telemetry-sensor-group-1-self-defined-event-path-filter-abc] op-field bandwidth op-type eq op-value 30"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure a filter criterion for telemetry sampling, run the op-field command. After the command is run, the data that meets the filter criterion can be collected and reported.\nPrerequisites\nA filter has been created using the filter command.\nPrecautions\nA maximum of two filter criteria can be configured for a filter."
}