{
    "PageTitle": "protocol (Subscription view)",
    "FuncDef": "The protocol command configures a protocol and encryption mode for the target collector that is associated with the current subscription.\nThe undo protocol command deletes the protocol and encryption mode configured for the target collector that is associated with the current subscription.\nBy default, no protocol and encryption mode are configured for the target collector that is associated with the current subscription.",
    "CLIs": [
        "protocol { grpc [ no-tls ] | udp }",
        "undo protocol",
        "undo protocol { grpc [ no-tls ] | udp }"
    ],
    "ParentView": [
        "Subscription view"
    ],
    "ParaDef": [
        {
            "Parameters": "grpc",
            "Info": "Specifies gRPC as the data reporting protocol.\n-"
        },
        {
            "Parameters": "no-tls",
            "Info": "Parameter indicating whether to use TLS encryption.\nIf this parameter is set, TLS encryption is not used.If this parameter is not set, TLS encryption can be used.\n-"
        },
        {
            "Parameters": "udp",
            "Info": "Specifies UDP as the data reporting protocol.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] telemetry",
            "[~HUAWEI-telemetry] subscription a",
            "[*HUAWEI-telemetry-subscription-a] protocol grpc"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure a protocol and encryption mode for the target collector associated with a created subscription, run the protocol command.\nPrecautions\nBoth this command and the ipv4-address port command or ipv6-address port command in the Destination-group view can configure a protocol and encryption mode for the target collector. If the target collector is associated with the subscription, command configurations take effect based on the following rules:\nIf this command has been run, the protocol and encryption mode configured by running this command in the Subscription view take effect.If this command is not run, the protocol and encryption mode configured by running the ipv4-address port command or ipv6-address port command in the Destination-group view take effect."
}