{
    "PageTitle": "sensor-path",
    "FuncDef": "The sensor-path command configures the sampling path for a Telemetry sensor.\nThe undo sensor-path command deletes the sampling path of a Telemetry sensor.\nThe sensor-path self-defined-event command configures a Telemetry customized event.\nThe undo sensor-path self-defined-event command deletes a Telemetry customized event.\nBy default, no sampling path or Telemetry customized event is configured.",
    "CLIs": [
        "sensor-path <path>",
        "sensor-path <path> self-defined-event",
        "undo sensor-path <path>",
        "undo sensor-path <path> self-defined-event"
    ],
    "ParentView": [
        "Sensor group view"
    ],
    "ParaDef": [
        {
            "Parameters": "path",
            "Info": "Specifies a sampling path name.\nIf a sampling path contains an interface name, you must add [ifname=interface-type interface-number] behind the interface for the sampling path, for example, huawei-ifm:ifm/interfaces/interface[ifname=\"GigabitEthernet1/0/1\"], ifname is a conditional filter field, and a path supports up to 5 conditional filters and the conditional filter field must be the key field in the node.\nTelemetry also supports fuzzy match for an interface name in a sampling path. An interface name must end with an asterisk (*) and contain only one asterisk (*). For example:\nGigabitEthernet1/0/*: indicates all interfaces with the prefix of GigabitEthernet1/0/.GigabitEthernet1/*: indicates all interfaces with the prefix of GigabitEthernet1/.GigabitEthernet*: indicates all interfaces with the prefix of GigabitEthernet.GigabitEt*: indicates all interfaces with the prefix of GigabitEt.*: indicates all device interfaces supported by the services corresponding to a sampling path.\nThe value is a string of 1 to 511 case-sensitive characters."
        },
        {
            "Parameters": "self-defined-event",
            "Info": "Specifies a Telemetry customized event.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] telemetry",
            "[~HUAWEI-telemetry] sensor-group test",
            "[*HUAWEI-telemetry-sensor-group-test] sensor-path huawei-devm:devm/cpuInfos/cpuInfo"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] telemetry",
            "[~HUAWEI-telemetry] sensor-group test",
            "[*HUAWEI-telemetry-sensor-group-test] sensor-path huawei-debug:debug/cpu-infos/cpu-info self-defined-event"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo enable a sensor to sample specific data sources and filter specific data, run the sensor-path command to configure one or more sensor paths.\nYou can configure a Telemetry customized event. If a performance indicator of a resource object that Telemetry monitors exceeds the user-defined threshold, the customized event is reported to the collector in time for service policy determination.\nPrecautions\nA maximum of 64 sampling paths can be configured for a sampling sensor group, including sampling paths configured using the sensor-path self-defined-event and sensor-path commands. When the number of sampling paths reaches the upper limit, the device displays a message indicating that the maximum number of paths is reached.\nA sampling path name can be configured in a maximum of 10 sampling sensor groups at the same time. When the number of sampling paths reaches the upper limit, the device displays a message indicating that the maximum number of paths is reached."
}