{
    "PageTitle": "e1 channel-set (CPOS-Trunk interface view)",
    "FuncDef": "The e1 channel-set command bundles the timeslots of the E1 channel of a CPOS-Trunk interface into a channel-set.\nThe undo e1 channel-set command unbundles the timeslots of the E1 channel of a CPOS-Trunk interface.\nBy default, no timeslots of the E1 channel of a CPOS-Trunk interface are bundled into a channel-set.",
    "CLIs": [
        "e1 <e1-number> channel-set <set-number> timeslot-list { <slot-list> [ ts0 ] | ts0 }",
        "undo e1 <e1-number> channel-set <set-number>"
    ],
    "ParentView": [
        "CPOS-Trunk interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "e1-number",
            "Info": "Specifies the E1 channel number of a CPOS interface.\nThe value is an integer ranging from 1 to 63."
        },
        {
            "Parameters": "set-number",
            "Info": "Specifies the number of a channel-set.\nThe value is an integer ranging from 0 to 30."
        },
        {
            "Parameters": "timeslot-list slot-list",
            "Info": "Specifies the timeslot number or the timeslot range.\nYou can specify either a single timeslot or a range of timeslots. A comma (,) is used to separate timeslots, and a hyphen (-) is used to specify a timeslot range.\nThe value is an integer ranging from 1 to 31."
        },
        {
            "Parameters": "ts0",
            "Info": "Specifies timeslot 0 to be bundled into a channel-set.\nThe e1 e1number channel-set setnumber timeslot-list slotbitmask ts0 command bundles timeslot 0 and the timeslots specified by slotbitmask into a channel-set.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface cpos-trunk 1",
            "[*HUAWEI-Cpos-Trunk1] e1 2 channel-set 3 timeslot-list 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA CPOS-Trunk interface working in channelized mode can be channelized into 63 E1 channels, each of which can be further divided into 32 timeslots. To increase the transmission rate, run the e1 channel-set command to bundle an E1 channel's timeslots other than timeslot 0 into a trunk serial interface.\nA trunk serial interface has the same function as a synchronous serial interface. After randomly dividing timeslots into several channel-sets, you can bundle the timeslots in each channel-set into a trunk serial interface.\nPrerequisites\nA CPOS-Trunk interface has been created using the interface cpos-trunk trunk-id command.\nFollow-up Procedure\nRun the interface trunk-serial command to enter the trunk serial interface view.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nTo ensure a device's processing capability, a CPOS-Trunk interface can have a maximum of 256 trunk serial interfaces bundled."
}