{
    "PageTitle": "e1 channel-set (Cpos interface view)",
    "FuncDef": "The e1 channel-set command bundles the timeslots of the E1 channel of a CPOS interface into a channel-set.\nThe undo e1 channel-set command unbundles the timeslots of the E1 channel of a CPOS interface.\nBy default, no timeslots of the E1 channel of a CPOS interface are bundled into a channel-set.",
    "CLIs": [
        "e1 <e1-number> channel-set <set-number> timeslot-list { <slot-list> [ ts0 ] | ts0 }",
        "undo e1 <e1-number> channel-set <set-number>"
    ],
    "ParentView": [
        "CPOS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "e1-number",
            "Info": "Specifies the E1 channel number of a CPOS interface.\nThe value is an integer ranging from 1 to 63."
        },
        {
            "Parameters": "set-number",
            "Info": "Specifies the number of a channel-set.\nThe value is an integer ranging from 0 to 30."
        },
        {
            "Parameters": "timeslot-list slot-list",
            "Info": "Specifies the timeslot number or the timeslot range.\nYou can specify either a single timeslot or a range of timeslots. A comma (,) is used to separate timeslots, and a hyphen (-) is used to specify a timeslot range.\nThe value is an integer ranging from 1 to 31."
        },
        {
            "Parameters": "ts0",
            "Info": "Specifies timeslot 0 to be bundled into a channel-set.\nThe e1 e1number channel-set setnumber timeslot-list slotbitmask ts0 command bundles timeslot 0 and the timeslots specified by slotbitmask into a channel-set.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] controller cpos 1/0/0",
            "[~HUAWEI-Cpos1/0/0] e1 63 channel-set 1 timeslot-list 1-31"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the E1 channel of a CPOS interface works in channelized mode, it is divided into 32 timeslots physically. Timeslots 1 to 31 can be bundled into several channel-sets. To bundle the timeslots into a channel-set, run the e1 channel-set command. Each channel-set functions as an interface whose logical features are the same as a synchronous serial interface. The interface serial command allows you to enter the view of the interface that is formed by bundling timeslots."
}