{
    "PageTitle": "using vc4 (CPOS-Trunk interface view)",
    "FuncDef": "The using vc4 command configures a CPOS-Trunk to work in VC4 clear channelized mode and creates a Trunk-Serial interface.\nThe undo using vc4 command restores the default mode in which a CPOS-Trunk interface works and deletes the created Trunk-Serial interface.\nBy default, a CPOS-Trunk interface works in channelized mode.",
    "CLIs": [
        "using vc4",
        "undo using vc4"
    ],
    "ParentView": [
        "CPOS-Trunk interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface cpos-trunk 1",
            "[*HUAWEI-Cpos-Trunk1] using vc4"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo guarantee that the Trunk-Serial interface channelized from a CPOS-Trunk interface has sufficient bandwidth to carry CEP services, run the using vc4 command to configure the CPOS-Trunk interface to work in VC4 clear channel mode and create a Trunk-Serial interface supporting higher bandwidth.\nThe CPOS-Trunk interface works in either of the following modes:\nChannelized mode: The physical interface is divided into n timeslots. You can bind all timeslots except timeslot 0 into several groups. Each group is taken as a logical interface that has the same feature as a synchronous serial interface. The number of timeslots that a physical interface has varies with the working channels.VC4 clear channelized mode: The interface is not divided into timeslots.\n\nPrerequisites\nThe interface cpos-trunk command has been run to create a CPOS-Trunk interface or enter the CPOS-Trunk interface view.\nConfiguration Impact\nAfter the using vc4 command is run, a Trunk-Serial interface is automatically created. The number of the serial interface is cpos-trunk-id/0:0. For example, if the using vc4 command is run on CPOS-Trunk 2, the number of the Trunk-Serial interface is 2/0:0.\nFollow-up Procedure\nRun the interface trunk-serial command to enter the Trunk-Serial interface view and perform configurations.\nPrecautions\nThe CPOS-Trunk interface cannot carry CEP services. The CPE services must be deployed on the Trunk-Serial interface channelized from the CPOS-Trunk interface.\nThe CPOS-Trunk interface and its member CPOS interface must work in the same E1 channel. Otherwise, the CPOS interface cannot be added to the CPOS-Trunk interface."
}