{
    "PageTitle": "e1 set loopback (CPOS interface view)",
    "FuncDef": "The e1 set loopback command enables the loopback of an E1 channel.\nThe undo e1 set loopback command disables the loopback.\nBy default, the loopback is disabled.",
    "CLIs": [
        "e1 <e1-number> set loopback { local | remote } [ autoclear period <hold-time> ]",
        "undo e1 <e1-number> set loopback"
    ],
    "ParentView": [
        "CPOS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "e1-number",
            "Info": "Specifies the E1 channel number of CPOS.\nThe value ranges from 1 to 63 in integer."
        },
        {
            "Parameters": "local",
            "Info": "Enables the internal loopback.\n-"
        },
        {
            "Parameters": "remote",
            "Info": "Enables the external remote loopback.\n-"
        },
        {
            "Parameters": "autoclear",
            "Info": "Specifies the loopback interface is automatically cleared.\n-"
        },
        {
            "Parameters": "period hold-time",
            "Info": "Specifies the loopback holding time after which loopback is automatically cleared.\nThe value is an integer ranging from 1 to 43200, in minutes."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] controller cpos 1/0/0",
            "[~HUAWEI-Cpos1/0/0] e1 1 set loopback remote"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] controller cpos 1/0/0",
            "[~HUAWEI-Cpos1/0/0] e1 1 set loopback remote autoclear period 5"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] controller cpos 1/0/0",
            "[~HUAWEI-Cpos1/0/0] undo e1 1 set loopback"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe E1 channel provides a variety of loopback functions for tests on different levels:\nIn the internal loopback, data at the sending end is looped back to the receiving end.In the external remote loopback, the received data is looped back without passing through the E1 framer and generating the payload.\nWhen a loopback is enabled on an E1 channel, the loopback is valid for the synchronous serial interface formed by the E1 channel.\nWhen the link layer protocol of the synchronous serial interface is PPP, the physical status of the synchronous serial interface is Up; whereas the link layer protocol is Down.When the link layer protocol of the synchronous serial interface is HDLC, the physical status of the synchronous serial interface and the link layer protocol are Up.\nTo configure the loopback automatic clearance function, run the e1 set loopback command. The command takes effect when loopback has been enabled. After time specified by hold-time expires, the loopback configuration is automatically deleted. hold-time specified in the e1 set loopback command takes effect only once.\n\nPrecautions\nTo enable the local loopback of the E1 channel, the channel must be in the master clock mode.\nTo enable the remote loopback of the E1 channel, the channel must be in the slave clock mode."
}