{
    "PageTitle": "e1 set frame-format (CPOS interface view)",
    "FuncDef": "The e1 set frame-format command sets a frame format used by an E1 channel of a CPOS interface.\nThe undo e1 set frame-format command restores the default setting.\nThis command varies in transport and router modes. For detailed differences, see Differences Between Commands in Transport and Router Modes. This topic describes the command configuration in router mode.\nBy default, no-CRC4 is used.",
    "CLIs": [
        "e1 <e1-number> set frame-format { crc4 | no-crc4 }",
        "undo e1 <e1-number> set frame-format"
    ],
    "ParentView": [
        "CPOS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "e1-number",
            "Info": "Specifies the E1 channel number of a CPOS interface.\nThe value is an integer ranging from 1 to 63."
        },
        {
            "Parameters": "crc4",
            "Info": "Indicates that the frame format is CRC4.\n-"
        },
        {
            "Parameters": "no-crc4",
            "Info": "Indicates that the frame format is no-CRC4.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] controller cpos 1/0/0",
            "[~HUAWEI-Cpos1/0/0] e1 1 set frame-format crc4"
        ]
    ],
    "ExtraInfo": "The frame format on the local end must be the same as that on the remote end.\nCRC4 multiframe alignment is based on the 001011 bit sequence, which consists of the first bits of timeslot 0 in frames 1, 3, 5, 7, 9, and 11. The first bits of timeslot 0 in frames 0, 2, 4, and 6, and in frames 8, 10, 12, and 14 are identified as C1, C2, C3, and C4 of two CRC4 submultiframes, which are the parity bits. The CRC4 check complies with ITU-T G.704 and G.706. E-bits identify errors of submultiframe check. The E-bit of frame 13 identifies the check result of submultiframe I, and the E-bit of frame 15 identifies the check result of submultiframe II. When the check result is correct, the E-bit is set to 1; when an error occurs, the E-bit is set to 0.\nNo-CRC4 is in odd-even frame format. Timeslot 0 in even frames transmits frame alignment signal 0011011. Timeslot 0 in an odd frame has a fixed value of 1 in the second bit, which distinguishes it from an even frame with value 0 in the second bit."
}