{
    "PageTitle": "mapping-mode (CPOS interface view)",
    "FuncDef": "The mapping-mode command configures the E1 channel mapping mode of a CPOS interface.\nThe undo mapping-mode command restores the default setting.\nBy default, the E1 channel mapping mode of the CPOS interface is h-mode.",
    "CLIs": [
        "mapping-mode { a-mode | h-mode | l-mode }",
        "undo mapping-mode"
    ],
    "ParentView": [
        "CPOS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "a-mode",
            "Info": "Configures the Alcatel mode (a-mode) as the E1 channel mapping mode of a CPOS interface. This mode applies when the E1 channel mapping mode of the interconnected device is the Alcatel mode. In this mode, E1 channel number = (TUG-3 number ? 1) * 21 + TUG-2 number + (TU-12 number ? 1) * 7.The numbers listed in the preceding formula stand for the positions in a VC-4 frame. The TUG-3 number ranges from 1 to 3; the TUG-2 number ranges from 1 to 7; the TU-12 number ranges from 1 to 3.\n-"
        },
        {
            "Parameters": "h-mode",
            "Info": "Configures the Huawei mode (h-mode) as the E1 channel mapping mode of a CPOS interface. This mode applies when the E1 channel mapping mode of the interconnected device is the Huawei mode. In this mode, E1 channel number = TUG-3 number + (TUG-2 number ? 1) x 3 + (TU-12 number ? 1) x 21.\nThe numbers listed in the preceding formula stand for the positions in a VC-4 frame. The TUG-3 number ranges from 1 to 3; the TUG-2 number ranges from 1 to 7; the TU-12 number ranges from 1 to 3.\n-"
        },
        {
            "Parameters": "l-mode",
            "Info": "Configures the Lucent mode (l-mode) as the E1 channel mapping mode of a CPOS interface. This mode applies when the E1 channel mapping mode of the interconnected device is the Lucent mode. In this mode, E1 channel number = (TUG-3 number ? 1) * 21 + (TUG-2 number ? 1) * 3 + TU-12 number.The numbers listed in the preceding formula stand for the positions in a VC-4 frame. The TUG-3 number ranges from 1 to 3; the TUG-2 number ranges from 1 to 7; the TU-12 number ranges from 1 to 3.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] controller cpos 1/0/0",
            "[~HUAWEI-Cpos1/0/0] mapping-mode a-mode"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen a Huawei connects to a non-Huawei device through a CPOS interface, run the mapping-mode command to configure a mapping mode for the E1 channel of the CPOS interface. This mapping mode must be the same as that of the non-Huawei device, so that the two devices can communicate with each other.\nPrerequisites\nE1 channels that were set up on the CPOS interface have been deleted.\nConfiguration Impact\nIf the non-Huawei device uses the a-mode or l-mode mapping mode, after the same mapping mode is configured for the Huawei device, the two devices can properly connect to each other without manual intervention. If the mapping mode is set incorrectly, packet forwarding fails."
}