{
    "PageTitle": "using vc4 (CPOS interface view)",
    "FuncDef": "The using vc4 command configures a CPOS interface to work in VC4 clear channel mode and creates a serial interface.\nThe undo using vc4 command restores the default mode in which a CPOS interface works and deletes the created serial interface.\nBy default, a CPOS interface works in channelized mode.",
    "CLIs": [
        "using vc4",
        "undo using vc4"
    ],
    "ParentView": [
        "CPOS interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] controller cpos 1/0/0",
            "[~HUAWEI-Cpos1/0/0] using vc4"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo guarantee that CPOS member interfaces of a CPOS-Trunk interface have sufficient bandwidth to carry CEP services, run the using vc4 command on the CPOS member interface to enable it to work in VC4 clear channel mode.\nThe CPOS member interface works in either of the following modes:\nChannelized mode: The physical interface is divided into n timeslots. You can bind all timeslots except timeslot 0 into several groups. Each group is taken as a logical interface that has the same feature as a synchronous serial interface. The number of timeslots that a physical interface has varies with the working channels.VC4 clear channelized mode: The interface is not divided into timeslots.\n\nPrerequisites\nThe controller cpos command has been run to enter the CPOS interface view.\nConfiguration Impact\nAfter the using vc4command is run, a serial interface is automatically created. The number of the serial interface is cpos-number/0:0.\nFollow-up Procedure\nRun the interface serial command to enter the serial interface view and perform configurations.\nPrecautions\nConfigure a CPOS interface and the CPOS-Trunk interface to which the CPOS interface will be added to work in the same E1 channel. Otherwise, the CPOS interface cannot be added into the CPOS-Trunk interface."
}