{
    "PageTitle": "pat-repetition",
    "FuncDef": "This command configures the analyzer to check for the program association table (PAT). It is expected that the PAT arrives periodically within a certain interval range. It is possible to configure the type of alarm that is raised when the PAT fails to arrive within the specified interval. As the delay increases between two consecutive PATs, the type of alarm raised becomes more critical, from TNC to POA.",
    "CLIs": [
        "pat-repetition [ tnc <tnc-milli-seconds> qos <qos-milli-seconds> poa <poa-milli-seconds> ]",
        "no pat-repetition"
    ],
    "ParentView": [
        "config>mcast-mgmt>mcast-info-plcy>bundle>video>analyzer>alarms",
        "config>mcast-mgmt>mcast-info-plcy>bundle>channel>video>analyzer>alarms",
        "config>mcast-mgmt>mcast-info-plcy>bundle>channel>source-override>video>analyzer>alarms"
    ],
    "ParaDef": [
        {
            "Parameters": "tnc-milli-seconds",
            "Info": "Specifies the time, in milliseconds, for which a TNC alarm is raised if the interval between two consecutive PATs is greater than or equal to this configured value. Values-100 to 800 in multiples of 100 only. ParamDefault: Default- 100"
        },
        {
            "Parameters": "qos-milli-seconds",
            "Info": "Specifies the time, in milliseconds, for which a QoS alarm is raised if the interval between two consecutive PATs is greater than or equal to this configured value. Values-200 to 900 in multiples of 100 only and higher than the tnc-milli-seconds value. ParamDefault: Default- 200"
        },
        {
            "Parameters": "poa-milli-seconds",
            "Info": "Specifies the time, in milliseconds, for which a POA alarm is raised if the interval between two consecutive PATs is greater than or equal to this configured value. Values-300 to 1000 in multiples of 100 only and higher than the qos-milli-seconds value. ParamDefault: Default- 500"
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: no pat-repetition"
}