{
    "PageTitle": "packet-byte-offset",
    "FuncDef": "This command is used to modify the size of each packet handled by the queue by adding or subtracting a number of bytes. The actual packet size is not modified; only the size used to determine the ingress scheduling and profiling is changed. The packet-byte-offset command is meant to be an arbitrary mechanism that can be used to either add downstream frame encapsulation or remove portions of packet headers. Both the scheduling and profiling throughput is affected by the offset as well as the stats (accounting) associated with the queue. The packet-byte-offset does not apply to drop statistics, received valid statistics, or the offered managed and unmanaged statistics used by Ingress Multicast Path Management.",
    "CLIs": [
        "packet-byte-offset { add <add-bytes> | subtract <sub-bytes> }",
        "no packet-byte-offset"
    ],
    "ParentView": [
        "config>qos>qgrps>ing>qgrp>queue"
    ],
    "ParaDef": [
        {
            "Parameters": "add-bytes",
            "Info": "The add keyword is mutually exclusive to the subtract keyword. Either add or subtract must be specified. When add is defined, the corresponding bytes parameter specifies the number of bytes that is added to the size each packet associated with the queue for scheduling, profiling and accounting purposes. From the queue s perspective, the packet size is increased by the amount being added to the size of each packet. Values-0 to 30, in steps of 2."
        },
        {
            "Parameters": "sub-bytes",
            "Info": "The subtract keyword is mutually exclusive to the add keyword. Either add or subtract must be specified. When subtract is defined, the corresponding bytes parameter specifies the number of bytes that is subtracted from the size of each packet associated with the queue for scheduling, profiling and accounting purposes. From the queue s perspective, the packet size is reduced by the amount being subtracted from the size of each packet. The minimum resulting packet size used by the system is 1 byte. Values-0 to 64, in steps of 2."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}