{
    "PageTitle": "queue",
    "FuncDef": "This command creates a queue for use in a queue group template. When created, the defined queue-id acts as a repository for the default parameters for the queue. The template queue is created on each queue-group object that is created with the queue group template name. Each queue is identified within the template by a queue-id number. The template ensures that all queue groups created with the template name will have the same queue-ids providing a uniform structure for the forwarding class redirection commands in the SAP ingress QoS policies. The parameters within the template queue will be used as the default settings for each queue in the actual queue group. The queue parameters may be individually changed for each queue in each queue group using per queue overrides.",
    "CLIs": [
        "queue <queue-id> [ multipoint ] [ <queue-type> ] [ <queue-mode> ] [ create ]",
        "no queue <queue-id>"
    ],
    "ParentView": [
        "config>qos>qgrps>ing>queue-group"
    ],
    "ParaDef": [
        {
            "Parameters": "queue-id",
            "Info": "This required parameter identifies the queue that will either be created or edited within the queue group template. Values-1 to 32."
        },
        {
            "Parameters": "multipoint",
            "Info": "This optional keyword creates an ingress multipoint queue. Multipoint queues in a queue group may be used by ingress VPLS for forwarding types multicast, broadcast or unknown within a forwarding class. For ingress IES and VPRN access SAPs, only multicast is supported. Multipoint queues are only supported on ingress queue group templates. ParamDefault: Default- non-multipoint (unicast queue)"
        },
        {
            "Parameters": "queue-type",
            "Info": "The queue types are mutually exclusive. Values-expedite - This keyword ensures that the queue is treated in an expedited manner independent of the forwarding classes mapped to the queue.. ParamDefault: Default- best-effort"
        },
        {
            "Parameters": "queue-mode",
            "Info": "These keywords are optional and mutually exclusive when creating a new template queue. The keywords specify how the queue manages ingress explicitly profiled packets. Values-profile-mode - Overrides the default priority mode of the queue and allows the adoption of color aware profiling within the queue. Forwarding classes and subclasses may be explicitly defined as in-profile or out-of-profile. Out-of-profile classified packets bypass the CIR rate associated with the queue, reserving it for the undefined or in-profile classified packets. If the template queue is not defined as profile-mode and the packet redirected to the queue is explicitly out-of-profile based on the classification rules, the queues within-CIR bandwidth may be consumed by the packet.."
        },
        {
            "Parameters": "create",
            "Info": "Keyword used to create the queue ID instance."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}