{
    "PageTitle": "rate",
    "FuncDef": "This command defines the administrative Peak Information Rate (PIR), the administrative Committed Information Rate (CIR), and the administrative Fair Information Rate (FIR) parameters for the queue. The PIR defines the maximum rate that the queue can transmit packets through the switch fabric (for SAP ingress queues). Defining a PIR does not necessarily guarantee that the queue can transmit at the intended rate. The actual rate sustained by the queue can be limited by oversubscription factors or available egress bandwidth.",
    "CLIs": [
        "rate <pir-rate> [ cir <cir-rate> ] [ fir <fir-rate> ]",
        "rate <pir-rate> police",
        "no rate"
    ],
    "ParentView": [
        "config>qos>queue-group-templates>ingress>queue-group>queue"
    ],
    "ParaDef": [
        {
            "Parameters": "pir-rate",
            "Info": "Defines the administrative PIR, in kilobits, for the queue. When the rate command is executed, a valid PIR setting must be explicitly defined. When the rate command has not been executed, the default PIR of max is assumed. \nFractional values are not allowed and the value must be given as a positive integer. Values-1 to 2000000000 kb/s, max. ParamDefault: Default- max"
        },
        {
            "Parameters": "cir-rate",
            "Info": "The cir parameter overrides the default administrative CIR used by the queue. When the rate command is executed, a CIR setting is optional. When the rate command has not been executed or the cir parameter is not explicitly specified, the default CIR (0) is assumed.\nFractional values are not allowed and the value must be given as a positive integer. The actual CIR used is dependent on the queue s adaptation-rule parameters and the actual hardware where the queue is provisioned. Values-1 to 2000000000 kb/s, max. ParamDefault: Default- 0"
        },
        {
            "Parameters": "fir-rate",
            "Info": "The fir parameter overrides the default administrative FIR used by the queue. When the rate command is executed, an FIR setting is optional. When the rate command has not been executed or the fir parameter is not explicitly specified, the default FIR (0) is assumed. Values-1 to 2000000000 kb/s, max. ParamDefault: Default- 0"
        },
        {
            "Parameters": "police",
            "Info": "Specifies that traffic feeding into the queue instance above the specified rate is dropped."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: rate max cir 0 fir 0"
}