{
    "PageTitle": "sftp client-transfile",
    "FuncDef": "The sftp client-transfile command uploads files from an SFTP client to an SFTP server or downloads files from an SFTP server to an SFTP client.",
    "CLIs": [
        "sftp client-transfile get ipv6 [ -a <source-ipv6-address> ] host-ip <host-ipv6> [ -oi { <interface-type> <interface-number> | <interface-name> } ] [ <port> ] [ [ public-net | -vpn-instance <vpn-instance-name> ] | [ prefer_kex { prefer_kex } ] | [ identity-key <identity-key-type> ] | [ prefer_ctos_cipher <prefer_ctos_cipher> ] | [ prefer_stoc_cipher <prefer_stoc_cipher> ] | [ prefer_ctos_hmac <prefer_ctos_hmac> ] | [ prefer_stoc_hmac <prefer_stoc_hmac> ] | [ -ki <interval> ] | [ -kc <count> ] ] * username <user-name> password <password> sourcefile destination [ destination <source-file> ]",
        "sftp client-transfile get [ -a <source-address> | -i { <interface-type> <interface-number> | <interface-name> } ] host-ip <host-ipv4> [ <port> ] [ [ public-net | -vpn-instance <vpn-instance-name> ] | [ prefer_kex { prefer_kex } ] | [ identity-key <identity-key-type> ] | [ prefer_ctos_cipher <prefer_ctos_cipher> ] | [ prefer_stoc_cipher <prefer_stoc_cipher> ] | [ prefer_ctos_hmac <prefer_ctos_hmac> ] | [ prefer_stoc_hmac <prefer_stoc_hmac> ] | [ -ki <interval> ] | [ -kc <count> ] ] * username <user-name> password <password> sourcefile destination [ destination <source-file> ]",
        "sftp client-transfile put ipv6 [ -a <source-ipv6-address> ] host-ip <host-ipv6> [ -oi { <interface-type> <interface-number> | <interface-name> } ] [ <port> ] [ [ public-net | -vpn-instance <vpn-instance-name> ] | [ prefer_kex { prefer_kex } ] | [ identity-key <identity-key-type> ] | [ prefer_ctos_cipher <prefer_ctos_cipher> ] | [ prefer_stoc_cipher <prefer_stoc_cipher> ] | [ prefer_ctos_hmac <prefer_ctos_hmac> ] | [ prefer_stoc_hmac <prefer_stoc_hmac> ] | [ -ki <interval> ] | [ -kc <count> ] ] * username <user-name> password <password> sourcefile <source-file> [ destination <destination> ]",
        "sftp client-transfile put [ -a <source-address> | -i { <interface-type> <interface-number> | <interface-name> } ] host-ip <host-ipv4> [ <port> ] [ [ public-net | -vpn-instance <vpn-instance-name> ] | [ prefer_kex { prefer_kex } ] | [ identity-key <identity-key-type> ] | [ prefer_ctos_cipher <prefer_ctos_cipher> ] | [ prefer_stoc_cipher <prefer_stoc_cipher> ] | [ prefer_ctos_hmac <prefer_ctos_hmac> ] | [ prefer_stoc_hmac <prefer_stoc_hmac> ] | [ -ki <interval> ] | [ -kc <count> ] ] * username <user-name> password <password> sourcefile <source-file> [ destination <destination> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "-a source-address",
            "Info": "Specifies the source address of an SFTP client.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "source-ipv6-address",
            "Info": "Specifies the source ipv6 address of an SFTP client.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "host-ip host-ipv4",
            "Info": "Specifies the IPv4 address or host name of an SFTP server.\nThe value is a string case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "host-ip host-ipv6",
            "Info": "Specifies the IPv6 address or host name of an SFTP server.\nThe value is a string case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "-oi interface-name",
            "Info": "Specifies the source IPv6 interface name of an SFTP client.\n-"
        },
        {
            "Parameters": "interface-type",
            "Info": "Specifies the source IPv6 interface type of an SFTP client.\n-"
        },
        {
            "Parameters": "interface-number",
            "Info": "Specifies the source IPv6 interface number of an SFTP client.\n-"
        },
        {
            "Parameters": "port",
            "Info": "Specifies the monitoring port number of an SSH server.\nYou can log in to the server from the SFTP client without the need of specifying the monitoring port number only when the monitoring port number of the server is 22. Otherwise, the monitoring port number must be specified.\nThe value is an integer ranging from 1 to 65535. The default value is 22."
        },
        {
            "Parameters": "public-net",
            "Info": "Indicates that the SFTP server resides on a public network.\n-"
        },
        {
            "Parameters": "-vpn-instance vpn-instance-name",
            "Info": "Specifies a VPN instance name. This means that the SFTP server resides on a private network.\nThe value is a string of 1 to 31 case-sensitive characters without spaces.\nIf spaces are used, the string must start and end with double quotation marks (\")."
        },
        {
            "Parameters": "vpn-instance-name",
            "Info": "Specifies an IPv6 VPN instance name. This means that the SFTP server resides on a private network.\nThe value is a string of 1 to 31 case-sensitive characters without spaces.\nIf spaces are used, the string must start and end with double quotation marks (\")."
        },
        {
            "Parameters": "prefer_kex prefer_kex",
            "Info": "Specifies the preferred algorithm for key exchange.\nPreferred algorithms for key exchange supported depend on the ssh client key-exchange command settings."
        },
        {
            "Parameters": "identity-key identity-key-type",
            "Info": "Specifies a public key algorithm for the server authentication.\nCurrently, the RSA_SHA2_512, RSA_SHA2_256, RSA, DSA, SM2, and ECC algorithms are supported. The default algorithm is ECC.\nTo ensure high security, do not use the RSA algorithm whose length is less than 2048 digits. You are advised to use RSA SHA2-512 or RSA SHA2-256 authentication algorithm which ensures higher security."
        },
        {
            "Parameters": "prefer_ctos_cipher prefer_ctos_cipher",
            "Info": "Specifies the preferred encryption algorithm for packets from the client to the server.\nEncryption algorithms supported depend on the ssh client cipher command settings."
        },
        {
            "Parameters": "prefer_stoc_cipher prefer_stoc_cipher",
            "Info": "Specifies the preferred encryption algorithm for packets from the server to the client.\nEncryption algorithms supported depend on the ssh client cipher command settings."
        },
        {
            "Parameters": "prefer_ctos_hmac prefer_ctos_hmac",
            "Info": "Specifies the preferred HMAC algorithm for packets from the client to the server.\nPreferred HMAC algorithms supported depend on the ssh client hmac command settings."
        },
        {
            "Parameters": "prefer_stoc_hmac prefer_stoc_hmac",
            "Info": "Specifies the preferred HMAC algorithm for packets from the server to the client.\nPreferred HMAC algorithms supported depend on the ssh client hmac command settings."
        },
        {
            "Parameters": "-ki interval",
            "Info": "Specifies an interval at which keepalive packets are sent if no data is received.\nThe value is an integer ranging from 1 to 3600, in seconds. The default value is 60."
        },
        {
            "Parameters": "-kc count",
            "Info": "Specifies the maximum number of times that a server does not respond to keepalive packets.\nThe value is an integer ranging from 1 to 30. The default value is 5."
        },
        {
            "Parameters": "username user-name",
            "Info": "Specifies the user name for an SFTP connection.\nThe value is a string of 1 to 255 case-sensitive characters without spaces.\nIf spaces are used, the string must start and end with double quotation marks (\")."
        },
        {
            "Parameters": "password password",
            "Info": "Specifies the password for an SFTP connection.\nThe value is a string of 1 to 128 case-sensitive characters without spaces.\nIf spaces are used, the string must start and end with double quotation marks (\")."
        },
        {
            "Parameters": "sourcefile source-file",
            "Info": "Specifies the absolute path of the source file to be uploaded or downloaded.\nThe value is a string of 1 to 256 case-insensitive characters without spaces. The file name is a string of 1 to 128 characters."
        },
        {
            "Parameters": "destination destination",
            "Info": "Specifies the absolute path of the destination file to be uploaded or downloaded.\nIf destination is not specified, the destination file name is the same as the source file name.\nThe value is a string of 1 to 256 case-insensitive characters without spaces. The file name is a string of 1 to 128."
        },
        {
            "Parameters": "get",
            "Info": "Downloads files from an SFTP server.\n-"
        },
        {
            "Parameters": "-i",
            "Info": "Specifies the source interface of an SFTP client.\n-"
        },
        {
            "Parameters": "put",
            "Info": "Uploads files to an SFTP server.\n-"
        },
        {
            "Parameters": "ipv6",
            "Info": "Specifies an IPv6 SFTP server.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance ssh",
            "[*HUAWEI-vpn-instance-ssh] ipv4-family",
            "[*HUAWEI-vpn-instance-ssh-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-ssh] quit",
            "[*HUAWEI] sftp client-transfile get host-ip 10.1.1.2 1025 -vpn-instance ssh username huawei password Huawei-123 sourcefile sample.txt"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] sftp client-transfile get host-ip 10.1.1.3 -ki 10 -kc 4 username huawei password Huawei-123 sourcefile sample.txt"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] sftp client-transfile get host-ip 10.1.1.4 identity-key ecc username huawei password Huawei-123 sourcefile sample.txt"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] sftp client-transfile put ipv6 host-ip 2001:db8::1 identity-key ecc username huawei password Huawei-123 sourcefile sample.txt"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo upload files from an SFTP client to an SFTP server or download files from an SFTP server to an SFTP client, run the sftp client-transfile command. This command can be run only on an SFTP client.\nBefore you run the sftp command to transfer files, enter the user name and password. You can transfer files only when the authentication succeeds. The sftp client-transfile command supports one-click file transfer, so that a file can be transferred after you run the command.\nPrerequisites\nBefore you run the sftp client-transfile command to connect to an SFTP server, ensure that the following requirements are met:\nThe route between the SSH client and server is reachable. If the server does not use a standard port number, the port number configured on the server must be obtained.The IP address of the SSH server and the information about the SSH user used for login are obtained.The SFTP service is enabled on the server, the service types configured for the server contain SFTP, and password authentication is configured for the SSH user.\n\nConfiguration Impact\nAfter a connection is established between an SFTP client and an SFTP server, they start to communicate.\nPrecautions\nIf command execution fails due to ACL configuration on the SFTP client or the TCP connection fails, the system displays an error message indicating that the connection to the server fails.When the connection between the server and the client fails, the client must detect the fault in time and proactively tears down the connection. To achieve this, before the client logs in to the server through SFTP, configure an interval at which keepalive packets are sent if no data is received and the maximum number of times that the server does not respond. If the client does not receive any data within the specified interval, it sends a keepalive packet to the server. If the maximum number of times that the server does not respond exceeds the specified value, the client proactively tears down the connection.If a source interface is specified using the -i interface-type interface-number parameter, the -vpn-instance vpn-instance-name parameter cannot be set then.This command is used to connect to the server and transfer files. Password authentication is required for login."
}