{
    "PageTitle": "scp client-source",
    "FuncDef": "The scp client-source command configures a source IP address for the SCP client.\nThe undo scp client-source command restores the default source IP address for the SCP client.\nBy default, the SCP client source address is 0.0.0.0.",
    "CLIs": [
        "scp client-source -a <source-ip-address>",
        "scp client-source -a <source-ip-address> { public-net | -vpn-instance <vpn-instance-name> }",
        "undo scp client-source"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "-a source-ip-address",
            "Info": "Specifies a source IP address for the SCP client.\nThe value is in the decimal format."
        },
        {
            "Parameters": "public-net",
            "Info": "Specifies the public network where the SCP server resides.\n-"
        },
        {
            "Parameters": "-vpn-instance vpn-instance-name",
            "Info": "Specifies the name of a VPN instance to which the SCP server belongs.\nBefore specifying the parameter vpn-instance vpn-instance-name, ensure that a VPN instance has been configured.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] scp client-source -a 10.1.1.1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf you run the scp command to log in to the SCP server without specifying a source IP address or source interface, the source IP address or source interface specified using the scp client-source command is adopted by default. When the SCP connection on the server is viewed, the specified source IP address or the primary IP address of the specified source interface is displayed as the IP address of the user.\nPrerequisites\nVPN configuration must be successful, to configure the vpn instance using this command.\nPrecautions\nIf the specified source interface has been bound to a VPN instance, the client is automatically bound to the same VPN instance.If the specified source interface has been bound to a VPN instance, for example, vpn1, but a different VPN instance, for example, vpn2, is specified in the scp client-source -a source-ip-address -vpn-instance vpn-instance-name command, The vpn configured by this command (vpn2) takes effect.After a bound VPN instance is deleted, the VPN configuration specified using the scp client-source command will not be cleared but does not take effect. In this case, the SCP server uses a public IP address. If you configure the VPN instance with the same name again, the VPN function restores.After a bound source interface is deleted, the interface configuration specified using the scp client-source command will not be cleared but does not take effect. If you configure the source interface with the same name again, the interface configuration specified using the scp client-source command is updated and the function restores."
}