{
    "PageTitle": "client ssl-policy",
    "FuncDef": "The client ssl-policy command configures an SSL policy for an HTTP client.\nThe undo client ssl-policy command deletes the SSL policy on an HTTP client.\nBy default, no SSL policy is configured on an HTTP client.",
    "CLIs": [
        "client ssl-policy <policy-name>",
        "undo client ssl-policy"
    ],
    "ParentView": [
        "HTTP view"
    ],
    "ParaDef": [
        {
            "Parameters": "policy-name",
            "Info": "Specifies the name of an SSL policy.\nThe value is a string of 1 to 23 case-insensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ssl policy policy1",
            "[*HUAWEI-ssl-policy-policy1] certificate load pem-cert a_servercertchain2_pem_dsa.pem key-pair dsa key-file a_serverkeychain2_pem_dsa.pem auth-code cipher 123456",
            "[*HUAWEI-ssl-policy-policy1] commit",
            "[~HUAWEI-ssl-policy-policy1] quit",
            "[~HUAWEI] http",
            "[*HUAWEI-http] client ssl-policy policy1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nLegacy HTTP does not have any security mechanism. It transmits data in simple text and does not verify the identities of communicating parties. Therefore, data transmitted over HTTP may be tampered with. In applications that require high security, such as e-commerce and online banking, HTTP is inapplicable. To enhance security, run the client ssl-policy command to configure an SSL policy for an HTTP client.\nPrerequisites\nAn SSL policy has been created and the SSL policy view is displayed using the ssl policy command in the system view.A digital certificate or certificate chain has been loaded using the certificate load command in the SSL policy view.\n\nConfiguration Impact\nHTTP security is enhanced with the SSL security mechanisms, such as data encryption, identity verification, and message integrity check.\nPrecautions\nAn HTTP client can only have one SSL policy configured. If the client ssl-policy command is run more than once, the latest configuration overrides the previous one."
}