{
    "PageTitle": "set net-manager vpn-instance",
    "FuncDef": "The set net-manager vpn-instance command configures a default VPN instance used by the NMS to manage devices.\nThe undo set net-manager vpn-instance command cancels the configuration.\nBy default, no default VPN instance is set on a device.",
    "CLIs": [
        "set net-manager vpn-instance <vpn-instance-name>",
        "set net-manager ipv6 vpn-instance <vpn-instance-name>",
        "undo set net-manager vpn-instance",
        "undo set net-manager ipv6 vpn-instance"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance-name",
            "Info": "Specifies the name of the default VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "ipv6",
            "Info": "Specifies the IPv6 VPN instance.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance v1",
            "[*HUAWEI-vpn-instance-v1] quit",
            "[*HUAWEI] set net-manager vpn-instance v1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance v2",
            "[*HUAWEI-vpn-instance-v2] quit",
            "[*HUAWEI] set net-manager ipv6 vpn-instance v2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen the NMS manages devices through a VPN, device management information needs to be sent to the NMS through the VPN.\nThe set net-manager vpn-instance command is used on a device to set a default VPN instance used by the NMS to implement device management. The default VPN instance will be used by the device to communicate with the NMS.\nPrerequisites\nA VPN instance has been created on the device.\nConfiguration Impact\nThe VPN configured using the set net-manager vpn-instance command affects the following service modules: TFTP client, FTP client, SFTP client, SCP client, Info Center module, SNMP module, TACACS module, PM module, IP FPM module, Callhome module of the SSH server.\nAfter a bound VPN instance is deleted, the VPN configuration specified using the set net-manager command will not be cleared but does not take effect. In this case, the server uses a public IP address. If you configure the VPN instance with the same name again, the VPN function restores."
}