{
    "PageTitle": "ssh client key-exchange",
    "FuncDef": "The ssh client key-exchange command configures a key exchange algorithm list on an SSH client.\nThe undo ssh client key-exchange command restores the default configuration.\nBy default, an SSH client supports dh_group_exchange_sha256 key exchange algorithms.",
    "CLIs": [
        "ssh client key-exchange { dh_group_exchange_sha256 | dh_group_exchange_sha1 | dh_group1_sha1 | ecdh_sha2_nistp256 | ecdh_sha2_nistp384 | ecdh_sha2_nistp521 | sm2_kep | dh_group14_sha1 } *",
        "undo ssh client key-exchange"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "dh_group_exchange_sha256",
            "Info": "Specifies that the Diffie-hellman-group-exchange-sha256 algorithm is contained in the key exchange algorithm list configured on the SSH client.\n-"
        },
        {
            "Parameters": "dh_group_exchange_sha1",
            "Info": "Specifies that the Diffie-hellman-group-exchange-sha1 algorithm is contained in the key exchange algorithm list configured on the SSH client.\n-"
        },
        {
            "Parameters": "dh_group1_sha1",
            "Info": "Specifies that the Diffie-hellman-group1-sha1 algorithm is contained in the key exchange algorithm list configured on the SSH client.\n-"
        },
        {
            "Parameters": "ecdh_sha2_nistp256",
            "Info": "Specifies that the Elliptic curve Diffie-hellman-sha2-nistp256 algorithm is contained in the key exchange algorithm list configured on the SSH client.\n-"
        },
        {
            "Parameters": "ecdh_sha2_nistp384",
            "Info": "Specifies that the Elliptic curve Diffie-hellman-sha2-nistp384 algorithm is contained in the key exchange algorithm list configured on the SSH client.\n-"
        },
        {
            "Parameters": "ecdh_sha2_nistp521",
            "Info": "Specifies that the Elliptic curve Diffie-hellman-sha2-nistp521 algorithm is contained in the key exchange algorithm list configured on the SSH client.\n-"
        },
        {
            "Parameters": "sm2_kep",
            "Info": "Specifies that the SuperMemo 2 Key Exchange Protocol algorithm is contained in the key exchange algorithm list configured on the SSH client.\n-"
        },
        {
            "Parameters": "dh_group14_sha1",
            "Info": "Specifies that the Diffie-hellman-group14-sha1 algorithm is contained in the key exchange algorithm list configured on the SSH client.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ssh client key-exchange dh_group_exchange_sha256"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe client and server negotiate the key exchange algorithm used for packet transmission. You can run the ssh client key-exchange command to configure a key exchange algorithm list on the SSH client. The SSH server compares the configured key exchange algorithm list with the counterpart sent by the client and then selects the first matched key exchange algorithm for packet transmission. If the key exchange algorithm list sent by the client does not match any algorithm in the key exchange algorithm list configured on the server, the negotiation fails.\nThis command takes effect for both IPv4 and IPv6 SSH clients.\nPrecautions\nTo ensure high security, you can use the key-exchange algorithms such as dh_group_exchange_sha256."
}