{
    "PageTitle": "ssh client rekey",
    "FuncDef": "The ssh client rekey command sets the criteria that trigger SSH client key re-negotiation.\nThe undo ssh client rekey command restores the default values of criteria that trigger SSH client key re-negotiation.\n\nBy default, key re-negotiation is triggered on the SSH client when one of the following conditions is met:\n\n\nThe total size of sent and received packets reaches 1000 MB.\n\nThe total number of sent and received packets reaches 2147483648.\n\nThe online duration reaches 60 minutes.",
    "CLIs": [
        "ssh client rekey { { max-packet <max-packet> } | { time <minutes> } | { data-limit <data-limit> } } *",
        "undo ssh client rekey { { max-packet [ max-packet ] } | { time [ <minutes> ] } | { data-limit [ data-limit ] } } *"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "max-packet max-packet",
            "Info": "Specifies the maximum number of packets that triggers key re-negotiation.\nThe value is an integer ranging from 268435456 to 2147483648."
        },
        {
            "Parameters": "time minutes",
            "Info": "Specifies the session duration that triggers key re-negotiation.\nThe value is an integer in the range of 30 to 1440, in minutes."
        },
        {
            "Parameters": "data-limit data-limit",
            "Info": "Specifies the maximum packet data volume that triggers key re-negotiation.\nThe value is an integer ranging from 100 to 10000, in MB."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ssh client rekey data-limit 10000 max-packet 268435456 time 1440"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen an SSH session meets one or more of the following criteria, the system re-negotiates a key and uses the new key to establish SSH session connections, improving system security.\nThe number of interaction packets meets the configured key re-negotiation criterion.The accumulated packet data volume meets the configured key re-negotiation criterion.The session duration meets the configured key re-negotiation criterion.\nA key re-negotiation request is initiated when either the SSH client or server meets the key re-negotiation criteria, and the other party responds.\nThis command takes effect for both IPv4 and IPv6 SSH clients.\n\nPrecautions\nA key re-negotiation request is initiated when either the SSH client or server meets the key re-negotiation criteria, and the other party responds."
}