{
    "PageTitle": "ssh client cipher",
    "FuncDef": "The ssh client cipher command configures encryption algorithms on an SSH client.\nThe undo ssh client cipher command restores the default encryption algorithms on an SSH client.\nBy default, the SSH client supports these encryption algorithms: AES128_CTR, AES256_CTR, AES192_CTR, AES128_GCM, AES256_GCM.",
    "CLIs": [
        "ssh client cipher { des_cbc | 3des_cbc | aes128_cbc | aes256_cbc | aes128_ctr | aes256_ctr | arcfour128 | arcfour256 | aes192_cbc | aes128_gcm | aes256_gcm | aes192_ctr } *",
        "undo ssh client cipher"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "des_cbc",
            "Info": "Specifies a DES encryption algorithm in CBC mode.\n-"
        },
        {
            "Parameters": "3des_cbc",
            "Info": "Specifies a 3DES encryption algorithm in CBC mode.\n-"
        },
        {
            "Parameters": "aes128_cbc",
            "Info": "Specifies an AES128 encryption algorithm in CBC mode.\n-"
        },
        {
            "Parameters": "aes256_cbc",
            "Info": "Specifies an AES256 encryption algorithm in CBC mode.\n-"
        },
        {
            "Parameters": "aes128_ctr",
            "Info": "Specifies an AES128 encryption algorithm in CTR mode.\n-"
        },
        {
            "Parameters": "aes256_ctr",
            "Info": "Specifies an AES256 encryption algorithm in CTR mode.\n-"
        },
        {
            "Parameters": "arcfour128",
            "Info": "Specifies an Arcfour128 encryption algorithm.\n-"
        },
        {
            "Parameters": "arcfour256",
            "Info": "Specifies an Arcfour256 encryption algorithm.\n-"
        },
        {
            "Parameters": "aes192_cbc",
            "Info": "Specifies an AES192 encryption algorithm in CBC mode.\n-"
        },
        {
            "Parameters": "aes128_gcm",
            "Info": "Specifies an AES128 encryption algorithm in GCM mode.\n-"
        },
        {
            "Parameters": "aes256_gcm",
            "Info": "Specifies an AES256 encryption algorithm in GCM mode.\n-"
        },
        {
            "Parameters": "aes192_ctr",
            "Info": "Specifies an AES192 encryption algorithm in CTR mode.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ssh client cipher aes256_ctr"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure encryption algorithms on an SSH client, run the ssh client cipher command. The SSH client and server negotiate encryption algorithms for the packets exchanged between them. During negotiation, the client sends its encryption algorithms to the server. After comparing the received encryption algorithms with local ones, the server selects the first matching encryption algorithm received for packet transmission. If no matching encryption algorithm is found, the negotiation fails.\nPrecautions\nTo ensure high security, you can use the encryption algorithms such as: aes128_ctr, aes256_ctr, aes192_ctr, aes128_gcm, aes256_gcm.\nThis command takes effect for both IPv4 and IPv6 SSH clients."
}