{
    "PageTitle": "ssh client hmac",
    "FuncDef": "The ssh client hmac command configures HMAC authentication algorithms on an SSH client.\nThe undo ssh client hmac command restores the default HMAC authentication algorithms on an SSH client.\nBy default, the SSH client supports these HMAC authentication algorithms: SHA2_51 and SHA2_256.",
    "CLIs": [
        "ssh client hmac { md5 | md5_96 | sha1 | sha1_96 | sha2_256 | sha2_256_96 | sha2_512 } *",
        "undo ssh client hmac"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "md5",
            "Info": "Specifies an HMAC MD5 authentication algorithm.\n-"
        },
        {
            "Parameters": "md5_96",
            "Info": "Specifies an HMAC MD5_96 algorithm.\n-"
        },
        {
            "Parameters": "sha1",
            "Info": "Specifies an HMAC SHA1 algorithm.\n-"
        },
        {
            "Parameters": "sha1_96",
            "Info": "Specifies an HMAC SHA1_96 algorithm.\n-"
        },
        {
            "Parameters": "sha2_256",
            "Info": "Specifies an HMAC SHA1 algorithm. This algorithm is recommended.\n-"
        },
        {
            "Parameters": "sha2_256_96",
            "Info": "Specifies anHMAC SHA2_256_96 authentication algorithm.\n-"
        },
        {
            "Parameters": "sha2_512",
            "Info": "Specifies an HMAC SHA2_512 authentication algorithm.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ssh client hmac sha2_256"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure HMAC authentication algorithms on an SSH client, run the ssh client  hmac command. The SSH client and server negotiate authentication algorithms for  the packets exchanged between them. During negotiation, the client sends its  authentication algorithms to the server. After comparing the received  authentication algorithms with local ones, the server selects the first matching  authentication algorithm received for packet transmission. If no matching  authentication algorithm is found, the negotiation fails.\nPrecautions\nTo ensure high security, you can use the HMAC authentication  algorithms such as: sha2_256, sha2_512.\nThis command takes effect for both  IPv4 and IPv6 SSH clients."
}