{
    "PageTitle": "cipher-suite exclude",
    "FuncDef": "The cipher-suite exclude key-exchange rsa command exclude RSA key exchange algorithms from the cipher-suite-list.\nThe undo cipher-suite exclude key-exchange rsa command include RSA key exchange algorithms from the cipher-suite-list.\nThe cipher-suite exclude cipher mode cbc command exclude CBC encryption mode algorithms from the cipher-suite-list.\nThe undo cipher-suite exclude cipher mode cbc command include CBC encryption mode algorithms from the cipher-suite-list.\nThe cipher-suite exclude hmac sha1 command exclude HMAC-SHA1 algorithms from the cipher-suite-list.\nThe undo cipher-suite exclude hmac sha1 command include HMAC-SHA1 algorithms from the cipher-suite-list.\nBy default, RSA key exchange algorithm, CBC mode algorithm and HMAC-SHA1 algorithm are not supported in an SSL cipher suite bound to an SSL policy.",
    "CLIs": [
        "cipher-suite exclude key-exchange rsa",
        "cipher-suite exclude cipher mode cbc",
        "cipher-suite exclude hmac sha1",
        "undo cipher-suite exclude key-exchange [ rsa ]",
        "undo cipher-suite exclude cipher mode [ cbc ]",
        "undo cipher-suite exclude hmac [ sha1 ]"
    ],
    "ParentView": [
        "SSL policy view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ssl policy abc",
            "[*HUAWEI-ssl-policy-abc] cipher-suite exclude key-exchange rsa"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ssl policy abc",
            "[*HUAWEI-ssl-policy-abc] cipher-suite exclude cipher mode cbc"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ssl policy abc",
            "[*HUAWEI-ssl-policy-abc] cipher-suite exclude hmac sha1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nDuring client and server authentication, an algorithm list is provided for the client and server to perform SSL algorithm negotiation. To exclude RSA/CBC/SHA1 key exchange algorithms, run the cipher-suite exclude key-exchange rsa, cipher-suite exclude cipher mode cbc or cipher-suite exclude hmac sha1 command.\nPrerequisites\nAn SSL policy has been created using the ssl policy command.\nPrecautions\nAfter the cipher-suite exclude key-exchange rsa, cipher-suite exclude cipher mode cbc or cipher-suite exclude hmac sha1 command is run, the RSA/CBC/SHA1 encryption algorithm configured in the SSL cipher suite of an SSL policy does not take effect."
}