{
    "PageTitle": "telnet client-source",
    "FuncDef": "The telnet client-source command configures a source for the Telnet client to establish a connection to the Telnet server.\nThe undo telnet client-source command deletes the configured source.\nBy default, the source address of the Telnet client is 0.0.0.0.",
    "CLIs": [
        "telnet client-source { { -a <source-ip-address> } | { -i { <interface-type> <interface-number> | <interface-name> } } }",
        "telnet ipv6 client-source -a <ipv6-address> [ -vpn-instance <ipv6-vpn-instance-name> ]",
        "undo telnet client-source",
        "undo telnet ipv6 client-source [ -a <ipv6-address> [ -vpn-instance <ipv6-vpn-instance-name> ] ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "-a source-ip-address",
            "Info": "Specifies the source IP address of the Telnet client.\nThe value is in the decimal format."
        },
        {
            "Parameters": "-i interface-name",
            "Info": "Specifies the source interface name for the Telnet client to establish a connection to the server.\n-"
        },
        {
            "Parameters": "interface-type",
            "Info": "Specifies the type of the source interface for the Telnet client to establish a connection to the server.\n-"
        },
        {
            "Parameters": "interface-number",
            "Info": "Specifies the number of the source interface for the Telnet client to establish a connection to the server.\n-"
        },
        {
            "Parameters": "ipv6",
            "Info": "Specifies the IPv6 protocol.\n-"
        },
        {
            "Parameters": "ipv6-address",
            "Info": "Specifies the source IPv6 address of the Telnet client.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "-vpn-instance ipv6-vpn-instance-name",
            "Info": "Specifies the name of a VPN instance to which the Telnet server belongs.\nBefore specifying the parameter vpn-instance ipv6-vpn-instance-name, ensure that a VPN instance has been configured.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] telnet client-source -a 10.1.1.1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface loopback 0",
            "[*HUAWEI-LoopBack0] ip address 10.1.1.1 24",
            "[*HUAWEI-LoopBack0] quit",
            "[*HUAWEI] telnet client-source -i loopback0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen you run the telnet command to log in to a Telnet server without specifying a source address or interface, the source address or interface configured using the telnet client-source command is adopted by default. If you run the telnet command and specify a source address or interface, you can log in to the Telnet server using the specified source address or interface.\nAfter a bound source interface is deleted, the interface configuration specified using the telnet client-source command will not be cleared but does not take effect. If you configure the source interface with the same name again, the interface configuration specified using the telnet client-source command is updated and the function restores.\nPrecautions\nIf the specified source interface has been bound to a VPN instance, the client is automatically bound to the same VPN instance."
}