{
    "PageTitle": "whitelist session-car telnet-server",
    "FuncDef": "The whitelist session-car telnet-server command sets values for Telnet whitelist session CAR parameters.\nThe undo whitelist session-car telnet-server command restores the default values for Telnet whitelist session CAR parameters.\nBy default, the CIR, CBS, PIR, and PBS of Telnet whitelist session CAR are 4 kbit/s, 640 bytes, 64 kbit/s, and 10000 bytes, respectively.",
    "CLIs": [
        "whitelist session-car telnet-server { cir <cir-value> | cbs <cbs-value> | pir <pir-value> | pbs <pbs-value> } *",
        "undo whitelist session-car telnet-server [ { cir <cir-value> | cbs <cbs-value> | pir <pir-value> | pbs <pbs-value> } * ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "cir cir-value",
            "Info": "Specifies a committed information rate (CIR), that is, the average rate at which packets can be transmitted or forwarded.\nThe value is an integer ranges from 0 to 1000000, in kbit/s. The default value is 4."
        },
        {
            "Parameters": "cbs cbs-value",
            "Info": "Specifies a committed burst size (CBS), that is, the committed volume of burst traffic that can pass instantly.\nThe value is an integer ranges from 0 to 1000000, in bytes. The default value is 640."
        },
        {
            "Parameters": "pir pir-value",
            "Info": "Specifies a peak information rate (PIR), that is, the peak rate at which packets can be transmitted or forwarded.\nThe value is an integer ranges from 0 to 1000000, in kbit/s. The default value is 64."
        },
        {
            "Parameters": "pbs pbs-value",
            "Info": "Specifies a peak burst size (PBS), that is, the peak volume of burst traffic that can pass instantly.\nThe value is an integer ranges from 0 to 1000000, in bytes. The default value is 10000."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] whitelist session-car telnet-server cir 100 cbs 500000 pir 2000 pbs 900000",
            "Warning: If the parameters of Session-CAR in the whitelist are too large or too small, the neighbor relationship may be disconnected or flap. You are advised to use the default values."
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo adjust the packet channel bandwidth for Telnet session CAR on a device, run the  whitelist session-car telnet-server command. If the device receives a large number of Telnet Server packets, this configuration ensures that the packets that hit the Telnet Server whitelist (session CAR) can be sent to Telnet Server properly.\nThe PIR must be greater than or equal to the CIR, and the PBS must be greater than or equal to the CBS.\nImplementation Procedure\nIf a session Telnet Server parameter in an Telnet whitelist is set to an excessively large or small value, the involved Telnet Server neighbor relationships may be disconnected or flap.\nPrecautions\nIn normal cases, you are advised not to change the values of the session CAR parameters in an Telnet whitelist. Use the default values of these parameters instead."
}