{
    "PageTitle": "tftp client-source",
    "FuncDef": "The tftp client-source command sets the interface and IP addresses of the TFTP client to establish the connection with TFTP server.\nThe undo tftp client-source command cancels the interface and IP address of the TFTP client.\nBy default, the source address is set to 0.0.0.0.",
    "CLIs": [
        "tftp client-source { -a <ip-address> | -i { <interface-type> <interface-number> | <interface-name> } }",
        "undo tftp client-source"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "-a ip-address",
            "Info": "Specifies the source IPv4 address of the local machine.\nThe value is in the decimal format."
        },
        {
            "Parameters": "-i interface-type",
            "Info": "Specifies the source interface type and source interface type.\n-"
        },
        {
            "Parameters": "interface-number",
            "Info": "Specifies the source interface type and source interface number.\nThe value is a string of 1 to 47 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "interface-name",
            "Info": "Specifies the source interface type and source interface name.\nThe value is a string of 1 to 47 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] tftp client-source -a 10.1.1.1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface loopback 0",
            "[*HUAWEI-LoopBack0] ip address 10.1.1.1 24",
            "[*HUAWEI-LoopBack0] quit",
            "[*HUAWEI] tftp client-source -i loopback0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen you run the tftp command to log in to a TFTP server without specifying a source address or source interface, the source address or interface that is specified by tftp client-source is adopted by default. If you run the tftp command and specify a source address or source interface at the same time, you can log in to the TFTP server with the specified source address or interface.\nPrerequisites\nEnsure that the loopback interface is configured before you configure the source interface type and interface number to establish connection with the server."
}