{
    "PageTitle": "tftp",
    "FuncDef": "The tftp command uploads the local file to the TFTP server or download the file from the TFTP server to the local machine.",
    "CLIs": [
        "tftp [ -a <source-ip-address> | -i { <interface-name> | <interface-type> <interface-number> } ] <host-ip-address> [ vpn-instance <vpn-instance-name> | public-net ] { get | put } <source-filename> [ <destination-filename> ]"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "-a source-ip-address",
            "Info": "Specifies the source IPv4 address of the local machine.\nIn dotted decimal notation."
        },
        {
            "Parameters": "-i interface-name",
            "Info": "Specifies the source interface type and source interface name.\n-"
        },
        {
            "Parameters": "interface-type",
            "Info": "Specifies the source interface type and source interface type.\n-"
        },
        {
            "Parameters": "interface-number",
            "Info": "Specifies the source interface type and source interface number.\n-"
        },
        {
            "Parameters": "host-ip-address",
            "Info": "Specifies the IPv4 address of the remote system or the host with a specific name.\nTo view the mapping between the IPv4 address and host name, run the display dns dynamic-host or display ip host command.\nIf the value is an IPv4 address, it is in dotted decimal notation.If the value is a host name, it is a string of case-sensitive characters without spaces."
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies the VPN instance name.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "public-net",
            "Info": "Indicates that the TFTP server on the public network is connected.\n-"
        },
        {
            "Parameters": "get",
            "Info": "Specifies the downloading files from the remote TFTP server.\n-"
        },
        {
            "Parameters": "put",
            "Info": "Specifies the uploading local files to the remote TFTP server.\n-"
        },
        {
            "Parameters": "source-filename",
            "Info": "Specifies the source file name.\nSource file name is string data type. The string length range is from 1 to 255 characters. It can contain alphanumeric and special characters."
        },
        {
            "Parameters": "destination-filename",
            "Info": "Specifies the name of the destination file.\nDestination file name is string data type. The string length range is from 1 to 255 characters. It can contain alphanumeric and special characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> tftp 10.1.1.2 get sample.txt sample1.txt"
        ],
        [
            "<HUAWEI> tftp 10.1.1.2 put sample.txt"
        ],
        [
            "<HUAWEI> tftp -a 10.1.1.2 vpn-instance vrp 10.1.1.1 get sample.txt sample1.txt"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nSpecify the valid source IP address to communicate with the server.\nConfiguration Impact\nIf you do not specify the destination file name, the source file name is considered as destination file name."
}