{
    "PageTitle": "fast-alarm-detect enable",
    "FuncDef": "The fast-alarm-detect enable command enables fast alarm detection on a serial interface.\nThe undo fast-alarm-detect enable command disables fast alarm detection on a serial interface.\nBy default, fast alarm detection is not enabled on a TDM serial interface.",
    "CLIs": [
        "fast-alarm-detect enable",
        "undo fast-alarm-detect enable"
    ],
    "ParentView": [
        "Serial interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Serial 1/0/3/2:0",
            "[~HUAWEI-Serial1/0/3/2:0] link-protocol tdm",
            "Warning: The encapsulation protocol of the link will be changed. ",
            "Continue? [Y/N]:y",
            "[*HUAWEI-Serial1/0/3/2:0] fast-alarm-detect enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nFor CES and CEP services, fast alarm detection can be implemented if a PW Down event is detected. Fast alarm detection must work with BFD. If BFD is not configured, transparent transmission of alarms (normal mode) is performed.\nFor CES services, after fast alarm detection and BFD are configured, a TU-AIS alarm is rapidly inserted to the AC side if a PW Down event is detected. After fast alarm detection is disabled, the TU-AIS alarm is inserted to the AC side in normal mode.\nFor CEP services, after fast alarm detection and BFD are configured, an AU-AIS alarm is rapidly inserted to the AC side if a PW Down event is detected. After fast alarm detection is disabled, the AU-AIS alarm is inserted to the AC side in normal mode.\nPrerequisites\nTDM has been configured for the target serial interface using the link-protocol tdm command.\nPrecautions\nFor CES services, fast alarm detection and a non-TDM service cannot be configured together on the same E1 channel of a CPOS interface. This restriction does not apply to CEP services.\nFor CES services, only one fast alarm detection channel can be configured on an E1 channel of a CPOS interface. This restriction does not apply to CEP services.\nFor CES services, fast alarm detection cannot be configured on the fourth or eighth interface of a CPOS subcard. This restriction does not apply to CEP services.\nA maximum of 150 fast alarm detection commands can be run on a device, and this specification is shared between CES and CEP services. If the number of fast alarm detection commands that have been run exceeds the specification, an error message is displayed.\nFast alarm detection is supported on the CR5D00C8CF71/CR5D00C4CF70/CR5D00C2CF70 subcards."
}