{
    "PageTitle": "trap-threshold (Serial interface view)",
    "FuncDef": "The trap-threshold ces command configures thresholds for generating and clearing a CES service performance threshold-crossing alarm.\nThe undo trap-threshold ces command restores the default thresholds for generating and clearing a CES service performance threshold-crossing alarm.\nBy default, all alarm functions are enabled.",
    "CLIs": [
        "trap-threshold { ces-jtrovr-exc | ces-jtrudr-exc | ces-lospkt-exc | ces-malpkt-exc | ces-misorderpkt-exc | ces-straypkt-exc } trigger-threshold <trigger-threshold> resume-threshold <resume-threshold>",
        "trap-threshold ces-lops trigger-threshold <lops-trigger-threshold> resume-threshold <lops-resume-threshold>",
        "undo trap-threshold { ces-jtrovr-exc | ces-jtrudr-exc | ces-lospkt-exc | ces-malpkt-exc | ces-misorderpkt-exc | ces-straypkt-exc }",
        "undo trap-threshold ces-lops"
    ],
    "ParentView": [
        "Trunk serial interface view",
        "Serial interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "ces-jtrovr-exc",
            "Info": "Sets the alarm generation and clearance thresholds for overflows in the jitter buffer.\n-"
        },
        {
            "Parameters": "ces-jtrudr-exc",
            "Info": "Sets the alarm generation and clearance thresholds for underflows in the jitter buffer.\n-"
        },
        {
            "Parameters": "ces-lospkt-exc",
            "Info": "Sets the alarm generation and clearance thresholds for packet drops every second.\n-"
        },
        {
            "Parameters": "ces-malpkt-exc",
            "Info": "Sets the alarm generation and clearance thresholds for malformed packets every second.\n-"
        },
        {
            "Parameters": "ces-misorderpkt-exc",
            "Info": "Sets the alarm generation and clearance thresholds for disordered packets every second.\n-"
        },
        {
            "Parameters": "ces-straypkt-exc",
            "Info": "Sets the alarm generation and clearance thresholds for stray packets every second.\n-"
        },
        {
            "Parameters": "trigger-threshold trigger-threshold",
            "Info": "Sets an alarm generation threshold.\nThe value is an integer, in packets (times)/second. The alarm generation threshold for ces-lospkt-exc, ces-misorderpkt-exc, ces-straypkt-exc, and ces-malpkt-exc ranges from 1 to 1000, and the default value is 5. The alarm threshold for ces-jtrudr-exc and ces-jtrovr-exc ranges from 1 to 1000, and the default value is 1."
        },
        {
            "Parameters": "resume-threshold resume-threshold",
            "Info": "Sets an alarm clearance threshold. resume-threshold-value must be smaller than trigger-threshold-value.\nThe value is an integer, in packets (times)/second. The alarm clearance threshold for ces-lospkt-exc, ces-misorderpkt-exc, ces-straypkt-exc, ces-malpkt-exc, ces-jtrudr-exc, and ces-jtrovr-exc ranges from 1 to 1000, and the default value is 0."
        },
        {
            "Parameters": "ces-lops",
            "Info": "Sets the alarm generation and clearance thresholds for Continuous loss of packets in a certain period.\n-"
        },
        {
            "Parameters": "lops-trigger-threshold",
            "Info": "Threshold for ces-lops alarm generation.\nThe value is an integer that ranges from 2 to 65535, and the default value is 128."
        },
        {
            "Parameters": "lops-resume-threshold",
            "Info": "Threshold for ces-lops alarm clearance.\nThe value is an integer that ranges from 32 to 65535, and the default value is 872."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface serial 2/0/0:1",
            "[~HUAWEI-Serial2/0/0:1] trap-threshold ces-lospkt-exc trigger-threshold 3 resume-threshold 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure thresholds for generating and clearing a CES service performance threshold-crossing alarm, run the trap-threshold ces command. If the alarm generation threshold is reached, the system generates an alarm. If the alarm clearance threshold is reached, the system clears the alarm.\nPrecautions\nThe alarm clearance threshold must be smaller than the alarm generation threshold for ces-lospkt-exc, ces-misorderpkt-exc, ces-straypkt-exc, ces-malpkt-exc, ces-jtrudr-exc and ces-jtrovr-exc.\nThe trap-threshold ces command can be configured only on serial interfaces and trunk serial interfaces that are encapsulated with TDM."
}