{
    "PageTitle": "twoway-loss threshold",
    "FuncDef": "The twoway-loss threshold command configures a two-way packet loss alarm threshold.\nThe undo twoway-loss threshold command cancels the two-way packet loss alarm threshold.\nBy default, the two-way packet loss alarm threshold is set to 0.1000%, and the alarm clearance threshold is set to 0.0500%.",
    "CLIs": [
        "twoway-loss threshold test-session <session-id> upper-limit <upper-limit> lower-limit <lower-limit>",
        "undo twoway-loss threshold test-session <session-id> [ upper-limit <upper-limit> lower-limit <lower-limit> ]"
    ],
    "ParentView": [
        "TWAMP-light view"
    ],
    "ParaDef": [
        {
            "Parameters": "upper-limit upper-limit",
            "Info": "Specifies a two-way packet loss alarm threshold.\nThe value is a floating number ranging from 0.0002% to 99.9999%. The default value is 0.1000%."
        },
        {
            "Parameters": "lower-limit lower-limit",
            "Info": "Specifies a two-way packet loss clear alarm threshold.\nThe value is a floating number ranging from 0.0001% to 99.9998%. The default value is 0.0500%."
        },
        {
            "Parameters": "test-session session-id",
            "Info": "Specifies the ID of a test session.\nFor the X3 device, the value is an integer ranging from 1 to 3072.For the X8/X16 device, the value is an integer ranging from 1 to 8192."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nqa twamp-light",
            "[~HUAWEI-twamp-light] client",
            "[~HUAWEI-twamp-light-client] test-session 1 sender-ip 1.1.1.1 reflector-ip 2.2.2.2 sender-port 3000 reflector-port 3000",
            "[~HUAWEI-twamp-light-client] quit",
            "[~HUAWEI-twamp-light] twoway-loss threshold test-session 1 upper-limit 0.2 lower-limit 0.03"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure the two-way packet loss alarm threshold, run the twoway-loss threshold command. After a two-way packet loss alarm threshold is configured, an alarm is generated if the two-way packet loss rate within one minute exceeds the threshold. The alarm instructs network administrators to adjust link bandwidth in time for service quality guarantee.\nPrerequisites\nA TWAMP Light test session has been created on the Control-Client."
}