{
    "PageTitle": "stp mode",
    "FuncDef": "The stp mode command sets an operation mode for a spanning tree protocol.\nThe undo stp mode command restores the default operation mode of a spanning tree protocol.\nBy default, the operation mode of a spanning tree protocol is Multiple Spanning Tree Protocol (MSTP).",
    "CLIs": [
        "stp mode { mstp | rstp | stp }",
        "undo stp mode"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "mstp",
            "Info": "Indicates the MSTP mode.\n-"
        },
        {
            "Parameters": "rstp",
            "Info": "Indicates the rapid spanning tree protocol (RSTP) mode.\n-"
        },
        {
            "Parameters": "stp",
            "Info": "Indicates the STP mode.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] stp mode stp"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn an STP/RSTP/MSTP network, devices running different spanning tree protocols cannot communicate with each other. As a result, spanning trees cannot be properly calculated.To resolve this problem, run the stp mode command to configure a proper operation mode for a local device so that the remote device can identify BPDUs sent by the local device. The operation mode can be MSTP, RSTP, or STP.By default, all ports on a device operate in MSTP mode. When a port is directly connected to an STP port, the operation mode of the port is automatically switched to STP.\n\nConfiguration Impact\nAfter the stp mode mstp command is run in an MSTP process, all MSTP process-binding ports except the port directly connected to an STP port operate in MSTP mode and send MST BPDUs. The port directly connected to an STP port operates in STP mode.After the stp mode rstp command is run in an MSTP process, all MSTP process-binding ports except the port directly connected to an STP port operate in RSTP mode and send RST BPDUs. The port directly connected to an STP port operates in STP mode.After the stp mode stp command is run in an MSTP process, all ports bound to the MSTP process operate in STP mode and send STP configuration BPDUs.\n\nPrecautions\nA port operating in MSTP mode can communicate with a port operating in RSTP mode.\nThe stp mode rstp command can be used to enable a device that does not support MSTP to communicate with an STP device."
}