{
    "PageTitle": "stp permit packet source-mac",
    "FuncDef": "The stp permit packet source-mac command enables the function to process STP, RSTP, and MSTP BPDUs that carry a specified source MAC address.\nThe undo stp permit packet source-mac command disables the function to process STP, RSTP, and MSTP BPDUs that carry a specified source MAC address.\nBy default, the function to process STP, RSTP, and MSTP BPDUs that carry a specified source MAC address is not enabled.",
    "CLIs": [
        "stp permit packet source-mac <source-mac> <source-mac-mask>",
        "undo stp permit packet source-mac <source-mac> <source-mac-mask>"
    ],
    "ParentView": [
        "Layer 2 100GE interface view",
        "100GE interface view",
        "Layer 2 10GE interface view",
        "10GE interface view",
        "25GE-L2 view",
        "25GE interface view",
        "400GE-L2 view",
        "400GE interface view",
        "Layer 2 40GE interface view",
        "40GE interface view",
        "Layer 2 50GE interface view",
        "50GE interface view",
        "Layer 2 50|100GE interface view",
        "50|100GE interface view",
        "Layer 2 Eth-Trunk interface view",
        "Eth-Trunk interface view",
        "Layer 2 GE interface view",
        "GE optical interface view",
        "GE electrical interface view",
        "Interface group view"
    ],
    "ParaDef": [
        {
            "Parameters": "source-mac source-mac",
            "Info": "Specifies the source MAC address based on which STP, RSTP, and MSTP BPDUs are processed.\nThe value is a 12-digit hexadecimal number, in the format of H-H-H. Each H is 4 digits. If an H contains fewer than 4 digits, the left-most digits are padded with zeros. For example, e0 is displayed as 00e0."
        },
        {
            "Parameters": "source-mac-mask",
            "Info": "Specifies a mask of the source MAC address.\nThe value is a 12-digit hexadecimal number, in the format of H-H-H. Each H is 4 digits. If an H contains fewer than 4 digits, the left-most digits are padded with zeros. For example, e0 is displayed as 00e0."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] stp enable",
            "[*HUAWEI-GigabitEthernet1/0/1] stp permit packet source-mac 00e0-fc12-3456 ffff-ffff-0000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn a network running STP, RSTP, or MSTP, if a device transparently transmits unexpected STP, RSTP, or MSTP BPDUs, network flapping may occur. To address this problem, run the stp permit packet command to enable the device to process only the STP, RSTP, and MSTP BPDUs carrying a specified source MAC address.\nPrerequisites\nTo set the stp deny packet command, run the stp enable command on the interface to enable STP/RSTP/MSTP.\nPrecautions\nA maximum of 16 source MAC addresses can be configured in the same interface view or VSI-LDP-PW view.If both the stp deny packet and stp permit packet commands are configured in the same interface view or VSI-LDP-PW view, the device preferentially executes the stp deny packet command.If the function to process STP, RSTP, and MSTP BPDUs that carry a specified source MAC address is incorrectly enabled, a broadcast storm may occur. Therefore, ensure that the source MAC address and source MAC address mask are correct before executing the stp permit packet command."
}