{
    "PageTitle": "stp (Ethernet interface view)",
    "FuncDef": "The stp enable command enables STP/Rapid Spanning Tree Protocol (RSTP)/Multiple Spanning Tree Protocol (MSTP) on an Eth-Trunk interface.\nThe undo stp enable command cancels the stp enable command configuration.\nThe stp disable command disables STP/RSTP/MSTP on an Eth-Trunk interface.\nThe undo stp disable command cancels the stp disable command configuration.\nBy default, STP/RSTP/MSTP is enabled on a Eth-Trunk interface.",
    "CLIs": [
        "stp { enable | disable }",
        "undo stp { enable | disable }"
    ],
    "ParentView": [
        "50GE interface view",
        "40GE interface view",
        "50|100GE interface view",
        "400GE interface view",
        "10GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Eth-Trunk interface view",
        "100GE interface view",
        "GE electrical interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[*HUAWEI] e-trunk 1",
            "[*HUAWEI-e-trunk-1] stp enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn a complex Layer 2 network, STP/RSTP/MSTP can be configured on devices to prevent or break loops.To enable STP/RSTP/MSTP, run the stp enable command. The devices running STP/RSTP/MSTP exchange information to discover loops on the network and block some interfaces to trim the ring topology into a loop-free tree topology. This prevents packet replication and circular propagation and device performance deterioration.Spanning tree calculation consumes system resources. Therefore, run the stp disable command to disable STP/RSTP/MSTP on devices or interfaces that do not need to participate in spanning tree calculation.\n\nConfiguration Impact\nIf STP/RSTP/MSTP is enabled on an interface, the interface participates in spanning tree calculation, and its forwarding state is determined based the calculation result.\nIf STP/RSTP/MSTP is disabled on an interface, the interface does not participate in spanning tree calculation and is always in the forwarding state.\nPrecautions\nIf the undo stp enable or stp disable command is run in the system view, the global STP/RSTP/MSTP function is disabled, which may cause a loop.STP/RSTP/MSTP must be enabled on all interfaces that participate in spanning tree calculation. Otherwise, a loop may occur.If STP and VPLS multi-homing (VPLS multi-homing enables data packets to be blocked on the backup PE's AC interface, preventing loops) have been deployed, the AC interfaces of both the master and backup PEs may be blocked because the backup PE's AC interface does not block Layer 2 protocol packets."
}