{
    "PageTitle": "display stp (MSTP process region view)",
    "FuncDef": "The display stp command displays the status of and statistics about the Multiple Spanning Tree Protocol (MSTP).",
    "CLIs": [
        "display stp [ instance <instance-id> ] [ interface { <interface-name> | <interface-type> <interface-number> } | slot <slot-id> | vsi <vsi-name> pw <pw-name> ] [ brief ]",
        "display stp [ instance <instance-id> ] [ interface { <interface-name> | <interface-type> <interface-number> } | vsi <vsi-name> pw <pw-name> ] tc-bpdu statistics",
        "display stp [ instance <instance-id> ] topology-change",
        "display stp active",
        "display stp bridge { local | root }",
        "display stp global",
        "display stp [ instance <instance-id> ] abnormal-interface"
    ],
    "ParentView": [
        "MSTP process region view"
    ],
    "ParaDef": [
        {
            "Parameters": "instance instance-id",
            "Info": "Displays statistics about the topology changes of a specified STP instance.\nIf instance <instance-id> is not specified, statistics about the topology changes of a Common and Internal Spanning Tree (CIST) instance are displayed.\nThe value is an integer ranging from 0 to 4094, Value 0 indicates CIST."
        },
        {
            "Parameters": "interface-name",
            "Info": "Specifies the interface name.\n-"
        },
        {
            "Parameters": "interface-type",
            "Info": "Specifies the interface type.\n-"
        },
        {
            "Parameters": "interface-number",
            "Info": "Specifies the interface number.\n-"
        },
        {
            "Parameters": "slot slot-id",
            "Info": "Specifies the number of the slot where the interface resides.\nThe value is a string of 1 to 23 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "vsi vsi-name",
            "Info": "Specifies the names of a virtual switching instance (VSI).\nThe vsi-name is a string of 1 to 31 case-sensitive characters, spaces not supported.\nWhen quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "pw pw-name",
            "Info": "Specifies the names of a pseudo wire (PW).\nThe pw-name is a string of 1 to 15 case-sensitive characters, spaces not supported.\nWhen quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "brief",
            "Info": "Displays the brief status.\n-"
        },
        {
            "Parameters": "tc-bpdu",
            "Info": "Displays the statistics about sent and received topology change (TC) and topology change notification (TCN) BPDUs on interfaces.\n-"
        },
        {
            "Parameters": "statistics",
            "Info": "Displays the statistics about sent and received topology change (TC) and topology change notification (TCN) BPDUs on interfaces.\n-"
        },
        {
            "Parameters": "topology-change",
            "Info": "Displays statistics about Multiple Spanning Tree Protocol (MSTP) topology changes.\n-"
        },
        {
            "Parameters": "active",
            "Info": "Displays the status of and statistics on spanning trees of all Up interfaces.\nTo view information about spanning trees on all Up interfaces, run the display stp active command.\n-"
        },
        {
            "Parameters": "bridge",
            "Info": "Displays detailed information about the spanning tree of a bridge.\nTo view detailed information about the spanning trees of the root and local bridges, run the display stp bridge command.\n-"
        },
        {
            "Parameters": "local",
            "Info": "Displays detailed information about the spanning tree of the local bridge.\n-"
        },
        {
            "Parameters": "root",
            "Info": "Displays detailed information about the spanning tree of the root bridge.\n-"
        },
        {
            "Parameters": "global",
            "Info": "Displays global Spanning Tree Protocol (STP) information.\n-"
        },
        {
            "Parameters": "abnormal-interface",
            "Info": "Displays information about abnormal interfaces running the Spanning Tree Protocol (STP).\nRun the display stp abnormal-interface command can query information about abnormal STP interfaces quickly.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] stp process 1",
            "[~HUAWEI-mst-process-1] stp region-configuration",
            "[~HUAWEI-mst-process-1-region] display stp global",
            "Protocol Status            :Disabled",
            "Bpdu-filter default        :Disabled",
            "Tc-protection              :Enabled",
            "Tc-protection threshold    :1",
            "Tc-protection interval     :2s",
            "Edged port default         :Disabled",
            "Pathcost-standard          :Dot1T",
            "Timer-factor               :3",
            "Transmit-limit             :6",
            "Bridge-diameter            :7",
            "-------[CIST Global Info][Mode MSTP]-------",
            "CIST Bridge         :32768.38ba-99a7-5001",
            "Config Times        :Hello 2s MaxAge 20s FwDly 15s MaxHop 20",
            "Active Times        :Hello 2s MaxAge 20s FwDly 15s MaxHop 20",
            "CIST Root/ERPC      :32768.38ba-99a7-5001 / 0 (This bridge is the root)",
            "CIST RegRoot/IRPC   :32768.38ba-99a7-5001 / 0 (This bridge is the root)",
            "CIST RootPortId     :0.0",
            "BPDU-Protection     :Disabled",
            "TC or TCN received  :0",
            "TC count per hello  :0",
            "STP Converge Mode   :Normal",
            "Time since last TC  :0 days 0h:0m:0s",
            "Number of TC        :0",
            "Topo Change Flag    :0"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] stp process 1",
            "[~HUAWEI-mst-process-1] stp region-configuration",
            "[~HUAWEI-mst-process-1-region] display stp active",
            " Protocol Status       :Disabled ",
            " Protocol Standard     :IEEE 802.1s",
            " Version               :3",
            " CIST Bridge Priority  :32768",
            " MAC address           :38ba-99a7-5001",
            " Max age(s)            :20",
            " Forward delay(s)      :15",
            " Hello time(s)         :2",
            " Max hops              :20"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe display stp command is used to check whether the spanning tree protocol is run on the existing device or specified interface.If the Protocol Status field value is disabled, the spanning tree protocol is not run.If STP/RSTP/MSTP has been run, information such as the working mode of the spanning tree protocol will be displayed.The display stp brief command displays information about spanning trees on interfaces, but not global information.The display stp global command displays global STP information.The display stp tc-bpdu statistics command displays statistics about sent and received topology change and topology change notification BPDUs on interfaces.To determine whether a fault has occurred on interfaces that send and receive TC (Topology Change)/TCN (Topology Change Notification) BPDUs, run display stp tc-bpdu statistics command to view statistics about sent and received BPDUs. The command output helps you locate the fault.The display stp topology-change command displays statistics about Multiple Spanning Tree Protocol (MSTP) topology changes.On a Layer 2 network running MSTP, a device clears ARP entries and MAC entries after receiving TC BPDUs. If a device receives too many TC BPDUs, the device will frequently clear ARP entries and MAC entries, causing high CPU usage. As a result, network traffic is unstable.You can run the display stp topology-change command to display statistics about MSTP topology changes. If the statistics increase, network flapping occurs.The display stp active command displays the status of and statistics on spanning trees of all Up interfaces.The display stp bridge command displays detailed information about the spanning trees of the root and local bridges.The display stp abnormal-interface command displays information about abnormal interfaces running the STP."
}