{
    "PageTitle": "display stp tc-bpdu statistics (MSTP process view)",
    "FuncDef": "The display stp tc-bpdu statistics command displays statistics about sent and received topology change (TC) and topology change notification (TCN) BPDUs in a Multiple Spanning Tree Protocol (MSTP) process.",
    "CLIs": [
        "display stp [ instance <instance-id> ] [ interface { <interface-name> | <interface-type> <interface-number> } | slot <slot-id> | vsi <vsi-name> pw <pw-name> ] tc-bpdu statistics"
    ],
    "ParentView": [
        "MSTP process view"
    ],
    "ParaDef": [
        {
            "Parameters": "instance instance-id",
            "Info": "Specifies the ID of an MSTP instance.\nIf instance <instance-id> is not specified, statistics about TC and TCN BPDUs on all interfaces are displayed in the sequence of the interface numbers.\nThe value is an integer ranging from 0 to 4094, Value 0 indicates CIST."
        },
        {
            "Parameters": "interface interface-type interface-number",
            "Info": "Displays information of a spanning tree on a specified interface.\nIf interface <ifType> <ifNum> is not specified, the status of and statistics about all interfaces will be displayed in the sequence of the interface numbers.\n-"
        },
        {
            "Parameters": "slot slot-id",
            "Info": "Specifies the number of a slot of which statistics about TC and TCN BPDUs are displayed.\nThe value is a string of 1 to 23 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "vsi vsi-name",
            "Info": "Specifies the names of a virtual switching instance (VSI).\nThe vsi-name is a string of 1 to 31 case-sensitive characters, spaces not supported.\nWhen quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "pw pw-name",
            "Info": "Specifies the names of a pseudo wire (PW).\nThe pw-name is a string of 1 to 15 case-sensitive characters, spaces not supported.\nWhen quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] stp process 1",
            "[*HUAWEI-stp-process-1] display stp tc-bpdu statistics",
            "-------------------------- STP TC/TCN information--------------------------",
            " MSTID Port                        TC(Send/Receive)      TCN(Send/Receive)",
            " 0     GigabitEthernet1/0/1        3/2                   0/0 ",
            " 0     GigabitEthernet1/0/2        1/0                   0/0 ",
            " 1     GigabitEthernet1/0/3        14/9                  -/-  ",
            " 1     GigabitEthernet1/0/4        8/10                  -/-  ",
            " 2     GigabitEthernet1/0/5        3/2                   -/-  ",
            " 2     GigabitEthernet1/0/6        1/0                   -/-"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo determine whether a fault has occurred on interfaces that send and receive TC/TCN BPDUs, run display stp tc-bpdu statistics command to view statistics about sent and received BPDUs. The command output helps you locate the fault."
}