{
    "PageTitle": "stp priority (MSTP process view)",
    "FuncDef": "The stp priority command sets a priority for a device on a spanning tree.\nThe undo stp priority command restores the default priority.\nBy default, the priority of a device on a spanning tree is 32768.",
    "CLIs": [
        "stp [ instance <instance-id> ] priority <priority>",
        "undo stp [ instance <instance-id> ] priority"
    ],
    "ParentView": [
        "MSTP process view"
    ],
    "ParaDef": [
        {
            "Parameters": "instance instance-id",
            "Info": "Specifies the ID of a spanning tree instance.\nIf this parameter is not specified, the configuration takes effect on a Common and Internal Spanning Tree (CIST) instance.\nThe value is an integer ranging from 0 to 4094, Value 0 indicates CIST."
        },
        {
            "Parameters": "priority",
            "Info": "Specifies the priority of a device.\nA smaller value indicates a higher priority.\nThe value ranges from 0 to 61440. The value is an integer multiple of 4096, such as 0, 4096, and 8192."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] stp process 1",
            "[*HUAWEI-stp-process-1] stp instance 1 priority 4096"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nPriorities of devices are an important factor to calculate a spanning tree and determine root bridge selection.\nOn a network running STP/RSTP/MSTP, each spanning tree has only one root bridge responsible for sending Bridge Protocol Data Units (BPDUs). Because the root bridge is of great importance, it is hoped that a device with high performance and network hierarchy can be chosen as the root bridge. However, this cannot be achieved if the device has a low priority. To set a priority for the device, run the stp priority command.\nYou can also run the stp priority command to set a low priority for devices with low performance and network hierarchy so that these devices are not selected as the root bridge.\nOn an MSTP network, each device can be set with a unique priority in each spanning tree instance.\nConfiguration Impact\nA smaller priority value indicates a higher possibility to be selected as the root bridge."
}