{
    "PageTitle": "stp mode (MSTP process view)",
    "FuncDef": "The stp mode command sets an operation mode for a spanning tree protocol in a Multiple Spanning Tree Protocol (MSTP) process.\nThe undo stp mode command restores the default operation mode of a spanning tree protocol in an MSTP process.\nBy default, the operation mode of a spanning tree protocol in an MSTP process is MSTP.",
    "CLIs": [
        "stp mode { mstp | rstp | stp }",
        "undo stp mode"
    ],
    "ParentView": [
        "MSTP process view"
    ],
    "ParaDef": [
        {
            "Parameters": "mstp",
            "Info": "Indicates that all the ports bound to an MSTP process work in the MSTP mode.\n-"
        },
        {
            "Parameters": "rstp",
            "Info": "Indicates that all the ports bound to an MSTP process work in the RSTPmode.\n-"
        },
        {
            "Parameters": "stp",
            "Info": "Indicates that all the ports bound to an MSTP process work in the STP mode.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] stp process 1",
            "[*HUAWEI-stp-process-1] stp mode stp"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter an MSTP process is created on an MSTP network, all ports bound to the MSTP process operate in MSTP mode by default. These ports may be connected to STP/RSTP devices, and spanning trees cannot be properly calculated because devices running different spanning tree protocols cannot exchange packets.To address this problem, run the stp mode command to set an operation mode for a device. The operation mode can be MSTP, RSTP, or STP.By default, if a port bound to an MSTP process is connected to an STP device, the operation mode of this port is automatically switched to STP and the operation mode of the other ports remains MSTP.\n\nConfiguration Impact\nAfter the stp mode mstp command is run in an MSTP process, all MSTP process-binding ports except the port directly connected to an STP port operate in MSTP mode and send MST BPDUs. The port directly connected to an STP port operates in STP mode.After the stp mode rstp command is run in an MSTP process, all MSTP process-binding ports except the port directly connected to an STP port operate in RSTP mode and send RST BPDUs. The port directly connected to an STP port operates in STP mode.After the stp mode stp command is run in an MSTP process, all ports bound to the MSTP process operate in STP mode and send STP configuration BPDUs.\n\nPrecautions\nA port operating in MSTP mode can communicate with a port operating in RSTP mode.\nRunning the stp mode rstp command on a device that supports MSTP is not recommended. The function of the stp mode rstp command can be implemented by the stp mode mstp command by default."
}