{
    "PageTitle": "stp bpdu vlan",
    "FuncDef": "The stp bpdu vlan command enables an interface to add a specified VLAN ID to bridge protocol data units (BPDUs) before sending them.\nThe undo stp bpdu vlan command disables the function.\nBy default, an interface does not add a VLAN ID to BPDUs that it sends.",
    "CLIs": [
        "stp bpdu vlan <vlan-id>",
        "undo stp bpdu vlan"
    ],
    "ParentView": [
        "Layer 2 100GE interface view",
        "Layer 2 10GE interface view",
        "25GE-L2 view",
        "400GE-L2 view",
        "Layer 2 40GE interface view",
        "Layer 2 50GE interface view",
        "Layer 2 50|100GE interface view",
        "Layer 2 Eth-Trunk interface view",
        "Layer 2 GE interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "vlan-id",
            "Info": "Specifies the VLAN ID that the interface adds to BPDUs.\nThe value is an integer ranging from 1 to 4094."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] vlan 100",
            "[*HUAWEI-vlan100] commit",
            "[~HUAWEI-vlan100] quit",
            "[~HUAWEI] interface GigabitEthernet 1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] portswitch",
            "[*HUAWEI-GigabitEthernet1/0/1] port trunk allow-pass vlan 100",
            "[*HUAWEI-GigabitEthernet1/0/1] stp bpdu vlan 100"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf multiple user networks are connected to the same interface of a PE, configure the interfaces of CEs to add specific VLAN IDs to BPDUs before sending them to the PE.Run the stp bpdu vlan command on an interface of a CE to add a specified VLAN ID to BPDUs before sending them. Then, run the bpdu-tunnel stp vlan command on the interface of the PE that is connected to the CE to allow the BPDUs carrying the specified VLAN ID to be transparently transmitted over the carrier network.In most cases, the stp bpdu vlan command is configured on the network-side interface of a CE.\n\nPrerequisites\nIf the interface is a Layer 3 interface, it must have been switched to a Layer 2 interface using the portswitch command.\nThe interface has been added to a specified VLAN."
}