{
    "PageTitle": "stp bpdu-filter default",
    "FuncDef": "The stp bpdu-filter default command configures all ports of a device as bridge protocol data unit (BPDU)-filter ports.\nThe undo stp bpdu-filter default command configures all ports of a device as non-BPDU-filter ports.\nBy default, ports are non-BPDU-filter ports.",
    "CLIs": [
        "stp bpdu-filter default",
        "undo stp bpdu-filter default"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] stp bpdu-filter default"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn a network running STP, if a port is configured as an edge port using the stp edged-port enable command, the port will not participate in the spanning tree calculation. This speeds up network convergence and improves network stability. However, this port may send BPDUs to other networks, causing network flapping.\nTo prevent this problem, run the stp bpdu-filter enable command on the edge port. The port becomes a BPDU-filter port and will not process BPDUs.\nRunning the stp bpdu-filter enable command in the interface view configures only the current port as a BPDU-filter port. If multiple BPDU-filter ports are required on a device, run the stp bpdu-filter default command in the system view to configure all edge ports as BPDU-filter ports.\nPrecautions\nIf a port is configured as a non-BPDU filter port using the undo stp bpdu-filter command, the port becomes a BPDU-filter port after the stp bpdu-filter default command is run, and remains a non-BPDU filter after the stp bpdu-filter disable command is run.\nAfter the stp bpdu-filter default and stp edged-port default commands are run in the system view, no ports on the device send BPDUs or negotiate with directly connected interfaces on the remote device. All the ports are in the forwarding state. This may lead to a loop and cause a broadcast storm. Therefore, exercise caution when running the stp bpdu-filter default and stp edged-port default commands in the system view."
}