{
    "PageTitle": "stp binding process to link-share (Layer 2 sub-interface view)",
    "FuncDef": "The stp binding process to link-share command configures an interface to participate in status calculation in multiple MSTP processes.\nThe undo stp binding process to link-share command removes an interface from status calculation of a certain MSTP process.\nBy default, an MSTP interface participates in status calculation only in MSTP process 0.",
    "CLIs": [
        "stp binding process <process-id1> to <process-id2> link-share",
        "undo stp binding process <process-id1> to <process-id2>"
    ],
    "ParentView": [
        "Layer 2 100GE interface view",
        "Layer 2 10GE interface view",
        "25GE-L2 view",
        "400GE-L2 view",
        "Layer 2 40GE interface view",
        "Layer 2 50GE interface view",
        "Layer 2 50|100GE interface view",
        "Layer 2 Eth-Trunk interface view",
        "Layer 2 GE interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "process-id1",
            "Info": "Specifies the ID of the start MSTP process.\nThe value is an integer ranging from 1 to 256."
        },
        {
            "Parameters": "to process-id2",
            "Info": "Specifies the ID of the end MSTP process.\nThe value is an integer ranging from 1 to 256."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] stp process 1",
            "[*HUAWEI-stp-process-1] quit",
            "[*HUAWEI] stp process 2",
            "[*HUAWEI-stp-process-2] quit",
            "[*HUAWEI] interface GigabitEthernet 1/0/1",
            "[*HUAWEI-GigabitEthernet1/0/1] portswitch",
            "[*HUAWEI-GigabitEthernet1/0/1] stp binding process 1 to 2 link-share"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn a Layer 2 network running MSTP, the link used by multiple access rings is a public link. An interface on the public link participates in the spanning tree calculation for multiple MSTP processes and access rings. Each MSTP process calculates an interface status. As a result, the interface may have multiple status, and which status is used cannot be determined. To prevent this problem, run the stp binding process link-share command to add the interface to multiple MSTP processes. The interface always uses its status in MSTP process 0, although it participates in status calculation in multiple MSTP processes.\nConfiguration Impact\nAfter the stp binding process link-share command is run on an interface, the interface will perform the following operations:\nParticipates in status calculation of a specified MSTP process without affecting packet forwarding of this MSTP process.Participates in status calculation of MSTP process 0, affecting packet forwarding of this MSTP process.\nIf the stp binding process link-share command is run more than once, all configurations take effect.\n\nPrecautions\nThe interface configured with the stp binding process link-share command must be an interface on the public link between devices configured with the MSTP multi-process, but not an interface that connects a device to an access ring.If a process has a public link, the stp enable command must be run in the view of this process to enable MSTP globally.For an interface that is added to a process in link-share mode, you must run the stp enable command in the interface view to enable MSTP.For an interface that is added to a process in link-share mode, the interface participates in status calculation of MSTP process 0. You must run the stp enable command to enable MSTP for process 0."
}