{
    "PageTitle": "stp edged-port default",
    "FuncDef": "The stp edged-port default command configures all ports as edge ports.\nThe undo stp edged-port default command restores the default setting.\nBy default, all ports are non-edge ports.",
    "CLIs": [
        "stp edged-port default",
        "undo stp edged-port default"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] stp edged-port default"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn a Layer 2 network running STP, if a port connected to a terminal is configured as an edge port using the stp edged-port enable command, the port will not participate in spanning tree calculation. This speeds up network convergence and improves network stability.\nRunning the stp edged-port enable command in the interface view configures only the current port as an edge port. If multiple edge ports are required on a device, run the stp edged-port default command in the system view to configure all ports as edge ports.\nConfiguration Impact\nAfter all ports are configured as edge ports using the stp edged-port default command, the edge-port automatic detection function does not take effect. After the undo stp edged-port default command is run to restore the default setting of the ports, the edge-port automatic detection function takes effect again.\nPrecautions\nAn edge port is automatically changed to a non-edge port after receiving a BPDU, and the spanning tree is recalculated.A non-edge port configured using the undo stp edged-port command will become an edge port if the stp edged-port default command is run in the system view. However, a non-edge port configured using the stp edged-port disable command remains a non-edge port, even if the stp edged-port default command is run in the system view.To prevent an edge port from becoming a non-edge port after the edge port receives bogus BPDUs, run the stp bpdu-protection command in the system view to configure BPDU protection. After BPDU protection is configured, if an edge port receives a BPDU, the device where the edge port resides shuts down the edge port but retains the edge port attribute. Meanwhile, the device notifies the NMS of the shutdown event.After the stp edged-port default command is run on a device, all ports of the device will be become edge ports. A loop may occur during network topology calculation. Therefore, exercise caution when using this command."
}