{
    "PageTitle": "stp no-agreement-check (Layer 2 Ethernet interface view)",
    "FuncDef": "The stp no-agreement-check command configures the common fast transition mechanism on an interface.\nThe undo stp no-agreement-check command restores the default fast transition mechanism on an interface.\nBy default, the enhanced fast transition mechanism is configured on an interface.",
    "CLIs": [
        "stp no-agreement-check",
        "undo stp no-agreement-check"
    ],
    "ParentView": [
        "Layer 2 100GE interface view",
        "Layer 2 10GE interface view",
        "25GE-L2 view",
        "400GE-L2 view",
        "Layer 2 40GE interface view",
        "Layer 2 50GE interface view",
        "Layer 2 50|100GE interface view",
        "Layer 2 Eth-Trunk interface view",
        "Layer 2 GE interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] portswitch",
            "[*HUAWEI-GigabitEthernet1/0/1] stp no-agreement-check"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf Huawei and non-Huawei data communication devices are deployed on a network running STP, the Huawei and non-Huawei devices may fail to communicate with each other, because they have different Proposal/Agreement mechanisms. To address this problem, run the stp no-agreement-check or undo stp no-agreement-check command to set a common or enhanced fast transition mechanism based on the Proposal/Agreement mechanism of the non-Huawei device.\nPrecautions\nBetween two interconnected devices on a spanning tree, the device closer to the root bridge is the upstream device of the other device. The fast transition mechanism is also called the Proposal/Agreement mechanism. The\ndevice currently supports the following modes:\nEnhanced mode: The current interface counts a root port when it calculates the synchronization flag bit.An upstream device sends a Proposal message to a downstream device requesting fast status transition. After receiving the message, the downstream device sets the port connected to the upstream device to the root port and blocks all non-edge ports.The upstream device then sends an Agreement message to the downstream device. After the downstream device receives the message, the root port changes to the Forwarding state.The downstream device then responds with an Agreement message. After receiving the message, the upstream device sets the port connected to the downstream device to the designated port, and then the status of the designated port changes to Forwarding.Common mode: The current interface ignores the root port when it calculates the synchronization flag bit.An upstream device sends a Proposal message to a downstream device requesting fast status transition. After receiving the message, the downstream device sets the port connected to the upstream device to the root port and blocks all non-edge ports. Then, the status of the root port changes to Forwarding.The downstream device then responds with an Agreement message. After receiving the message, the upstream device sets the port connected to the downstream device to the designated port, and then the status of the designated port changes to Forwarding."
}