{
    "PageTitle": "stp point-to-point (Ethernet interface view)",
    "FuncDef": "The stp point-to-point command sets the link type of a port.\nThe undo stp point-to-point command restores the default link type.\nBy default,the link type of the ports on the device is auto. That is, the spanning tree protocol detects whether a port is connected to a point to point (P2P) link.",
    "CLIs": [
        "stp point-to-point { auto | force-false | force-true }",
        "undo stp point-to-point"
    ],
    "ParentView": [
        "50GE interface view",
        "40GE interface view",
        "50|100GE interface view",
        "400GE interface view",
        "10GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Eth-Trunk interface view",
        "100GE interface view",
        "GE electrical interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "auto",
            "Info": "Indicates that the spanning tree protocol detects automatically whether the port is connected to a P2P link.\n-"
        },
        {
            "Parameters": "force-false",
            "Info": "Indicates that the link type is non-P2P.\n-"
        },
        {
            "Parameters": "force-true",
            "Info": "Indicates that the link type is P2P.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface eth-trunk 1",
            "[*HUAWEI-Eth-Trunk1] portswitch",
            "[*HUAWEI-Eth-Trunk1] stp point-to-point force-true"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn a Layer 2 network running STP, if a port of a device is connected to a non-P2P link, the port cannot perform fast status transition.\nIf a port works in full-duplex mode, the port is connected to a P2P link, and force-true can be set in the stp point-to-point command.\nIf a port works in half-duplex mode, run the stp point-to-point force-true command to forcibly set the type of the link to which the port is connected to P2P, implementing rapid network convergence.\nConfiguration Impact\nThe stp point-to-point command configuration on a port takes effect in all spanning tree instances where the port resides."
}