{
    "PageTitle": "stp vpls-subinterface enable (Ethernet interface view)",
    "FuncDef": "The stp vpls-subinterface enable command enables an interface to instruct its VSI-bound sub-interfaces to update ARP and MAC entries after it receives TC BPDUs.\nThe undo stp vpls-subinterface enable command disables an interface from instructing its VSI-bound sub-interfaces to update ARP and MAC entries after it receives TC BPDUs.\nBy default, an interface does not instruct its VSI-bound sub-interfaces to update ARP and MAC entries after it receives TC BPDUs.",
    "CLIs": [
        "stp vpls-subinterface enable",
        "undo stp vpls-subinterface enable"
    ],
    "ParentView": [
        "50GE interface view",
        "40GE interface view",
        "50|100GE interface view",
        "400GE interface view",
        "10GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Eth-Trunk interface view",
        "100GE interface view",
        "GE electrical interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface eth-trunk 1",
            "[*HUAWEI-Eth-Trunk1] portswitch",
            "[*HUAWEI-Eth-Trunk1] stp vpls-subinterface enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn normal situations, when an STP topology changes and an interface receives TC BPDUs, the interface recalculates the spanning tree, and accordingly all devices will update ARP and MAC entries. However, if an STP-enabled interface has sub-interfaces that are bound to VSIs, the sub-interfaces cannot detect the topology change immediately, and ARP and MAC entries cannot be updated on the VPLS network in time. To prevent this problem, run the stp vpls-subinterface enable command to enable an STP-enabled interface to instruct its VSI-bound sub-interfaces to update ARP and MAC entries after it receives TC BPDUs.\nPrerequisites\nTo set the stp vpls-subinterface enable command, run the stp enable command on the interface to enable STP.\nConfiguration Impact\nWhen the forwarding status of an interface goes to Discarding, its VSI-bound sub-interfaces will go to the Flowdown state to prevent loops on the VPLS network on which a CE is dual-homed to PEs.\nPrecautions\nThe stp vpls-subinterface enable and erps vpls-subinterface enable commands are mutually exclusive on the same interface."
}