{
    "PageTitle": "ds-lite alarm address-group port-number threshold",
    "FuncDef": "The ds-lite alarm address-group port-number threshold command sets alarm thresholds for port usage and port pre-allocation usage in a DS-Lite address pool so that a device generates an alarm if usage exceeds the specified threshold.\nThe undo ds-lite alarm address-group port-number threshold command restores the default alarm thresholds for port usage and port pre-allocation usage in a DS-Lite address pool.\nThe default alarm thresholds for port usage and port pre-allocation usage in a DS-Lite address pool are 80%.",
    "CLIs": [
        "ds-lite alarm address-group port-number threshold <threshold-value>",
        "undo ds-lite alarm address-group port-number threshold [ <threshold-value> ]"
    ],
    "ParentView": [
        "DS-Lite instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "threshold-value",
            "Info": "Sets an alarm threshold for the number of used ports and the number of port pre-allocation times in a DS-Lite address pool.\nPort pre-allocation ratio of a DS-Lite address pool = Number of times that port pre-allocation is performed in the DS-Lite address pool/Maximum number of times that port pre-allocation can be performed in the DS-Lite address pool.\nThe value is an integer ranging from 60 to 100, in percentage. The default value is 80."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ds-lite instance cpe1 id 1",
            "[*HUAWEI-ds-lite-instance-cpe1] ds-lite alarm address-group port-number threshold 85"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf you want to monitor port usage and port pre-allocation usage of every DS-Lite address pool on a DS-Lite device, run the ds-lite alarm address-group port-number threshold command to set an alarm threshold of every DS-Lite address pool.\nConfiguration Impact\nIf DS-Lite port usage reaches the specified alarm threshold, a service board sends an alarm to the NMS. If DS-Lite port usage exceeds the alarm threshold, the service board does not repeatedly send an alarm. After DS-Lite port usage falls to 87.5%, the service board sends a clear alarm to the NMS.\nPrecautions\nThe ds-lite alarm address-group port-number threshold command takes effect on all address pools of a DS-Lite instance."
}