{
    "PageTitle": "ds-lite log send-mode",
    "FuncDef": "The ds-lite log send-mode command configures the mode of sending DS-Lite logs.\nThe undo ds-lite log send-mode command restores the default configuration.\nBy default, logs are sent when a DS-Lite session is created and when a DS-Lite session ages out.",
    "CLIs": [
        "ds-lite log send-mode { session-start-only | session-end-only }",
        "undo ds-lite log send-mode { session-start-only | session-end-only }"
    ],
    "ParentView": [
        "DS-Lite instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "session-start-only",
            "Info": "Indicates that logs are sent only when a DS-Lite session is created.\n-"
        },
        {
            "Parameters": "session-end-only",
            "Info": "Indicates that logs are sent only when a DS-Lite session ages out.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ds-lite instance nat1 id 1",
            "[*HUAWEI-ds-lite-instance-nat1] ds-lite log send-mode session-start-only"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, logs are sent when a DS-Lite session is created and when a DS-Lite session ages out. To allow logs to be sent only when a DS-Lite session is created or ages out so that the number of DS-Lite logs is reduced, run the log send-mode command.\nPrecaution\nThis command takes effect only after the DS-Lite log function is enabled on a DS-Lite instance.\nIf the session-start-only parameter is specified, logs are sent only when a DS-Lite session is created. In this case, the DS-Lite session aging time cannot be specified after a DS-Lite session ages out.\nIf the session-end-only parameter is specified, logs are sent only when a DS-Lite session ages out. In this case, information about the DS-Lite session is not displayed on the log server before the DS-Lite session ages out. If the DS-Lite session keeps not aging out (traffic always exists), information about the DS-Lite session will never be displayed on the log server. If the board is reset, log tracing fails.\nPrecautions\nThis command takes effect only after the DS-Lite log function is enabled on a DS-Lite instance.\nIf the session-start-only parameter is specified, logs are sent only when a DS-Lite session is created. In this case, the DS-Lite session aging time cannot be specified after a DS-Lite session ages out.\nIf the session-end-only parameter is specified, logs are sent only when a DS-Lite session ages out. In this case, information about the DS-Lite session is not displayed on the log server before the DS-Lite session ages out. If the DS-Lite session keeps not aging out (traffic always exists), information about the DS-Lite session will never be displayed on the log server. If the board is reset, log tracing fails."
}