{
    "PageTitle": "ds-lite bind instance",
    "FuncDef": "The ds-lite bind instance command binds a DS-Lite instance to a traffic behavior.\nThe undo ds-lite command deletes the binding between a DS-Lite instance and a traffic behavior.\nBy default, a DS-Lite instance is bound to no traffic behavior.",
    "CLIs": [
        "ds-lite bind instance <instance-name>",
        "undo ds-lite [ bind instance <instance-name> ]"
    ],
    "ParentView": [
        "Traffic behavior view"
    ],
    "ParaDef": [
        {
            "Parameters": "instance-name",
            "Info": "Specifies the name of a DS-Lite instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ds-lite instance cpe1 id 1",
            "[*HUAWEI-ds-lite-instance-cpe1] commit",
            "[~HUAWEI-ds-lite-instance-cpe1] quit",
            "[~HUAWEI] traffic behavior cpe1",
            "[*HUAWEI-behavior-cpe1] ds-lite bind instance cpe1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTraffic distribution policies must be defined to direct traffic to a service board for DS-Lite processing. The configuration involves defining ACL rules, traffic classifiers, traffic behaviors, and traffic distribution policies and applying the traffic distribution policies. To bind a DS-Lite instance to a traffic behavior, run the ds-lite bind instance command.\nPrerequisites\nACL rules have been configured to match user traffic to be processed by DS-Lite. Traffic classifiers have also been configured.\nFollow-up Procedure\nBind the traffic classifier with the traffic behavior in a traffic distribution policy and apply the traffic distribution policy to an interface or globally.\nPrecautions\nIn the traffic behavior view, the DS-Lite redirection is mutually exclusive with redirection actions (including the deny action, NAT44 traffic distribution, NAT64 traffic distribution, DNS redirection action, HTTP redirection action, and redirect action, and redirect-CPU action).\nBiding a DS-Lite instance to a traffic behavior is mutually exclusive with mirroring.\nIf the destination address of a packet matches both an ACL rule and a FIB entry, the ACL rule takes precedence over the FIB entry for traffic diversion. For example, a DS-Lite IPv6 prefix 2001:db8::1/96 is defined for DS-Lite instance A, and the prefix matches ACL1 which is bound to DS-Lite instance B. Packets destined for 2001:db8::1/96 are preferentially matched against ACL1 and assigned to DS-Lite instance B instead of DS-Lite instance A. As a result, DS-Lite processing fails to be performed for the packets."
}