{
    "PageTitle": "ds-lite alarm port-number enable",
    "FuncDef": "The ds-lite alarm port-number address-group disable command enables the log and alarm functions for DS-Lite user port usage.\nThe ds-lite alarm port-number user enable command enables the log and alarm functions for DS-Lite user port usage.\nThe undo ds-lite alarm port-number address-group disable command disables the log and alarm functions for DS-Lite user port usage.\nThe undo ds-lite alarm port-number user enable command disables the log and alarm functions for DS-Lite user port usage.\nBy default, the log and alarm functions of port usage of a DS-Lite public IP address pool are enabled, the log and alarm functions for DS-Lite user port usage are disabled.",
    "CLIs": [
        "ds-lite alarm port-number { log | trap } address-group disable",
        "ds-lite alarm port-number { log | trap } [ load-balance ] user enable",
        "undo ds-lite alarm port-number { log | trap } address-group disable",
        "undo ds-lite alarm port-number { log | trap } [ load-balance ] user enable"
    ],
    "ParentView": [
        "DS-Lite instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "log",
            "Info": "Enables or disables the log function for the port usage of DS-Lite users.\nEnables or disables the log function for the port usage of a public address pool.\n-"
        },
        {
            "Parameters": "trap",
            "Info": "Enables or disables the alarm function for the port usage of DS-Lite users.\nEnables or disables the trap function for the port usage of a public address pool.\n-"
        },
        {
            "Parameters": "load-balance",
            "Info": "Load balance.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ds-lite instance cpe1 id 1",
            "[*HUAWEI-ds-lite-instance-cpe1] ds-lite alarm port-number log user enable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ds-lite instance cpe1 id 1",
            "[*HUAWEI-ds-lite-instance-cpe1] ds-lite alarm port-number log address-group disable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo monitor the port usage of the public address pool, run the ds-lite alarm port-number address-group disable command in the NAT instance view to control whether the device sends an alarm upon port usage threshold-crossing of the public address pool and whether the alarm is cleared when the port usage decreases to 87.5% of the alarm threshold.\nBy default, the log and alarm functions for DS-Lite user port usage are disabled. To monitor DS-Lite user port usage, run the ds-lite alarm port-number user enable command to enable the log and alarm functions for DS-Lite user port usage.\nPrecautions\nThe ds-lite alarm port-number address-group disable command is applicable only to the NAT address pool in non-easy IP mode.\nThis command is applicable only to the VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S."
}