{
    "PageTitle": "ds-lite alg (DS-Lite instance view)",
    "FuncDef": "The ds-lite alg command enables the DS-Lite application level gateway (ALG) function to monitor specified application protocols.\nThe undo ds-lite alg command disables the DS-Lite ALG function from monitoring specified application protocols.\nBy default, the DS-Lite ALG function is enabled for ICMP, regardless of whether the DS-Lite ALG function is configured.",
    "CLIs": [
        "ds-lite alg { ftp [ rate-threshold <rate-threshold> ] | pptp | rtsp | sip | all | sip separate-translation }",
        "undo ds-lite alg { ftp [ rate-threshold [ rate-threshold ] ] | pptp | rtsp | sip | all | sip separate-translation }"
    ],
    "ParentView": [
        "DS-Lite instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "ftp",
            "Info": "Enables or disables the DS-Lite ALG function for FTP.\n-"
        },
        {
            "Parameters": "rate-threshold rate-threshold",
            "Info": "Sets the DS-Lite ALG rate at which FTP packets are sent.\nThe value is an integer ranging from 64 to 10000, in packets/second."
        },
        {
            "Parameters": "pptp",
            "Info": "Enables or disables the DS-Lite ALG function for PPTP.\n-"
        },
        {
            "Parameters": "rtsp",
            "Info": "Enables or disables the DS-Lite ALG function for RTSP.\n-"
        },
        {
            "Parameters": "sip",
            "Info": "Enables or disables the DS-Lite ALG function for SIP.\n-"
        },
        {
            "Parameters": "all",
            "Info": "Enables or disables the DS-Lite ALG function for all application layer protocols.\n-"
        },
        {
            "Parameters": "separate-translation",
            "Info": "Specifies that the SIP control channel and data channel match an address-based NAT server separately in the NAT instance view for NAT.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ds-lite instance cpe1 id 1",
            "[*HUAWEI-ds-lite-instance-cpe1] ds-lite alg ftp"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nDS-Lite translates only the IP addresses contained in user data packets and the port information in the Transmission Control Protocol (TCP)/User Datagram Protocol (UDP) headers of data packets. For special protocols (for example, FTP) the Data field in a packet contains IP address or port information. DS-Lite, however, does not take effect on an IP address or port information in the Data field of a packet. As a result, a protocol-specific connection fails to be established. A good way to solve the DS-Lite translation issue for these special protocols is to use the ALG function. Functioning as a special conversion agent for application protocols, the ALG interacts with the DS-Lite device to establish states. The ALG uses DS-Lite state information to change the specific data in the Data field of IP packets and to complete other necessary work, so that application protocols can run across internal and external networks.\nConfiguration Impact\nAfter the ALG function is enabled in the DS-Lite instance view, traffic of specified application protocols in a specified DS-Lite instance can be processed by the ALG."
}