{
    "PageTitle": "ds-lite address-group (DS-Lite instance view)",
    "FuncDef": "The ds-lite address-group command creates a DS-Lite address pool or displays the view of an existing DS-Lite address pool.\nThe undo ds-lite address-group command deletes a DS-Lite address pool.\nNo DS-Lite address pool is configured by default.",
    "CLIs": [
        "ds-lite address-group <address-group-name> [ group-id <id> [ vpn-instance <vpn-instance-name> ] ]",
        "ds-lite address-group <address-group-name> group-id <id> <start-address> { mask { <mask-length> | <address-mask> } | <end-address> } [ vpn-instance <vpn-instance-name> ]",
        "undo ds-lite address-group <address-group-name> [ group-id <id> [ vpn-instance <vpn-instance-name> ] ]",
        "undo ds-lite address-group <address-group-name> group-id <id> <start-address> { mask { <mask-length> | <address-mask> } | <end-address> } [ vpn-instance <vpn-instance-name> ]"
    ],
    "ParentView": [
        "DS-Lite instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "address-group-name",
            "Info": "Specifies the name of a DS-Lite public IP address pool.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "group-id id",
            "Info": "Specifies the ID of a DS-Lite public IP address pool.\nThe value is an integer ranging from 0 to 127."
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies the name of a VPN instance to which a DS-Lite public address pool is bound.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "start-address",
            "Info": "Specifies a start IP address in a DS-Lite public address pool.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "mask mask-length",
            "Info": "Specifies the mask length of a DS-Lite public address pool.\nThe value is an integer ranging from 1 to 32."
        },
        {
            "Parameters": "address-mask",
            "Info": "Specifies the mask of a DS-Lite public IP address pool.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "end-address",
            "Info": "Specifies an end IP address in a DS-Lite public address pool.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ds-lite instance cpe1 id 1",
            "[*HUAWEI-ds-lite-instance-cpe1] ds-lite address-group group1 group-id 1 192.168.131.1 192.168.131.155"
        ]
    ],
    "ExtraInfo": "A DS-Lite address pool is a collection of public IPv4 addresses. When IPv4-in-IPv6 packets are sent to a DS-Lite device through a DS-Lite tunnel, they are first decapsulated into IPv4 packets with the source IP addresses set to private IPv4 addresses. To transmit IPv4 packets to a public network, a device performs DS-Lite to translate IP addresses carried in IPv4 packets. The DS-Lite address pool used in DS-Lite is determined by a traffic policy."
}