{
    "PageTitle": "ds-lite address-group exclude-ip-address",
    "FuncDef": "The ds-lite address-group exclude-ip-address command excludes a specific IP address or a range of IP addresses from a DS-Lite address pool.\nThe undo ds-lite address-group exclude-ip-address command disables a device from excluding a specific IP address or a range of IP addresses from a DS-Lite address pool.\nNo IP address is excluded from a DS-Lite address pool by default.",
    "CLIs": [
        "ds-lite address-group <address-group-name> exclude-ip-address <start-address> [ <end-address> ]",
        "undo ds-lite address-group <address-group-name> exclude-ip-address <start-address> [ <end-address> ]"
    ],
    "ParentView": [
        "DS-Lite instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "address-group-name",
            "Info": "Specifies the name of a DS-Lite public IP address pool.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "start-address",
            "Info": "Specifies a start IP address in a DS-Lite public address pool.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "end-address",
            "Info": "Specifies an end IP address in a DS-Lite public address pool.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ds-lite instance cpe1 id 1",
            "[*HUAWEI-ds-lite-instance-cpe1] ds-lite address-group group1 group-id 1 10.0.0.0 10.0.0.254",
            "[*HUAWEI-ds-lite-instance-cpe1] ds-lite address-group group1 exclude-ip-address 10.0.0.0 10.0.0.5"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo exclude a specific IP address or a range of IP addresses from a DS-Lite address pool, each IP address sub-range in the original address range must be configured. To simplify the configuration, run the ds-lite address-group exclude-ip-address command to implement the same function.\nPrerequisites\nA DS-Lite instance has been created. The ds-lite outbound command does not need to be run to configure an ACL rule for matching the NAT64 address pool.\nPrecautions\nThe ds-lite address-group exclude-ip-address command only removes a public IP address or a public IP address range.A maximum of 10 IP address sub-ranges can be excluded from each IP address range. IP addresses in these sub-ranges cannot overlap.Before you disable a device from excluding a specific IP address or a range of IP addresses from a DS-Lite address pool, ensure that exclude-ip-address configured in the undo ds-lite address-group exclude-ip-address command is the same as that configured in the ds-lite address-group exclude-ip-address command.If an address pool is configured by specifying mask, the device advertises specific UNRs instead of network segment UNRs after this command is run. If you run this command to exclude some public IP addresses, routes to the public IP addresses may fail to be advertised, and services may be interrupted."
}