{
    "PageTitle": "ds-lite port-limit (DS-Lite instance view)",
    "FuncDef": "The ds-lite port-limit command sets the maximum number of user-based ports.\nThe undo ds-lite port-limit command restores the default maximum number of user-based ports.\nBy default, the maximum number of NAT TCP ports to be allocated and that of NAT UDP ports to be allocated are 10240. That of NAT ICMP ports to be allocated is 512. The total number of these three types of NAT ports to be allocated cannot exceed 20992.",
    "CLIs": [
        "ds-lite port-limit { tcp | udp | icmp } <port-number>",
        "ds-lite port-limit total <port-number>",
        "undo ds-lite port-limit { tcp | udp | icmp | total } [ <port-number> ]"
    ],
    "ParentView": [
        "DS-Lite instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "tcp port-number",
            "Info": "Indicates the maximum number of available TCP ports.\nThe value is an integer ranging from 50 to 65535."
        },
        {
            "Parameters": "udp port-number",
            "Info": "Indicates the maximum number of available UDP ports.\nThe value is an integer ranging from 50 to 65535."
        },
        {
            "Parameters": "icmp port-number",
            "Info": "Indicates the maximum number of available ICMP ports.\nThe value is an integer ranging from 50 to 65535."
        },
        {
            "Parameters": "total port-number",
            "Info": "Indicates the maximum number of available ports of TCP, UDP, and ICMP.\nIf the total number of TCP, UDP, and ICMP ports used for DS-Lite has exceeded the maximum number, DS-Lite cannot be performed even if the number of TCP, UDP, or ICMP ports used for DS-Lite has not reached the maximum number.\nThe value is an integer ranging from 50 to 65535."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ds-lite instance cpe1 id 1",
            "[*HUAWEI-ds-lite-instance-cpe1] ds-lite port-limit tcp 20000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nSome unauthorized users may consume a lot of port resources to attack devices. As a result, there is a possibility that no port can be assigned to authorized users for DS-Lite. To address this problem, run the ds-lite port-limit command to set the maximum number of user-based ports.\nConfiguration Impact\nAfter the ds-lite port-limit command is run in the DS-Lite instance view, each user can be assigned a specified maximum number of ports in the instance. When the number of ports used for DS-Lite reaches the upper limit, DS-Lite cannot be performed for subsequent users.\nPrecautions\nThe ds-lite port-limit command can be run to limit the number of assignable ports in a DS-Lite address pool working in 3-tuple mode only after the ds-lite port-limit enable command is run to enable the restriction.\nThis command does not take effect on the address-based DS-Lite internal server."
}