{
    "PageTitle": "ds-lite reverse-session-limit",
    "FuncDef": "The ds-lite reverse-session-limit command enables the limitation on the maximum number of network-to-user DS-Lite sessions, or configures the maximum number of network-to-user DS-Lite sessions.\nThe undo ds-lite reverse-session-limit command disables the limitation on the maximum number of network-to-user DS-Lite sessions, or restores the default upper limit.\n\nBy default, the user-based DS-Lite session number limitation is enabled. The maximum number of user-to-network DS-Lite sessions for each user of a specific or all three protocols is as follows:\n\nTCP or UDP: 10240\n\nICMP: 512\n\nTCP, UDP, and ICMP: 8192\n\n\n\nIf the total parameter is set, this parameter takes precedence.",
    "CLIs": [
        "ds-lite reverse-session-limit { enable | icmp <session-number> | tcp <session-number> | total <session-number> | udp <session-number> }",
        "undo ds-lite reverse-session-limit { enable | { icmp | tcp | total | udp } [ <session-number> ] }"
    ],
    "ParentView": [
        "DS-Lite instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "enable",
            "Info": "Enables the limitation on the maximum number of network-to-user DS-Lite sessions.\n-"
        },
        {
            "Parameters": "icmp session-number",
            "Info": "Indicates the maximum number of ICMP network-to-user DS-Lite sessions for each user.\nThe value is an integer ranging from 50 to 65535."
        },
        {
            "Parameters": "tcp session-number",
            "Info": "Indicates the maximum number of TCP network-to-user DS-Lite sessions for each user.\nThe value is an integer ranging from 50 to 65535."
        },
        {
            "Parameters": "total session-number",
            "Info": "Indicates the maximum number of total network-to-user DS-Lite sessions for each user.If the total number of TCP, UDP, and ICMP network-to-user IP sessions for each user reaches the maximum number, DS-Lite cannot be performed even if the number of TCP, UDP, or ICMP network-to-user IP sessions for each user has not reached the maximum number.\nThe value is an integer ranging from 50 to 65535."
        },
        {
            "Parameters": "udp session-number",
            "Info": "Indicates the maximum number of UDP network-to-user DS-Lite sessions for each user.\nThe value is an integer ranging from 50 to 65535."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ds-lite instance cpe1 id 1",
            "[*HUAWEI-ds-lite-instance-cpe1] ds-lite reverse-session-limit tcp 20000"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ds-lite instance cpe1 id 1",
            "[*HUAWEI-ds-lite-instance-cpe1] ds-lite reverse-session-limit enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter the ds-lite reverse-session-limit enable command is run in the DS-Lite instance view, the system will allow the creation of only a specified number of network-to-user DS-Lite sessions.\nA reverse session is established for packets transmitted from the network side to the user side.\nSome unauthorized users may consume a lot of session resources to attack devices. As a result, there is a possibility that no session can be used by authorized users for DS-Lite. To prevent this, run the ds-lite session-limit command to limit the number of sessions that can be used.\nPrerequisites\nThe configured maximum number of network-to-user DS-Lite sessions that can be established can take effect only after the ds-lite reverse-session-limit enable command is run.\nConfiguration Impact\nAfter the number of network-to-user DS-Lite sessions established for a specific user reaches the upper limit, no more sessions can be established for the user. After existing DS-Lite sessions age and the number of established network-to-user DS-Lite sessions falls below the upper limit, new sessions can be established for the user."
}