{
    "PageTitle": "ds-lite alarm user port-number threshold (DS-Lite instance view)",
    "FuncDef": "The ds-lite alarm user port-number threshold command sets an alarm threshold for user-based port usage so that an alarm is generated if the threshold is reached.\nThe undo ds-lite alarm user port-number threshold command restores the default alarm threshold for user-based port usage.\nThe default alarm threshold for user-based port usage is 80%.",
    "CLIs": [
        "ds-lite alarm user port-number threshold <alarm-threshold-value>",
        "undo ds-lite alarm user port-number threshold [ <alarm-threshold-value> ]"
    ],
    "ParentView": [
        "DS-Lite instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "alarm-threshold-value",
            "Info": "Sets an alarm threshold for user-based port usage.\nUser-based port usage = Actual number of ports used by a user/Number of ports available for the user.\nThe value is an integer ranging from 60 to 100, in percentage. The default value is 80."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ds-lite instance cpe1 id 1",
            "[*HUAWEI-ds-lite-instance-cpe1] ds-lite alarm user port-number threshold 85"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo monitor user-based port usage on a DS-Lite device, run the ds-lite alarm user port-number threshold command to set an alarm threshold for user-based port usage to enable the DS-Lite device to generate an alarm if the threshold is reached.\nConfiguration Impact\nIf user-based port usage reaches the specified alarm threshold, a service board sends an alarm to the NMS. If user-based port usage exceeds the alarm threshold, the service board does not repeatedly send an alarm. After user-based port usage falls to 7/8 of the threshold, the service board sends a clear alarm to the NMS.\nPrecautions\nThe number of user-specific pre-allocated ports is equal to the number of ports configured in the port-range command run in the DS-Lite instance view. Usage of user-specific ports is equal to the number of user-specific ports in use divided by the number of user-specific pre-allocated ports. The ds-lite alarm user port-number threshold command takes effect only after the port-range command is run in the DS-Lite instance view. If usage of user-specific ports in use is greater than the alarm threshold (80% by default) for usage-specific port usage, an alarm indicating that usage of user-specific ports in use exceeds the threshold is generated."
}