{
    "PageTitle": "ds-lite statistics enable",
    "FuncDef": "The ds-lite statistics enable command enables a device to collect DS-Lite statistics.\nThe undo ds-lite statistics enable command disables a device from collecting DS-Lite statistics.\nThis function is disabled by default.",
    "CLIs": [
        "ds-lite statistics { port-usage | session-usage | address-pool-usage } enable",
        "undo ds-lite statistics { port-usage | session-usage | address-pool-usage } enable"
    ],
    "ParentView": [
        "DS-Lite instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "port-usage",
            "Info": "Enables a device to collect or disables a device from collecting statistics about the average and maximum port usage in each instance.\n-"
        },
        {
            "Parameters": "session-usage",
            "Info": "Enables a device to collect or disables a device from collecting statistics about the average and maximum usage of IP addresses in an address pool.\n-"
        },
        {
            "Parameters": "address-pool-usage",
            "Info": "Enables a device to collect or disables a device from collecting statistics about the average and maximum number of sessions in each instance.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ds-lite instance cpe1 id 1",
            "[*HUAWEI-ds-lite-instance-cpe1] ds-lite statistics address-pool-usage enable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ds-lite instance cpe1 id 1",
            "[*HUAWEI-ds-lite-instance-cpe1] ds-lite statistics session-usage enable"
        ]
    ],
    "ExtraInfo": "A device can be enabled to collect DS-Lite statistics, including IP address usage of an address pool on the device and the number of ports used in each DS-Lite instance. To enable a device to collect DS-Lite statistics, run the ds-lite statistics enable command. The device samples statistics every 10 minutes by default. After the ds-lite statistics { port-usage | session-usage | address-pool-usage } enable command is run, the display nat statistics command can be run 10 minutes later to view statistics."
}