{
    "PageTitle": "ds-lite log host",
    "FuncDef": "The ds-lite log host command configures a DS-Lite log host.\nThe undo ds-lite log host command deletes DS-Lite log host configurations.\nNo DS-Lite log host is configured by default.",
    "CLIs": [
        "ds-lite log host <host-ip-address> <host-port> source <source-ip-address> <source-port> name <host-name> [ vpn-instance <vpn-instance-name> ] [ secondary ]",
        "undo ds-lite log [ host <host-ip-address> [ <host-port> source <source-ip-address> <source-port> name <host-name> [ vpn-instance <vpn-instance-name> ] [ secondary ] ] ]"
    ],
    "ParentView": [
        "DS-Lite view"
    ],
    "ParaDef": [
        {
            "Parameters": "source source-ip-address",
            "Info": "Specifies the source IP address used by a DS-Lite device to communicate with a NAT log host.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "source source-port",
            "Info": "Specifies the source port number used by a DS-Lite device to communicate with a DS-Lite log host.\nThe value is an integer that ranges from 1 to 65535."
        },
        {
            "Parameters": "name host-name",
            "Info": "Specifies the name of a DS-Lite log host.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies the name of a VPN instance to which a DS-Lite log host belongs.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "secondary",
            "Info": "Indicates the secondary log host group.\n-"
        },
        {
            "Parameters": "host host-ip-address",
            "Info": "Specifies IP address of a DS-Lite log host.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "host host-port",
            "Info": "Specifies the port number of a DS-Lite log host.\nThe value is an integer that ranges from 1 to 65535."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ds-lite instance cpe1 id 1",
            "[*HUAWEI-ds-lite-instance-cpe1] ds-lite log host 192.168.100.10 1234 source 10.10.10.1 3456 name host1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure a DS-Lite log host, run the DS-Lite log host command. After DS-Lite translates a source private IP address to a source public IP address, the source that initiates a request to access a network cannot be located, which decreases network security. To improve network security, the flow log function can be configured. DS-Lite logs record information about DS-Lite flows so that administrators can obtain addresses before DS-Lite translation is performed to query and trace network activities and operations. This improves network availability and security. The ds-lite log host command configures DS-Lite log host information, such as the log host's IP address, port number, log host name, and source IP address and port number that a device uses to communicate with a log host.\nPrerequisites\nThe DS-Lite log function has been configured using the ds-lite log session enable command.\nPrecautions\nA maximum of 64 log servers can be configured in a DS-Lite instance view."
}