{
    "PageTitle": "ds-lite filter mode full-cone",
    "FuncDef": "The ds-lite filter mode full-cone command sets the full-cone translation mode for all addresses in a specified DS-Lite instance.\nThe undo ds-lite filter mode full-cone command restores the default configuration.\nBy default, the symmetrical mode is used in address translation.",
    "CLIs": [
        "ds-lite filter mode full-cone",
        "undo ds-lite filter mode full-cone"
    ],
    "ParentView": [
        "DS-Lite instance view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ds-lite instance cpe1 id 1",
            "[*HUAWEI-ds-lite-instance-cpe1] ds-lite filter mode full-cone"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe symmetric and full-cone modes are two main DS-Lite modes, both of which are used widely:\nSymmetric mode: also called the 5-tuple mode. A 5-tuple entry contains a source IP address, source port number, protocol type, destination IP address, and destination port number, which is used to translate addresses and filter packets. For packets that have the same source IP address and source port number but different destination IP addresses and destination port numbers, the DS-Lite device translates the source IP address and source port number of these packets into different public addresses and port numbers, respectively. Only the destined hosts on the public networks can use the translated addresses and port numbers to communicate with hosts on the private network.Full-cone mode: also known as the 3-tuple mode that is not concerned with destination addresses or destination port numbers. In this mode, a DS-Lite device assigns IP addresses and filters packets based on source addresses, source port numbers, and protocol type. A device uses DS-Lite to translate packets carrying the same source IP address and port number to the same public IP address and port number, respectively. In addition, the device allows public network hosts to use the translated IP address and port number to visit the internal network host.\n\nConfiguration Impact\nThe symmetry mode is more secure but does not support Session Traversal Utilities for NAT (STUN) or point-to-point (P2P) DS-Lite traversal, which is supported in full-cone mode. You can select a proper translation mode as needed.\nExercise caution when switching a translation mode in the service instance view on a VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S. Such a mode change causes existing session tables to be reestablished, which may result in a maximum of a 150s traffic interruption.If an instance is bound to a VSUF-80/VSUF-160, the interval at which translation modes are switched is 75s.If an instance is bound to a VSUI-160-E/VSUI-160-E/VSUI-400A/VSUI-400/VSUI-400A-E/VSUI-400-E, the interval at which translation modes are switched is 150s."
}