{
    "PageTitle": "ds-lite centralized-backup switch down-number",
    "FuncDef": "The ds-lite centralized-backup switch down-number command sets the maximum number of failed CPUs in centralized DS-Lite providing backup for centralized DS-Lite.\nThe undo ds-lite centralized-backup switch down-number command restores the default maximum number of failed CPUs in centralized DS-Lite providing backup for centralized DS-Lite.\nThe default maximum number of failed CPUs in centralized DS-Lite providing backup for centralized DS-Lite is 1.",
    "CLIs": [
        "ds-lite centralized-backup switch down-number <down-number>",
        "undo ds-lite centralized-backup switch down-number <down-number>"
    ],
    "ParentView": [
        "DS-Lite instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "down-number",
            "Info": "Sets the maximum number of failed CPUs allowed in centralized DS-Lite providing backup for centralized DS-Lite.\nThe value is an integer ranging from 1 to 16."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ds-lite instance cpe1 id 1",
            "[*HUAWEI-ds-lite-instance-cpe1] ds-lite centralized-backup enable",
            "[*HUAWEI-ds-lite-instance-cpe1] ds-lite centralized-backup switch down-number 3"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn centralized DS-Lite providing backup for centralized DS-Lite, if the centralized-boards on the primary DS-Lite device fails and users are online, user traffic switches to the backup DS-Lite device for DS-Lite processing.\nIf a specified maximum number of CPUs fail on the primary DS-Lite device, traffic switches to the backup DS-Lite device. To set this maximum number, run the\nds-lite centralized-backup switch down-number command. The implementation is as follows:\nIf the number of failed CPUs of centralized-boards on the master DS-Lite is greater than or equal to , traffic switches to the backup DS-Lite device.If is greater than the total number of CPUs of centralized-boards on the master DS-Lite and all CPUs fail, traffic also switches to the backup DS-Lite device.\n\nPrerequisites\nCentralized DS-Lite providing backup for centralized DS-Lite has been enabled using the ds-lite centralized-backup enable command.\nPrecautions\nThe ds-lite centralized-backup enable command takes effect only on the VSUF-80/VSUF-160/VSUI-160-E/VSUI-400/VSUI-400-E/VSUI-400A/VSUI-400A-E/VSUI-400-S/VSUI-400A-S."
}