{
    "PageTitle": "local-ipv6 (DS-Lite instance view)",
    "FuncDef": "The local-ipv6 command sets a local address of a DS-Lite tunnel.\nThe undo local-ipv6 command deletes a local address of a DS-Lite tunnel.\nNo local address of a DS-Lite tunnel is configured by default.",
    "CLIs": [
        "local-ipv6 <ipv6-address> prefix-length <prefix-length>",
        "undo local-ipv6 <ipv6-address> [ prefix-length <prefix-length> ]"
    ],
    "ParentView": [
        "DS-Lite instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv6-address",
            "Info": "Specifies a local IPv6 address of a DS-Lite tunnel.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "prefix-length prefix-length",
            "Info": "Specifies the local IPv6 address prefix of a DS-Lite tunnel.\nThe value is an integer ranging from 1 to 128."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ds-lite instance cpe1 id 1",
            "[*HUAWEI-ds-lite-instance-cpe1] local-ipv6 2001:db8::1 prefix-length 64"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA CPE and a DS-Lite device uses the local and remote IPv6 addresses to create a DS-Lite tunnel. If a DS-Lite receives IPv6 packets destined for an IPv6 address configured using the local-ipv6 command, the device considers them as DS-Lite tunnel packets.\nConfiguration Impact\nThe DS-Lite device forwards IPv6 packets destined for an IPv6 address configured using the local-ipv6 command to a service board for processing.\nPrecautions\nA single local IPv6 address can be configured in each DS-Lite instance and must be different from a DS-Lite interface. If a specified local IPv6 address is the same as an existing interface address, the device displays an error message. The identical address causes the DS-Lite service to conflict with other services. A local IPv6 address can be configured in multiple DS-Lite instances."
}