{
    "PageTitle": "port-forwarding address-group (DS-Lite instance view)",
    "FuncDef": "The port-forwarding address-group command enables a device to dynamically associate a port range in a DS-Lite address pool with internal hosts.\nThe undo port-forwarding address-group command disables a device from dynamically associating a port range in a DS-Lite address pool with internal hosts.\nBy default, no port range in a DS-Lite address pool is configured or associated with internal hosts.",
    "CLIs": [
        "port-forwarding address-group <addr-grp-name> port-scope <start-port-value> <end-port-value>",
        "undo port-forwarding address-group <addr-grp-name> [ port-scope <start-port-value> <end-port-value> ]"
    ],
    "ParentView": [
        "DS-Lite instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "addr-grp-name",
            "Info": "Specifies the name of a DS-Lite address pool.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "port-scope end-port-value",
            "Info": "Specifies an end port number to be reserved. The end port number cannot be less than the start port number.\nThe value is an integer ranging from 1 to 65535. The end port number must be greater than or equal to the start port number."
        },
        {
            "Parameters": "port-scope start-port-value",
            "Info": "Specifies a start port number to be reserved.\nThe value is an integer ranging from 1 to 65535."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ds-lite instance cpe1 id 1",
            "[*HUAWEI-ds-lite-instance-cpe1] ds-lite address-group group1 group-id 1 10.38.160.100 10.38.160.110",
            "[*HUAWEI-ds-lite-instance-cpe1] port-forwarding address-group group1 port-scope 2000 2020"
        ]
    ],
    "ExtraInfo": "The IP addresses of internal hosts may frequently change. To prevent frequent manual modification of DS-Lite configurations, configure the port forwarding function to dynamically associate each internal host with a public IP address and port.\nTo configure a DS-Lite address and a port range that can be dynamically associated with an internal host, run the port-forwarding address-group command. After the configuration, the ports in the specified range cannot be used as public ports in DS-Lite translation."
}