{
    "PageTitle": "remote-ipv6 (DS-Lite instance view)",
    "FuncDef": "The remote-ipv6 command sets a remote address of a DS-Lite tunnel.\nThe undo remote-ipv6 command deletes a remote address of a DS-Lite tunnel.\nNo remote address of a DS-Lite tunnel is configured by default.",
    "CLIs": [
        "remote-ipv6 <ipv6-address> prefix-length <prefix-length>",
        "undo remote-ipv6 <ipv6-address> [ prefix-length <prefix-length> ]"
    ],
    "ParentView": [
        "DS-Lite instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv6-address",
            "Info": "Specifies a remote IPv6 address of a DS-Lite tunnel.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "prefix-length prefix-length",
            "Info": "Specifies the remote IPv6 address prefix of a DS-Lite tunnel.\nThe value is an integer ranging from 1 to 128."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ds-lite instance cpe1 id 1",
            "[*HUAWEI-ds-lite-instance-cpe1] remote-ipv6 2001:db8::1 prefix-length 64"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA CPE and a DS-Lite device use a local IPv6 address and a remote IPv6 address to create a DS-Lite tunnel. To set a remote address of a DS-Lite tunnel, run the remote-ipv6 command.\nConfiguration Impact\nThe DS-Lite device forwards IPv6 packets destined for an IPv6 address configured using the local-ipv6 command to a service board for processing. If the source IPv6 address carried in packets is different from the IPv6 address configured using the remote-ipv6 command, the device discards the packets. If the source IPv6 address is the same as the configured remote IPv6 address, the device performs DS-Lite for the packet.\nPrecautions\nA maximum of 16 remote IPv6 network addresses can be configured in each DS-Lite instance and must be different from interface IP addresses.\nRemote addresses of one network segment can be configured only for one DS-Lite instance."
}