{
    "PageTitle": "section (DS-Lite instance address pool view)",
    "FuncDef": "The section command configures an address range for a DS-Lite address pool.\nThe undo section command cancels the configuration.\nNo address range is configured for a DS-Lite address pool by default.",
    "CLIs": [
        "section <section-num> <start-ip-address> { mask { <mask-length> | <mask-ip> } | <end-ip-address> }",
        "undo section <section-num> [ <start-ip-address> { mask { <mask-length> | <mask-ip> } | <end-ip-address> } ]"
    ],
    "ParentView": [
        "DS-Lite instance address pool view"
    ],
    "ParaDef": [
        {
            "Parameters": "section-num",
            "Info": "Specifies an address range number.\nThe value is an integer ranging from 0 to 15."
        },
        {
            "Parameters": "start-ip-address",
            "Info": "Specifies a start IP address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "mask mask-length",
            "Info": "Specifies the mask length of public IP addresses.\nThe value is an integer ranging from 22 to 32."
        },
        {
            "Parameters": "mask mask-ip",
            "Info": "Specifies the mask of public IP addresses.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "end-ip-address",
            "Info": "Specifies an end IP address. The end IP address must be greater than or equal to the start IP address.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ds-lite instance cpe1 id 1",
            "[*HUAWEI-ds-lite-instance-cpe1] ds-lite address-group group1 group-id 1",
            "[*HUAWEI-ds-lite-instance-cpe1-ds-lite-address-group-group1] section 0 172.20.1.0 mask 24"
        ]
    ],
    "ExtraInfo": "A DS-Lite address pool is a collection of public IPv4 addresses. When IPv4-in-IPv6 packets are sent to a DS-Lite device through a DS-Lite tunnel, they are first decapsulated into IPv4 packets with the source IP addresses set to private IPv4 addresses. To transmit IPv4 packets to the public network, the system needs to perform DS-Lite to translate the IP addresses carried in IPv4 packets. The DS-Lite address pool used in DS-Lite is determined by the traffic policy.\nEither of the following modes can be used to configure a DS-Lite address range:\nConfigure an address range by specifying a start address and an end address or by specifying a network segment address with a mask in the ds-lite address-group command.Run the section command to configure an address range for a public IP address pool in the DS-Lite instance address pool view."
}