{
    "PageTitle": "member-slot",
    "FuncDef": "The member-slot multicast command specifies the slot IDs of boards on which specified global VE members reside for multicast traffic.\nThe undo member-slot multicast command cancels the slot IDs of boards on which specified global VE members reside for multicast traffic.\nBy default, global VE member interfaces are added to all boards on a device for multicast traffic.",
    "CLIs": [
        "member-slot { { <slotbegin> [ to <slotend> ] } &<1-10> } multicast",
        "undo member-slot { { <slotbegin> [ to <slotend> ] } &<1-10> } multicast"
    ],
    "ParentView": [
        "Global VE interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "slotbegin",
            "Info": "Specifies the start slot ID of a board.\n-"
        },
        {
            "Parameters": "to slotend",
            "Info": "Specifies the end slot ID of a board.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Global-VE 1",
            "[*HUAWEI-Global-VE1] ve-group 1 l2-terminate",
            "[*HUAWEI-Global-VE1] undo member-slot 1 multicast"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen a VE-Group is bound to a multicast service, all interface boards in the VE-Group are member interface boards by default. When Layer 3 multicast traffic leaves an L3VE interface and enters an L2VE interface, the upstream interface board detects that the multicast outbound interface of the multicast traffic is the VE-Group and copies the traffic to all member interface boards. The interface boards then prune the traffic in the downstream direction. After a global VE interface is configured, you need to specify the range of interface boards to be added to the global VE interface. You can run the member-slot multicast command to reduce the number of interface boards to be added to the VE-Group, reducing the number of copies of multicast traffic.\nPrerequisites\nA global VE interface has been created and the binding type is L2VE.\nPrecautions\nThis command applies only to the Admin-VS."
}