{
    "PageTitle": "set l2ve-mac",
    "FuncDef": "The set l2ve-mac command configures the MAC address of an L2VE interface.\nThe undo set l2ve-mac command restores the MAC address of an L2VE interface.\nBy default, the MAC address of an L2VE interface allocated by the system.",
    "CLIs": [
        "set l2ve-mac <mac-address>",
        "undo set l2ve-mac"
    ],
    "ParentView": [
        "Slot view"
    ],
    "ParaDef": [
        {
            "Parameters": "mac-address",
            "Info": "MAC address of an L2VE interface.\nThe value is a 12-digit hexadecimal number, in the format of H-H-H. Each H is 4 digits. If an H contains fewer than 4 digits, the left-most digits are padded with zeros. For example, e0 is displayed as 00e0. The MAC address cannot be set to FFFF-FFFF-FFFF."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] slot 1",
            "[~HUAWEI-slot-1] set l2ve-mac 00e0-fc12-3456"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn a scenario where an L2VPN accesses an L3VPN, when packets whose destination MAC address is the same as an L2VE interface's MAC address are sent from the L3VPN to the L2VPN's CE, the packets are unexpectedly processed based on Layer 3 forwarding through the L2VE interface, therefore causing traffic loss. To resolve this issue, run the set l2ve-mac command to modify the MAC address of the L2VE interface.\nPrecautions\nIn an earlier version, the set l2ve-mac command is run in the slot view to configure a MAC address for an L2VE interface. If the corresponding board is offline and the offline configuration is cleared, upgrading the device to the current version in DB mode causes the configuration to be displayed in the last slot view of the device.\nIn the current version, after the set l2ve-mac command is run in the slot view to configure a MAC address for an L2VE interface, a version downgrade is performed. If the corresponding board is offline and the offline configuration is cleared, upgrading the device to the current version in DB mode also causes the configuration to be displayed in the last slot view of the device.After the set l2ve-mac command is run for multiple times, the latest MAC address takes effect."
}