{
    "PageTitle": "set access-ve-mac",
    "FuncDef": "The set access-ve-mac command configures the MAC address of an L3VE interface.\nThe undo set access-ve-mac command restores the MAC address of an L3VE interface.\nBy default, the MAC address of an L3VE interface is the system bridge MAC address.",
    "CLIs": [
        "set access-ve-mac <mac-address>",
        "undo set access-ve-mac"
    ],
    "ParentView": [
        "Slot view"
    ],
    "ParaDef": [
        {
            "Parameters": "mac-address",
            "Info": "MAC address of an L3VE interface.\nThe value is a 12-digit hexadecimal number, in the format of H-H-H. Each H is 4 digits. If an H contains fewer than 4 digits, the left-most digits are padded with zeros. For example, e0 is displayed as 00e0."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] slot 1",
            "[~HUAWEI-slot-1] set access-ve-mac 00e0-fc12-3456"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn a scenario where an L2VPN accesses an L3VPN, an L2VE interface and the sub-interface of an Eth-Trunk or portswitch interface are bound to the same local VSI. The default MAC addresses of an L3VE interface that needs to communicate with the preceding sub-interface and the sub-interface are both the system bridge's MAC address. In this case, packets that the L2VPN's CE sends to the L3VE interface will be sent to the CPU when passing through the sub-interface, and traffic will be discarded. This is because the destination MAC address of the packets is the same as the MAC address of the preceding sub-interface. To resolve this issue, run the set access-ve-mac command to modify the MAC address of the L3VE interface.\nPrecautions\nIn an earlier version, the set access-ve-mac command is run in the slot view to configure a MAC address for an L3VE interface. If the corresponding board is offline and the offline configuration is cleared, upgrading the device to the current version in DB mode causes the configuration to be displayed in the last slot view of the device.\nIn the current version, after the set access-ve-mac command is run in the slot view to configure a MAC address for an L3VE interface, a version downgrade is performed. If the corresponding board is offline and the offline configuration is cleared, upgrading the device to the current version in DB mode also causes the configuration to be displayed in the last slot view of the device.\nAfter the set access-ve-mac command is run for multiple times, the latest MAC address takes effect."
}