{
    "PageTitle": "ve-group",
    "FuncDef": "The ve-group command creates a VE-Group and binds a VE interface to the VE-Group.\nThe undo ve-group command restores the default configuration.\nBy default, a VE interface is not bound to a VE-Group.",
    "CLIs": [
        "ve-group <ve-group-id> { l2-terminate | l3-access }",
        "undo ve-group"
    ],
    "ParentView": [
        "Global VE interface view",
        "VE interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "ve-group-id",
            "Info": "Specifies the ID of a VE-Group.\nThe value is an integer that ranges from 1 to 8192."
        },
        {
            "Parameters": "l2-terminate",
            "Info": "Indicates that a VE interface is used as a Layer 2 VE interface to terminate a VLL.\n-"
        },
        {
            "Parameters": "l3-access",
            "Info": "Indicates that a VE interface is used as a Layer 3 VE interface to access an MPLS L3VPN service.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface virtual-ethernet 1/0/0",
            "[~HUAWEI-Virtual-Ethernet1/0/0] ve-group 1 l2-terminate"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface virtual-ethernet 1/0/1",
            "[~HUAWEI-Virtual-Ethernet1/0/1] ve-group 1 l3-access"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface virtual-ethernet 1/0/1",
            "[~HUAWEI-Virtual-Ethernet1/0/1] ve-group 1 l3-access"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy creating a VE-Group, you can implement L2VPN termination and L3VPN access or implement L3VPN termination and BRAS access on the same device.\nPrecautions\nA VE-Group contains only one l2-terminate VE interface and one l3-access VE interface in an L2VPN accessing L3VPN or L2VPN accessing BRAS scenario.\nIn an L3VPN accessing BRAS scenario, a VE-Group contains only one l3-access VE interface, and only Layer 3 user access can be configured on sub-interfaces of the l3-access VE interface.\nAn l2-terminate VE interface, an l3-terminate VE interface must have their own sub-interfaces created before implementing VLAN service access.\nThe VE interfaces in a VE-Group must both be board VE interfaces or Global-VE interfaces.\nThe two VE interfaces in a VE-Group must be on the same board.\nAn l3-access VE sub-interface can be configured as a QinQ VLAN tag termination sub-interface, dot1q VLAN tag termination sub-interface, sub-interface bound to a VLAN and encapsulated with dot1q, or sub-interface with an 802.1p priority range specified.\nAn l2-terminate sub-interface can be configured as a sub-interface bound to a VLAN and encapsulated with dot1q, dot1q VLAN tag termination sub-interface, QinQ stacking sub-interface, or QinQ mapping sub-interface.\nThis command is supported only on the admin VS."
}