{
    "PageTitle": "buffer-allocation",
    "FuncDef": "The buffer-allocation command defines the amount of buffers that will be set aside for WRED queue buffer pools. Note that theminpercentageand maxpercentageparameters must be set to the same value. The forwarding plane protects against cross application buffer starvation by implementing a hierarchy of buffer pools. At the top of the hierarchy are mega-pools. Mega-pools are used to manage buffers at a system application level. Two mega-pools are currently used by the system. The first (default) mega-pool services all non-WRED type queues and when WRED queues are not enabled will contain all available forwarding plane queue buffers. When WRED queuing is enabled, the second mega-pool (the WRED mega-pool) is given buffers from the default mega-pool based on the buffer-allocation command.",
    "CLIs": [
        "buffer-allocation min <percentage> max <percentage>",
        "no buffer-allocation"
    ],
    "ParentView": [
        "config>card>fp>egress>wred-queue-control"
    ],
    "ParaDef": [
        {
            "Parameters": "min percentage",
            "Info": "Specifies that the required keyword defines the minimum percentage of total egress forwarding plane queue buffers that will be applied to the WRED mega-pool. The value given for percentage must be less than or equal to the value given for the max percentage. Percentages are defined with an accuracy of hundredths of a percent in the nn.nn format (15.65 = 15.65%). Values-0.00 to 99.99. ParamDefault: Default- 25.00"
        },
        {
            "Parameters": "max percentage",
            "Info": "Specifies that the required keyword defines the maximum percentage of total egress forwarding plane queue buffers that may be applied to the WRED mega-pool. The value given for percentage must be equal to or greater than the value given for the min percentage. Percentages are defined with an accuracy of hundredths of a percent in the nn.nn format (15.65 = 15.65%). Values-0.01 to 99.99. ParamDefault: Default- 25.00"
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: buffer-allocation min 25.00 max 25.00"
}