{
    "PageTitle": "encap-type",
    "FuncDef": "This command configures the encapsulation method used to on the specified port, path, or channel. This parameter can be set on both access and network ports.",
    "CLIs": [
        "encap-type { atm | bcp-null | bcp-dot1q | ipcp | ppp-auto | frame-relay | wan-mirror | cisco-hdlc | cem }"
    ],
    "ParentView": [
        "config>port>tdm>ds1>channel-group",
        "config>port>tdm>ds3",
        "config>port>tdm>e1>channel-group",
        "config>port>tdm>e3"
    ],
    "ParaDef": [
        {
            "Parameters": "atm",
            "Info": "Specifies the encapsulation on the port is ATM."
        },
        {
            "Parameters": "bcp-null",
            "Info": "When selected, this keyword specifies that only a single service is configured on this channel and IEEE 802.1Q tags are not used as a service delimiter. Any IEEE 802.1Q tags encountered are regarded as part of the customer payload and transparently forwarded. When bcp-null encapsulation is specified, the PPP Bridge Control Protocol (BCP) is activated and all packets on this access port will be encapsulated in accordance with the BCP protocol."
        },
        {
            "Parameters": "bcp-dot1q",
            "Info": "When selected, this keyword specifies that ingress frames carry IEEE 802.1Q tags and the tags are used as service delimiter. Any untagged packets are silently discarded with exception of protocol specific packets. When bcp-dot1q encapsulation is specified, the PPP Bridge Control Protocol (BCP) is activated and all packets on this access port will be encapsulated in accordance with the BCP protocol."
        },
        {
            "Parameters": "ipcp",
            "Info": "Ingress frames are encapsulated according to the IP Control Protocol. When ipcp encapsulation is specified, the PPP IP Control Protocol will be activated and only packets that comply with IPCP encapsulation are processed; others are silently discarded."
        },
        {
            "Parameters": "ppp-auto",
            "Info": "(Network mode) Enables PPP on the associated port/channel. The activation of ipcp and mplscp is automatically enabled depending on the protocol configuration. This encap type is only valid on ports/channels in network mode."
        },
        {
            "Parameters": "frame-relay",
            "Info": "Enables frame relay on the associated port/channel."
        },
        {
            "Parameters": "wan-mirror",
            "Info": "The port is used for mirroring of frame-relay and POS ports. On these ports, no link management protocol will run."
        },
        {
            "Parameters": "cisco-hdlc",
            "Info": "Monitors line status on a serial interface by exchanging keepalive request messages with peer network devices."
        },
        {
            "Parameters": "cem",
            "Info": "Specifies that on circuit emulation CMAs and MDAs, only the cem encap-type is supported. All other values are blocked with an appropriate warning. The cem encap-type is not supported on other CMAs and MDAs and are blocked with an appropriate warning."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: encap-type bcp-null"
}