{
    "PageTitle": "event-notification",
    "FuncDef": "This command defines how to react to the reception of event TLVs contained in the Event Notification OAMPDU. The event TLVs contained in the event notification OAMPDU will be analyzed to determine if the peer has crossed the error threshold for the window. The analysis does not consider any local signal degrades or signal failure threshold. The analysis is based solely on the information receive form the peer. The analysis is performed on all event TLVs contained in the Event Notification OAMPDU without regard for support of a specific error counters or local configuration of any thresholds. In the case of symbol errors only, a threshold below the error rate can be used to return the port to service.",
    "CLIs": [
        "event-notification local-port-action { log-only | out-of-service }"
    ],
    "ParentView": [
        "config>port>ethernet>efm-oam>peer-rdi-rx"
    ],
    "ParaDef": [
        {
            "Parameters": "local-port-action",
            "Info": "Defines whether or not the local port will be affected when the Event Notification OAM PDU is received from a peer based on the threshold computation for the included TLVs."
        },
        {
            "Parameters": "log-only",
            "Info": "Keyword that prevents the port from being affected when the local peer receives an Event Notification OAM PDU. The event will be logged but the port will remain operational."
        },
        {
            "Parameters": "out-of-service",
            "Info": "Keyword that causes the port to enter a non-operation down state with a port state of link up. The error will be logged upon reception of Event Notification. The port will not be available to service data but will continue to carry Link OAM traffic to ensure the link is monitored. All this assumes the error threshold exceeds the error rate in the TLV."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: event-notification local-port-action log-only"
}