{
    "PageTitle": "named-pool-policy",
    "FuncDef": "This command associates a named pool policy with an MDA or port ingress or egress context. The policy governs the way that named pools are created at the MDA or port level. The policy may be applied regardless of whether the IOM is in named pool mode; however, a named pool policy to an MDA or port to a card that is not on named pool mode will be ignored. Pools may not be created due to insufficient resources or pool name collisions. Pool name collisions are allowed. The name check is performed independently between ingress and egress. A port on ingress may have a named pool defined that is also on the egress side at the MDA level. Multiple ports on the same MDA may have the same policy or the same named pools defined. Ports on the same MDA may also have different named pool policies defined.",
    "CLIs": [
        "named-pool-policy <policy-name>",
        "no named-pool-policy"
    ],
    "ParentView": [
        "config>card>mda>named-pool-mode>ingress",
        "config>card>mda>named-pool-mode>egress",
        "config>port>named-pool-mode>ingress",
        "config>port>named-pool-mode>egress"
    ],
    "ParaDef": [
        {
            "Parameters": "policy-name",
            "Info": "Specifies an existing named pool policy on the system, up to 32 characters. If policy-name does not exist, the named-pool-policy command fails. If another named pool policy is currently associated, it continues to be associated on the MDA or port. If the policy-name does exist, the pools within the current policy (if a policy is currently associated) will be removed and the pools defined within the new policy will be created. Queues on the port or MDA will be moved to the new pools. If a pool being used by a queue existed on the previous policy, but not in the new policy, the queue is moved to the appropriate default pool and marked as  pool-orphaned . The policy-name may be changed at any time."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: no named-pool-policy"
}