{
    "PageTitle": "port-threshold",
    "FuncDef": "This command configures the behavior for the Link Aggregation Group (LAG) if the number of operational links is equal to or below a threshold level.",
    "CLIs": [
        "port-threshold <value> [ action { dynamic-cost | static-cost | down } ] [ cost static-cost ]",
        "no port-threshold"
    ],
    "ParentView": [
        "config>lag"
    ],
    "ParaDef": [
        {
            "Parameters": "value",
            "Info": "The decimal integer threshold number of operational links for the LAG at or below which the configured action will be invoked. If the number of operational links exceeds the port-threshold value, any action taken for being below the threshold value will cease. Values-0 to 63."
        },
        {
            "Parameters": "action",
            "Info": "Specifies the action to take if the number of active links in the LAG is at or below the threshold value."
        },
        {
            "Parameters": "dynamic-cost",
            "Info": "Specifies that dynamic costing will be activated. As a result, the LAG will remain operationally up with a cost relative to the number of operational links. The link will only be regarded as operationally down when all links in the LAG are down."
        },
        {
            "Parameters": "static-cost",
            "Info": "Specifies that static costing will be activated. As a result, the LAG will remain operationally up with the configured cost, regardless of the number of operational links. The link will only be regarded as operationally down when all links in the LAG are down. If this parameter is used with an IGP, its reference-bandwidth must also be configured."
        },
        {
            "Parameters": "down",
            "Info": "Specifies the LAG will be brought operationally down if the number of operational links is equal to or less than the configured threshold value. The LAG will only be regarded as up once the number of operational links exceeds the configured threshold value."
        },
        {
            "Parameters": "static-cost",
            "Info": "The decimal integer static cost of the LAG. Values-1 to 16777215."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: port-threshold 0 action down"
}