{
    "PageTitle": "port",
    "FuncDef": "This command enables access to the context to configure ports, multilink bundles, and bundle protection groups (BPGs). Before a port can be configured, the chassis slot must be provisioned with a valid card type and the MDA parameter must be provisioned with a valid MDA type.",
    "CLIs": [
        "port { <port-id> | <bundle-id> | <bpgrp-id> | <aps-id> | <connector-port-id> }",
        "no port { <port-id> | <bundle-id> | <bpgrp-id> | <aps-id> | <connector-port-id> }"
    ],
    "ParentView": [
        "config"
    ],
    "ParaDef": [
        {
            "Parameters": "port-id",
            "Info": "Specifies the physical port ID in the following format:. Values-slot/mda/port [.channel]."
        },
        {
            "Parameters": "eth-sat-id",
            "Info": "Specifies the Ethernet satellite ID to be associated with this IP interface. This parameter applies to the 7950 XRS only."
        },
        {
            "Parameters": "pxc-id",
            "Info": "Specifies the PXC ID to be associated with this IP interface. This parameter applies to the 7950 XRS only."
        },
        {
            "Parameters": "bundle-id",
            "Info": "Specifies the multilink bundle to be associated with this IP interface. The command syntax must be configured as follows:. Values-bundle-type-slot/mda.bundle-num."
        },
        {
            "Parameters": "aps-id",
            "Info": "This option configures APS on unbundled SONET/SDH ports. All SONET-SDH port parameters, with certain exceptions, for the working and protection circuit ports must be configured in the config>port>aps-group-id context. The working and protection circuit ports inherit all those parameters configured. The exception parameters for the working and protect circuits can be configured in the config>port>sonet-sdh context. Exception list commands include:. Values-port aps-group-id\n\taps:\tkeyword\n\t\twhere group-id: \t1 to 64."
        },
        {
            "Parameters": "bpgrp-id",
            "Info": "Creates a bundle protection group (BPG). The BPGrp consists of a working and protection bundles that provide APS protection to each other using bi-directional APS as supported on the 7750 SR family of products. All members of a working/protection bundle must be on the same working/protection circuit respectively of the same, already provisioned APS group. The working bundle must have already been created in the config>port context before services can be created on a BPGrp. Values-bpgrp-type-bpgrp-num."
        },
        {
            "Parameters": "connector-port-id",
            "Info": "Specifies the physical port of a connector in the following format. Values-slot/mda/cconnector/port."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: No ports are configured. All ports must be explicitly configured and enabled."
}