{
    "PageTitle": "rate",
    "FuncDef": "This command configures the policer s metering and optional profiling rates. The metering rate is used by the system to configure the policer s PIR leaky bucket s decrement rate while the profiling rate configures the policer s CIR leaky bucket s decrement rate. The decrement function empties the bucket while packets applied to the bucket attempt to fill it based on the each packets size. If the bucket fills faster than how much is decremented per packet, the bucket s depth eventually reaches it's exceed (CIR) or violate (PIR) threshold. Thecbs,mbs, andhigh-prio-onlycommands are used to configure the policer s PIR and CIR thresholds.",
    "CLIs": [
        "rate { rate | max } [ cir { max | rate } ]",
        "no rate"
    ],
    "ParentView": [
        "config>card>fp>ingress>access>qgrp>policer-over>plcr",
        "config>card>fp>ingress>network>qgrp>policer-over>plcr"
    ],
    "ParaDef": [
        {
            "Parameters": "{rate | max}",
            "Info": "Specifying the keyword max or an explicit rate parameter directly following the rate command is required and identifies the policer s metering rate for the PIR leaky bucket. When the policer is first created, the metering rate defaults to max. The kilobits-per-second value must be expressed as an integer and defines the rate in kilobits-per-second. The integer value is multiplied by 1,000 to derive the actual rate in bits-per-second. When max is specified, the maximum policer rate used will be equal to the maximum capacity of the card on which the policer is configured. If the policer rate is set to a value larger than the maximum rate possible for the card, then the PIR used is equivalent to max. Values-max or 1 to 2000000000."
        },
        {
            "Parameters": "cir {max | rate}",
            "Info": "The optional cir keyword is used to override the default CIR rate of the policer. Specifying the keyword max or an explicit rate parameter directly following the cir keyword is required and identifies the policer s profiling rate for the CIR leaky bucket. When the policer is first created, the profiling rate defaults to 0 kb/s. The kilobits-per-second value must be expressed as an integer and defines the rate in kilobits-per-second. The integer value is multiplied by 1,000 to derive the actual rate in bits-per-second. When max is specified, the maximum policer rate used will be equal to the maximum capacity of the card on which the policer is configured. If the policer rate is set to a value larger than the maximum rate possible for the card, then the CIR used is equivalent to max. Values-max or 0 to 2000000000."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}