{
    "PageTitle": "rate",
    "FuncDef": "This command specifies the administrative Peak Information Rate (PIR) and the administrative Committed Information Rate (CIR) parameters for the queue. The PIR defines the maximum rate that the queue can transmit packets out an egress interface (for SAP egress queues). Defining a PIR does not necessarily guarantee that the queue can transmit at the intended rate. The actual rate sustained by the queue can be limited by oversubscription factors or available egress bandwidth.",
    "CLIs": [
        "rate <pir-rate> [ cir <cir-rate> ]",
        "no rate"
    ],
    "ParentView": [
        "config>port>ethernet>access>egr>qgrp>qover>q",
        "config>port>ethernet>access>ing>qgrp>qover>q",
        "config>port>ethernet>network>egr>qover>q"
    ],
    "ParaDef": [
        {
            "Parameters": "pir-rate",
            "Info": "Defines the administrative PIR rate, in kilobits per second, for the queue. When the rate command is executed, a valid PIR setting must be explicitly defined. When the rate command has not been executed, the default PIR of max is assumed. \nFractional values are not allowed and must be given as a positive integer. Values-1 to 200000000, max. ParamDefault: Default- max"
        },
        {
            "Parameters": "cir-rate",
            "Info": "The cir parameter overrides the default administrative CIR used by the queue, in kilobits per second. When the rate command is executed, a CIR setting is optional. When the rate command has not been executed or the cir parameter is not explicitly specified, the default CIR (0) is assumed.\nFractional values are not allowed and must be given as a positive integer. Values-0 to 200000000, max. ParamDefault: Default- 0"
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: rate max cir 0 - The max default specifies the amount of bandwidth in kilobits per second (thousand bits per second). The max value is mutually exclusive to the pir-rate value."
}