{
    "PageTitle": "report-alarm",
    "FuncDef": "This command enables logging of SONET (SDH) path alarms for a SONET-SDH port. Only path alarms can be configured in the channel context.",
    "CLIs": [
        "report-alarm [ pais ] [ plop ] [ prdi ] [ pplm ] [ prei ] [ puneq ] [ plcd ]",
        "no report-alarm [ pais ] [ plop ] [ prdi ] [ pplm ] [ prei ] [ puneq ] [ plcd ]"
    ],
    "ParentView": [
        "config>port>sonet-sdh>path"
    ],
    "ParaDef": [
        {
            "Parameters": "pais",
            "Info": "Reports path alarm indication signal errors. When configured, pais alarms are raised and cleared. ParamDefault: Default- pais alarms are not issued"
        },
        {
            "Parameters": "plop",
            "Info": "Reports path loss of pointer (per tributary) errors. When configured, plop traps are raised but not cleared. ParamDefault: Default- plop traps are issued"
        },
        {
            "Parameters": "prdi",
            "Info": "Reports path remote defect indication errors. When configured, prdi alarms are raised and cleared. ParamDefault: Default- prdi alarms are not issued"
        },
        {
            "Parameters": "pplm",
            "Info": "Reports a path payload mismatch, as a result the channel will be operationally downed. When configured, pplm traps are raised but not cleared. ParamDefault: Default- pplm traps are issued"
        },
        {
            "Parameters": "prei",
            "Info": "Reports a path error condition raised by the remote as a result of b3 errors received from this node. When configured, prei traps are raised but not cleared. ParamDefault: Default- prei traps are not issued"
        },
        {
            "Parameters": "puneq",
            "Info": "Reports path unequipped errors. Reports path unequipped signal errors. ParamDefault: Default- puneq traps are issued"
        },
        {
            "Parameters": "plcd",
            "Info": "Reports path loss of code group delineation errors. It is applicable only when the value of xgig is set to WAN. ParamDefault: Default- plcd traps are not issued"
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}