{
    "PageTitle": "report-alarm",
    "FuncDef": "This command enables logging of SONET (SDH) line and section alarms for a SONET-SDH port. Only line and section alarms can be configured in the SONET/SDH context, for path alarms see thesonet-sdh>pathcontext.",
    "CLIs": [
        "report-alarm [ loc ] [ lais ] [ lrdi ] [ ss1f ] [ lb2er-sd ] [ lb2er-sf ] [ slof ] [ slos ] [ lrei ]",
        "no report-alarm [ loc ] [ lais ] [ lrdi ] [ ss1f ] [ lb2er-sd ] [ lb2er-sf ] [ slof ] [ slos ] [ lrei ]"
    ],
    "ParentView": [
        "config>port>sonet-sdh"
    ],
    "ParaDef": [
        {
            "Parameters": "loc",
            "Info": "Reports a loss of clock which causes the operational state of the port to be shut down. ParamDefault: Default- loc alarms are issued"
        },
        {
            "Parameters": "lais",
            "Info": "Reports line alarm indication signal errors. When configured, lais alarms are raised and cleared. ParamDefault: Default- lais alarms are not issued"
        },
        {
            "Parameters": "lrdi",
            "Info": "Reports line remote defect indication errors. LRDI's are caused by remote LOF, LOC, LOS. When configured, lrdi alarms are raised and cleared. ParamDefault: Default- lrdi alarms are issued"
        },
        {
            "Parameters": "ss1f",
            "Info": "Reports section synchronization failure which is detected when the S1 byte is not consistent for 8 consecutive frames. When configured, ss1f alarms are raised and cleared. ParamDefault: Default- ss1f alarms are not issued"
        },
        {
            "Parameters": "lb2er-sd",
            "Info": "Reports line signal degradation BER (bit interleaved parity) errors. Use the threshold command to set the error rate(s) that when crossed determine signal degradation and signal failure. When configured, lb2er-sd alarms are raised and cleared. ParamDefault: Default- lb2er-sd alarms are not issued"
        },
        {
            "Parameters": "lb2er-sf",
            "Info": "Reports line signal failure BER errors. Use the threshold command to set the error rate(s) that when crossed determine signal degradation and signal failure. When configured, lb2er-sf alarms are raised and cleared. ParamDefault: Default- lb2er-sf alarms are issued"
        },
        {
            "Parameters": "slof",
            "Info": "Reports section loss of frame errors. When configured, slof alarms are raised and cleared. ParamDefault: Default- slof alarms are issued"
        },
        {
            "Parameters": "slos",
            "Info": "Reports a section loss of signal error on the transmit side. When configured, slos alarms are raised and cleared. ParamDefault: Default- slos alarms are issued"
        },
        {
            "Parameters": "lrei",
            "Info": "Reports a line error condition raised by the remote as a result of b1 errors received from this node. When configured, lrei traps are raised but not cleared. ParamDefault: Default- lrei traps are not issued"
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}