{
    "PageTitle": "resv-cbs",
    "FuncDef": "This command defines the amount of buffers within the WRED mega-pool that will be set aside for WRED queues operating within their configured CBS thresholds.Notethat theminpercentageandmaxpercentageparameters must be set to the same value. The forwarding plane protects against WRED queue buffer starvation by setting aside a portion of the buffers within the WRED mega-pool. The WRED queue CBS threshold defines when a WRED queue requests buffers from reserved portion of the WRED mega-pool and when it starts requesting buffers from the shared portion of the mega-pool. With proper oversubscription provisioning, this prevents a seldom active queue from being denied a buffer from the mega-pool when the shared portion of the mega-pool is congested.",
    "CLIs": [
        "resv-cbs min <percentage> max <percentage>",
        "no resv-cbs"
    ],
    "ParentView": [
        "config>card>fp>egress>wred-queue-control"
    ],
    "ParaDef": [
        {
            "Parameters": "min percentage",
            "Info": "Specifies that the required keyword defines the minimum percentage of the WRED mega-pool buffers that will be applied to the CBS reserve. The value given for percentage must be less than or equal to the value given for the max percentage. Percentages are defined with an accuracy of hundredths of a percent in the nn.nn format (15.65 = 15.65%). Values-0.00 to 99.99. ParamDefault: Default- 25.00"
        },
        {
            "Parameters": "max percentage",
            "Info": "Specifies that the required keyword defines the maximum percentage of the IOM3-XP WRED mega-pool buffers that may be applied to the CBS reserve. The value given for percentage must be greater than or equal to the value given for the min percentage. Percentages are defined with an accuracy of hundredths of a percent in the nn.nn format (15.65 = 15.65%). Values-0.01 to 99.99. ParamDefault: Default- 25.00"
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: resv-cbs min 25.00 max 25.00"
}