{
    "PageTitle": "selection-criteria",
    "FuncDef": "This command specifies which selection criteria should be used to select the active sub-group. If there is a tie for highest-count or highest-weight, the LAG will prefer the port with the lowest priority. If that does not break the tie, the currently active sub group will stay active (that is, non-revertive behavior).",
    "CLIs": [
        "selection-criteria [ best-port | highest-count | highest-weight ] [ slave-to-partner ] [ subgroup-hold-time <hold-time> ]",
        "no selection-criteria"
    ],
    "ParentView": [
        "config>lag"
    ],
    "ParaDef": [
        {
            "Parameters": "highest-count",
            "Info": "Selects a sub-group with the highest number of eligible members as an active sub-group (not applicable to \"power-off\" mode of operations)."
        },
        {
            "Parameters": "highest-weight",
            "Info": "Selects a sub-group with the highest aggregate weight as an active subgroup (not applicable to \"power-off\" mode of operations). Aggregate weight is calculated as the sum of (65535 - port priority) all ports within a sub-group."
        },
        {
            "Parameters": "best-port",
            "Info": "Selects a sub-group containing the port with highest priority port as an active subgroup. In case of equal port priorities, the sub-group containing the port with the lowest port-id is chosen."
        },
        {
            "Parameters": "slave-to-partner",
            "Info": "The slave-to-partner keyword specifies that it, together with the selection criteria, should be used to select the active sub-group. An eligible member is a LAG-member link which can potentially become active. This means it is operationally up (not disabled) for use by the remote side. The slave-to-partner parameter can be used to control whether or not this latter condition is taken into account."
        },
        {
            "Parameters": "hold-time",
            "Info": "Applicable with LACP enabled. Specifies the optional delay timer for switching to a newly selected active sub-group from the existing active sub-group. The timer delay applies only if the existing sub-group remains operationally up. Values-not specified|Equivalent to specifying a value of 0. Specifies no delay and to switchover immediately to a new candidate active sub-group., 0 to 2000 |Integer specifying the timer value in 10ths of a second., infinite|Do not switchover from existing active sub-group if the subgroup remains UP. Manual switchover possible using tools perform lag force command.."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: selection-criteria highest-count"
}