{
    "PageTitle": "dst-ip",
    "FuncDef": "This command configures a destination address range to be used as a network QoS policy match criterion.",
    "CLIs": [
        "dst-ip { <ip-address/mask> | <ip-address> <ipv4-address-mask> | ip-prefix-list <ip-prefix-list-name> }",
        "dst-ip { <ipv6-address/mask> | <ipv6-address> <ipv6-address-mask> | ipv6-prefix-list <ipv6-prefix-list-name> }",
        "no dst-ip"
    ],
    "ParentView": [
        "config>qos>network>ingress>ip-criteria>entry>match",
        "config>qos>network>ingress>ipv6-criteria>entry>match"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address",
            "Info": "Specifies the source IPv4 address specified in dotted decimal notation. Values-ip-address: a.b.c.d."
        },
        {
            "Parameters": "mask",
            "Info": "Specifies the length in bits of the subnet mask. Values-1 to 32."
        },
        {
            "Parameters": "ipv4-address-mask",
            "Info": "Specifies the subnet mask in dotted decimal notation. Values-a.b.c.d (dotted quad equivalent of mask length)."
        },
        {
            "Parameters": "ip-prefix-list-name",
            "Info": "Specifies an IPv4 prefix list which contains IPv4 address prefixes to be matched. IP prefix lists are only supported at a network ingress. Values-A string of up to 32 characters of printable ASCII characters. If special characters are used, the string must be enclosed within double quotes.."
        },
        {
            "Parameters": "ipv6-address",
            "Info": "Specifies the IPv6 prefix for the IP match criterion in hex digits."
        },
        {
            "Parameters": "mask",
            "Info": "Specifies the length of the IPv6 address expressed as a decimal integer. Values-1 to 128."
        },
        {
            "Parameters": "ipv6-address-mask",
            "Info": "Specifies the eight 16-bit hexadecimal pieces representing bit match criteria. Values-x:x:x:x:x:x:x (eight 16-bit pieces)."
        },
        {
            "Parameters": "ipv6-prefix-list-name",
            "Info": "Specifies an IPv6 prefix list which contains IPv6 address prefixes to be matched. IPv6 prefix lists are only supported at a network ingress. Values-A string of up to 32 characters of printable ASCII characters. If special characters are used, the string must be enclosed within double quotes.."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}