{
    "PageTitle": "nhrp registration no-unique",
    "FuncDef": "The nhrp registration no-unique command configures the device to override conflicting NHRP peer entries during NHRP registration.\nThe undo nhrp registration no-unique command restores the device to the default configuration.\nBy default, the device does not override conflicting NHRP peer entries during NHRP registration.",
    "CLIs": [
        "nhrp registration no-unique",
        "undo nhrp registration no-unique"
    ],
    "ParentView": [
        "Tunnel interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nhrp enable",
            "[*HUAWEI] interface tunnel 0",
            "[*HUAWEI-Tunnel0] tunnel-protocol gre p2mp",
            "[*HUAWEI-Tunnel0] nhrp enable",
            "[*HUAWEI-Tunnel0] nhrp registration no-unique"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen a spoke registers with the hub, the hub generates NHRP peer entries of the spoke. When the public network address of the spoke changes, it re-registers with the hub. The hub saves the latest NHRP peer entries of the spoke. In this case, you can run the nhrp registration no-unique command to enable the hub to override conflicting NHRP peer entries.\nPrerequisites\nThe following operations have been performed:\nRun the interface tunnel command to create a tunnel interface and display the tunnel interface view.Run the tunnel-protocol gre p2mp command to set the tunnel encapsulation mode to mGRE.\n\nConfiguration Impact\nThe following situations occur when the spoke re-registers with the hub after the public address of the spoke is changed:\nIf the nhrp registration no-unique command is used on the spoke, the device overrides existing NHRP peer entries with new NHRP peer entries.If the nhrp registration no-unique command is not configured on a spoke node, new NHRP peer entries will not override existing NHRP peer entries on a hub node and new registration entries will be discarded. New registration entries can successfully register only when old NHRP peer entries are aged out."
}