{
    "PageTitle": "nhrp entry multicast dynamic",
    "FuncDef": "The nhrp entry multicast dynamic command enables the Hub to add dynamically registered Spokes to the NHRP multicast member table.\nThe undo nhrp entry multicast dynamic command disables the Hub to add dynamically registered Spokes from the NHRP multicast member table.\nBy default, no dynamically registered Spoke is added to the NHRP multicast member table.",
    "CLIs": [
        "nhrp entry multicast dynamic",
        "undo nhrp entry multicast dynamic"
    ],
    "ParentView": [
        "Tunnel interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nhrp enable",
            "[*HUAWEI] interface tunnel 0",
            "[*HUAWEI-Tunnel0] tunnel-protocol gre p2mp",
            "[*HUAWEI-Tunnel0] nhrp enable",
            "[*HUAWEI-Tunnel0] nhrp entry multicast dynamic"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter the RIP or OSPF protocol is deployed on the DSVPN network, run the nhrp entry multicast dynamic command to enable the Hub to add dynamically registered Spokes to the multicast member table. This allows Spokes to learn routes from each other. After receiving routing multicast packets sent from Spokes, the Hub copies these routing multicast packets and forwards them to the destination Spoke based on the NHRP multicast member table. This allows routing multicast packets to be exchanged between Spokes.\nPrerequisites\nThe following operations have been performed:\nRun the interface tunnel command to create a tunnel interface and display the tunnel interface view.Run the tunnel-protocol gre p2mp command to set the tunnel encapsulation mode to mGRE.\n\nConfiguration Impact\nWhen a network has multiple Spokes and the Hub learns all the routes to these Spokes, the Hub consumes large CPU resources. In this case, you can configure a shortcut mode of DSVPN and the route summarization function to allow Spokes to directly communicate with each other.\nPrecautions\nRun this command on the hub in both the shortcut and non-shortcut mode of DSVPN."
}