{
    "PageTitle": "multicast shaping service-template",
    "FuncDef": "The multicast shaping service-template command configures multicast packet compensation for CQs.\nThe undo multicast shaping service-template command cancels the configuration.\nBy default, multicast packet compensation is not configured for CQs.",
    "CLIs": [
        "multicast shaping [ <cos-value> ] service-template <service-template-name>",
        "undo multicast shaping [ <cos-value> ] service-template"
    ],
    "ParentView": [
        "Slot view"
    ],
    "ParaDef": [
        {
            "Parameters": "cos-value",
            "Info": "Specifies the Flow Queue (FQ) priority.\nThe value can be af1, af2, af3, af4, be, cs6, cs7, or ef."
        },
        {
            "Parameters": "service-template-name",
            "Info": "Specifies the name of a user-defined service template.\nThe value is a string of 1 to 31 characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] service-template aaa",
            "[*HUAWEI-service-template-aaa-slot-all] network-header-length 24 outbound",
            "[*HUAWEI-service-template-aaa-slot-all] quit",
            "[~HUAWEI] slot 2",
            "[*HUAWEI-slot-2] multicast shaping service-template aaa"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nDifferent encapsulation types defines different encapsulation lengths for packets. Therefore, packet compensation is required to balance the packet lengths.\nThe default service profiles are displayed as follows. You can select the desired service profile as required.\nbridge-outbound: Service profile of Bridge switching outbound of the tunnel.ip-outbound: Service profile of IP switching or IP switching with 802.1Q in the outbound direction of an interface.ip-outbound1: Service profile of IP switching to QinQ in the outbound direction of an interface.ip-outbound2: Service profile of IP switching in the outbound direction of a POS interface.ip-outbound3: Service profile of IP switching in the outbound direction of an FR interface.l3vpn-outbound: Service profile of L3VPN switching or L3VPN switching with 802.1Q in the outbound direction of an FR interface.l3vpn-outbound1: Service profile of L3VPN switching to QinQ in the outbound direction of an interface.l3vpn-outbound2: Service profile of L3VPN switching in the outbound direction of a or a FR interface.l3vpn-outbound2: Service profile of L3VPN switching in the outbound direction of a POS interface.pbt-outbound: Service profile of PBT switching in the outbound direction of an interface.vlan-mapping-outbound: Service profile of VLAN Mapping switching in the outbound direction of an interface.vll-outbound: Service profile of VLL switching with hetero-medium in the outbound direction of a POS interface or VLL switching to QinQ in the outbound direction of a tunnel.vll-outbound1: Service profile of VLL switching with homo-medium in the outbound direction of a POS interface or VLL switching to QinQ in the outbound direction of a tunnel.vpls-outbound: Service profile of VLL switching with homo-medium in the outbound direction of a POS interface or VLL switching to QinQ in the outbound direction of a tunnel.vpls-outbound1: Service profile of VPLS switching to QinQ in the outbound direction of a tunnel.\nThe system preserves the default service profiles as follows.\ntemplate-default0: This profile is preserved for flow queues and has a default adjustment length 0.template-default1: This profile is preserved for ATM interfaces and has a default adjustment length -16.template-default2: This profile is preserved for multicast traffic and has a default adjustment length 4.template-default3: This profile is preserved for boards housing POS interfaces and has a default adjustment length 8.template-default4: This profile is preserved for boards housing Ethernet interfaces and has a default adjustment length 18.\n\nPrerequisites\nBefore running the multicast shaping service-template command, create a service template in the system view and configure multicast packet compensation."
}