{
    "PageTitle": "port shaping (slot view)",
    "FuncDef": "The port shaping bind mtunnel command sets a peak rate at which the MTunnel interface in the distributed multicast VPN can send data.\nThe undo port shaping bind mtunnel command cancels the peak rate at which the MTunnel interface in the distributed multicast VPN can send data.\nBy default, the shaping rate of an interface equals the bandwidth of the interface.",
    "CLIs": [
        "port shaping <shaping-value> bind mtunnel",
        "undo port shaping bind mtunnel"
    ],
    "ParentView": [
        "Slot view"
    ],
    "ParaDef": [
        {
            "Parameters": "shaping-value",
            "Info": "Specifies the rate for traffic shaping, namely, the peak bandwidth at which the loopback interface in the distributed multicast VPN can send data after traffic shaping is configured. The value is equal to the peak information rate.\nThe value is an integer ranging from 1 to 4294967294, in Mbit/s. The value can be a string of 256 KB or 512 KB, in bit/s."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] slot 1",
            "[*HUAWEI-slot-1] port shaping 500 bind mtunnel"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the incoming traffic from the upstream distributed multicast VPN is too heavy, the downstream device may be congested or a great number of packets are directly discarded. To prevent this situation, you can configure traffic shaping on the MTunnel interface of the distributed multicast VPN on the upstream router to limit the traffic rate and burst size of a connection from the desired network. In this manner, packets can be transmitted at a rather even speed rate.\nConfiguration Impact\nThis command is circular in nature. That is, the latest traffic shaping configuration overrides the previous ones.\nTo configure traffic shaping on the MTunnel interface in a distributed multicast VPN, you need to enable simple traffic classification on the interface, which corresponds to the MTunnel interface, at the side of the public network; otherwise, traffic will be transiently interrupted intermittently."
}