{
    "PageTitle": "service-template",
    "FuncDef": "The service-template command configures a user-defined service profile.\nThe undo service-template command cancels the configuration.\nBy default, no user-defined service profile is configured.",
    "CLIs": [
        "service-template <service-template-name> [ slot <slot-number> ]",
        "undo service-template <service-template-name>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "service-template-name",
            "Info": "Specifies the name of a user-defined service profile.\nThe value is a string of 1 to 31 characters."
        },
        {
            "Parameters": "slot slot-number",
            "Info": "Specifies the ID of the slot for which a user-defined service template is configured. If no slot ID is specified, the service-template command will create a global service profile.\nThe value is an integer that ranges from 0 to 3.The value range is subject to the device display."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] service-template template1 slot 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe service-template command is used to configure a user-defined service template corresponding to a specific network header length. If no slot ID is specified in this command, the command configures a global service profile. If a slot ID is specified, the configured service profile can be used on interfaces that can be managed on the board in the slot.\nA maximum of 256 service profiles are supported, irrespective of whether a slot ID is specified or not.\nConfiguration Impact\nThe forwarding engine processes packets based on packet types and forwarding types. For example, if the forwarding engine removes the MAC header from an IP packet, the length of the packet is different from the original one. As a result, if the forwarding engine performs queue scheduling or traffic shaping, traffic shaping is inaccurate.\nTo improve traffic shaping precise, run the network-header-length command to configure a network header length for packets."
}