{
    "PageTitle": "ppp peer hostroute-suppress",
    "FuncDef": "The ppp peer hostroute-suppress command enables the suppression of adding the peer host route to the local routing table of direct routes.\nThe undo ppp peer hostroute-suppress command disables the suppression of adding the peer host route to the local routing table of direct routes.\nBy default, the local routing table of direct routes contains the peer host route.",
    "CLIs": [
        "ppp peer hostroute-suppress",
        "undo ppp peer hostroute-suppress"
    ],
    "ParentView": [
        "Global MP-group interface view",
        "LMP configuration view",
        "MP-group interface view",
        "POS interface view",
        "POS-Trunk interface view",
        "Trunk serial interface view",
        "Serial interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface serial 1/0/0:2",
            "[~HUAWEI-Serial1/0/0:2] ppp peer hostroute-suppress",
            "[*HUAWEI-Serial1/0/0:2] shutdown",
            "[*HUAWEI-Serial1/0/0:2] commit",
            "[~HUAWEI-Serial1/0/0:2] undo shutdown"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface pos 1/0/1",
            "[~HUAWEI-Pos1/0/1] ppp peer hostroute-suppress",
            "[*HUAWEI-Pos1/0/1] shutdown",
            "[*HUAWEI-Pos1/0/1] commit",
            "[~HUAWEI-Pos1/0/1] undo shutdown"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] lmp",
            "[*HUAWEI-lmp] commit",
            "[~HUAWEI] quit",
            "[~HUAWEI] interface GigabitEthernet1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] lmp interface enable",
            "[*HUAWEI-GigabitEthernet1/0/0] quit",
            "[*HUAWEI] interface Lmpif1/0/0",
            "[*HUAWEI-Lmpif1/0/0] ppp peer hostroute-suppress",
            "[*HUAWEI-Lmpif1/0/0] shutdown",
            "[*HUAWEI-Lmpif1/0/0] commit",
            "[*HUAWEI-Lmpif1/0/0] undo shutdown"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA PPP link does not strictly require that the peer and local routes exist on the same network segment. If the two ends of a PPP link reside on different network segments, one end automatically adds the host route of the other end to the local routing table of direct routes. However, when one end is configured with an incorrect IP address, the other end automatically adds the incorrect peer host route to the local routing table and advertises the incorrect routing information across the network. To resolve this problem, run the ppp peer hostroute-suppress command to enable the suppression of adding the peer host route to the local routing table of direct routes.\nPrerequisites\nPPP has been configured as the link layer protocol of the interface.\nConfiguration Impact\nRunning the ppp peer hostroute-suppress command prevents the route of the directly-connected host from being added to the local routing table of direct routes.\nPrecautions\nAfter the configuration, you must run the shutdown, commit, and undo shutdown commands in the corresponding interface view for the configuration to take effect."
}