{
    "PageTitle": "ppp timer negotiate",
    "FuncDef": "The ppp timer negotiate command sets a timeout period for PPP negotiation.\nThe undo ppp timer negotiate command restores the default timeout period of PPP negotiation.\nBy default, the timeout period of PPP negotiation is 3 seconds.",
    "CLIs": [
        "ppp timer negotiate <seconds>",
        "undo ppp timer negotiate"
    ],
    "ParentView": [
        "LMP configuration view",
        "POS interface view",
        "POS-Trunk interface view",
        "Trunk serial interface view",
        "Serial interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "seconds",
            "Info": "Specifies a timeout period.\nThe value is an integer ranging from 1 to 10, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface pos 1/0/1",
            "[~HUAWEI-Pos1/0/1] ppp timer negotiate 5"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] lmp",
            "[*HUAWEI-lmp] commit",
            "[~HUAWEI] quit",
            "[~HUAWEI] interface GigabitEthernet1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] lmp interface enable",
            "[*HUAWEI-GigabitEthernet1/0/0] quit",
            "[*HUAWEI] interface Lmpif1/0/0",
            "[*HUAWEI-Lmpif1/0/0] ppp timer negotiate 5"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface serial 1/0/0:2",
            "[~HUAWEI-Serial1/0/0:2] ppp timer negotiate 5"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nPPP is a link layer protocol used to transmit data over P2P links. PPP supports MRU negotiation. If the two ends of a PPP link are configured with the MTUs, you must enable PPP MRU negotiation for the two ends to negotiate the MTU and then exchange data.\nRunning the ppp timer negotiate command sets a timeout period of PPP negotiation. If PPP fails to receive a reply packet within the configured timeout period, it resends the packet.\nPrerequisites\nPPP has been configured as the link layer protocol of the interface.\nConfiguration Impact\nIf the ppp timer negotiate command is run more than once, the latest configuration overrides the previous one. After the configuration, the timeout period of PPP negotiation changes.\nPrecautions\nThis command is supported only on the admin VS.\nAfter the configuration, you must run the shutdown, commit, and undo shutdown commands in the corresponding interface view for the configuration to take effect."
}