{
    "PageTitle": "ppp mp threshold-least",
    "FuncDef": "The ppp mp threshold-least command sets the minimum number of the member links in the Up state in an MP group. An MP group can work only when the number of member links in the Up state reaches the configured minimum value.\nThe undo ppp mp threshold-least command restores the default minimum number of the member links in the Up state in an MP group.\nBy default, the minimum number of the member links in the Up state in an MP group is 1.",
    "CLIs": [
        "ppp mp threshold-least <number>",
        "undo ppp mp threshold-least"
    ],
    "ParentView": [
        "Global MP-group interface view",
        "MP-group interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "number",
            "Info": "Specifies the minimum number of the member links in the Up state in an MP group.\nThe value is an integer.\nIf the member interface of the MP link is an E1 interface, the value ranges from 1 to 16.If the member interface of the MP link is a CPOS interface, the value ranges from 1 to 32."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface mp-group 1/0/1",
            "[~HUAWEI-Mp-group1/0/1] ppp mp threshold-least 5",
            "[*HUAWEI-Mp-group1/0/1] shutdown",
            "[*HUAWEI-Mp-group1/0/1] commit",
            "[~HUAWEI-Mp-group1/0/1] undo shutdown"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe minimum number of PPP links configured in an MP group determines the minimum bandwidth of the MP link. To meet bandwidth requirements, run the ppp mp threshold-least command to configure the minimum number of PPP links in an MP group.\nIf the number of PPP links bundled in an MP group is less than the threshold configured using the ppp mp threshold-least command, the MP group goes Down immediately, triggering an alarm.\nIf the number of PPP links bundled in an MP group is greater than or equal to the threshold configured using the ppp mp threshold-least command, the MP group goes Up immediately, triggering a clear alarm.\nConfiguration Impact\nAfter the LCP negotiation succeeds, an MP group performs immediate NCP negotiation only after the number of member links in the Up state in the MP group reaches the configured minimum value. After the NCP negotiation succeeds, the MP link becomes available.\nIf the number of member links in the Up state falls below the minimum value, the MP link goes Down immediately.\nPrecautions\nThis command takes effect only after the MP-group interface is restarted using the shutdown and undo shutdown commands or the restart command in the MP-group interface view."
}