{
    "PageTitle": "ppp chap password",
    "FuncDef": "The ppp chap password command configures an interface to use the default CHAP password for CHAP authentication.\nThe undo ppp chap password command deletes the configured password.\nBy default, a password is in ciphertext format.",
    "CLIs": [
        "ppp chap password { simple password | cipher { password | password } }",
        "undo ppp chap password"
    ],
    "ParentView": [
        "LMP configuration view",
        "POS interface view",
        "POS-Trunk interface view",
        "Trunk serial interface view",
        "Serial interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "simple password",
            "Info": "Specifies a simple password with which the local Device is authenticated by the peer in CHAP mode. The password is stored in plaintext in the configuration file.\nThe password is a string of 1 to 16 case-sensitive characters."
        },
        {
            "Parameters": "cipher password",
            "Info": "Specifies a ciphertext password with which the local Device is authenticated by the peer in CHAP mode. The password is input in simple or encrypt text but stored in cipher text in the configuration file.\nThe password is input in simple or encrypt text.\nWhen being input in simple text, the password is a string of 1 to 16 case-sensitive characters.When being input in ciphertext, the password must be a string of case-sensitive characters. If the system root key is not set, the length of the string must be 48. If the system root key is set, the length of the string can be 108 or 128.A 24-character or 32-character ciphertext password configured in an earlier version is also supported in this version."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface pos 1/0/1",
            "[~HUAWEI-Pos1/0/1] ppp chap password cipher Test-123"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] lmp",
            "[*HUAWEI-lmp] commit",
            "[~HUAWEI] quit",
            "[~HUAWEI] interface GigabitEthernet1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] lmp interface enable",
            "[*HUAWEI-GigabitEthernet1/0/0] quit",
            "[*HUAWEI] interface Lmpif1/0/0",
            "[*HUAWEI-Lmpif1/0/0] ppp chap password cipher Test-123"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe devices on both ends of a PPP link must complete the authentication phase before entering the network-layer protocol phase during the PPP link establishment in most cases. There are two major PPP authentication modes: PAP and CHAP. CHAP authentication is available in two modes: unidirectional and bidirectional. In former mode, one end functions as the authenticator, and the other end as the authenticatee. In latter end, both ends function as the authenticator as well as the authenticatee. In practice, only the unidirectional CHAP authentication is adopted.\nThe unidirectional CHAP authentication can be either of the following: the authenticator is configured with a user name or the authenticator is not configured with a user name. The ppp chap password command is used to configure a CHAP password with which the local Device is authenticated by the peer in the second situation. In this situation, the authenticator sends a Challenge packet to the authenticatee. Based on the password configured on its interface and the Challenge packet, the authenticatee calculates a value using encryption algorithm. Then the authenticatee sends its host name and the calculated value in a response packet to the authenticator. It is generally recommended that you save the password in ciphertext by configuring cipher. When configuring the CHAP authentication, you should configure the password on the local Device in accordance with the user password on the peer. That is, you must configure the user name and password in the AAA view on the local Device according to the user name and password of the peer.\nPrerequisites\nInterfaces are connected, and physical parameters of the interfaces are configured so that the physical layer status of the interfaces is Up.\nPPP has been configured as the link layer protocol of the interface.\nConfiguration Impact\nIf the ppp chap password command is run more than once, the latest configuration overrides the previous one. After the configuration, the configured password is used for the CHAP authentication.\nAfter the simple mode is specified, a password is stored in plaintext mode in the configuration file, which has a high security risk.\nPrecautions\nAfter the configuration, you must run the shutdown, commit, and undo shutdown commands in the corresponding interface view for the configuration to take effect."
}