{
    "PageTitle": "ppp mp damping",
    "FuncDef": "The ppp mp damping command enables the suppression function for MP member links.\nThe undo ppp mp damping command disables the suppression function for MP member links.\nBy default, the suppression function is disabled for MP member links.",
    "CLIs": [
        "ppp mp damping [ detect-time <detect-time> flapping-count <flapping-count> damping-time <damping-time> ]",
        "undo ppp mp damping"
    ],
    "ParentView": [
        "MP-group interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "detect-time detect-time",
            "Info": "Specifies the time during which the MP member link status is detected.\nThe detect-time value must be smaller than or equal to the damping-time value.\nThe value is an integer ranging from 30 to 3600, in seconds. By default, the value is 30."
        },
        {
            "Parameters": "flapping-count flapping-count",
            "Info": "Specifies the maximum number of times that an MP member link flaps within the detection time.\nIf the number of flapping times is greater than or equal to this value within a specified detection period, the MP member link is suppressed.\nThe value is an integer ranging from 1 to 64. By default, the value is 1."
        },
        {
            "Parameters": "damping-time damping-time",
            "Info": "Specifies the minimum time during which an MP member link keeps Up to be released from the suppression state.\nAn MP member link can be released from the suppression state only after it keeps Up for at least the time specified by damping-time.\nThe value is an integer ranging from 60 to 86400, in seconds. By default, the value is 60."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface mp-group 1/0/1",
            "[*HUAWEI-Mp-group1/0/1] ppp mp damping detect-time 120 flapping-count 2 damping-time 150"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo ensure the bandwidth stability of an MP link, you can run the ppp mp damping command to enable the suppression function for MP member links. If the number of times that a member link flaps exceeds the specified threshold, the member link is suppressed.\nPrecautions\nIf an MP member link is suppressed, the link layer protocol is displayed as DOWN (damping) in the display interface mp-group command output.\nIf you run the ppp mp damping command without specifying any parameters, the default parameters are adopted. If the number of times that an MP member link flaps is greater than or equal to 1 within 30s, the MP member link is suppressed and can be released from the suppressed state only after it keeps Up for at least 60s."
}