{
    "PageTitle": "ppp authentication-mode",
    "FuncDef": "The ppp authentication-mode command configures a PPP authentication mode.\nThe undo ppp authentication-mode command deletes the configured PPP authentication mode.\nBy default, no authentication mode is configured.",
    "CLIs": [
        "ppp authentication-mode { chap [ pap ] | pap }",
        "undo ppp authentication-mode"
    ],
    "ParentView": [
        "LMP configuration view",
        "POS interface view",
        "POS-Trunk interface view",
        "Trunk serial interface view",
        "Serial interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "chap",
            "Info": "Indicates the CHAP authentication.\n-"
        },
        {
            "Parameters": "pap",
            "Info": "Indicates the PAP authentication.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface pos 1/0/1",
            "[~HUAWEI-Pos1/0/1] ppp authentication-mode chap"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface serial 1/0/0:2",
            "[~HUAWEI-Serial1/0/0:2] ppp authentication-mode chap"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] lmp",
            "[*HUAWEI-lmp] commit",
            "[~HUAWEI] quit",
            "[~HUAWEI] interface GigabitEthernet1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] lmp interface enable",
            "[*HUAWEI-GigabitEthernet1/0/0] quit",
            "[*HUAWEI] interface Lmpif1/0/0",
            "[*HUAWEI-Lmpif1/0/0] ppp authentication-mode chap"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nGenerally, PPP involves five phases: link dead phase, link establishment phase, authentication phase, network-layer protocol phase, and link termination phase.\nIn most cases, the devices on both ends of a PPP link must complete the authentication phase before entering the network-layer protocol phase.\nPPP authentication is mainly used for:\nHosts and Devices that connect to a PPP network server through switched circuits or dial-up linesDedicated lines\nThere are two major PPP authentication modes: PAP and CHAP. To configure an authentication mode, run the ppp authentication-mode command.\n\nPrerequisites\nInterfaces are connected, and physical parameters of the interfaces are configured so that the physical layer status of the interfaces is Up.\nPPP has been configured as the link layer protocol of the interface.\nConfiguration Impact\nIf the ppp authentication-mode command is run more than once, the latest configuration overrides the previous one. After the configuration, the local Device authenticates the remote Device as configured.\nPrecautions\nAfter the configuration, you must run the shutdown, commit, and undo shutdown commands in the corresponding interface view for the configuration to take effect.\nPAP is not a secure protocol, and it is recommended to use CHAP."
}