{
    "PageTitle": "remote address",
    "FuncDef": "The remote address command assigns an IP address to the peer.\nThe undo remote address command deletes the IP address assigned to the peer.\nBy default, no IP address is assigned to the peer.",
    "CLIs": [
        "remote address <ip-address>",
        "undo remote address"
    ],
    "ParentView": [
        "Global MP-group interface view",
        "LMP configuration view",
        "MP-group interface view",
        "POS interface view",
        "POS-Trunk interface view",
        "Trunk serial interface view",
        "Serial interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address",
            "Info": "Specifies an IP address assigned to the peer.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface pos 1/0/1",
            "[~HUAWEI-Pos1/0/1] remote address 10.1.0.1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface serial 1/0/0:2",
            "[~HUAWEI-Serial1/0/0:2] remote address 10.1.0.1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] lmp",
            "[*HUAWEI-lmp] commit",
            "[~HUAWEI] quit",
            "[~HUAWEI] interface GigabitEthernet1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] lmp interface enable",
            "[*HUAWEI-GigabitEthernet1/0/0] quit",
            "[*HUAWEI] interface Lmpif1/0/0",
            "[*HUAWEI-Lmpif1/0/0] remote address 10.1.0.1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface mp-group 1/0/1",
            "[*HUAWEI-Mp-group1/0/1] remote address 10.1.0.1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf Devices are connected through PPP links, interfaces of the client can obtain IP addresses from the server through negotiation. This is applicable to the scenario where the client accesses the Internet by connecting to the Internet Service Provider (ISP) device through PPP links (for example through dial-up). In this case, the ISP device assigns an IP address to the client through negotiation.\nThe remote address command is used on the server to assign an IP address to the interface of the client.\nPrerequisites\nThe client and the server have been directly connected either physically or Layer 2 logically.\nPPP has been configured as the link layer protocol of the interface.\nConfiguration Impact\nIf the remote address command is run more than once, the latest configuration overrides the previous one. After the configuration, the client is assigned a new IP address.\nPrecautions\nThe IP address or the address pool to be assigned to the peer cannot conflict with the IP addresses of the local Device.\nThe function of automatically obtaining IP addresses through negotiation is applicable to only PPP interfaces.\nAfter the configuration, you must run the shutdown, commit, and undo shutdown commands in the corresponding interface view for the configuration to take effect."
}