{
    "PageTitle": "time-delay-detect enable",
    "FuncDef": "The time-delay-detect enable command enables transmission delay detection on MP-group member links.\nThe undo time-delay-detect enable command disables the function.\nBy default, transmission delay detection is disabled on MP-group member links.",
    "CLIs": [
        "time-delay-detect enable",
        "undo time-delay-detect enable"
    ],
    "ParentView": [
        "MP-group interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Mp-group 1/0/1",
            "[*HUAWEI-Mp-group1/0/1] time-delay-detect enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf devices are connected to each other using low-speed links, these low-speed links can be bundled into an MP group to increase link bandwidth and implement link protection and load balancing. The transmission delays on different MP-group member links, however, are different. If the delay difference between MP-group member links exceeds the allowable value, service transmission quality is affected. Delay detection for MP-group member links enables the device to send a detection packet every second to detect the transmission delay on each MP-group member link. If the transmission delay on a member link reaches the threshold, services to be transmitted on the member link are switched to another member link.\nConfiguration Impact\nAfter transmission delay detection is enabled on MP-group member links, if the transmission delay on a member link reaches the configured threshold, the link stops transmitting service data. Therefore, you are advised to reserve backup member interfaces to ensure sufficient transmission bandwidth.\nPrecautions\nIf there are less than two MP-group member links, transmission delay detection for MP-group member links is disabled automatically.\nDelay detection takes effect for MP-group member links only when the time-delay-detect enable command is supported by the MP-group interfaces through which two devices are connected and has been run on one of the two devices."
}