{
    "PageTitle": "display current-configuration interface",
    "FuncDef": "The display current-configuration command displays the set parameters that take effect on the device.",
    "CLIs": [
        "display current-configuration interface [ <interface-type> [ <interface-number> ] | <interface-number> ] [ include-default ]",
        "display current-configuration controller [ <interface-type> [ <interface-number> ] | <interface-number> ] [ include-default ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "include-default",
            "Info": "Displays both the configurations that users have performed and default configurations.\n-"
        },
        {
            "Parameters": "interface interface-type interface-number",
            "Info": "Specifies the interface name and type.\n-"
        },
        {
            "Parameters": "controller",
            "Info": "Displays the configuration information about a controller interface.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display current-configuration interface GigabitEthernet1/0/0",
            "#",
            "interface GigabitEthernet1/0/0",
            " undo shutdown",
            " ip address  ip address 192.168.1.1 255.255.255.0",
            "#",
            "return"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter a set of configurations are complete, you can run the display current-configuration command to check the parameters that take effect. The parameters that do not take effect are not displayed. If some running configuration parameters are the same as the default parameters, they are not displayed.If include-default is not specified, the display current-configuration command displays only configurations that users have performed.If include-default is specified, the display current-configuration command displays both default configurations and configurations that users have performed.\n\nConfiguration Impact\nYou can filter the output using regular expressions in the case of a large amount of configuration information. For usage of regular expressions, see \"CLI Overview\" in Configuration Guide - Basic Configurations.\nPrecautions\nThe following configurations are not displayed in the command output.\nConfigurations that are the same as default onesConfigurations that have not been committedConfigurations on a VS that is managed separately"
}