{
    "PageTitle": "clear configuration interface",
    "FuncDef": "The clear configuration interface command deletes configurations on an interface at one time.",
    "CLIs": [
        "clear configuration interface { <interface-type> <interface-number> | <interface-name> }"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "interface-type",
            "Info": "Deletes configurations on a specified type interface.\n-"
        },
        {
            "Parameters": "interface-number",
            "Info": "Deletes configurations on a specified number interface.\n-"
        },
        {
            "Parameters": "interface-name",
            "Info": "Deletes configurations on a specified name interface.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] clear configuration interface GigabitEthernet 1/0/1",
            "Warning: All running configurations of the interface will be cleared immediately. Continue? [Y/N]:y"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure an interface on a device for other use, original configurations on the interface need to be deleted one by one. If the interface has a large number of configurations, deleting these configurations one-by-one takes a long time and increases the maintenance workload. To reduce the maintenance workload and simplify the deletion operation, you can use this command to perform one-touch configuration clearance on an interface.\nYou can also run the clear configuration this command in the interface view to delete configurations on a specified interface.\nConfiguration Impact\nAfter you run the clear configuration interface command, the system displays a message, asking you whether to delete the configurations on the specified interface. If you enter Y, all configurations on the specified interface are deleted.Running the clear configuration interface command on an interface is similar to running undo commands on the interface in batches.To delete configurations on an interface at one time and restore the default configuration, run the clear configuration interface command. The command takes effect immediately without being committed using the commit command. Exercise caution when running the clear configuration interface command."
}