{
    "PageTitle": "terminal command forward matched upper-view",
    "FuncDef": "The terminal command forward matched upper-view command enables the intelligent rollback function.\nThe undo terminal command forward matched upper-view command disables the intelligent rollback function.\nBy default, the intelligent rollback function is enabled.",
    "CLIs": [
        "terminal command forward matched upper-view",
        "undo terminal command forward matched upper-view"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> terminal command forward matched upper-view"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIntelligent rollback enables the system to automatically return to the previous view if a command fails to be run in the current view. The system performs view return attempts until the system view is displayed. If the command is matched, it is run in the current view and the matching view is displayed.When configuring services, you need to enter the view of the command to be configured to complete the configuration. In this case, you need to run the quit command repeatedly to exit the current view and enter the required view. The intelligent rollback function allows you to run commands of other views in the current view to reduce repeated quit operations.This command is valid only for sessions that run this command. That is, you can enable or disable the intelligent rollback function only for the sessions that run this command.If you do not need to automatically match a command in an upper-level view, run the undo terminal command forward matched upper-view command to disable the intelligent rollback function.\n\nPrecautions\nIf command matching fails because an ambiguous command is entered in the current view, no intelligent rollback can be performed.Intelligent rollback is not performed when a command fails to be matched.The undo commands do not support intelligent rollback.If the intelligent rollback function is enabled, commands may be executed in unexpected views, and services may be interrupted. Before configuring a command, check whether the command to be configured exists in the view. If the command does not exist, run the command in the correct view."
}