{
    "PageTitle": "command-privilege level rearrange",
    "FuncDef": "The command-privilege level rearrange command promotes the commands of Level 2 or Level 3 to Level 10 or Level 15 in batches.\nThe undo command-privilege level rearrange command restores the commands whose levels are promoted to Level 10 or Level 15 in batches to Level 2 or Level 3.\nBy default, the system does not promote the commands in batches.",
    "CLIs": [
        "command-privilege level rearrange",
        "undo command-privilege level rearrange"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] command-privilege level rearrange"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen a command registers on the device, it is assigned with a default level-0, level-1, level-2, or level-3, corresponding to the visit level, monitoring level, configuration level, and management level respectively. You can run the command-privilege level rearrange command to upgrade all the level-2 and level-3 commands to level-10 and level-15 commands in batches. The levels of level-0 and level-1 commands remain unchanged. Changing the command-privilege level rearrange command configuration affects the value of level in the user privilege level (user interface view), user privilege level (console user interface view), command-privilege level, adminuser-priority, and local-user level commands. The command level and user level increase accordingly. For details, see the \"Parameters\" table in the corresponding sections. For details, see the \"Parameters\" table in the corresponding sections.Before running the command-privilege level rearrange command, confirm that the user level is 3 or 15. Otherwise, this command cannot be run.The system prompts that the user command level is promoted in batches to avoid misoperation of other users.Before the command level resumes after being promoted in batches, promoting the command level in batches again does not take effect."
}