{
    "PageTitle": "display diagnostic-information",
    "FuncDef": "The display diagnostic-information command displays diagnostic information about the current system.",
    "CLIs": [
        "display diagnostic-information [ level <level_value> ] [ <module-name> ] &<1-8> [ slot <slot-id> ] [ key <key-string> ] [ force ]",
        "display diagnostic-information [ level <level_value> ] [ <module-name> ] &<1-8> [ slot <slot-id> ] [ key <key-string> ] [ force ] <file-name>",
        "display diagnostic-information [ level <level_value> ] [ <module-name> ] &<1-8> <file-name> [ slot <slot-id> ] [ key <key-string> ] [ force ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "level level_value",
            "Info": "Specifies the level of the diagnostic information.\nThe value is an enumerated type, which can be:\nhigh: Specifies the level of the diagnostic information to be high.medium: Specifies the level of the diagnostic information to be medium.low: Specifies the level of the diagnostic information to be low."
        },
        {
            "Parameters": "module-name",
            "Info": "Displays diagnostic file information for the specified module.\n-"
        },
        {
            "Parameters": "slot slot-id",
            "Info": "Displays diagnostic file information on a specified board.\n-"
        },
        {
            "Parameters": "key key-string",
            "Info": "Specifies the keyword of the diagnostic information.\nEnumerated type:\nslothistory"
        },
        {
            "Parameters": "force",
            "Info": "Forcibly collects diagnostic command information with one-click.\n-"
        },
        {
            "Parameters": "file-name",
            "Info": "Specifies the name of the file that stores diagnostic information.\nThe value is a string of 5 to 64 characters.\nBy default, the file path is bin/, and the extension of the file must be .txt or .zip."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display diagnostic-information level high smp",
            "=============================================================================== ",
            "                 display version                                                ",
            "=============================================================================== ",
            "                                                                                ",
            "                                                                                ",
            "                                                                                ",
            "=============================================================================== ",
            "                 display patch-information                                      ",
            "=============================================================================== ",
            "                                                                                ",
            "Info: No patch exists.                                                          ",
            "The current state is: Idle                                                      ",
            "                                                                                ",
            "=============================================================================== ",
            "                 display alarm active verbose                                   ",
            "=============================================================================== ",
            "                                                                                ",
            "                                                                                ",
            "                                                                                ",
            "=============================================================================== ",
            "                 display current-configuration                                  ",
            "=============================================================================== ",
            "                                                                                ",
            "!Software Version V800R011C00B001                                               ",
            "!Last configuration was updated at 2015-05-07 10:18:40+00:00"
        ],
        [
            "<HUAWEI> display diagnostic-information key history a.txt",
            "Now saving the diagnostic information to the device",
            "10%"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen a fault occurs in the system, if it is difficult to determine the module that causes the fault, you can use the display diagnostic-information command to collect diagnostics information for locating the fault. To collect diagnostic information about the historical information or board, run the display diagnostic-information key command. If history is specified for key, information about diagnostic commands containing history is collected. If slot is specified for key, information about diagnostic commands containing slot is collected.\nConfiguration Impact\nThe display diagnostic-information command combines the functions of multiple common display commands, such as the display clock, display version, and display current-configuration commands. Running this command equals to the running of these display commands.\nPrecautions\nWhen using this command, note the following points:If no parameter is specified, diagnostics information is only displayed.If the parameter file-name is specified, diagnostics information is not only displayed but also saved into the specified file.If level is specified, diagnostics information is displayed by level.If key is specified, only information about diagnostic commands containing the specified keyword is displayed. The keyword is fully matched.If force is specified, diagnostic command information is forcibly collected with one-click.The troubleshooting aspect varies with the device. Therefore, the collected information varies when the same command is used on different devices.If force is not contained in the command, collecting diagnostic information is restricted by the CPU:Before the information is collected, if the CPU usage exceeds 60%, the command is not performed, and an error message is displayed.During information collecting, if the CPU usage exceeds 80% at the interval of performing two commands, the running of the command is stopped, and the system waits for 300 seconds. If the CPU usage falls below 70% in 300 seconds, the running of the command restores. Otherwise, an error message is displayed.The level of the display diagnostic-informationfile-name command is level 3 (management level)."
}