{
    "PageTitle": "execute",
    "FuncDef": "The execute command executes a specified batch file or VRP Shell Languages (VSL) script.",
    "CLIs": [
        "execute <filename> [ <parameter> [ <parameter> [ <parameter> [ <parameter> [ <parameter> [ <parameter> [ <parameter> [ <parameter> ] ] ] ] ] ] ] ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "filename",
            "Info": "Specifies the name and path of a batch file.\nThe value is a string of 5 to 64 characters. The file name extension is .bat or .cfg. If the batch file to be processed is in the current directory; you can only input the name of a batch file."
        },
        {
            "Parameters": "parameter",
            "Info": "Specifies a VSL parameter.\nThe value is a string of 1 to 32 case-sensitive characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> cd cfcard:/",
            "<HUAWEI> system-view",
            "[~HUAWEI] execute test.bat"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe commands in a batch file are run one by one. A batch file cannot contain any invisible character. If an invisible character is detected, the execute command exits from the current process and no rollback is performed.The execute command does not ensure that all commands can be run. The execute command is not hot backed up, and no restriction is on the format or contents of the command.Running the execute command functions the same as running the commands one by one manually.\n\nPrecautions\nWhen a .bat file is a VSL script, the execute command configures services automatically and commands in the batch file as well as performs configurations for services specified by parameter at a time.\nWhether a character is invisible is determined based on the ASCII character table. Characters whose ASCII character value ranges from 32 to 126 are visible (the ASCII character value 32 indicates spaces). Other characters are invisible."
}