{
    "PageTitle": "header",
    "FuncDef": "The header command configures the title contents to be displayed at a login.\nThe undo header command deletes the title contents to be displayed at a login.\nBy default, no title is displayed if a user logs in.",
    "CLIs": [
        "header login information <text>",
        "header login file <file-name>",
        "header shell information <text>",
        "header shell file <file-name>",
        "undo header login",
        "undo header shell"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "login",
            "Info": "Displays the title when the terminal connection is activated during the login to the device.\n-"
        },
        {
            "Parameters": "file file-name",
            "Info": "Specifies the file name used in the title.\nThe value is a string of 1 to 64 characters without spaces. The size of a title file should be equal to or smaller than 2 KB. For a title file larger than 2 KB, only the contents of the first 2 KB are displayed."
        },
        {
            "Parameters": "shell",
            "Info": "Displays the title when a session is set up after the successful login to the device.\n-"
        },
        {
            "Parameters": "information text",
            "Info": "Specifies the title information.\nThe value is a string of 1 to 480 characters with spaces supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] header shell information Hello Welcome",
            "[*HUAWEI] commit",
            "[~HUAWEI] quit"
        ],
        [
            "Username: huawei",
            "Password:******",
            "Hello Welcome",
            "<HUAWEI>"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] header login file cfcard:/header-file.txt",
            "[*HUAWEI] commit",
            "[~HUAWEI] quit"
        ],
        [
            "Hello Welcome",
            "Username: huawei",
            "Password:******",
            "<HUAWEI>"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo provide some prompts or alarms to users, you can use the header command to configure a title on the device. If a user logs in to the device, the title is displayed.You can use the parameter information text to specify the title information, or use the parameter file file-name to specify the title information by using the contents of a file.When a terminal connection is activated and you attempt to log in, the terminal displays the contents of the title that is set by using the header login command. After the successful login, the terminal displays the contents of the title that is configured by using the header shell command.\n\nConfiguration Impact\nIf you run the header command several times, the last configuration overrides the previous configuration.\nAfter the login title is configured, any user that logs in to the system can view the title.\nPrecautions\nA title text must start and end with the first letter of the character string to be entered.To edit a file, enter a character and press Enter. Then, you can add data to or delete data from the file. After editing the file, enter the end letter and the system automatically exists the file editing process.If you do not want to edit a file, press Enter when the same letter is displayed at both the start and end of the file."
}