{
    "PageTitle": "loadbalance packet enable",
    "FuncDef": "The loadbalance packet enable command enables the per-packet load balancing mode on an outbound interface.\nThe undo loadbalance packet enable command disables the per-packet load balancing mode on an outbound interface.\nBy default, an outbound interface uses the per-flow load balancing mode.",
    "CLIs": [
        "loadbalance packet enable",
        "undo loadbalance packet enable"
    ],
    "ParentView": [
        "Eth-Trunk interface view",
        "GE optical interface view",
        "GE sub-interface view",
        "GE electrical interface view",
        "IP-Trunk interface view",
        "Port extension sub-interface view",
        "Port extension interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1/0/1",
            "[*HUAWEI-GigabitEthernet1/0/1] loadbalance packet enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe Router supports per-flow and per-packet load balancing modes.\nPer-flow load balancing: In this mode, the Router forwards packets that have the same attribute through the same interface. This mode minimizes packet disorder risks on receiving devices.Per-packet load balancing: In this mode, the Router evenly distributes packets to multiple outbound interfaces, without considering logical relationships between packets. Therefore, this mode implements interface-based load balancing.\nBy default, an outbound interface uses the per-flow load balancing mode. If the lengths of packets have no big difference and the per-packet load balancing mode is demanded, run the\nloadbalance packet enable command.\n\nPrecautions\nPer-packet load balancing is supported on the following types of interfaces only:Layer 3 Ethernet interfaces, GE interfaces, Eth-Trunk interfaces, Ethernet sub-interfaces, QinQ VLAN tag termination sub-interfaces, dot1q VLAN tag termination sub-interfaces, flexible access sub-interfaces, Eth-Trunk dot1q VLAN tag termination sub-interfaces, Eth-Trunk QinQ VLAN tag termination sub-interfaces, remote AP interfaces, and remote Eth-Trunk interfaces.If this command is run in the Eth-Trunk interface view, per-packet load balancing is performed among multiple member interfaces.Per-packet load balancing takes effect only when the loadbalance packet enable command is configured on each outbound interface that participates in load balancing."
}