{
    "PageTitle": "load-balance hash-fields tunnel-inner-ip enable",
    "FuncDef": "The load-balance hash-fields tunnel-inner-ip enable command enables load balancing based on inner IP packets transmitted over an SRv6.\nThe undo load-balance hash-fields tunnel-inner-ip enable command restores the default configuration.\nBy default, load balancing based on inner IP packets transmitted over an SRv6 is not enabled.",
    "CLIs": [
        "load-balance hash-fields tunnel-inner-ip enable",
        "undo load-balance hash-fields tunnel-inner-ip enable"
    ],
    "ParentView": [
        "Slot view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] slot 1",
            "[*HUAWEI-slot-1] load-balance hash-fields tunnel-inner-ip enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn an L3VPN IPv4 accessing SRv6 BE load balancing scenario, the inner information of SRv6 packets transmitted by P nodes is not used as a hash factor by default. After the load-balance hash-fields tunnel-inner-ip enable command is run, the inner packet information of the SRv6 is mapped to the FlowLabel value of the outer IPv6 packets. The P nodes of SRv6 implement load balancing based on the new hash factor, that is, the FlowLabel value.\nIn SRv6, the load balancing can be implemented based on inner IP packets transmitted over an SRv6 only when the inner IP packets carry the GTP, 4over4, 6over4, GRE and L2TP information.\nGTP: SIP+DIP+TEID4over4: inner IPv4 quintuple6over4: inner IPv6 quintupleGRE: inner IPv4 quintupleL2TP: SIP+DIP+TunnelID+SessionID\n\nPrecautions\nAfter the load-balance hash-fields tunnel-info disable command is run, the load-balance hash-fields tunnel-inner-ip enable command cannot be executed.\nAfter the load-balance hash-fields tunnel-inner-ip enable command is run, the execution of the load-balance hash-fields tunnel-info disable command causes the load-balance hash-fields tunnel-inner-ip enable configuration to be deleted from the device.\nIn an L3VPN IPv4 accessing SRv6 BE load balancing scenario, by default, common triplet and quintuple information can be mapped to the FlowLabel value of an outer IPv6 packet.\nThis command does not take effect in EVPN VPLS and EVPN VPWS scenarios.\nIn VS mode, this command is supported only by the admin VS.\nThe commands does not apply to LPUF-50/LPUF-50-L/LPUI-21-L/LPUI-51-L/LPUF-51/LPUF-51-B/LPUI-51/LPUI-51-B/LPUS-51/LPUF-101/LPUF-101-B/LPUI-101/LPUI-101-B/LPUS-101.\nAfter the load-balance hash-fields tunnel-info disable command is run, the load-balance hash-fields tunnel-inner-ip enable command cannot be executed.\nAfter the load-balance hash-fields tunnel-inner-ip enable command is run, the execution of the load-balance hash-fields tunnel-info disable command causes the load-balance hash-fields tunnel-inner-ip enable configuration to be deleted from the device.\nIn VS mode, this command is supported only by the admin VS."
}