{
    "PageTitle": "load-balance hash-key ip",
    "FuncDef": "The load-balance hash-key ip command configures a device to use source or destination IP addresses as hash elements to balance all incoming IP packets on a specific or all interface boards.\nThe undo load-balance hash-key ip command disables a device from using source or destination IP addresses as hash elements to balance all incoming IP packets on a specific or all interface boards.\nThis function is disabled by default.",
    "CLIs": [
        "load-balance hash-key ip { destination-ip | source-ip } slot { all | <slot-id> }",
        "undo load-balance hash-key ip [ destination-ip | source-ip ] slot { all | <slot-id> }"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "destination-ip",
            "Info": "Uses destination IP addresses to balance data packets. Select destination IP addresses if the change scope of source IP addresses exceeds that of destination IP addresses.\n-"
        },
        {
            "Parameters": "source-ip",
            "Info": "Uses source IP addresses to balance data packets. Select source IP addresses if the change scope of destination IP addresses exceeds that of source IP addresses.\n-"
        },
        {
            "Parameters": "slot all",
            "Info": "Enables the load balancing function for all interface boards.\n-"
        },
        {
            "Parameters": "slot slot-id",
            "Info": "Enables the load balancing function for a specified interface board.\nThe value is the slot number of an installed board."
        },
        {
            "Parameters": "ip",
            "Info": "Enable the load balancing function for traffic with IP packet header received by an interface board.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] load-balance hash-key ip source-ip",
            "Warning: The priority of the current configuration is higher than that of other hash mode configurations."
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] load-balance hash-key ip source-ip slot all",
            "Warning: The priority of the current configuration is higher than that of other hash mode configurations."
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] load-balance hash-key ip source-ip slot 1",
            "Warning: The priority of the current configuration is higher than that of other hash mode configurations."
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA device by default uses 5-tuple information to balance traffic through outbound interfaces. The default load balancing mode may result in load imbalance. To prevent load imbalance, run the load-balance hash-key ip command to configure a device to use source or destination IP addresses as hash elements to balance all incoming IP packets on a specific or all interface boards. This command ensures that traffic is hashed to the same outbound interface.\nPrecautions\nThe load balancing function configured using the load-balance hash-key ip command takes precedence over the other IP packet load balancing functions.Delivering of the load-balance hash-key ip command may result in load imbalance.When the load-balance hash-key ip command and the trunk load balancing function are configured, the same hash mode must be configured on both ends.The load-balance hash-key ip command cannot be run on a LPUF-50/LPUF-50-L/LPUI-21-L/LPUI-51-L/LPUF-51/LPUF-51-B/LPUI-51/LPUI-51-B/LPUS-51/LPUF-101/LPUF-101-B/LPUI-101/LPUI-101-B/LPUS-101/VSUF-80/VSUF-160/VSUI-160-E.If the load-balance hash-key ip {destination-ip | source-ip } slot all command on a board that does not support this function, an alarm is generated.The load-balance hash-key ip command enables a device to balance incoming traffic only of a single interface board based only on source IP addresses and hash the traffic to the same outbound interface.\nIn VS mode, this command is supported only by the admin VS."
}