{
    "PageTitle": "load-balance dynamic-adjust enable",
    "FuncDef": "The load-balance dynamic-adjust enable command enables the dynamic load balancing adjustment function.\nThe undo load-balance dynamic-adjust enable command disables the dynamic load balancing adjustment function.\nBy default, the dynamic load balancing adjustment function is disabled on an interface board.",
    "CLIs": [
        "load-balance dynamic-adjust enable",
        "undo load-balance dynamic-adjust enable"
    ],
    "ParentView": [
        "Slot view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] slot 1",
            "[*HUAWEI-slot-1] load-balance dynamic-adjust enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe device supports multiple load balancing configurations, including IP packet, VPLS, VLL load balancing configurations. If these configurations cannot prevent uneven load balancing, run the load-balance dynamic-adjust enable command to enable the dynamic load balancing adjustment function on a specific board. This function enables the Router to dynamically adjust load balancing on a board, improving the hash precision.\nPrecautions\nThe dynamic load balancing adjustment function configured using the load-balance dynamic-adjust enable command does not take effect for tunnel interfaces with service classes configured.\nDynamic load balancing adjustment enables a device to re-select path based on the hash algorithm. As a result, this causes a temporary packet mis-sequence, and the packet mis-sequence problem is rectified after dynamic load balancing adjustment is complete.\nApplicable scenarios:Multiple flows are hashed to one or two outbound interfaces, with other outbound interfaces unattended.After dynamic load balancing adjustment is enabled, the default traffic offset threshold implemented by the system is 30%. After the adjustment is successful, the offset threshold is less than 30% and cannot be determined. In addition, an offset threshold cannot be configured using a command. If the traffic offset threshold is set to a value lower than 30%, for example, 1%, the dynamic adjustment result cannot be ensured.\nInapplicable scenarios:No outbound interface has traffic.The number of flows to be load-balanced is lower than four times the number of load balancing outbound interfaces. For example, ten flows are load-balanced to three outbound interfaces.A burst of traffic is sent to one outbound interface at a rate higher than the average traffic rate multiplying a factor of 1+traffic offset threshold. The average traffic rate is calculated based on a 1-minute traffic statistics, slightly deviating from the actual value. Therefore, reducing the traffic offset threshold by 2% or 3% in calculation is recommended.\n\n\nThe dynamic load balancing adjustment function configured using the load-balance dynamic-adjust enable command does not take effect for tunnel interfaces with service classes configured.\nThis command applies only to the LPUF-50/LPUF-50-L/LPUI-21-L/LPUI-51-L/LPUF-51/LPUF-51-B/LPUI-51/LPUI-51-B/LPUI-51-S/LPUS-51/LPUF-101/LPUF-101-B/LPUI-101/LPUI-101-B/LPUS-101/LPUF-51-E/LPUI-51-E/LPUI-51-CM/LPUF-120/LPUF-120-B/LPUF-120-E/LPUI-102-E/LPUI-120/LPUI-120-B/LPUI-120-L/LPUI-52-E/LPUI-120-E/LPUI-120-CM/LPUF-240/LPUF-240-B/LPUF-240-E/LPUI-240/LPUI-240-B/LPUI-240-CM/LPUI-240-L/LPUF-480/LPUF-480-B/LPUI-480/LPUI-480-B/LPUI-480-L/LPUF-480-E/LPUI-480-CM/LPUI-200/LPUI-200-L/LPUF-200/LPUF-200-B/LPUI-1T/LPUI-1T-B/LPUI-1T-L/LPUI-1T-CM/LPUI-2T/LPUI-2T-B/LPUI-2T-CM/LPUF-481/LPUF-402-E/LPUI-241/LPUI-241-B/LPUI-241-CM//LPUF-241/LPUF-241-E/LPUF-52/LPUF-1T-E/LPUI-1T-CM/LPUF-1T-L.\nIn VS mode, this command is supported only by the admin VS."
}