{
    "PageTitle": "load-balance hash-fields tunnel-info disable (slot view)",
    "FuncDef": "The load-balance hash-fields tunnel-info disable command disables a device from using tunnel information as a hash factor during hash calculation for packets of a specified tunnel type.\nThe undo load-balance hash-fields tunnel-info disable command restores the default configuration.\nBy default, a device uses tunnel information as a hash factor during hash calculation for packets of a specified tunnel type. The hash factor is SIP+DIP+tunnel ID.",
    "CLIs": [
        "load-balance hash-fields tunnel-info <tunnel-type> disable",
        "undo load-balance hash-fields tunnel-info <tunnel-type> disable"
    ],
    "ParentView": [
        "Slot view"
    ],
    "ParaDef": [
        {
            "Parameters": "tunnel-type",
            "Info": "Specifies a tunnel type.\nThe value can be gtp."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] slot 1",
            "[~HUAWEI-slot-1] load-balance hash-fields tunnel-info gtp disable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn an ESQM scenario, GTP packets are balanced based on tunnel IDs by default. GTP heartbeat packets and data packets are balanced on different paths based on tunnel IDs, which causes inaccurate statistics. As a result, NCE performs incorrect detection, triggering iFIT detection. To resolve this issue, run the load-balance hash-fields tunnel-info disable command to disable the device from using tunnel information as a hash factor during hash calculation for GTP packets. By default, the device performs hash calculation for GTP packets based on the 5-tuple information. In this way, GTP heartbeat packets and data packets are hashed to the same path based on the 5-tuple information, improving statistics accuracy.\nPrecautions\nThis command does not support the LPUF-50/LPUF-50-L/LPUI-21-L/LPUI-51-L/LPUF-51/LPUF-51-B/LPUI-51/LPUI-51-B/LPUS-51/LPUF-101/LPUF-101-B/LPUI-101/LPUI-101-B/LPUS-101 or VSUF."
}