{
    "PageTitle": "load-balance hash-fields tunnel-info disable",
    "FuncDef": "The load-balance hash-fields tunnel-info disable command disables a device from using tunnel information as a hash factor during hash calculation for non-fragmented IP tunnel packets.\nThe undo load-balance hash-fields tunnel-info disable command restores the default configuration.\nBy default, a device uses tunnel information as a hash factor during hash calculation for non-fragmented IP tunnel packets.",
    "CLIs": [
        "load-balance hash-fields tunnel-info disable",
        "undo load-balance hash-fields tunnel-info disable"
    ],
    "ParentView": [
        "Slot view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] slot 10",
            "[~HUAWEI-slot-10] load-balance hash-fields tunnel-info disable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn IP tunnel (GTP, GRE, L2TP, 6over4, or IPinIP tunnel) load balancing scenarios, a device uses tunnel information as a hash factor during hash calculation for non-fragmented packets but hashes fragmented packets based only on IP addresses (3-tuple information) by default. If both fragmented and non-fragmented packets exist, different load balancing modes cause packets to be out of order. To solve this problem, run the load-balance hash-fields tunnel-info disable command to disable a device from using tunnel information as a hash factor during hash calculation for non-fragmented IP tunnel packets. If 5-tuple information can be obtained, packets are hashed based on 5-tuple information. Otherwise, packets are hashed based on 3-tuple information. The inbound interface of packets performs hash calculation to implement load balancing. Packets are hashed based on packet characteristics, which are called hash factors. If these hash factors are more hashable, packets will be more evenly balanced using the hash algorithm. The device uses default hash factors to balance packets of different service types. The inbound interface of packets automatically applies default hash factors matching service packet types to implement load balancing. For better load balancing performance, select optimal hash factors based on service packet types.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}