{
    "PageTitle": "load-balance unequal-cost enable (system view)",
    "FuncDef": "The load-balance unequal-cost enable command enables unequal-cost multiple path (UCMP) in the system view.\nThe undo load-balance unequal-cost enable command disables UCMP in the system view.\nBy default, UCMP is disabled in the system view.",
    "CLIs": [
        "load-balance unequal-cost enable",
        "undo load-balance unequal-cost enable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] load-balance unequal-cost enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAlthough both high- and low-speed links are connected to outbound interfaces of multiple equal-cost routes, ECMP evenly load-balances traffic among the links to a destination, irrespective of bandwidth. If the ratio of a link bandwidth value to another link bandwidth value is too high or two low, the low-speed links may be congested whereas the high-speed links may not be effectively utilized. To efficiently and properly utilize link bandwidth, load balancing must be performed on multiple links based on bandwidth ratios.\nUCMP distributes traffic based on bandwidth ratios associated with multiple unequal-cost paths that have the same precedence, achieving optimal load balancing.\nConfiguration Impact\nEthernet, GE, Eth-Trunk and TE tunnel interfaces support UCMP configurations in the system view.\nEnabling or disabling UCMP triggers the system to deliver routing entries to an interface board. UCMP cannot be enabled or disabled during the graceful restart (GR) process because the system does not deliver routing entries to the interface board.\nPrecautions\nWhen the UCMP function is enabled or disabled, the system triggers the delivery of routing entries to interface boards. During GR, however, the system does not deliver routing entries to interface boards. In this case, run the load-balance unequal-cost enable command in the system view to enable or disable the UCMP function.For a trunk interface, the load-balance unequal-cost enable command takes effect between the trunk interface and other interfaces instead of between the member interfaces of the trunk interface. The UCMP function between the member interfaces of the trunk interface is related only to weights. You can run the distribute-weight command to set a load balancing weight of each member interface."
}