{
    "PageTitle": "load-balance hash-fields vll",
    "FuncDef": "The load-balance hash-fields vll command specifies hash factors that are used for traffic load balancing on the interface board in VLL forwarding.\nThe undo load-balance hash-fields vll command restores the default configuration.\nBy default, the hash factors are specified as l4 on the interface board in VLL forwarding.",
    "CLIs": [
        "load-balance hash-fields vll { l2 | l3 | l4 | label-ip }",
        "load-balance hash-fields vll label",
        "undo load-balance hash-fields vll"
    ],
    "ParentView": [
        "Slot view"
    ],
    "ParaDef": [
        {
            "Parameters": "l2",
            "Info": "Indicates that hash factors are the source MAC address and destination MAC address. This means that the hash calculation is performed based on the source MAC address and destination MAC address for the traffic in the upstream direction of the interface. The parameter is specified if the source MAC address and destination MAC address are hashable.\n-"
        },
        {
            "Parameters": "l3",
            "Info": "Indicates that hash factors are the source IP address and destination IP address. This means that the hash calculation is performed based on the source IP address and destination IP address for the traffic in the upstream direction of the interface. The parameter is specified if the source IP address and destination IP address are hashable.\n-"
        },
        {
            "Parameters": "l4",
            "Info": "Indicates that hash factors are the source IP address, destination IP address, source port number, destination port number, and protocol number. This means that the hash calculation is performed based on these hash factors for the traffic in the upstream direction of the interface. The parameter is specified if the source/destination IP addresses and source/destination MAC addresses are not hashable.\n-"
        },
        {
            "Parameters": "label-ip",
            "Info": "Extends the l4 mode:\nFor IP packets, hash factors are the source and destination IP addresses, source and destination port numbers, and protocol number.For non-IP packets, hash factors are MPLS labels. If the number of labels is less than or equal to five, all labels are used for hash calculation. If the number of labels is greater than five, five outermost labels are used for hash calculation.\n-"
        },
        {
            "Parameters": "label",
            "Info": "Indicates that hash factors are the private network labels of VLL services. If the traffic of a VLL service needs to be transmitted from a public network interface, the load balancing behavior of the VLL service needs to be disabled. In this case, setting this parameter is recommended.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] slot 1",
            "[*HUAWEI-slot-1] load-balance hash-fields vll label"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] slot 1",
            "[*HUAWEI-slot-1] load-balance hash-fields vll l3"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThis command is used to specify the hash factors that are used for traffic load balancing at the device in VLL forwarding.\nThe load balancing function is implemented using the hash algorithm on the upstream interface board. Traffic is hashed based on traffic characteristics, which are called hash factors. If hash factors are more hashable, traffic will be more evenly load-balanced. The device has default values of the hash factors used for load balancing of different service types of packets. Traffic is load balanced based on the default hash factors depending on the service types of packets on the upstream interface board. To implement load balancing better, configure hash factors based on traffic types.\nConfiguration Impact\nThe load-balance hash-fields vll command is cyclic in nature, and only the latest configuration takes effect. After the command is configured, the hash calculation is performed based on the new hash factors.\nPrecautions\nThis command is used to adjust the hash factors for AC-side upstream traffic on PEs in VLL networking. If MAC addresses are more hashable, the l2 parameter needs to be specified. If IP addresses are more hashable, the l3 parameter needs to be specified. If non-IP packets are encapsulated with labels, the label-ip parameter needs to be specified. Otherwise, use the default parameter l4 for hashing.\nThe load-balance hash-fields vll label configuration is mutually exclusive with the VPN QoS configuration. If they are both configured, the function corresponding to the load-balance hash-fields vll label configuration does not take effect and PW label-based load balancing fails to be implemented.\nThe load-balance hash-fields vll label command does not support the LPUF-50/LPUF-50-L/LPUI-21-L/LPUI-51-L/LPUF-51/LPUF-51-B/LPUI-51/LPUI-51-B/LPUS-51/LPUF-101/LPUF-101-B/LPUI-101/LPUI-101-B/LPUS-101 board. If the board specified in the load-balance hash-fields vll label command is changed from LPUF-50/LPUF-50-L/LPUI-21-L/LPUI-51-L/LPUF-51/LPUF-51-B/LPUI-51/LPUI-51-B/LPUI-51-S/LPUS-51/LPUF-101/LPUF-101-B/LPUI-101/LPUI-101-B/LPUS-101/LPUF-51-E/LPUI-51-E/LPUI-51-CM/LPUF-120/LPUF-120-B/LPUF-120-E/LPUI-102-E/LPUI-120/LPUI-120-B/LPUI-120-L/LPUI-52-E/LPUI-120-E/LPUI-120-CM/LPUF-240/LPUF-240-B/LPUF-240-E/LPUI-240/LPUI-240-B/LPUI-240-CM/LPUI-240-L/LPUF-480/LPUF-480-B/LPUI-480/LPUI-480-B/LPUI-480-L/LPUF-480-E/LPUI-480-CM/LPUI-200/LPUI-200-L/LPUF-200/LPUF-200-B/LPUI-1T/LPUI-1T-B/LPUI-1T-L/LPUI-1T-CM/LPUI-2T/LPUI-2T-B/LPUI-2T-CM/LPUF-481/LPUF-402-E/LPUI-241/LPUI-241-B/LPUI-241-CM//LPUF-241/LPUF-241-E/LPUF-52/LPUF-1T-E/LPUI-1T-CM/LPUF-1T-L to an unsupported board, the load-balance hash-fields vll label configuration is lost and the default load-balance hash-fields vll l4 configuration is restored.\nIn VS mode, this command is supported only by the admin VS."
}