{
    "PageTitle": "load-balance unequal-cost enable (interface view)",
    "FuncDef": "The load-balance unequal-cost enable command enables unequal-cost multiple path (UCMP) on the current interface.\nThe undo load-balance unequal-cost enable command disables UCMP on the current interface.\nBy default, UCMP is disabled on an interface.",
    "CLIs": [
        "load-balance unequal-cost enable",
        "undo load-balance unequal-cost enable"
    ],
    "ParentView": [
        "100GE interface view",
        "10GE interface view",
        "400GE interface view",
        "40GE interface view",
        "GE optical interface view",
        "GE electrical interface view",
        "POS interface view",
        "XGE interface view",
        "Port extension interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] load-balance unequal-cost enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nUCMP distributes traffic among equal-cost physical links to a given destination based on bandwidth ratios, improving load balancing efficiency.\nUCMP applies to only equal-cost routes and is independent of routing protocols such as the Interior Gateway Protocol (IGP) or Border Gateway Protocol (BGP).\nPrecautions\nUCMP takes effect on all outbound interfaces associated with equal-cost routes to the same destination only after all outbound interfaces have been enabled with UCMP. If UCMP is not enabled on any of the preceding outbound interfaces, traffic is evenly balanced over equal-cost paths.\nUnequal cost multipath (UCMP) is not supported on sub-interfaces.\nAfter the interface is configured with portswitch or is bound to LMP, the load-balance unequal-cost enable command can still be configured but does not take effect for any service.\nFor a trunk interface, the load-balance unequal-cost enable command takes effect between the trunk interface and other interfaces instead of between the member interfaces of the trunk interface. The UCMP function between the member interfaces of the trunk interface is related only to weights. You can run the distribute-weight command to set a load balancing weight of each member interface."
}