{
    "PageTitle": "trunk multicast load-balance enable",
    "FuncDef": "The trunk multicast load-balance enable command enables trunk load balancing for multicast.\nThe undo trunk multicast load-balance enable command disables trunk load balancing for multicast.\nBy default, trunk load balancing is not enabled for multicast.",
    "CLIs": [
        "trunk multicast load-balance enable",
        "undo trunk multicast load-balance enable"
    ],
    "ParentView": [
        "VLAN view",
        "VSI view",
        "Bridge domain view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] vlan 1",
            "[*HUAWEI-vlan1] trunk multicast load-balance enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo enable the device to balance multicast traffic among trunk member interfaces in a multicast group, run the trunk multicast load-balance enable command to enable trunk load balancing for multicast. Then, when a member interface fails, the other member interfaces will take over the traffic on the faulty member interface, implementing uninterrupted multicast traffic forwarding.\nPrecautions\nWhen CE-GW is the transit node for the connection between the PW and VXLAN, the following mutually-exclusive relationships exist:\nThe trunk load balancing configuration for multicast is not supported in the BD view.The port-mirroring command cannot be run in the BD view.QoS commands that begin with the keyword QoS/trust/traffic-policy cannot be run in the BD view.The DHCP, IGMP Snooping, and Layer 2 multicast functions are not supported in the BD view.A BD interface that is bound to a VSI can only be bound to a VXLAN. A BD interface cannot be bound to a VSI, VXLAN, or EVC sub-interfaces at the same time.Only BD 1:1 mode is supported to access the VSI.The DiffServ mode cannot be modified to the default uniform mode in the BD or VSI view.\nDevice-specific VXLAN has the following mutual exclusive relationships:\nThe trunk load balancing for multicast is not supported in the BD view.DHCP, IGMP Snooping, and L2 multicast are not supported in the BD and EVC sub-interface views.IP FPM and Y.1731 are not supported in the EVC sub-interface view.\nIn the same VLAN/VSI/BD,\nTrunk load balancing for multicast cannot work with IGMP snooping or MLD snooping.A BD fails to be bound to a VSI in the following situations: 1. IGMP Snooping or the function of discarding unknown multicast packets is configured on a BD. 2. After a BD is bound to a VSI, the number of links bearing trunk load for multicast exceeds the threshold.For a BD to which a VSI is bound, after trunk load balancing for multicast is enabled on the VSI, this function takes effect on all BDs. To separately enable or disable trunk load balancing for multicast in a BD, ensure that trunk load balancing for multicast is disabled in the VSI view.If multicast trunk load balancing is enabled, Y.1731 basic functions are unavailable.The user-vlan configuration for the VLAN/VSI/BD is mutually exclusive with the user-vlan configuration in the Layer 2 multicast instance view.Configure aggregate-vlan for the VLAN/VSI/BD."
}