{
    "PageTitle": "qos-local-id behavior",
    "FuncDef": "The qos-local-id behavior command binds a QoS local ID to a traffic behavior.\nThe undo qos-local-id command unbinds a QoS local ID from a traffic behavior.\nBy default, no QoS local ID is binded to a traffic behavior.",
    "CLIs": [
        "qos-local-id <qos-local-id> behavior <behavior-name>",
        "undo qos-local-id <qos-local-id>"
    ],
    "ParentView": [
        "QPPB local-policy view"
    ],
    "ParaDef": [
        {
            "Parameters": "qos-local-id qos-local-id",
            "Info": "Specifies the QoS local ID.\nThe value is an integer ranging from 1 to 255."
        },
        {
            "Parameters": "behavior behavior-name",
            "Info": "Specifies the name of a traffic behavior. The traffic behavior must have been defined. The value of this parameter can be defined by the system or users by using the traffic behavior command.\nThe value is a string of 1 to 127 case-sensitive characters with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic behavior destination",
            "[*HUAWEI-behavior-destination] quit",
            "[*HUAWEI] qppb local-policy 1",
            "[*HUAWEI-localpolicy-1] qos-local-id 1 behavior destination"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nYou can run this command to bind a QoS local ID to a specified traffic behavior. The traffic behavior is then applied to the traffic on the specified route.\nPrerequisites\nA QoS policy has defined a routing policy for routes requiring QoS guarantee.\nThe traffic behavior has been created in the system view.\nPrecautions\nWhen flow-queue is bound to user-queue in the QPPB traffic action, the applied share-shaping 1 instance profile does not take effect.\nA QoS local ID can be bound to only one traffic behavior.\nWhen the QoS policy ID, configured by apply qos-local-id, is applied to QPPB, the ID value can be configured within the range of the QoS policy ID value using qos-local-id behavior.\nThe template Be of the traffic behavior defined by the system has not been bound."
}