{
    "PageTitle": "qppb-policy ip-precedence",
    "FuncDef": "The qppb-policy ip-precedence command applies a QPPB local policy to an interface.\nThe undo qppb-policy ip-precedence command cancels the configuration.\nBy default, no QPPB local policy is applied to an interface.",
    "CLIs": [
        "qppb-policy ip-precedence destination",
        "qppb-policy ip-precedence source",
        "undo qppb-policy [ ip-precedence ]"
    ],
    "ParentView": [
        "100GE interface view",
        "10G LAN interface view",
        "10G WAN interface view",
        "40GE interface view",
        "Eth-Trunk interface view",
        "GE optical interface view",
        "GE electrical interface view",
        "IP-Trunk interface view",
        "POS interface view",
        "Serial interface view",
        "Port extension sub-interface view",
        "Port extension interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "source",
            "Info": "Indicates source-based QPPB.\n-"
        },
        {
            "Parameters": "destination",
            "Info": "Indicates destination-based QPPB.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 5/0/0",
            "[~HUAWEI-GigabitEthernet5/0/0] qppb-policy ip-precedence destination"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nYou can run this command to configure QPPB to be based on routing policies.\nOn a large and complex network, a large number of complex traffic classification operations are required, and routes cannot be classified based on the community attribute, ACL, IP prefix, or AS_Path. When a network topology keeps changing, configuring or changing routing policies is difficult or even impossible to implement.\nQPPB is introduced to reduce the configuration workload. In QPPB, the sender of the BGP routes can set attributes for the BGP route to pre-classify routes. This simplifies the policy modification on the route receiver. To meet the requirements, you only need to configure the BGP routing policy.\nQPPB is applicable to both IBGP and EBGP and can be configured in an AS or between different ASs.\nPrerequisites\nBasic BGP functions have been configured and BGP peers have been set up before QPPB is configured.\nConfiguration Impact\nQPPB configured on the inbound interface is valid for all the packets that meet the matching rules.\nPrecautions\nBGP routes in QPPB refer to only BGP routes on the public network.\nThis command applies to VLAN-type dot1q sub-interfaces, dot1q VLAN tag termination sub-interfaces, and QinQ VLAN tag termination sub-interfaces."
}