{
    "PageTitle": "qppb-policy outbound",
    "FuncDef": "The qppb-policy outbound command applies a QPPB local policy to an outbound interface.\nThe undo qppb-policy outbound command cancels the configuration.\nBy default, no QPPB local policy is applied to an outbound interface.",
    "CLIs": [
        "qppb-policy <policy-name> [ unshared ] outbound",
        "undo qppb-policy [ <policy-name> [ unshared ] ] outbound"
    ],
    "ParentView": [
        "100GE interface view",
        "10G LAN interface view",
        "10G WAN interface view",
        "40GE interface view",
        "Eth-Trunk sub-interface view",
        "Eth-Trunk interface view",
        "GE optical interface view",
        "GE sub-interface view",
        "GE electrical interface view",
        "IP-Trunk interface view",
        "POS interface view",
        "Serial interface view",
        "Port extension sub-interface view",
        "Port extension interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "policy-name",
            "Info": "Specifies the name of a QPPB local policy.\nThe value is a string of 1 to 31 case-sensitive characters with spaces not supported."
        },
        {
            "Parameters": "unshared",
            "Info": "Indicates unshared QPPB, which enables the same QPPB policy applied in different interfaces occupying QPPB resources respectively.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] qppb local-policy policy1",
            "[*HUAWEI-localpolicy-policy1] quit",
            "[*HUAWEI] interface GigabitEthernet1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] qppb-policy policy1 outbound"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nQPPB configuration on an outbound interface is determined by the QPPB configuration of the upstream traffic.\nIf a QPPB local policy is not required on the upstream traffic but is required on the outbound interface, run the qppb-policy qos-local-id { destination | source } inbound command for the upstream traffic and run the qppb-policy  outbound command on the outbound interface.If a QPPB local policy is required by both the upstream and downstream traffic, run the qppb-policy inbound command for the upstream traffic, and run the qppb-policy outbound command on the outbound interface.\n\nPrecautions\nThis command applies to VLAN-type dot1q sub-interfaces, dot1q VLAN tag termination sub-interfaces, and QinQ VLAN tag termination sub-interfaces.\nIf both a QPPB policy and a traffic policy are configured on an interface, the QPPB policy takes effect preferentially."
}