{
    "PageTitle": "dhcp-stb igmp-copy",
    "FuncDef": "The dhcp-stb igmp-copy command enables the master Router to replicate IGMP messages from DHCP STBs for the backup Router.\nThe undo dhcp-stb igmp-copy command disables the IGMP message replication function.\nBy default, the IGMP message replication function is enabled.",
    "CLIs": [
        "dhcp-stb igmp-copy",
        "undo dhcp-stb igmp-copy"
    ],
    "ParentView": [
        "Remote backup profile view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] remote-backup-profile rpf",
            "[*HUAWEI-rm-backup-prf-rpf] service-type multicast",
            "[*HUAWEI-rm-backup-prf-rpf] undo dhcp-stb igmp-copy"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn a multicast hot backup scenario, if a DHCP STB connects to the master and backup Routers over links in a smart link group or an E-Trunk or over VLL PWs, the access-side link status does not change with the network-side link status. Therefore, if the network-side primary link fails and the secondary link becomes active, the access network cannot detect the network-side link status change. It continues to send IGMP messages to the master Router, causing packet loss. To resolve this issue, run the dhcp-stb igmp-copy command to enable IGMP message replication. This allows the master Router to replicate IGMP messages for the backup Router. The backup Router can then create forwarding entries based on IGMP messages received and rapidly implement on-demand data forwarding if the master Router or primary link fails.\nIf a DHCP STB is dual-homed to the master and backup Routers, both of them can receive IGMP messages. In this case, IGMP message replication is not needed and can be disabled using the undo dhcp-stb igmp-copy command to reduce system resource consumption.\nPrerequisites\nA multicast RBS has been enabled using the service-type multicast command.\nPrecautions\nThis command does not apply to PPPoE STBs, because PPPoE always allows both the master and backup Routers to replicate IGMP messages received, irrespective of whether the dhcp-stb igmp-copy command or its undo form is run."
}