{
    "PageTitle": "display igmp interface (All views)",
    "FuncDef": "The display igmp interface command displays IGMP configurations and state information on interfaces.",
    "CLIs": [
        "display igmp interface { up | down } [ verbose ]",
        "display igmp { vpn-instance <vpn-instance-name> | all-instance } interface { up | down } [ verbose ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "up",
            "Info": "Displays IGMP configurations and state information on interfaces with the IP protocol status being Up and the IGMP protocol status being active.\n-"
        },
        {
            "Parameters": "down",
            "Info": "Displays IGMP configurations and state information on interfaces with the IP protocol status being Down and the IGMP protocol status being inactive.\n-"
        },
        {
            "Parameters": "verbose",
            "Info": "Displays detailed IGMP configurations and state information.\n-"
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Displays IGMP configurations and state information in a specified VPN instance.\nvpn-instance-name specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "all-instance",
            "Info": "Displays IGMP configurations and state information in all instances.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display igmp interface verbose",
            "Interface information of VPN-Instance: public net",
            " Gigabitethernet3/0/1(192.168.101.1):",
            "   IGMP is enabled",
            "   Current IGMP version is 2",
            "   IGMP state: up",
            "   IGMP group policy: none",
            "   IGMP limit: -",
            "   IGMP access-limit: 5  except: 2002",
            "   Value of query interval for IGMP (negotiated): -",
            "   Value of query interval for IGMP (configured): 60 s",
            "   Value of other querier timeout for IGMP: 0 s",
            "   Value of maximum query response time for IGMP: 10 s",
            "   Value of last member query time: 2 s",
            "   General query timer expiry (hours:minutes:seconds): 00:00:44",
            "   Querier for IGMP: 192.168.101.1 (this router)",
            "   IGMP activity: 4 joins, 0 leaves",
            "   Robustness (negotiated): -",
            "   Robustness (configured): 2",
            "   Require-router-alert: disabled",
            "   Send-router-alert: enabled",
            "   Ip-source-policy: ab",
            "   Query ip-source-policy: 2000",
            "   Prompt-leave: disabled",
            "   SSM-Mapping: enabled",
            "   Startup-query-timer-expiry: off",
            "   Other-querier-present-timer-expiry: off",
            "   IGMP ipsec: disable",
            "  Total 2 IGMP Groups reported"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo check IGMP interface's status or locate faults in IGMP interfaces, run the display igmp interface command to view IGMP configurations and state information on interfaces.\nPrecautions\nBefore using the display igmp interface command, note the following:\nIf neither vpn-instance nor all-instance is specified, the command displays IGMP configurations and state information in the public network instance.\nIf up is specified, the command displays IGMP configurations and state information on all interfaces on which the IGMP protocol status is active.\nIf down is specified, the command displays IGMP configurations and state information on all interfaces on which the IGMP protocol status is inactive.\nIf verbose is specified, the command displays detailed IGMP configurations and state information."
}