{
    "PageTitle": "display igmp group static",
    "FuncDef": "The display igmp group static command displays information about IGMP groups, including multicast groups that hosts dynamically join by sending Report messages and multicast groups to which hosts are statically added by using commands.",
    "CLIs": [
        "display igmp group [ <group-address> | interface { <interface-type> <interface-number> | <interface-type> } ] * static [ verbose ]",
        "display igmp { vpn-instance <vpn-instance-name> | all-instance } group [ <group-address> | interface { <interface-type> <interface-number> | <interface-type> } ] * static [ verbose ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "group-address",
            "Info": "Displays configurations and running information about IGMP groups that have the specified group address.\ngroup-address specifies a multicast group address.\nThe value ranges from 224.0.0.0 to 239.255.255.255, in dotted decimal notation."
        },
        {
            "Parameters": "interface interface-type interface-number",
            "Info": "Displays configurations and running information about IGMP groups that a specified interface joins.\ninterface-type interface-number specifies the type and number of an interface.\n-"
        },
        {
            "Parameters": "interface-type",
            "Info": "Specifies the name of an interface.\n-"
        },
        {
            "Parameters": "verbose",
            "Info": "Displays detailed configurations and running information about IGMP groups that hosts dynamically join or the IGMP groups to which hosts are statically added.\n-"
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Displays configurations and running information about IGMP groups in a specified VPN instance.\nvpn-instance-name specifies a VPN instance name.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "all-instance",
            "Info": "Displays configurations and running information about IGMP groups in all instances.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display igmp group interface gigabitethernet 1/0/1 static",
            "Static join group information of VPN-Instance: public net",
            " GigabitEthernet1/0/1:",
            "  Total 2 entries",
            "   Group Address   Source Address  Expires",
            "   226.0.0.1       10.1.6.4      never",
            "   226.0.0.2       0.0.0.0         never"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a host wants to receive multicast data for a multicast group, the host must join the multicast group. Either of the following modes can be used to enable a host to join a multicast group:\nDynamic mode: Run the igmp enable command to enable IGMP on the interface connected to the network segment on which the host resides. Then, the network sends data to the host after the host joins the group and stops sending data after the host leaves the group.Static mode: Run the igmp static-group command to enable IGMP on the interface connected to the network segment on which the host resides. Then, the host becomes a static data receiver of this group, and the network keeps sending data to the host.\nTo learn the status of or locate a fault in a dynamically joined multicast group, run the display igmp group command to view information about the multicast group. The information helps you analyze and locate the fault."
}