{
    "PageTitle": "display igmp ssm-mapping interface",
    "FuncDef": "The display igmp ssm-mapping interface command displays configured source-specific multicast (SSM) mappings and whether SSM mapping is enabled on an interface.",
    "CLIs": [
        "display igmp ssm-mapping interface [ <interface-type> <interface-number> | <interface-name> ]",
        "display igmp { vpn-instance <vpn-instance-name> | all-instance } ssm-mapping interface [ <interface-type> <interface-number> | <interface-name> ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "interface-name",
            "Info": "Specifies the name of an interface.\n-"
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Displays SSM mappings in a specified VPN instance.\nvpn-instance-name specifies the name of a VPN instance.\nThe value is a string of case-sensitive characters."
        },
        {
            "Parameters": "all-instance",
            "Info": "Displays SSM mappings in all instances.\n-"
        },
        {
            "Parameters": "interface interface-type interface-number",
            "Info": "Displays whether SSM mapping is enabled on an interface.\ninterface-type interface-number specifies the type and number of an interface.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display igmp ssm-mapping interface gigabitethernet 1/0/1",
            " IGMP SSM-Mapping is enabled"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, SSM group addresses range from 232.0.0.0 to 232.255.255.255. If SSM group addresses beyond this range are configured using the ssm-policy command and static SSM mapping rules are configured using the ssm-mapping command.\nBefore using the display igmp ssm-mapping command, note the following:\nIf neither vpn-instance nor all-instance is specified, the command displays SSM mappings in the public network instance.If group-address is specified, the command displays SSM mappings of the specified group.If interface is specified, the command displays whether SSM mapping is enabled on the specified interface."
}