{
    "PageTitle": "display igmp invalid-packet",
    "FuncDef": "The display igmp invalid-packet command displays statistics about received invalid IGMP messages and details about these messages.",
    "CLIs": [
        "display igmp { vpn-instance <vpn-instance-name> | all-instance } invalid-packet [ interface { <interface-type> <interface-number> | <interface-name> } | message-type { query | report | leave } ] *",
        "display igmp invalid-packet [ interface { <interface-type> <interface-number> | <interface-name> } | message-type { query | report | leave } ] *"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Displays statistics about received invalid IGMP messages in a specified VPN instance.\nvpn-instance-name specifies the name of a VPN instance.\nThe value is a string of case-sensitive characters."
        },
        {
            "Parameters": "all-instance",
            "Info": "Displays statistics about received invalid IGMP messages in all instances.\n-"
        },
        {
            "Parameters": "interface interface-type",
            "Info": "Displays statistics about invalid IGMP messages received by a specified interface type.\n-"
        },
        {
            "Parameters": "interface-number",
            "Info": "Displays statistics about invalid IGMP messages received by a specified interface number.\n-"
        },
        {
            "Parameters": "interface-name",
            "Info": "Specifies the name of an interface.\n-"
        },
        {
            "Parameters": "message-type",
            "Info": "Displays statistics about received invalid IGMP messages of a specific message type.\n-"
        },
        {
            "Parameters": "query",
            "Info": "Displays statistics about received invalid Query messages.\n-"
        },
        {
            "Parameters": "report",
            "Info": "Displays statistics about received invalid Report messages.\n-"
        },
        {
            "Parameters": "leave",
            "Info": "Displays statistics about received invalid Leave messages.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display igmp invalid-packet",
            "",
            "           Statistics of invalid packets for public net:",
            "--------------------------------------------------------------------",
            "IGMP Query invalid packet:",
            "Unwanted Source List    : 1000        Zero Max Resp Code      : 0",
            "Fault Length            : 1000        Invalid Multicast Group : 0",
            "Bad Checksum            : 0",
            "",
            "IGMP Report invalid packet:",
            "Fault Length            : 0           Invalid Multicast Group : 0",
            "Invalid Multicast Source: 0           Bad Checksum            : 0",
            "Illegal Report Type     : 0",
            "",
            "IGMP Leave invalid packet:",
            "Invalid Multicast Group : 0           Bad Checksum            : 0",
            "--------------------------------------------------------------------"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo view statistics and details about received invalid IGMP messages, run the display igmp invalid-packet command. The command output helps you locate and rectify IGMP faults.\nIf IGMP entries fail to be generated on a multicast network, you can first run the display igmp invalid-packet command to check whether devices have received invalid IGMP messages. If the command output contains statistics about invalid IGMP messages, run the display igmp invalid-packet verbose command to view details about invalid IGMP messages to locate faults.\nBefore using the display igmp invalid-packet command, note the following:\nIf neither vpn-instance vpn-instance-name nor all-instance is specified, the command displays statistics about received invalid IGMP messages in the public network instance.If interface is specified, the command displays statistics about invalid IGMP messages received by the specified interface."
}