{
    "PageTitle": "igmp max-response-time",
    "FuncDef": "The igmp max-response-time command sets the maximum response time of IGMP Query messages on an interface.\nThe undo igmp max-response-time command restores the default setting.\nBy default, the maximum response time of IGMP Query messages on an interface is 10s.",
    "CLIs": [
        "igmp max-response-time <interval>",
        "undo igmp max-response-time"
    ],
    "ParentView": [
        "Virtual template view",
        "Tunnel interface view",
        "PW-VE sub-interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "GE electrical interface view",
        "Port extension interface view",
        "Loopback interface view",
        "Serial interface view",
        "Eth-Trunk sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "50GE sub-interface view",
        "MP-group interface view",
        "POS sub-interface view",
        "GE sub-interface view",
        "VBDIF interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "GE interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "25GE interface view",
        "100ge sub-interface view",
        "Eth-Trunk interface view",
        "40GE sub-interface view",
        "10GE sub-interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "interval",
            "Info": "Specifies the maximum response time of IGMP Query messages.\nThe value is an integer ranging from 1 to 125, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] igmp max-response-time 8"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe maximum response time is used to control the deadline for user hosts to send Report messages. In practice, the response time on a host is a random value from 0 to the maximum response time. The shorter the response time is, the more quickly the IGMP device obtains multicast member information and the more the bandwidth and Router resources are consumed. To set the maximum response time, run the igmp max-response-time command.\nAfter receiving an IGMP Query message, a user host starts a timer for each group that it joins. The value of the timer ranges from 0 to the maximum response time. When the timer expires, the host sends Report messages.\nThe maximum response time can be used to control the deadline for sending Report messages by the user host. If the maximum response time is properly set, user hosts can rapidly respond to Query messages, and traffic congestion caused by a large number of hosts simultaneously sending response packets is prevented.\nThe function of the igmp max-response-time command is the same as the function of the max-response-time command in the IGMP view. The configuration in the IGMP view is effective for all interfaces, whereas the configuration in the interface view is effective only for the specified interface. The configuration in the interface view takes precedence over the configuration in the IGMP view. The configuration in the IGMP view is used only when the configuration in the interface view is not available."
}