{
    "PageTitle": "igmp on-demand",
    "FuncDef": "The igmp on-demand command configures entries of dynamically joined IGMP groups not to age on a specified interface.\nThe undo igmp on-demand command restores the default configuration.\nBy default, entries of dynamically joined IGMP groups age periodically on a specified interface",
    "CLIs": [
        "igmp on-demand",
        "undo igmp on-demand"
    ],
    "ParentView": [
        "Tunnel interface view",
        "PW-VE sub-interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "GE electrical interface view",
        "Port extension interface view",
        "Loopback interface view",
        "Serial interface view",
        "Eth-Trunk sub-interface view",
        "50GE sub-interface view",
        "MP-group interface view",
        "400GE interface view",
        "10GE interface view",
        "POS sub-interface view",
        "GE sub-interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "GE interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "100ge sub-interface view",
        "25GE interface view",
        "Eth-Trunk interface view",
        "40GE sub-interface view",
        "10GE sub-interface view",
        "POS interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] igmp on-demand"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nigmp on-demand enables a host to become a static data receiver of a multicast group on a multicast device's interface connected to an access device, thus reducing packet exchanges and workloads of the multicast and access devices. To enable this function, run the igmp on-demand command, so that entries of dynamically joined IGMP groups will not age on a specified interface.\nThis command applies only to IGMPv2 and IGMPv3 interfaces connected to access devices, not to user hosts.\nConfiguration Impact\nThe igmp on-demand command configuration does not take effect for existing entries of dynamically joined IGMP groups.\nPrecautions\nAfter the igmp on-demand command is used on a multicast device directly connected to an IGMP proxy-capable access device, the following situations occur:\nThe multicast device interface connected to the access device sends only one IGMP general query message to the access device.The multicast device interface connected to the access device directly deletes the entry for a group after it receives an IGMP Leave message for the group."
}