{
    "PageTitle": "igmp timer query",
    "FuncDef": "The igmp timer query command sets the interval at which an interface sends IGMP general query messages.\nThe undo igmp timer query command restores the default setting.\nBy default, an interface sends IGMP general query messages at an interval of 60s.",
    "CLIs": [
        "igmp timer query <interval>",
        "undo igmp timer query"
    ],
    "ParentView": [
        "Virtual template view",
        "Tunnel interface view",
        "PW-VE sub-interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "Port extension interface view",
        "GE electrical interface view",
        "Loopback interface view",
        "Serial interface view",
        "Eth-Trunk sub-interface view",
        "MP-group interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "POS sub-interface view",
        "GE sub-interface view",
        "VBDIF interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "GE interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "100ge sub-interface view",
        "25GE interface view",
        "40GE sub-interface view",
        "Eth-Trunk interface view",
        "10GE sub-interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "interval",
            "Info": "Specifies the interval at which an interface sends IGMP general query messages.\nThe value is an integer ranging from 1 to 18000, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] igmp timer query 50"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf multiple multicast Routers are connected to a shared network segment where hosts reside, these multicast Routers automatically elect a unique querier that is responsible for maintaining IGMP group memberships. The timeout period of a group membership is calculated by using the formula: Timeout period of a group membership = Interval for sending general IGMP query messages x Robustness variable + Maximum response time. To set an interval at which an interface sends general IGMP query messages, run the igmp timer query command.\nWhen a querier starts, the querier sends general query messages for the number of \"robustness variable\" times to query the multicast groups that have members on the attached network segment. The sending interval is 1/4 of the interval for sending general query messages. The robustness variable can be set by using the igmp robust-count command or the robust-count command.The querier periodically sends general query messages to maintain memberships. The shorter the interval is, the more sensitive the querier is and the more bandwidth and Router resources are consumed.\n\nPrecautions\nThe function of the igmp timer query command is the same as the function of the timer query command in the IGMP view. The configuration in the IGMP view is effective for all interfaces, whereas the configuration in the interface view is effective only for the specified interface. The configuration in the interface view takes precedence over the configuration in the IGMP view. The configuration in the IGMP view is used only when the configuration in the interface view is not available.\nThe function of the igmp timer query command is the same as the function of the timer query command in the IGMP view. The configuration in the IGMP view is effective for all interfaces, whereas the configuration in the interface view is effective only for the specified interface. The configuration in the interface view takes precedence over the configuration in the IGMP view. The configuration in the IGMP view is used only when the configuration in the interface view is not available."
}