{
    "PageTitle": "igmp timer other-querier-present",
    "FuncDef": "The igmp timer other-querier-present command sets the keepalive period for other IGMP queriers on an interface.\nThe undo igmp timer other-querier-present command restores the default setting.\nBy default, if the default values of the robustness variable, the interval for sending IGMP general query messages, and the maximum response time of IGMP Query messages are used, the keepalive period of other IGMP queriers is 125s. The formula used to calculate the keepalive period of other IGMP queriers is: Keepalive period of other IGMP queriers = Robustness variable x Interval for sending IGMP general query messages + 1/2 x Maximum response time of IGMP Query messages.",
    "CLIs": [
        "igmp timer other-querier-present <interval>",
        "undo igmp timer other-querier-present"
    ],
    "ParentView": [
        "Virtual template view",
        "PW-VE sub-interface view",
        "Tunnel interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "GE electrical interface view",
        "Port extension interface view",
        "Loopback interface view",
        "Serial interface view",
        "Eth-Trunk sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "50GE sub-interface view",
        "MP-group interface view",
        "POS sub-interface view",
        "GE sub-interface view",
        "VBDIF interface view",
        "VE sub-interface view",
        "GE interface view",
        "25GE sub-interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "25GE interface view",
        "100ge sub-interface view",
        "40GE sub-interface view",
        "Eth-Trunk interface view",
        "10GE sub-interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "interval",
            "Info": "Specifies the keepalive period of other IGMP queriers.\nThe value is an integer ranging from 60 to 300, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] igmp timer other-querier-present 200"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen multiple multicast Routers are connected to a network segment where user hosts reside, one of these multicast Router is elected as the querier that is responsible for periodically sending Query messages to the network segment. If the non-queriers do not receive any Query message from the querier within the keepalive period of other IGMP queriers, they consider the querier invalid and automatically trigger a new round of querier election. To set the keepalive period of other IGMP queriers, run the igmp timer other-querier-present command.\nIn IGMPv1, the querier is determined by PIM; in IGMPv2, the Router that has the lowest IP address functions as the querier on a shared network segment.\nPrecautions\nThe igmp timer other-querier-present command applies only to IGMPv2 and IGMPv3.\nIf the keepalive period of other IGMP queriers is shorter than the interval for sending IGMP general query messages, the querier election is performed frequently.\nThe function of the igmp timer other-querier-present command is the same as the function of the timer other-querier-present command in the IGMP view. The configuration in the IGMP view is effective for all interfaces, whereas the configuration in the interface view is effective only for the specified interface. The configuration in the interface view takes precedence over the configuration in the IGMP view. The configuration in the IGMP view is used only when the configuration in the interface view is not available."
}