{
    "PageTitle": "igmp static-group source dns-ssm-map",
    "FuncDef": "The igmp static-group source dns-ssm-map command manually adds an interface to multicast groups to receive data from the multicast sources whose addresses are obtained through the DNS server.\nThe undo igmp static-group source dns-ssm-map command removes the configuration of manually adding an interface to multicast groups to receive data from the multicast sources whose addresses are obtained through the DNS server.\nBy default, an interface does not join any multicast group statically.",
    "CLIs": [
        "igmp static-group <group-address> source dns-ssm-map",
        "undo igmp static-group <group-address> [ source { <source-address> | dns-ssm-map } ]"
    ],
    "ParentView": [
        "PW-VE sub-interface view",
        "Tunnel interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "GE electrical interface view",
        "Port extension interface view",
        "Loopback interface view",
        "Serial interface view",
        "Eth-Trunk sub-interface view",
        "50GE sub-interface view",
        "MP-group interface view",
        "400GE interface view",
        "10GE interface view",
        "POS sub-interface view",
        "GE sub-interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "GE interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "100ge sub-interface view",
        "25GE interface view",
        "40GE sub-interface view",
        "Eth-Trunk interface view",
        "10GE sub-interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "group-address",
            "Info": "Specifies the IP address of the multicast group that an interface statically joins. In batch configuration mode, this parameter specifies the initial address of the multicast group range.\nThe value ranges from 224.0.1.0 to 239.255.255.255, in dotted decimal notation."
        },
        {
            "Parameters": "source source-address",
            "Info": "Specifies a multicast source address.\nThe address is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] igmp static-group 232.1.1.1 dns-ssm-map"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf users want to receive multicast data for a group for a long time, the igmp static-group command can be used to configure the interface connected to user hosts to statically join groups. This allows the interface to rapidly respond to users' requests, thus reducing the channel switching time.\nPrerequisites\nThe multicast routing function has been enabled using the multicast routing-enable command in the public network instance view or VPN instance view.\nFollow-up Procedure\nIf a user host no longer wants to receive multicast data for a group that the user host statically joins, delete the static group configuration.\nPrecautions\nIf an interface belongs to an NDR (Non-Designated Router) or Assert Loser device, the interface is not used as an outbound interface of PIM routing entries, so the multicast traffic cannot be statically directed to targets by running the igmp static-group command.\nYou are allowed to configure overlapped multicast group addresses in different batch configurations of multicast groups.\nAfter an interface is configured to statically join multicast groups in batches, do not delete any command related to static group configuration before the system completes the batch static group configuration."
}