{
    "PageTitle": "ipsec sa (IGMP view/VPN instance IGMP view)",
    "FuncDef": "The ipsec sa command globally specifies a security association (SA) using which interfaces authenticate sent and received IGMP messages, including IGMP Report, Leave, and Query messages, to implement IP Security (IPsec) authentication.\nThe undo ipsec sa command restores the default configuration.\nBy default, no SA is specified globally.",
    "CLIs": [
        "ipsec sa <sa-name>",
        "undo ipsec sa"
    ],
    "ParentView": [
        "IGMP view",
        "VPN instance IGMP view"
    ],
    "ParaDef": [
        {
            "Parameters": "sa-name",
            "Info": "Specifies the name of an SA.\nIt is a string of 1 to 15 case-sensitive characters, spaces not supported. The characters can be letters or numbers, hyphens (-) not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] ipsec sa sa1",
            "[*HUAWEI-ipsec-sa-sa1] quit",
            "[*HUAWEI] igmp",
            "[*HUAWEI-igmp] ipsec sa sa1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn a multicast network, forged IGMP messages may be used to attack devices, causing devices unable to forward multicast traffic. To protect a device against attacks launched using forged IGMP messages, run the ipsec sa command to configure the device to authenticate sent and received IGMP messages based on a specified SA.\nPrerequisites\nThe multicast routing function has been enabled using The multicast routing-enable command.Basic IPsec functions have been configured.\n\nPrecautions\nIf the ipsec sa command is run more than once, the latest configuration overrides the previous one. If the ipsec sa and query ipsec sa commands are both configured, the command configured later overrides the command configured earlier.\nThe function of this command is the same as the function of the igmp ipsec sa command in the interface view. The configuration in the interface view takes precedence over the configuration in the IGMP view. The configuration in the IGMP view is used only when the configuration in the interface view is not available."
}