{
    "PageTitle": "ssm-mapping domain",
    "FuncDef": "The ssm-mapping domain command sets the domain name suffix used for SSM source-group mappings.\nThe undo ssm-mapping domain command restores the default configuration.\nThe default domain name suffix used for SSM source-group mappings is in-addr.arpa.",
    "CLIs": [
        "ssm-mapping domain <domain-name>",
        "undo ssm-mapping domain",
        "undo ssm-mapping domain <domain-name>"
    ],
    "ParentView": [
        "IGMP view",
        "VPN instance IGMP view"
    ],
    "ParaDef": [
        {
            "Parameters": "domain-name",
            "Info": "Specifies a domain name suffix.\nThe value is a string of 1 to 63 characters, spaces not supported. The value can be any combination of digits, letters, underscores (_), and dots (.)."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] igmp",
            "[*HUAWEI-igmp] ssm-mapping query dns",
            "[*HUAWEI-igmp] ssm-mapping domain huawei.com"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen the DNS-based SSM mapping function is enabled, you can run the ssm-mapping domain command to set the domain name suffix of multicast group addresses in SSM mapping. A multicast group address and a domain name suffix constitute a domain name for DNS query. The format is group-address.domain-name. As a domain name is matched from backward to forward, group-address in the domain name is the multicast group address in reverse order. For example, when the default domain name suffix is used, the multicast device queries the DNS server for the IP address (that is, the multicast source address) corresponding to the domain name 5.1.1.232.in-addr.arpa after receiving the (*, 232.1.1.5) Join message. After the DNS server returns the corresponding IP address, the multicast device generates the corresponding (S, G) Join message.\nPrerequisites\nThe ssm-mapping query dns command has been used to enable DNS-based SSM mapping."
}