{
    "PageTitle": "reset igmp group",
    "FuncDef": "The reset igmp group command deletes records about IGMP groups that interfaces dynamically join or information about multicast groups that are configured with source-specific multicast (SSM) mapping.",
    "CLIs": [
        "reset igmp group { all | interface { <port-type> <port-num> | <port-name> } { all | <GrpAddr4> [ mask { <GrpMask> | <GrpMaskLen> } ] [ <SrcAddr4> [ mask { <SrcMask> | <SrcMaskLen> } ] ] } }",
        "reset igmp { vpn-instance <vpn-instance-name> | all-instance } group { all | interface { <port-type> <port-num> | <port-name> } { all | <GrpAddr4> [ mask { <GrpMask> | <GrpMaskLen> } ] [ <SrcAddr4> [ mask { <SrcMask> | <SrcMaskLen> } ] ] } }",
        "reset igmp group ssm-mapping { all | interface { <port-type> <port-num> | <port-name> } { all | <GrpAddr4> [ mask { <GrpMask> | <GrpMaskLen> } ] } }",
        "reset igmp { vpn-instance <vpn-instance-name> | all-instance } group ssm-mapping { all | interface { <port-type> <port-num> | <port-name> } { all | <GrpAddr4> [ mask { <GrpMask> | <GrpMaskLen> } ] } }"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "all",
            "Info": "Indicates all IGMP groups.\n-"
        },
        {
            "Parameters": "interface port-type port-num",
            "Info": "Specifies the type and number of an interface.\n-"
        },
        {
            "Parameters": "port-name",
            "Info": "Specifies the name of an interface.\n-"
        },
        {
            "Parameters": "GrpAddr4",
            "Info": "Specifies the address of a multicast group.\nThe address is in dotted decimal notation and ranges from 224.0.0.0 to 239.255.255.255."
        },
        {
            "Parameters": "mask",
            "Info": "Indicates the mask of a multicast source address or group address.\n-"
        },
        {
            "Parameters": "GrpMask",
            "Info": "Specifies the mask of a multicast group address.\nThe address is in dotted decimal notation and ranges from 240.0.0.0 to 255.255.255.255."
        },
        {
            "Parameters": "GrpMaskLen",
            "Info": "Specifies the mask length of a multicast group address.\nThe value is an integer ranging from 4 to 32."
        },
        {
            "Parameters": "SrcAddr4",
            "Info": "Specifies a multicast source address.\nThe address is in dotted decimal notation."
        },
        {
            "Parameters": "SrcMask",
            "Info": "Specifies the mask of a multicast source address.\nThe address is in dotted decimal notation and ranges from 240.0.0.0 to 255.255.255.255."
        },
        {
            "Parameters": "SrcMaskLen",
            "Info": "Specifies the mask length of a multicast source address.\nThe value is an integer ranging from 0 to 32."
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of case-sensitive characters."
        },
        {
            "Parameters": "all-instance",
            "Info": "Indicates all instances.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset igmp group ssm-mapping all"
        ],
        [
            "<HUAWEI> reset igmp group all"
        ],
        [
            "<HUAWEI> reset igmp group interface GigabitEthernet1/0/0 all"
        ],
        [
            "<HUAWEI> reset igmp group interface GigabitEthernet1/0/0 225.0.0.1"
        ],
        [
            "<HUAWEI> reset igmp group interface GigabitEthernet1/0/0 225.1.1.0 mask 255.255.255.0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThis command is valid only for IGMP groups that interfaces dynamically join.\nBefore using the reset igmp group command without ssm-mapping, note the following:\nIf neither vpn-instance nor all-instance is specified, the command deletes records about IGMP groups that interfaces in the public network instance dynamically join.If the reset igmp group all command is used, the command deletes records about all IGMP groups that all interfaces of the router dynamically join.If interface interface-type interface-number all is specified, the command deletes records about all IGMP groups that a specified interface dynamically joins.If GrpAddr4 is specified, the command deletes records about a specified IGMP group.If SrcAddr4 is specified, the command deletes records about the IGMP groups of a specified source address.An interface can rejoin the IGMP group after records about this group are deleted.\nBefore using the reset igmp group ssm-mapping command, note the following:\nIf neither vpn-instance nor all-instance is specified, the command deletes information about multicast groups that are configured with SSM mapping in the public network instance.If all is specified, the command deletes information about all multicast groups that are configured with SSM mapping.If interface port-type port-number is specified, the command deletes information about multicast groups configured with SSM mapping on a specified interface.If both interface and GrpAddr4 are specified, the command deletes information about the specified multicast group configured with SSM mapping on a specified interface."
}