{
    "PageTitle": "arp generate-rd-table enable",
    "FuncDef": "The arp generate-rd-table enable command enables a device to generate ARP entries based on host information synchronized from EVPN routes.\nThe undo arp generate-rd-table enable command restores the default configuration and deletes ARP entries generated based on host information synchronized from EVPN routes.\nBy default, a device is disabled from generating ARP entries based on host information synchronized from EVPN routes.",
    "CLIs": [
        "arp generate-rd-table enable",
        "undo arp generate-rd-table enable"
    ],
    "ParentView": [
        "VBDIF interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bridge-domain 10",
            "[*HUAWEI-bd10] commit",
            "[~HUAWEI-bd10] quit",
            "[~HUAWEI] interface vbdif 10",
            "[*HUAWEI-Vbdif10] arp generate-rd-table enable",
            "[*HUAWEI-Vbdif10] arp broadcast-detect enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn the NFVI distributed gateway scenario where BGP EVPN peer relationships are established between L2GWs/L3GWs and DC-GWs, L2GWs or L3GWs learn MAC address and ARP information of interface processing units (main control boards) through the data plane and advertise the information to DC-GWs through EVPN routes. This allows ARP entries to be generated for Layer 2 forwarding and ensures that user services run properly. To enable a device to generate ARP entries based on host information synchronized from EVPN routes, run the arp generate-rd-table enable command.\nConfiguration Impact\nAfter the undo arp generate-rd-table enable command is run, the device deletes ARP entries generated based on host information synchronized from EVPN routes and will not generate ARP entries upon receipt of host information synchronized from EVPN routes advertised by the peer.\nFollow-up Procedure\nRun the arp broadcast-detect enable command in the VBDIF interface view to enable ARP broadcast probe implemented when a VXLAN tunnel or Layer 2 sub-interface goes Down."
}