{
    "PageTitle": "arp expire-time",
    "FuncDef": "The arp expire-time command sets the aging time of dynamic Address Resolution Protocol (ARP) entries.\nThe undo arp expire-time command restores the default setting.\nBy default, the aging time of dynamic ARP entries is 1200 seconds, namely, 20 minutes.",
    "CLIs": [
        "arp expire-time <expire-time>",
        "undo arp expire-time"
    ],
    "ParentView": [
        "Layer 2 40GE interface view",
        "Port extension interface view",
        "Port extension Layer 2 interface view",
        "Remote-AP interface view",
        "Layer 2 10GE interface view",
        "GMPLS-UNI interface view",
        "400GE interface view",
        "VE interface view",
        "Layer 2 100GE interface view",
        "GE sub-interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "Vbridge interface view",
        "Global VE sub-interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "25GE interface view",
        "PW-VE interface view",
        "PW-VE sub-interface view",
        "40GE interface view",
        "GE electrical interface view",
        "Layer 2 GE interface view",
        "Eth-Trunk sub-interface view",
        "50GE sub-interface view",
        "10GE interface view",
        "Layer 2 50|100GE interface view",
        "Global VE interface view",
        "25GE-L2 view",
        "400GE-L2 view",
        "VBDIF interface view",
        "GE interface view",
        "Layer 2 50GE interface view",
        "100GE interface view",
        "VLANIF interface view",
        "50GE interface view",
        "100ge sub-interface view",
        "40GE sub-interface view",
        "Eth-Trunk interface view",
        "10GE sub-interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "expire-time",
            "Info": "Specifies the aging time of dynamic ARP entries.\nThe value is an integer ranging from 60~86400, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] arp expire-time 600"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo ensure communication reliability, you need to update ARP entries when they are invalid. A dynamic ARP entry has a life cycle. If a dynamic ARP entry is not updated before its life cycle ends, this dynamic ARP entry will be deleted from the ARP table. The life cycle is called aging time. If the entry is updated before its life cycle expires, the aging time of the entry is recalculated. You can run the arp expire-time command to adjust aging time for ARP entries to ensure their updating. An aging time configured using the arp expire-time command takes effect from the next lifetime after the current lifetime expires.\nConfiguration Impact\nIf the aging time set for a dynamic ARP entry is short, the refreshment for the ARP entry will consume huge number of system resources, causing adverse impacts on other services, a network flapping and even traffic forwarding.If the aging time set for a dynamic ARP entry is long, the ARP entry will not be promptly updated when it is invalid. For example, if a device fails to work or a network card is changed but the invalid ARP entry has not updated yet, the device sends packets to the peer device based on the existing ARP entry. As a result, the service will be interrupted.\n\nPrecautions\nAfter this command is run, the aging time of dynamic ARP entries is changed on an interface."
}