{
    "PageTitle": "arp learning passive enable",
    "FuncDef": "The arp learning passive enable command enables passive ARP that allows a backup device in a VRRP backup group to learn ARP entries after receiving an ARP request message sent to a virtual IP address.\nThe undo arp learning passive enable command disables passive ARP.\nBy default, passive ARP is disabled so that a backup device in a VRRP backup group does not learn ARP entries after receiving an ARP request message sent to a virtual IP address.",
    "CLIs": [
        "arp learning passive enable",
        "undo arp learning passive enable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] arp learning passive enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter the master and backup devices in a VRRP backup group receive an ARP request message sent to a virtual IP address, only the master device learns ARP entries and responds to the sender with the virtual MAC address. If a link or device fault causes the VRRP backup group to perform a master/backup switchover, a backup device must learn ARP entries on the user side before taking over traffic. As a result, service traffic is interrupted for a short time.\nAfter you run the arp learning passive enable command to enable passive ARP, a backup device in a VRRP backup group learns ARP entries after receiving an ARP request message sent to a virtual IP address. If a VRRP backup group performs a master/backup switchover, the new master device can take over traffic without needing to relearn ARP entries, ensuring service continuity.\nPrecautions\nWhen both passive ARP and strict ARP learning are enabled, strict ARP learning takes effect in priority.When both passive ARP and ARP dual-device hot backup are enabled, ARP dual-device hot backup takes effect in priority. Specifically, the interface enabled with dual-device hot backup on the VRRP backup device does not learn ARP entries with the destination IP address as a virtual IP address. Instead, ARP learning relies on backup of the VRRP master device."
}