{
    "PageTitle": "arp l2-proxy timeout (Bridge domain view)",
    "FuncDef": "The arp l2-proxy timeout command sets the aging time of Address Resolution Protocol (ARP) snooping entries.\nThe undo arp l2-proxy timeout command restores the default aging time of ARP snooping binding entries.\nBy default, the aging time of ARP snooping binding entries is 900s.",
    "CLIs": [
        "arp l2-proxy timeout <expire-time>",
        "undo arp l2-proxy timeout [ <expire-time> ]"
    ],
    "ParentView": [
        "Bridge domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "expire-time",
            "Info": "Specifies the aging time of ARP snooping binding entries.\nThe value is an integer ranging from 1 to 62640, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bridge-domain 10",
            "[*HUAWEI-bd10] arp l2-proxy enable",
            "[*HUAWEI-bd10] arp l2-proxy timeout 700"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nEach ARP snooping binding entry has a life cycle, called aging time. If an ARP snooping binding entry is not updated before its aging time expires, the entry will be deleted.\nIf the device stores a large number of ARP snooping binding entries, the CPU resources are wasted, and ARP snooping binding entries for new users cannot be generated. To resolve this problem, run the arp l2-proxy timeout command to set the aging time of ARP snooping binding entries.\nPrerequisites\nLayer 2 proxy ARP has been enabled using the arp l2-proxy enable command.\nPrecautions\nSet the aging time for ARP snooping binding entries based on the networking requirement.\nIf the aging time of ARP snooping binding entries is too short, the device refreshes ARP snooping binding entries frequently, wasting CPU resources and affecting other services.If the aging time of ARP snooping binding entries is too long, the device cannot refresh ARP snooping binding entries promptly and sends packets to the peer device based on the existing ARP snooping binding entries. As a result, services will be interrupted.\nUsing the default aging time of ARP snooping binding entries is recommended."
}