{
    "PageTitle": "arp collect host enable (Bridge domain view)",
    "FuncDef": "The arp collect host enable command enables BGP EVPN or EVPN MPLS to collect host information by BD.\nThe undo arp collect host enable command disables BGP EVPN or EVPN MPLS from collecting host information by BD.\nBy default, BGP EVPN or EVPN MPLS is disabled from collecting host information by BD.",
    "CLIs": [
        "arp collect host enable",
        "undo arp collect host enable"
    ],
    "ParentView": [
        "Bridge domain view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bridge-domain 10",
            "[*HUAWEI-bd10] arp l2-proxy enable",
            "[*HUAWEI-bd10] arp collect host enable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bridge-domain 10",
            "[*HUAWEI-bd10] arp l2-proxy enable",
            "[*HUAWEI-bd10] arp collect host enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn an EVPN, when a user terminal accesses a Layer 2 device through a BD, the terminal sends an ARP request packet to the device. The packet is broadcast in the BD. If the device receives a large number of ARP request packets within a period and broadcasts the packets, many network resources are consumed, causing network congestion. As a result, network performance deteriorates and user services are affected. To resolve this issue, run the arp collect host enable command on each Layer 2 device. After the command is run, the Layer 2 devices use EVPN routes (MAC/IP routes) to synchronize learned user ARP information from one another and add the information to their local ARP snooping binding entries. The information contains the source IP and source MAC addresses.\nWhen a Layer 2 gateway receives another ARP request packet, the gateway searches its local ARP snooping binding entries (including the locally listened entries and those synchronized from other gateways) for an entry that matches the packet's destination IP address.\nIf the matching entry exists, the gateway directly sends an ARP reply packet based on the entry.If no matching entry exits, the gateway broadcasts the ARP request packet.\n\nPrerequisites\nLayer 2 proxy ARP has been enabled by running the arp l2-proxy enable command."
}