{
    "PageTitle": "arp-ping ip",
    "FuncDef": "The arp-ping ip command configures a device on a LAN to send Address Resolution Protocol (ARP) messages to check whether an IP address is used by another device.",
    "CLIs": [
        "arp-ping ip <ip-host> [ interface { <interface-name> | <interface-type> <interface-number> } [ <vlan-id> <vlanId> ] ] [ timeout <timeout> ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-host",
            "Info": "Specifies a destination IP address or host name.\nIf the value is an IP address, it is in dotted decimal notation. If the value is a host name, it is a string of 1 to 255 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "interface interface-type interface-number",
            "Info": "Specifies the type and number of the interface that sends ARP messages.\n-"
        },
        {
            "Parameters": "vlan-id vlanId",
            "Info": "Specifies the VLAN to which the interface that sends ARP messages belongs.\nThe value is an integer ranging from 1 to 4094. If this parameter is not specified, the VLAN ID of 0 is used. When the specified outbound interface is a Layer 2 interface, you must configure vlan-id; when the specified outbound interface is a Layer 3 interface, you cannot configure vlan-id."
        },
        {
            "Parameters": "timeout timeout",
            "Info": "Specifies the timeout period of an ARP-ping test. This parameter is recommended when the local IP address is to be detected.\nThe value is an integer ranging from 1 to 10, in seconds. The default value is 3s."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> arp-ping ip 10.1.1.1",
            "ARP-Pinging 10.1.1.1:",
            "10.1.1.1 is used by 00e0-fc91-8d70"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo use ARP messages to check whether an IP address is used by another devices on a LAN, run this command.\nAlternatively, you can run the ping command to check whether an IP address is used by another device on the network. If the destination host and the Router that are enabled with the firewall function are configured not to respond to ping packets, after the ping command is run, the destination host and the Router do not respond to the ping packets. Therefore, the initiator mistakenly considers that the IP address is not in use. As ARP is a Layer 2 protocol, in most cases, ARP messages can pass through the firewall of the device that is configured not to respond to ping packets. In this manner, the preceding situation does not occur.\nIn addition, an ARP request message is smaller than an ICMP packet used in ping operations, and therefore running the arp-ping ip command consumes fewer network resources. This command is recommended for IP address detection.\nPrerequisites\nARP has been enabled, and ARP messages can be properly sent and received.\nConfiguration Impact\nIf you specify a local IP address or loopback address in the arp-ping ip command, the probe will fail.\nPrecautions\nThe arp-ping ip command cannot be used to detect a local IP address, whereas the ping command can."
}