{
    "PageTitle": "display arp statistics",
    "FuncDef": "The display arp statistics command displays Address Resolution Protocol (ARP) entry statistics.",
    "CLIs": [
        "display arp statistics { all | interface { <interface-name> | <interface-type> <interface-number> } }",
        "display arp statistics slot <slot-id> [ verbose ]",
        "display arp statistics static"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "all",
            "Info": "Displays statistics about all ARP entries on a device.\n-"
        },
        {
            "Parameters": "interface interface-type interface-number",
            "Info": "Displays statistics about ARP entries on a specifies the type and number of an interface.\n-"
        },
        {
            "Parameters": "interface interface-name",
            "Info": "Displays statistics about ARP entries on a specifies the name of an interface.\n-"
        },
        {
            "Parameters": "slot slot-id",
            "Info": "Displays ARP entries of the board in a specified slot.\n-"
        },
        {
            "Parameters": "verbose",
            "Info": "Displays detailed statistics about dynamic ARP entries learned by a specified interface board.\n-"
        },
        {
            "Parameters": "static",
            "Info": "Displays the maximum number of static ARP entries on a device and the current number of static ARP entries.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display arp statistics slot 1",
            "Dynamic:0       Static:0       Remote: 0",
            "Redirect:0"
        ],
        [
            "<HUAWEI> display arp statistics all",
            "Dynamic:106       Static:0       Remote: 0       Redirect:800"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo check ARP entry statistics or locate ARP faults, run the display arp statistics command.\nPrecautions\nFor centralized devices and the distributed devices that are not equipped with an interface boardARP statistics cannot be viewed based on the slot ID where the interface board resides. Instead, ARP statistics can be viewed by device or interface.\nTo view the number of ARP entries learned by various types of interfaces, and the number of remaining resources, run the display arp statistics slot slot-id verbose command. The AVAILABLE field in the command output indicates the number of dynamic ARP entries that can be learned by the interfaces of the same type on the current board. When the value of the AVAILABLE field is 0:\nIf fake ARP entries exist on the board, the board can learn extra dynamic ARP entries by replacing the fake ARP entries.If no fake ARP entries exist on the board, the board cannot learn extra dynamic ARP entries.The number of remaining resources is collected by board. Interface limitations are not taken into consideration.If the generated entries include fake entries, even when the number of entries has reached the threshold, new entries can be added by occupying the space of fake entries. This situation is not considered for the calculation of the number of remaining resources.Statistics collection for fake entries is supported in this command.\nIn VS mode, this command is supported only by the admin VS."
}