{
    "PageTitle": "mac-change notify-arp disable",
    "FuncDef": "The mac-change notify-arp disable command disables association between MAC and ARP.\nThe undo mac-change notify-arp disable command enables association between MAC and ARP.\nBy default, association between MAC and ARP is enabled.",
    "CLIs": [
        "mac-change notify-arp disable",
        "undo mac-change notify-arp disable"
    ],
    "ParentView": [
        "VLANIF interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] vlan 10",
            "[~HUAWEI-vlan10] quit",
            "[~HUAWEI] interface vlanif 10",
            "[~HUAWEI-Vlanif10] mac-change notify-arp disable",
            "Warning: This operation will reset the ARP configuration on the VLANIF interface, causing the traffic to be forwarded in an unexpected direction. Continue? [Y/N]y"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA device supports association between MAC and ARP by default. Association between MAC and ARP is generally deployed on the gateway and applies to networks where multiple links are available between the user and gateway or the interface through which users access the gateway can change. After association between MAC and ARP is configured, ARP entries can be rapidly updated to ensure stable traffic forwarding. However, the ARP entries learned by the VLANIF interface are synchronized globally, causing the number of ARP entries on all interface boards to increase. To resolve this problem in scenarios where ARP entries learned by the VLANIF interface do not need to be synchronized globally, run the mac-change notify-arp disable command to disable association between MAC and ARP.\nPrecautions\nRunning the mac-change notify-arp disable command causes ARP entries on the VLANIF interface to be reset, which may cause traffic forwarding failures. Therefore, exercise caution when running this command.\nChanging this configuration takes a period longer than 10 minutes."
}