{
    "PageTitle": "arp send-packet",
    "FuncDef": "The arp send-packet command configures an interface to send a unicast Address Resolution Protocol (ARP) request message that carries the specified destination IP and MAC addresses.",
    "CLIs": [
        "arp send-packet <ip-address> <mac-address> interface { <interface-name> | <interface-type> <interface-number> } [ vid <vid> [ cevid <cevid> ] ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address",
            "Info": "Specifies the destination IP address for a unicast ARP request message to be sent.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "mac-address",
            "Info": "Specifies the destination MAC address for a unicast ARP request message to be sent.\nThe value is a 12-digit hexadecimal number, in the format of H-H-H. Each H is 4 digits. If an H contains fewer than 4 digits, the left-most digits are padded with zeros. For example, e0 is displayed as 00e0."
        },
        {
            "Parameters": "interface interface-type interface-number",
            "Info": "Specifies the type and number of an interface for sending out a unicast ARP request message.\n-"
        },
        {
            "Parameters": "interface interface-name",
            "Info": "Specifies the name of an interface for sending out a unicast ARP request message.\n-"
        },
        {
            "Parameters": "vid vid",
            "Info": "Specifies the outer tag value for a unicast ARP request message to be sent.\nThe value is an integer ranging from 1 to 4094."
        },
        {
            "Parameters": "cevid cevid",
            "Info": "Specifies the inner tag value for a unicast ARP request message to be sent.\nThe value is an integer ranging from 1 to 4094."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> arp send-packet 10.1.1.1 3-3-3 interface GigabitEthernet1/0/0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo check whether a peer device is reachable, run the\narp send-packet command to configure a local interface to send a unicast ARP request message that carries the peer device's IP and MAC addresses as the destination addresses.\nIf the peer is reachable, the peer sends an ARP reply message to the local device. The local device then uses information carried in the ARP reply message to create or update an ARP entry for the peer.If the peer is unreachable, the peer device does not send an ARP reply message."
}