{
    "PageTitle": "binding tunnel gre",
    "FuncDef": "The binding tunnel gre command binds GRE to an interface.\nThe undo binding tunnel command restores the default configuration.\n\nBy default, GRE is not bound to an interface.",
    "CLIs": [
        "binding tunnel gre",
        "undo binding tunnel gre"
    ],
    "ParentView": [
        "100GE interface view",
        "10GE interface view",
        "25GE interface view",
        "400GE interface view",
        "40GE interface view",
        "50GE interface view",
        "50|100GE interface view",
        "Eth-Trunk interface view",
        "FlexE interface view",
        "GE optical interface view",
        "GE electrical interface view",
        "Global VE interface view",
        "Loopback interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface loopback 1",
            "[*HUAWEI-LoopBack1] binding tunnel gre"
        ]
    ],
    "ExtraInfo": "Usage Scenario\n\nTo configure a GRE tunnel interface, run the source command in the interface view to configure the source IP address or source interface for the tunnel interface and run the binding tunnel gre command to bind GRE to the source interface or the interface with the source IP address. GRE tunnels use only the interfaces to which GRE is bound to transmit GRE packets.\nA GRE-bound interface cannot be used as the following interfaces:\n\nData link (direct link) interface connecting LMP neighbors\nInterface to be bound to IPsec\nSource interface of an IPv4 over IPv6 tunnel\n\n\nPrecautions\n\nIf the tunnel interface is numbered in the format of slot ID/card ID/interface ID, after a source interface is configured using the source command in the tunnel interface view, you must run the target-board command on the source interface to map the interface to a GRE service board and run the binding tunnel gre command to bind GRE to the interface. After the configuration is complete, the tunnel sends the packets destined for the source tunnel interface to the corresponding GRE service board for processing.\nThe binding tunnel gre command is mutually exclusive with the data-link command."
}