{
    "PageTitle": "forward-mode (Slot view)",
    "FuncDef": "The forward-mode command sets the forwarding mode to high-performance forwarding or half-line-rate forwarding for interfaces except VE and global GRE interfaces.\nThe undo forward-mode command restores the default configuration.\nBy default, packets are forwarded in half-line-rate mode.",
    "CLIs": [
        "forward-mode through",
        "forward-mode loopback",
        "undo forward-mode [ through ]"
    ],
    "ParentView": [
        "Slot view"
    ],
    "ParaDef": [
        {
            "Parameters": "loopback",
            "Info": "Indicates half-line-rate forwarding mode, in which the interface bandwidth is set to half of the bandwidth of an interface board.\n-"
        },
        {
            "Parameters": "through",
            "Info": "Indicates high-performance forwarding mode, in which the interface bandwidth is set to the bandwidth of an interface board.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] slot 1",
            "[~HUAWEI-slot-1] forward-mode through"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nFor interfaces (except VE and global GRE interfaces), packets are forwarded in high-performance mode enabled using the forward-mode through command. However, Downstream HQoS cannot be implemented on interfaces except VE interfaces and global GRE interfaces. To use the downstream HQoS function, you have to set the forwarding mode to half-line-rate using the forward-mode loopback command.\nConfiguration Impact\nIn half-line-rate forwarding mode, the bandwidth of an interface equals half of the maximum bandwidth supported on an interface board. After you run the forward-mode through command, an interface switches to the high-performance forwarding mode, and the interface bandwidth equals the maximum bandwidth supported on an interface board.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nCentralized GRE tunnels can work in either software loopback or hardware loopback mode. The loopback mode must be configured in the slot view. When working in software loopback mode, a GRE interface has a bandwidth equal to the maximum bandwidth supported by the interface board. When working in hardware loopback mode, a GRE interface has a bandwidth half of that supported by the interface board. If high forwarding performance is required, using the software loopback mode is recommended."
}