{
    "PageTitle": "global-gre forward-mode",
    "FuncDef": "The global-gre forward-mode command configures the forwarding mode for all distributed GRE tunnels.\nThe undo global-gre forward-mode command cancels the configuration.\nBy default, the forwarding mode of distributed GRE tunnels is through.",
    "CLIs": [
        "global-gre forward-mode { through | loopback }",
        "undo global-gre forward-mode"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "through",
            "Info": "Indicates that the forwarding mode of distributed GRE tunnels is software loopback, which is also called the high-performance forwarding mode.\n-"
        },
        {
            "Parameters": "loopback",
            "Info": "Indicates that the forwarding mode of distributed GRE tunnels is hardware loopback, which is also called the low-performance forwarding mode.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] global-gre forward-mode loopback"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nDistributed GRE tunnels on the\nRouter support two forwarding modes: through and loopback. By default, the forwarding mode of distributed GRE tunnels is through.\nIn through mode, the device boasts high forwarding performance but does not allow for downstream HQoS implementations.In loopback mode, the device provides lower forwarding performance but allows for downstream HQoS implementations.\nYou can configure a proper forwarding mode based on service requirements. If the traffic rate on the GRE tunnel interface is lower than half of the board bandwidth, configuring the forwarding mode as loopback is recommended.\n\nPrecautions\nThe global-gre forward-mode command takes effect for distributed GRE tunnels only.\nDistributed GRE tunnels can work in either software loopback or hardware loopback mode. When working in software loopback mode, a GRE interface has a bandwidth equal to the maximum bandwidth supported by the interface board. When working in hardware loopback mode, a GRE interface has a bandwidth half of that supported by the interface board. If high forwarding performance is required, using the software loopback mode is recommended.\nIn VPLS over distributed GRE tunnel scenarios, removing a board may cause packet loss or redundancy in the broadcast, multicast, or unknown unicast services of some VSIs.\nThis command applies only to the Admin-VS."
}