{
    "PageTitle": "gre key",
    "FuncDef": "The gre key command sets the key number of a GRE tunnel.\nThe undo gre key command deletes the key number of a GRE tunnel.\nBy default, the GRE key number is not configured.",
    "CLIs": [
        "gre key { simple <key-number-simple> | [ cipher ] <key-number-cipher> }",
        "undo gre key"
    ],
    "ParentView": [
        "Tunnel interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "simple key-number-simple",
            "Info": "Specifies the key number used for both ends of a tunnel. The key number is saved in plaintext in the configuration file.\nSince a simple key number is insecure, it is recommended that you configure the key number in ciphertext on both ends of the tunnel.\nThe value is an integer ranging from 0 to 4294967295."
        },
        {
            "Parameters": "cipher",
            "Info": "Indicates that a ciphertext key is displayed.\n-"
        },
        {
            "Parameters": "key-number-cipher",
            "Info": "Specifies a simple text key (integer) or a ciphertext key.\nYou can specify a simple text key (integer) ranging from 0 to 4294967295 or a 32 or 48 to 128 character ciphertext key."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface tunnel 100",
            "[*HUAWEI-Tunnel100] tunnel-protocol gre",
            "[*HUAWEI-Tunnel100] gre key cipher 1024256"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo enhance GRE tunnel security, run the gre key command to set the key number of a GRE tunnel. The key number of a GRE tunnel can be used to prevent one end from identifying or receiving packets from another end that has a different key number.\nPrerequisites\nThe encapsulation mode of a tunnel has been configured as GRE using the tunnel-protocol gre command.\nConfiguration Impact\nIf the gre key command is run more than once, the latest configuration overrides the previous one.\nFollow-up Procedure\nConfigure the same key number on the peer end of the GRE tunnel.Bind specific services to the GRE tunnel.\n\nPrecautions\nIf the gre key command is run, the transmit and receive ends will authenticate the key number of packets. Only the packets with the same key number on both ends of the tunnel can pass the authentication. Otherwise, the packets will be dropped. Therefore, if you specify the key number on both ends of a tunnel, set the same value for both ends. You can also specify no key number on both ends."
}