{
    "PageTitle": "source (IPv6)(Tunnel interface view)",
    "FuncDef": "The source command configures a source IPv6 address or a source interface for a tunnel.\nThe undo source command deletes the source IPv6 address or source interface of a tunnel.\nBy default, no source IPv6 address or source interface is configured for a tunnel.",
    "CLIs": [
        "source <ipv6-address>",
        "source { <ifName> | <ifType> <ifNum> }",
        "undo source [ <ipv6-address> | { <ifName> | <ifType> <ifNum> } ]"
    ],
    "ParentView": [
        "Tunnel interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv6-address",
            "Info": "Specifies the source IPv6 address of a tunnel.\nThe address is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "ifType",
            "Info": "Specifies the type of the source interface of a tunnel.\n-"
        },
        {
            "Parameters": "ifNum",
            "Info": "Specifies the number of the source interface of a tunnel.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface LoopBack 1",
            "[*HUAWEI-LoopBack1] quit",
            "[*HUAWEI] interface Tunnel 10",
            "[*HUAWEI-Tunnel10] tunnel-protocol gre ipv6",
            "[*HUAWEI-Tunnel10] source loopback 1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Tunnel 10",
            "[*HUAWEI-Tunnel10] tunnel-protocol gre ipv6",
            "[*HUAWEI-Tunnel10] source 2001:db8:1::1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen configuring a tunnel, you must create a tunnel interface and run the source command to configure the source address on the tunnel interface. The IPv6 address of the interface that sends packets should be specified as the source address on the tunnel interface.\nPrerequisites\nThe tunnel mode has been configured using the tunnel-protocol command.\nConfiguration Impact\nThe same source or destination IPv6 address cannot be configured for two or more tunnel interfaces that use the same encapsulation protocol.\nPrecautions\nA source tunnel interface can be a physical interface or a loopback interface. Similarly, a source IPv6 address for a tunnel interface can be the IPv6 address of a physical interface or a loopback interface."
}