{
    "PageTitle": "source (Tunnel interface view)",
    "FuncDef": "The source command configures a source IP address or a source interface for a tunnel.\nThe undo source command deletes the source IP address or source interface of a tunnel.\nBy default, no source IP address or source interface is configured for a tunnel.",
    "CLIs": [
        "source <ip-address>",
        "source { <ifName> | <ifType> <ifNum> }",
        "undo source [ <ip-address> | { <ifName> | <ifType> <ifNum> } ]"
    ],
    "ParentView": [
        "Tunnel interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address",
            "Info": "Specifies the source address of a tunnel.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "ifType",
            "Info": "Specifies the name of an GRE tunnel interface.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "ifNum",
            "Info": "Specifies the number of the source interface of a tunnel.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface LoopBack 1",
            "[*HUAWEI-LoopBack1] quit",
            "[*HUAWEI] interface Tunnel 10",
            "[*HUAWEI-Tunnel10] tunnel-protocol gre",
            "[*HUAWEI-Tunnel10] source loopback 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen configuring a tunnel, you must create a tunnel interface and run the source command to configure the source address on the tunnel interface. The IP address of the interface that sends packets should be specified as the source address on the tunnel interface.\nPrerequisites\nThe tunnel mode has been configured using the tunnel-protocol command.\nConfiguration Impact\nThe same source or destination IP address cannot be configured for two or more tunnel interfaces that use the same encapsulation protocol.\nPrecautions\nFor a tunnel, its source IP address is the same as the destination IP address specified on the remote tunnel interface. Ensure that there is a reachable route between the source and destination tunnel interfaces.\nA source tunnel interface can be a physical interface or a loopback interface. Similarly, a source IP address for a tunnel interface can be the IP address of a physical interface or a loopback interface.\nThe source command is mutually exclusive with the data-link command."
}