{
    "PageTitle": "tunnel pathmtu enable",
    "FuncDef": "The tunnel pathmtu enable command enables path MTU auto-discovery on a tunnel.\nThe undo tunnel pathmtu enable command disables path MTU auto-discovery on a tunnel.\nBy default, path MTU auto-discovery is disabled for a tunnel.",
    "CLIs": [
        "tunnel pathmtu enable",
        "undo tunnel pathmtu enable"
    ],
    "ParentView": [
        "Tunnel interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Tunnel 10",
            "[*HUAWEI-Tunnel10] tunnel-protocol gre",
            "[*HUAWEI-Tunnel10] tunnel pathmtu enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a GRE tunnel is set up between two BGP nodes on which the peer path-mtu auto-discovery command has been run, path MTU auto-discovery can be enabled on the tunnel interface. This prevents TCP packets that contain BGP data from being fragmented multiple times during transmission, improving efficiency of BGP data transmission.\nPrerequisites\nThe tunnel-protocol gre command has been configured in the tunnel interface view.\nPrecautions\nThe tunnel pathmtu enable and mtu commands cannot be run on the same tunnel interface. If the mtu command has been run on a tunnel interface, the tunnel pathmtu enable command cannot be executed on the interface.\nIn a scenario where path MTU (PMTU) learning is enabled for an IPv4 GRE tunnel and the smallest IPv4 MTU of the tunnel is less than 1312 bytes (1280+32), the IPv6 MTU learned by the IPv4 GRE interface is less than 1280 bytes. If the ingress sends an IPv6 packet longer than the learned IPv6 MTU, the IPv6 packet is dropped. To address this problem, perform either of the following operations:Disable PMTU learning for the IPv4 GRE tunnel.If the IPv4 GRE tunnel must have PMTU learning enabled and must carry IPv6 packets, ensure that the tunnel's transit nodes each have an IPv4 MTU no less than 1312 bytes.PTMU learning is always enabled for IPv6 GRE tunnels. In a scenario where the smallest IPv6 MTU of an IPv6 GRE tunnel is less than 1332 bytes (1280+52), the MTU learned by the IPv6 GRE interface is less than 1280 bytes. If the ingress sends an IPv6 packet longer than the learned IPv6 MTU, the IPv6 packet is dropped. To address this problem, ensure that the tunnel's transit nodes each have an IPv6 MTU no less than 1332 bytes."
}