{
    "PageTitle": "pads",
    "FuncDef": "The pads disable command disables the protocol auxiliary diagnosis system (PADS).\nThe undo pads disable command enables the PADS.\nThe pads switch command enables or disables a specific function in the protocol-aided diagnosis system.\nThe undo pads switch command enables or disables a specific function in the protocol-aided diagnosis system.\nBy default, The protocol-assisted diagnostic system is enable, the status of functions in the protocol-aided diagnosis system is determined by the pads disable command.",
    "CLIs": [
        "pads disable",
        "pads switch <appName> enable",
        "pads switch <appName> disable",
        "undo pads disable",
        "undo pads switch <appName> enable",
        "undo pads switch <appName> disable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "appName",
            "Info": "Modual name.\nThe value is an enumerated type. You can select a value according to the prompt information after entering a question mark (?)."
        },
        {
            "Parameters": "enable",
            "Info": "Enables protocol aided diagnosis system.\n-"
        },
        {
            "Parameters": "disable",
            "Info": "Disables protocol aided diagnosis system.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] pads switch memory-leak enable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] pads switch eum-health enable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] pads disable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] pads switch evpn-health enable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] pads switch arp-learning enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe protocol-aided diagnosis system helps diagnose protocol problems such as OSPF route flapping and IP address conflict.\nThe pads disable command controls the status of the entire protocol-aided diagnosis system, and the pads switch command controls a specific function's status in the protocol-aided diagnosis system.\nIf the pads switch command is not run, the status of functions in the protocol-aided diagnosis system is determined by the pads disable command. If the pads switch command is run, the status of a specific function in the protocol-aided diagnosis system is determined by the pads switch command no matter the status of the entire protocol-aided diagnosis system is enabled or disabled.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}