{
    "PageTitle": "ntp-service enable",
    "FuncDef": "The ntp-service enable command enables NTP in the port extension system.\nThe undo ntp-service enable command disables NTP in the port extension system.\nBy default, NTP is disabled in the port extension system.",
    "CLIs": [
        "ntp-service enable authentication-keyid <key-id> authentication-mode hmac-sha256 <password>",
        "undo ntp-service enable"
    ],
    "ParentView": [
        "Virtual access port-extension view"
    ],
    "ParaDef": [
        {
            "Parameters": "authentication-mode hmac-sha256",
            "Info": "Indicates HMAC-SHA256 authentication.\n-"
        },
        {
            "Parameters": "password",
            "Info": "Specifies an authentication password in simple text or ciphertext.\nThe new password is at least eight characters long and contains at least two of the following types: upper-case letters, lower-case letters, digits, and special characters.For security purposes, you are advised to configure a password in ciphertext mode. To further improve device security, periodically change the password.\nThe value is a string of case-sensitive characters, spaces supported.\nThe value is a string of 1 to 255 characters for a simple text password.\nThe value is a string of 20 to 432 characters for a ciphertext password."
        },
        {
            "Parameters": "authentication-keyid key-id",
            "Info": "Specifies a key ID for communicating with a peer end.\nThe value is an integer ranging from 1 to 4294967295."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] virtual-access port-extend",
            "[*HUAWEI-virtual-access-portextend] ntp-service enable authentication-keyid 10 authentication-mode hmac-sha256 xyz123456"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn the port extension system, each AP automatically synchronizes clock information with a master. If the primary master fails, an AP switches traffic to the secondary master.\nYou can run the ntp-service enable command to enable NTP for all APs and masters on an aggregation ring and configure NTP authentication for the APs and masters. You must enable NTP authentication and configure the same authentication password on all APs and masters.\nIn VS mode, this command is supported only by the admin VS."
}