{
    "PageTitle": "ntp-service authentication-keyid authentication-mode",
    "FuncDef": "The ntp-service authentication-keyid authentication-mode command sets an NTP authentication key.\nThe undo ntp-service authentication-keyid authentication-mode command deletes an NTP authentication key.\nBy default, no authentication key is set.",
    "CLIs": [
        "ntp-service authentication-keyid <keyId> authentication-mode { md5 | hmac-sha256 } { <password> | cipher <password> }",
        "undo ntp-service authentication-keyid <keyId>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "keyId",
            "Info": "Authentication key identifier value.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "md5",
            "Info": "Indicates MD5 authentication.\n-"
        },
        {
            "Parameters": "hmac-sha256",
            "Info": "Indicates hashed message authentication code-secure hash algorithm 256 (HMAC-SHA256) authentication mode.\nAs the HMAC-SHA256 algorithm is more secure than the MD5 algorithm, using the HMAC-SHA256 algorithm for NTP authentication is recommended.\n-"
        },
        {
            "Parameters": "cipher password",
            "Info": "Sets a ciphertext authentication password.\nThe new password is at least eight characters long and contains at least all of the following types: upper-case letters, lower-case letters, digits, and special characters.For security purposes, you are advised to configure a password in ciphertext mode. To further improve device security, periodically change the password.\nThe password is a string of case-sensitive characters, with spaces supported. By default, a simple text password is a string of 12 to 255 characters. A ciphertext password is a string of 20 to 432 characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ntp-service authentication-keyid 10 authentication-mode hmac-sha256 cipher Huawei_123456"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn a network that requires high security, NTP authentication must be enabled. You can configure password authentication between the client and server, which guarantees the client only to synchronize with the server successfully authenticated and improves network security.In VS mode, this command is supported only by the admin VS.\nFollow-up Procedure\nRun the ntp-service reliable authentication-keyid command to specify an authentication key to be reliable.\nPrecautions\nIf this command is the first NTP configuration command, the system automatically adds the ntp-service [ ipv6 ] server disable command in the configuration file to disable the NTP service. To enable the NTP service, run the undo ntp-service [ ipv6 ] server disable command. If this command is the last NTP configuration command to be deleted, the system automatically deletes the ntp-service [ ipv6 ] server disable command from the configuration file."
}