{
    "PageTitle": "ntp-service multicast-client ipv6",
    "FuncDef": "The ntp-service multicast-client ipv6 command configures a local device to work in NTP multicast client mode.\nThe undo ntp-service multicast-client ipv6 command removes a local device from the NTP multicast client mode.\nBy default, the multicast client service is disabled.",
    "CLIs": [
        "ntp-service multicast-client ipv6 [ <ipv6-address> ]",
        "undo ntp-service multicast-client ipv6 [ <ipv6-address> ]"
    ],
    "ParentView": [
        "100GE interface view",
        "10GE interface view",
        "400GE interface view",
        "40GE interface view",
        "Eth-Trunk interface view",
        "GE optical interface view",
        "GE electrical interface view",
        "IP-Trunk interface view",
        "Loopback interface view",
        "POS interface view",
        "Tunnel interface view",
        "VLANIF interface view",
        "Virtual template view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv6 ipv6-address",
            "Info": "Specifies a multicast IPv6 address.\nThe default IPv6 address is FF0E::0101."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 10GE 1/0/0",
            "[~HUAWEI-10GE1/0/0] ipv6 enable",
            "[~HUAWEI-10GE1/0/0] ntp-service multicast-client ipv6 FF0E::111"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a device is configured to receive NTP multicast packets on an interface, the local device is in multicast-client mode.\nIf the valid multicast server is configured, the local device gets synchronized with the multicast server. The local device time is updated with the time of the server.\nIn VS mode, this command is supported only by the admin VS.\nFollow-up Procedure\nRun the display ntp-service sessions commands to check the sessions formed between the multicast server and local device.You can configure more than one multicast client each with a specific multicast IP addresses on the same interface.\nPrecautions\nIf this command is the first NTP configuration command, the system automatically adds the ntp-service [ ipv6 ] server disable command in the configuration file to disable the NTP service. To enable the NTP service, run the undo ntp-service [ ipv6 ] server disable command. If this command is the last NTP configuration command to be deleted, the system automatically deletes the ntp-service [ ipv6 ] server disable command from the configuration file.\nRun the command ntp-service authentication-keyid authentication-mode sets an NTP authentication key."
}