{
    "PageTitle": "ntp-service manycast-server ipv6",
    "FuncDef": "The ntp-service manycast-server ipv6 command enables the manycast server mode configures on an interface of a local device to send NTP manycast packets.\nThe undo ntp-service manycast-server ipv6 command disables the NTP manycast server mode.\nBy default, the manycast service is not configured.",
    "CLIs": [
        "ntp-service manycast-server ipv6 [ <ipv6-address> ]",
        "undo ntp-service manycast-server ipv6 [ <ipv6-address> ]"
    ],
    "ParentView": [
        "100GE interface view",
        "10GE interface view",
        "400GE interface view",
        "40GE interface view",
        "Eth-Trunk interface view",
        "GE optical interface view",
        "GE electrical interface view",
        "IP-Trunk interface view",
        "Loopback interface view",
        "POS interface view",
        "Tunnel interface view",
        "VLANIF interface view",
        "Virtual template view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv6 ipv6-address",
            "Info": "Specifies a manycast IPv6 address.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 10GE 1/0/0[~HUAWEI-10GE1/0/0] ipv6 enable",
            "[~HUAWEI-10GE1/0/0] ntp-service manycast-server ipv6 FF0E::0101"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA manycast server responds to manycast client packets. Based on the responses, a manycast client creates an ephemeral association and works in client server mode.If you configure a manycast server on an interface, the interface can receive NTP manycast messages, and the local device runs in server mode.If you execute the undo ntp-service manycast-server ipv6 command and do not specify a multicast IP address, a local device searches for default IP addresses. The manycast server with default IP address is FF0E::101 on an IPv6 address. If the local device finds a default IP address, this command deletes the manycast server configuration, or it does not perform any action.In VS mode, this command is supported only by the admin VS.\nPrecautions\nIf this command is the first NTP configuration command, the system automatically adds the ntp-service [ ipv6 ] server disable command in the configuration file to disable the NTP service. To enable the NTP service, run the undo ntp-service [ ipv6 ] server disable command. If this command is the last NTP configuration command to be deleted, the system automatically deletes the ntp-service [ ipv6 ] server disable command from the configuration file.\nOn an IPv6 network, multiple primary IPv6 addresses can be configured on the source interface. The system by default uses the most recently updated IPv6 address as the source address of the NTP multicast server. To ensure that the server can properly receive and process packets from a client, set this address as the source address listened by the NTP server."
}