{
    "PageTitle": "ntp-service max-dynamic-sessions",
    "FuncDef": "The ntp-service max-dynamic-sessions command sets the maximum number of dynamic NTP sessions that a device can set up.\nThe undo ntp-service max-dynamic-sessions command restores the maximum dynamic NTP session to the default value.\nBy default, a maximum of 100 sessions are allowed to be set.",
    "CLIs": [
        "ntp-service max-dynamic-sessions <number>",
        "undo ntp-service max-dynamic-sessions"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "number",
            "Info": "Sets the maximum number of dynamic NTP sessions allowed to be set up.\nThe value is an integer ranging from 0 to 100. The default value is 100."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ntp-service max-dynamic-sessions 50"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThis command limits the number of dynamic sessions only.\nPrecautions\nNote the following when using the ntp-service max-dynamic-sessions command:\nThis command limits the number of dynamic sessions only.Unicast server/client mode symmetric active modes are configured using the command line. So, sessions between them are static. Sessions set up in the symmetric passive, broadcast, and multicast modes are dynamic.This command does not affect the existing NTP sessions. If the number of dynamic sessions exceeds the upper limit, dynamic sessions will not be created anymore.\nThe ntp-service max-dynamic-sessions command is only run on a client. The server does not record the number of NTP sessions.\nIf this command is the first NTP configuration command, the system automatically adds the ntp-service [ ipv6 ] server disable command in the configuration file to disable the NTP service. To enable the NTP service, run the undo ntp-service [ ipv6 ] server disable command. If this command is the last NTP configuration command to be deleted, the system automatically deletes the ntp-service [ ipv6 ] server disable command from the configuration file."
}