{
    "PageTitle": "ntp-service server disable",
    "FuncDef": "The ntp-service server disable command disables NTP server functionality.\nThe undo ntp-service server disable command enables NTP server functionality.\nThe ntp-service ipv6 server disable command disables NTP IPv6 server functionality.\nThe undo ntp-service ipv6 server disable command enables NTP IPv6 server functionality.\nBy default, the NTP server functionality is enabled. NTP server functionality will be disabled when the first configuration of the NTP function takes effect.",
    "CLIs": [
        "ntp-service [ ipv6 ] server disable",
        "undo ntp-service [ ipv6 ] server disable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv6",
            "Info": "Indicates NTP IPv6 services.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ntp-service server disable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ntp-service ipv6 server disable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, the NTP server functionality is enabled. For the security purpose, NTP server functionality will be disabled when the first configuration of the NTP function takes effect. User need to undo the command to enable server functionality.\nBy default, the NTP IPv6 server functionality is enabled. For the security purpose, NTP IPv6 server functionality will be disabled when the first configuration of the NTP function takes effect. User need to undo the command to enable IPv6 server functionality.\nIn VS mode, this command is supported only by the admin VS.\nConfiguration Impact\nRunning the ntp-service [ipv6] server disable command disables IPv4 or IPv6 NTP server functionality.\nPrecautions\nTo enhance system security, the NTP IPv4 server by default does not process the packets sent from interfaces or addresses. To ensure that the server can properly process the synchronization requests from a client, run the ntp-service server source-interface command to configure the server to listen to the source interface or the ntp-service server source-interface all enable command to configure the server to listen to all interfaces.\nTo enhance system security, the NTP IPv6 server by default does not process the packets sent from interfaces or addresses. To ensure that the server can properly process the synchronization requests from a client, run the ntp-service ipv6 server source-address command to configure the NTP server to listen to the source address or the ntp-service ipv6 server source-interface all enable command to configure the server to listen to all interfaces."
}