{
    "PageTitle": "ntp-service refclock-master",
    "FuncDef": "The ntp-service refclock-master command configures a local clock to be the NTP master clock that provides the synchronizing time for other devices.\nThe undo ntp-service refclock-master command deletes the configuration of the NTP master clock.\nBy default, no NTP master clock is specified.",
    "CLIs": [
        "ntp-service refclock-master [ <ip-address> ] [ <stratum> ]",
        "undo ntp-service refclock-master [ <ip-address> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address",
            "Info": "Specifies the IP address of the local clock 127.127.t.u.\nValue 't' is an integer ranging from 0 to 37. Here 't' indicates the local reference clock, and its value is 1. 'u' indicates number of NTP processes. Value 'u' is an integer ranging from 0 to 3. If no IP address is specified, by default, the local clock 127.127.1.0 is considered as the NTP master clock."
        },
        {
            "Parameters": "stratum",
            "Info": "Specifies the stratum of an NTP master clock.\nThe value is an integer that ranges from 1 to 15. The default value is 8. A smaller value indicates a higher stratum, which allows for more accurate time."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ntp-service refclock-master 3"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure the local clock as the NTP master clock to provide a clock source for other devices, run the ntp-service refclock-master command.\nIn VS mode, this command is supported only by the admin VS.\nPrecautions\nIf a clock server is configured for a local device, the following situations occur:\nIf the local clock stratum value is higher than that of the clock source provided by the clock server, the device takes the clock source provided by the clock server.If the local clock stratum value is lower than or the same as that of the clock source provided by the clock server, the device takes the value of the local clock.\nIf this command is the first NTP configuration command, the system automatically adds the ntp-service [ ipv6 ] server disable command in the configuration file to disable the NTP service. To enable the NTP service, run the undo ntp-service [ ipv6 ] server disable command. If this command is the last NTP configuration command to be deleted, the system automatically deletes the ntp-service [ ipv6 ] server disable command from the configuration file."
}