{
    "PageTitle": "ntp-service reliable authentication-keyid",
    "FuncDef": "The ntp-service reliable authentication-keyid command specifies a reliable authentication key.\nThe undo ntp-service reliable authentication-keyid command deletes the reliable authentication key.\nBy default, no authentication key is specified to be reliable.",
    "CLIs": [
        "ntp-service reliable authentication-keyid <key-id>",
        "undo ntp-service reliable authentication-keyid <key-id>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "key-id",
            "Info": "Specifies a key number.\nThe value is an integer ranging from 1 to 4294967295."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ntp-service authentication enable",
            "[*HUAWEI] ntp-service authentication-keyid 37 authentication-mode hmac-sha256 BetterKey",
            "[*HUAWEI] ntp-service reliable authentication-keyid 37"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf identity authentication is enabled, specify one or more reliable keys. A client can only be synchronized with the servers that provide reliable keys.\nThe device that wants to synchronize its clock must declare its key reliable.When the client synchronizes to authenticated server, the authentication key must be declared reliable only on the client side. The server does not need to declare the key reliable.\nIn VS mode, this command is supported only by the admin VS.\n\nPrerequisites\nThe NTP authentication key has been set using the ntp-service authentication-keyid command.\nPrecautions\nIf this command is the first NTP configuration command, the system automatically adds the ntp-service [ ipv6 ] server disable command in the configuration file to disable the NTP service. To enable the NTP service, run the undo ntp-service [ ipv6 ] server disable command. If this command is the last NTP configuration command to be deleted, the system automatically deletes the ntp-service [ ipv6 ] server disable command from the configuration file."
}