{
    "PageTitle": "port-allocation-weights",
    "FuncDef": "The port-allocation-weights command is used to define the weights used to divide the buffers managed by a port into three categories: default, XMA and MDA, and port. The default category is given to the default pools, the XMA or MDA category is given to the XMA or MDA named pools, and the port category is used by the local port named pools. When the IOM is placed in named-pool-mode, each port has an inherent set of weights that places all port-managed buffers into the default category (default = 100, XMA or MDA = 0, port = 0). The policy port-allocation-weights command is used to override this port inherent behavior. When the policy is applied to the XMA or MDA, the defined port-allocation-weights parameter values override the inherent values for all ports on the XMA or MDA. When the policy is applied to the port level, the defined port-allocation-weights override both the local ports inherent weights and the XMA- or MDA-level named pool policy\nweights (if existing).",
    "CLIs": [
        "port-allocation-weights default <weight> mda <weight> port <weight>",
        "no port-allocation-weights"
    ],
    "ParentView": [
        "config>qos>named-pool-policy"
    ],
    "ParaDef": [
        {
            "Parameters": "default weight",
            "Info": "The default keyword is used to identify the weight value for the port where the policy is applied, and is used in the calculation of the amount of buffer space given to the default pools by the port. The following weight parameter is required and must be specified as an integer between 0 and 100. The specified weight only has meaning when compared to the mda and port weights. The sum of all three weights is divided into each weight to determine the amount of buffering given to the pools of each type. Values-0 to 100. ParamDefault: Default- 50"
        },
        {
            "Parameters": "mda weight",
            "Info": "The mda keyword is used to identify the weight value for the port where the policy is applied, and is used in the calculation of the amount of buffer space given to the XMA- or MDA-level named pools by the port. The following weight parameter is required and must be specified as an integer between 0 and 100. The specified weight only has meaning when compared to the default and port weights. The sum of all three weights is divided into each weight to determine the amount of buffering given to the pools of each type. Values-0 to 100. ParamDefault: Default- 50"
        },
        {
            "Parameters": "port weight",
            "Info": "The port keyword is used to identify the weight value for the port where the policy is applied, and is used in the calculation of the amount of buffer space given to the local port named pools by the port. The following weight parameter is required and must be specified as an integer between 0 and 100. The specified weight only has meaning when compared to the mda and port weights. The sum of all three weights is divided into each weight to determine the amount of buffering given to the pools of each type. Values-0 to 100. ParamDefault: Default- 50"
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}