{
    "PageTitle": "resv-cbs",
    "FuncDef": "Theresv-cbscommand is used to override the default reserved CBS size of the pool. The reserved CBS size defines the amount of buffer space within the pool that is not considered shared. When queues request buffers from the pool, they will be either within-CBS or above-CBS. If the queue is within-CBS based on the current queue depth and the configured CBS value for the queue, the requested buffer is taken from the reserved portion of the buffer pool. After the queues depth is beyond its configured CBS, the buffer will be taken from the pools shared space. Shared space buffers are subject to the WRED slope function within the buffer pool. If the WRED slopes are enabled, the buffer request may be denied based on WRED drop probability.",
    "CLIs": [
        "resv-cbs <percentage-of-pool-size> [ amber-alarm-action step <percent> max <maximum> ]",
        "no resv-cbs"
    ],
    "ParentView": [
        "config>qos>named-pool-policy>q1-pools>pool"
    ],
    "ParaDef": [
        {
            "Parameters": "percentage-of-pool-size",
            "Info": "The percentage-of-pool-size parameter is required and is an integer specifying a percentage from 0 to 100 percent. Specifying a value of 30 (the default) is equivalent to specifying no resv-cbs. Values-0 to 100. ParamDefault: Default- 30"
        },
        {
            "Parameters": "amber-alarm-action step percent",
            "Info": "specifies the percentage step-size for the reserved CBS size of the pool. When using the default value, the adaptive CBS sizing is disabled. To enable adaptive CBS sizing, step percent must be set to a non-default value along with the max parameter. When reserved CBS is default, adaptive CBS sizing cannot be enabled. The reserved CBS (Committed Burst Size) defines the amount of buffer space within the pool that is not considered shared. Values-1 to 100. ParamDefault: Default- 0"
        },
        {
            "Parameters": "max maximum",
            "Info": "Specifies the maximum percentage for the reserved CBS size of the pool. When using the default value, the adaptive CBS sizing is disabled. To enable adaptive CBS sizing, max value must be set to a non-default value along with the step percent. When reserved CBS is default, adaptive CBS sizing cannot be enabled. The reserved CBS (Committed Burst Size) defines the amount of buffer space within the pool that is not considered shared. Max reserved CBS must not be more than the reserved CBS. Values-1 to 100. ParamDefault: Default- 0"
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: resv-cbs 30"
}