{
    "PageTitle": "display xpl ip-prefix-list",
    "FuncDef": "The display xpl ip-prefix-list command displays the configuration and reference information about XPL IPv4 prefix sets.",
    "CLIs": [
        "display xpl ip-prefix-list state [ attached | unattached ]",
        "display xpl ip-prefix-list [ name <xpl-name> attachpoints ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "attached",
            "Info": "Displays information about the IPv4 prefix sets that are referenced.\n-"
        },
        {
            "Parameters": "unattached",
            "Info": "Displays information about the IPv4 prefix sets that are not referenced.\n-"
        },
        {
            "Parameters": "name xpl-name",
            "Info": "Specifies the name of the IPv4 prefix sets.\nThe value is a string of 1 to 200 case-sensitive characters, spaces not supported. The string can contain letters, digits, underscores (_), hyphens (-), and dots (.). It must start with a letter or digit."
        },
        {
            "Parameters": "attachpoints",
            "Info": "Displays information about points of attachment.\n-"
        },
        {
            "Parameters": "state",
            "Info": "Displays information about IPv4 prefix set configurations and references.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display xpl ip-prefix-list state",
            "Attached :Applied by at least one attach point",
            "Unattached : Not applied by any attach point",
            "",
            "Attached",
            "---------------------------------------------------------------",
            "",
            "Unattached",
            "---------------------------------------------------------------",
            "aaa"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo view information about XPL route-filter and route attribute set configurations and references, run the display xpl command. If a large amount of information is output, you can specify attached or unattached to filter the information. Route attribute set reference indicates that a route attribute set is referenced by a route-filter, and route-filter reference indicates that a route-filter is referenced by a routing protocol. To check the configuration and reference information about XPL IPv4 prefix sets, run the display xpl ip-prefix-list command."
}