{
    "PageTitle": "edit xpl ip-prefix-list",
    "FuncDef": "The edit xpl ip-prefix-list command displays the IPv4 prefix set paragraph editing interface view.\nBy default, no IPv4 prefix sets are configured.",
    "CLIs": [
        "edit xpl ip-prefix-list <ip-prefix-list-name>"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-prefix-list-name",
            "Info": "Specifies the name of an IPv4 prefix set.\nThe value is a string of 1 to 200 case-sensitive characters, spaces not supported. The string can contain letters, digits, underscores (_), hyphens (-), and dots (.). It must start with a letter or digit."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> edit xpl ip-prefix-list aaa",
            "xpl ip-prefix-list aaa",
            "1.1.1.0 24,",
            "2.2.2.0 24,",
            "3.3.3.3 32",
            "end-list"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAn IPv4 prefix set is a group of IPv4 prefix data used by a route-filter to filter BGP routes based on route attributes, such as the source, destination, or next hop IP address. To enter the IPv4 prefix set paragraph editing interface view, run the edit xpl ip-prefix-list command.\nTo configure an IPv4 prefix set in the IPv4 prefix set paragraph editing interface view, perform the following steps:\n Configure a start clause (xpl ip-prefix-list ip-prefix-list-name) for an IPv4 prefix set. Configure elements (IPv4 addresses with masks, 1.1.1.0 24 for example) for the set and separate every two neighboring elements with a comma (,). You can use eq, ge, or le to specify the mask length. For example, 1.1.1.0 24 ge 26 le 30 matches the routes in network segment 1.1.1.0/24 with the mask length ranging from 26 to 30 bits. Configure an end clause (end-list) for the IPv4 prefix set.\n\nPrecautions\nAn IPv4 prefix set is only a group of data used as matching rules and does not have the permit or deny function. Therefore, an IPv4 prefix set can be used to filter routes only after it is referenced by a route-filter."
}