{
    "PageTitle": "edit xpl global-value",
    "FuncDef": "The edit xpl global-value command displays the global variable set paragraph editing interface view.\nBy default, no global variable sets are configured.",
    "CLIs": [
        "edit xpl global-value"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> edit xpl global-value",
            "xpl global-value",
            "aaa '12',",
            "bbb '34',",
            "ccc '1.2.3.4'",
            "end-global-value"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA global variable set is a group of frequently used values that are defined as global variables. Global variables can be referenced by all route-filters configured on a device. To enable a route-filter or a set to reference a global variable, enter $+variable name, for example, $glovar1. The global variables on a device must be unique. A new global variable will override an existing global variable with the same name. To enter the global variable set paragraph editing interface view, run the edit xpl global-value command.\nTo configure a global variable set in the global variable set paragraph editing interface view, perform the following steps:\n Configure a start clause (xpl global-value) for a global variable set. Configure set elements in the format of variable name+'value' in the global variable set view.The variable value range is The value is a string of 1 to 200 case-sensitive characters, spaces not supported. The string can contain letters, digits, underscores (_), hyphens (-), and dots (.). It must start with a letter or digit.The variable name must not be abort, display, end-global-value, or any abbreviation of the keywords, for example, a, ab, abo, di, e, or end.Separate every two neighboring elements with a comma (,), for example, aaa '12', bbb '34', aaa '1.2.3.4'.\n Configure an end clause (end-global-value) for the global variable set.\n\nPrecautions\nThe data type of each value in a global variable set may vary with the route-filter that references the set. For example, glovar '12' is configured as an element for a global variable set and the set is referenced by a route-filter to modify the MED values of BGP routes, the value of glovar is an integer."
}