{
    "PageTitle": "edit xpl route-flow-group",
    "FuncDef": "The edit xpl route-flow-group command displays the QPPB configuration group paragraph editing interface view.\nBy default, no QPPB configuration groups are configured.",
    "CLIs": [
        "edit xpl route-flow-group <group-name>"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "group-name",
            "Info": "Specifies the name of a QPPB configuration group.\nThe value is a string of 1 to 200 case-sensitive characters, spaces not supported. The string can contain letters, digits, underscores (_), hyphens (-), and dots (.). It must start with a letter or digit."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> edit xpl route-flow-group aaa",
            "xpl route-flow-group aaa",
            "apply ip-precedence 2,",
            "apply qos-local-id 10,",
            "apply traffic-index 1,",
            "apply peer-id 10",
            "end-group"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, routes do not carry the QoS attribute. Configuring QPPB helps collect traffic statistics.\nTo enter the QPPB configuration group paragraph editing interface view to set a value for the QoS attribute of routes, run the edit xpl route-flow-group command.\nTo configure a QPPB configuration group in the QPPB configuration group paragraph editing interface view, perform the following steps:\n Configure a start clause (edit xpl route-flow-group group-name) for a QPPB configuration group. Set a value for the QoS attribute of routes using one or more apply clauses. The clauses are as follows:apply ip-precedence ip-precedence: sets the QoS parameter ip-precedence which is an integer ranging from 0 to 7.apply qos-local-id qos-local-id: sets a qos-local-id which is an integer ranging from 1 to 4095.apply traffic-index traffic-index: sets a traffic-index which is an integer ranging from 1 to 64.apply behavior behavior-name: sets a QoS behavior. The value of behavior-name is a string of 1 to 127 characters.apply peer-id peer-id: sets an ID for a BGP peer group. The peer-id is an integer ranging from 1 to 255.\n Configure an end clause (end-group) for the QPPB configuration group.\n\nPrecautions\nIf multiple QPPB configuration groups are applied in a route-filter, the configuration in the last QPPB configuration group applied in the route-filter takes effect. Take the following configuration as an example. Because the QPPB configuration group named rfg2 is the last applied group, the configuration of the apply qos-local-id command in this group takes effect. The configuration of the apply ip-precedence command in the group named rfg1 does not take effect in the route-filter.#xpl route-flow-group rfg1 apply ip-precedence 6 end-group#xpl route-flow-group rfg2 apply qos-local-id 39 end-group# #xpl route-filter rf1 apply group rfg1 apply group rfg2 end-filter#"
}