{
    "PageTitle": "edit xpl large-community-list",
    "FuncDef": "The edit xpl large-community-list command displays the paragraph editing interface view of a Large-Community set.\nBy default, no Large-Community sets are configured.",
    "CLIs": [
        "edit xpl large-community-list <large-community-list-name>"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "large-community-list-name",
            "Info": "Specifies the name of a Large-Community set.\nThe value is a string of 1 to 200 case-sensitive characters, spaces not supported. The string can contain letters, digits, underscores (_), hyphens (-), and dots (.). It must start with a letter or digit."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> edit xpl large-community-list aaa",
            "xpl large-community-list aaa",
            "100:1:1,",
            "200:1:1,",
            "300:1:1",
            "end-list"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA Large-Community set is a group of data related to the Large-Community attribute and can be used by route-filters to filter BGP routes. To enter the paragraph editing interface view of a Large-Community set, run the edit xpl large-community-list command.\nTo configure a Large-Community set in its paragraph editing interface view, perform the following steps:\n Configure a start clause (xpl large-community-list large-community-list-name) for the Large-Community set. Configure elements in the format of aa:bb:cc (100:1:1 for example) for the Large-Community set and separate every two neighboring elements with a comma (,). An asterisk (*) can be used in an element to represent any digit; for example, an element can be set to 100:1:*. Alternatively, configure elements in the format of regular regular-expression, which matches routes with the large-community attribute in the specified regular expression. For detailed description about regular expressions, see Configuration Guide - Basic Configuration.Regular expression processing is computing-intensive. When a large number of regular expressions are configured in an XPL policy to match a BGP route attribute and the length of the route attribute is long, the processing performance of the XPL policy deteriorates. To improve the processing performance of the routing policy, decrease the number of regular expressions or use a non-regular expression matching command.\nIt is recommended that a maximum of 100 regular expressions be configured for each policy.\n Configure an end clause (end-list) for the Large-Community set.\n\nPrecautions\nA Large-Community set is only a group of data used as matching rules and does not have the permit or deny function. Therefore, a Large-Community set can be used to filter routes only after it is referenced by a route-filter."
}