{
    "PageTitle": "xpl simulate enable",
    "FuncDef": "The xpl simulate enable command enables routing protocols on a device to simulate route filtering based on XPL route-filters.\nThe undo xpl simulate enable command disables routing protocols on a device from simulating route filtering based on XPL route-filters.\nBy default, routing protocols on a device are disabled from simulating route filtering based on XPL route-filters.",
    "CLIs": [
        "xpl simulate enable",
        "undo xpl simulate enable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] xpl simulate enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo enable routing protocols on a device to simulate route filtering based on XPL route-filters, run the xpl simulate enable command. This configuration is a prerequisite if you want to use a display command specific to a routing protocol to preview the result of the routing protocol simulating route filtering based on a specified XPL route-filter.\nFollow-up Procedure\nRun a specific display command provided by a routing protocol to preview the result of the routing protocol simulating route filtering based on a specified XPL route-filter.\nFor example, run the display bgp routing-table route-filter command to preview the result of simulating route filtering in the BGP routing table based on a specified XPL route-filter.\nPrecautions\nAfter the xpl simulate enable command is run, system performance slightly deteriorates when XPL-based lists and route-filters are configured. If this function does not need to be enabled, you are advised not to run this command.\nIf more than 1000 route-filters have been configured on a device or a route-filter has referenced more than 1000 XPL-based lists such as AS_Path and community lists, executing the xpl simulate enable command may be time-consuming. Exercise caution when using this command.\nThe xpl simulate enable command cannot be run if the number of reference clauses (estimated as the number of configured route-filters multiplied by the number of configured XPL-based lists) is greater than 50000."
}