{
    "PageTitle": "xpl ipv6-prefix-list",
    "FuncDef": "The xpl ipv6-prefix-list command creates an IPv6 prefix set and displays the IPv6 prefix set view.\nThe undo xpl ipv6-prefix-list command deletes a specified IPv6 prefix set.\nBy default, no IPv6 prefix sets are configured.",
    "CLIs": [
        "xpl ipv6-prefix-list <ipv6-prefix-list-name>",
        "undo xpl ipv6-prefix-list <ipv6-prefix-list-name>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv6-prefix-list-name",
            "Info": "Specifies the name of an IPv6 prefix set.\nThe value is a string of 1 to 200 case-sensitive characters, spaces not supported. The string can contain letters, digits, underscores (_), hyphens (-), and dots (.). It must start with a letter or digit."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system",
            "[~HUAWEI] xpl ipv6-prefix-list ipv6-list1",
            "[~HUAWEI-xpl-pfx6] 2001:db8:0:1:: 64,",
            "[~HUAWEI-xpl-pfx6] 2001:db8:1:1:: 64,",
            "[~HUAWEI-xpl-pfx6] 2001:db8:1:2:: 64 GE 96 le 100",
            "[~HUAWEI-xpl-pfx6] end-list"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAn IPv6 prefix set is a group of IPv6 prefix data used by a route-filter to filter BGP routes based on route attributes, such as the source, destination, or next hop IP address. To create an IPv6 prefix set and enter the IPv6 prefix set view, run the xpl ipv6-prefix-list command.\nFollow-up Procedure\n Configure elements (IPv6 addresses with masks, 2001:db8:0:1:: 64 for example) for the set in the IPv6 prefix set view and separate every two neighboring elements with a comma (,). You can use eq, ge, or le to specify the mask length. For example, 2001:db8:0:1:: 64 ge 96 le 100 matches the routes in network segment 2001:db8:0:1::/64 with the mask length ranging from 96 to 100 bits. Run the end-list command in the IPv6 prefix set view to conclude the configuration of the IPv6 prefix set.\n\nPrecautions\nAn IPv6 prefix set is only a group of data used as matching rules and does not have the permit or deny function. Therefore, an IPv6 prefix set can be used to filter routes only after it is referenced by a route-filter.\nTo exit from the IPv6 prefix set view, run the abort command in the IPv6 prefix set view."
}