{
    "PageTitle": "xpl ip-prefix-list",
    "FuncDef": "The xpl ip-prefix-list command creates an IPv4 prefix set and displays the IPv4 prefix set view.\nThe undo xpl ip-prefix-list command deletes a specified IPv4 prefix set.\nBy default, no IPv4 prefix sets are configured.",
    "CLIs": [
        "xpl ip-prefix-list <ip-prefix-list-name>",
        "undo xpl ip-prefix-list <ip-prefix-list-name>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-prefix-list-name",
            "Info": "Specifies the name of an IPv4 prefix set.\nThe value is a string of 1 to 200 case-sensitive characters, spaces not supported. The string can contain letters, digits, underscores (_), hyphens (-), and dots (.). It must start with a letter or digit."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system",
            "[~HUAWEI] xpl ip-prefix-list ipv4-list1",
            "[~HUAWEI-xpl-pfx] 1.1.1.1 32,",
            "[~HUAWEI-xpl-pfx] 2.2.2.2 32,",
            "[~HUAWEI-xpl-pfx] 3.3.3.0 24",
            "[~HUAWEI-xpl-pfx] end-list"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAn IPv4 prefix set is a group of IPv4 prefix data used by a route-filter to filter BGP routes based on route attributes, such as the source, destination, or next hop IP address. To create an IPv4 prefix set and enter the IPv4 prefix set view, run the xpl ip-prefix-list command.\nFollow-up Procedure\n Configure elements (IPv4 addresses with masks, 0 24 for example) for the set in the IPv4 prefix set view and separate every two neighboring elements with a comma (,). You can use eq, ge, or le to specify the mask length. For example, 0 24 ge 26 le 30 matches the routes in network segment 0/24 with the mask length ranging from 26 to 30 bits. Run the end-list command in the IPv4 prefix set view to conclude the configuration of the IPv4 prefix set.\n\nPrecautions\nAn IPv4 prefix set is only a group of data used as matching rules and does not have the permit or deny function. Therefore, an IPv4 prefix set can be used to filter routes only after it is referenced by a route-filter.\nTo exit from the IPv4 prefix set view, run the abort command in the IPv4 prefix set view."
}