{
    "PageTitle": "route-distinguisher (VPN instance IPv6 address family view)",
    "FuncDef": "The route-distinguisher command configures an RD for a VPN instance IPv6 address family.\nThe undo route-distinguisher command deletes the RD configuration in a specified VPN instance IPv6 address family.\nBy default, no RD is configured for a VPN instance IPv6 address family.",
    "CLIs": [
        "route-distinguisher <route-distinguisher>",
        "undo route-distinguisher <route-distinguisher>"
    ],
    "ParentView": [
        "VPN instance IPv6 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "route-distinguisher",
            "Info": "Specifies an RD.\nThe three formats of an RD are as follows:\n16-bit AS number: 32-bit user-defined number. For example, 101:3. The AS number ranges from 0 to 65535, and the user-defined number ranges from 0 to 4294967295. The AS number and user-defined number cannot be both 0s. This means that an RD cannot be 0:0.Integral 4-byte AS number: 2-byte user-defined number, for example, 0:3 or 65537:3. An AS number ranges from 0 to 4294967295. A user-defined number ranges from 0 to 65535. The AS number and user-defined number cannot be both 0s. This means that an RD cannot be 0:0.4-byte AS number in dotted notation: 2-byte user-defined number, for example, 0.0:3 or 0.1:0. A 4-byte AS number in dotted notation is in the format of x.y, where x and y are integers that range from 1 to 65535 and from 0 to 65535, respectively. A user-defined number ranges from 0 to 65535. The AS number and user-defined number cannot be both 0s. This means that an RD cannot be 0:0.32-bit IP address: 16-bit user-defined number. For example, 192.168.122.15:1. The IP address ranges from 0.0.0.0 to 255.255.255.255, and the user-defined number ranges from 0 to 65535."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ipv6-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv6] route-distinguisher 22:1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nDifferent RDs need to be configured for different VPNs to prevent overlapping of routes with the same prefixes in different VPNs. To configure an RD for a VPN instance IPv6 address family, run the route-distinguisher command.\nAn RD must be configured for a VPN instance before other IPv6 VPN configurations are performed. This means that other VPN configurations can be performed for a VPN instance IPv6 address family only after an RD is configured for it.\nPrecautions\nConfiguring a unique RD for a VPN instance IPv6 address family is recommended; otherwise, route overlapping may occur.\nAfter an RD in the IPv6 address family for a VPN instance is deleted using the undo route-distinguisher command, configurations in the IPv6 address family as well as the IPv6 address family-related configurations in the BGP view will be deleted. Therefore, exercise caution when you run this command."
}