{
    "PageTitle": "import route-policy (VPN instance IPv6 address family view)",
    "FuncDef": "The import route-policy command associates an import route-policy with a VPN instance IPv6 address family.\nThe undo import route-policy command dissociates an import route-policy from a VPN instance IPv6 address family.\nBy default, no import route-policy is associated with a VPN instance IPv6 address family.",
    "CLIs": [
        "import route-policy <policy-name>",
        "undo import route-policy"
    ],
    "ParentView": [
        "VPN instance IPv6 address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "policy-name",
            "Info": "Specifies the name of an import route-policy to be associated with a VPN instance IPv6 address family.\nThe value is a string of 1 to 200 case-sensitive characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] route-policy poly-1 permit node 10",
            "[*HUAWEI-route-policy] quit",
            "[*HUAWEI] ip vpn-instance vrf1",
            "[*HUAWEI-vpn-instance-vrf1] ipv6-family",
            "[*HUAWEI-vpn-instance-vrf1-af-ipv6] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vrf1-af-ipv6] import route-policy poly-1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf no import route-policy is configured, the routes whose export VPN targets match the import VPN target of the local VPN instance IPv6 address family are added to the VPN instance IPv6 address family. To control the import of the routes into the VPN instance IPv6 address family more precisely, use the import route-policy. The import route-policy is used to filter the imported routing information and to set the routing attributes of the routes that pass the filtering.\nCompared with the import route-policy command, the peer route-policy import or peer filter-policy import command configured in the BGP-VPN instance IPv6 address family view filters the routes received by the VPN instance IPv6 address family from the CE (a BGP peer).\nPrerequisites\nThe ipv6-family command has been run in the VPN instance view to enable the IPv6 address family, and the route-distinguisher command has been run in the VPN instance view to set an RD for the VPN instance IPv6 address family.\nConfiguration Impact\nOnly one import route-policy can be associated with a VPN instance IPv6 address family. If the import route-policy command is run more than once, the latest configuration overrides the previous one.\nFollow-up Procedure\nIf the import route-policy to be associated with a VPN instance IPv6 address family does not exist, configure the route-policy."
}