{
    "PageTitle": "ipv6 nd autoconfig other-flag",
    "FuncDef": "The ipv6 nd autoconfig other-flag command sets the \"other configuration\" flag (O flag) in the RA message, indicating whether hosts should use stateful autoconfiguration to obtain additional information (excluding addresses).\nThe undo ipv6 nd autoconfig other-flag command clears the \"other configuration\" flag (O flag) set in the RA message.\nBy default, the \"other configuration\" flag (O flag) is not set in the RA message.",
    "CLIs": [
        "ipv6 nd autoconfig other-flag",
        "undo ipv6 nd autoconfig other-flag"
    ],
    "ParentView": [
        "PW-VE interface view",
        "PW-VE sub-interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "Port extension interface view",
        "GE electrical interface view",
        "Serial interface view",
        "Eth-Trunk sub-interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "MP-group interface view",
        "GE sub-interface view",
        "VBDIF interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "GE interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "100ge sub-interface view",
        "25GE interface view",
        "40GE sub-interface view",
        "Eth-Trunk interface view",
        "10GE sub-interface view",
        "POS interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] ipv6 enable",
            "[*HUAWEI-GigabitEthernet1/0/1] ipv6 nd autoconfig other-flag"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the O flag is set, the attached hosts should use stateful autoconfiguration to obtain additional configuration information (excluding IPv6 addresses). Additional configuration information includes the router lifetime, neighbor reachable time, retransmission interval, and PMTU.If the O flag is not set, the attached hosts should use stateless autoconfiguration to obtain additional configuration information. That is, the attached hosts obtain additional configuration information through the RA messages advertised by Routers.\n\nPrerequisites\nIPv6 has been enabled on the involved interface using the ipv6 enable command.\nConfiguration Impact\nIf the ipv6 nd autoconfig managed-address-flag command is run, hosts can obtain additional configuration information (excluding IPv6 addresses) though the ipv6 nd autoconfig other-flag command is not run.\nTo check whether the attached hosts obtain IPv6 addresses through stateful autoconfiguration or stateless autoconfiguration, run the display ipv6 interface command.\nPrecautions\nThe interface on a Router cannot use stateful and stateless address autoconfiguration simultaneously to obtain additional configuration information (excluding IPv6 addresses)."
}