{
    "PageTitle": "ipv6 nd autoconfig managed-address-flag (interface view)",
    "FuncDef": "The ipv6 nd autoconfig managed-address-flag command sets the \"managed address configuration\" flag (M flag) in the RA message, indicating whether hosts should use stateful autoconfiguration to obtain addresses.\nThe undo ipv6 nd autoconfig managed-address-flag command clears the \"managed address configuration\" flag (M flag) set in the RA message.\nBy default, the \"managed address configuration\" flag (M flag) is not set in the RA message.",
    "CLIs": [
        "ipv6 nd autoconfig managed-address-flag",
        "undo ipv6 nd autoconfig managed-address-flag"
    ],
    "ParentView": [
        "PW-VE interface view",
        "PW-VE sub-interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "GE electrical interface view",
        "Port extension interface view",
        "Serial interface view",
        "Eth-Trunk sub-interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "MP-group interface view",
        "10GE interface view",
        "GE sub-interface view",
        "VBDIF interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "GE interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "100ge sub-interface view",
        "25GE interface view",
        "Eth-Trunk interface view",
        "40GE sub-interface view",
        "10GE sub-interface view",
        "POS interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] ipv6 enable",
            "[*HUAWEI-GigabitEthernet1/0/0] ipv6 nd autoconfig managed-address-flag"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the M flag is set, the attached hosts should use stateful autoconfiguration to obtain IPv6 addresses.If the M flag is not set, the attached hosts should use stateless autoconfiguration to obtain IPv6 addresses. For example, the attached hosts obtain IPv6 prefixes through the RA messages advertised by Routers.\n\nPrerequisites\nIPv6 has been enabled on the involved interface using the ipv6 enable command.\nConfiguration Impact\nIf the ipv6 nd autoconfig managed-address-flag command is run, hosts can obtain additional configuration information (excluding IPv6 addresses) though the ipv6 nd autoconfig other-flag command is not run. Additional configuration information includes the router lifetime, time period for the neighbor to keep reachable, retransmission interval, and PMTU.\nTo check whether the attached hosts obtain IPv6 addresses through stateful autoconfiguration or stateless autoconfiguration, run the display ipv6 interface command.\nPrecautions\nThe interface on a Router cannot use stateful address autoconfiguration and stateless address autoconfiguration simultaneously to obtain IPv6 addresses."
}