{
    "PageTitle": "ipv6 nd nud attempts",
    "FuncDef": "The ipv6 nd nud attempts command sets the number of probe retransmissions for ND entries in the PROBE state.\nThe undo ipv6 nd nud attempts command restores the default configuration.\n\nBy default, the number of probe retransmissions for ND entries in the PROBE state is 3.",
    "CLIs": [
        "ipv6 nd nud attempts <attempts>",
        "undo ipv6 nd nud attempts",
        "undo ipv6 nd nud attempts <attempts>"
    ],
    "ParentView": [
        "PW-VE interface view",
        "PW-VE sub-interface view",
        "40GE interface view",
        "Port extension interface view",
        "GE electrical interface view",
        "Eth-Trunk sub-interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "GE sub-interface view",
        "VBDIF interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "GE interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "100ge sub-interface view",
        "25GE interface view",
        "40GE sub-interface view",
        "Eth-Trunk interface view",
        "10GE sub-interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "attempts",
            "Info": "Specifies the number of probe retransmissions for ND entries in the PROBE state.\nThe value is an integer ranging from 1 to 10."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] ipv6 enable",
            "[*HUAWEI-GigabitEthernet1/0/1] ipv6 nd nud attempts 5"
        ]
    ],
    "ExtraInfo": "Usage Scenario\n\nIf an ND entry is in the PROBE state, the neighbor is no longer known to be reachable. The device sends unicast NS messages to detect the validity of the ND entry. If a response is received from the neighbor, the ND entry enters the REACH state, indicating that the neighbor is known to have been reachable. If no response is received from the neighbor, the ND entry is deleted.\nYou are advised to run the ipv6 nd nud attempts command to set the number of probe retransmissions for ND entries in the PROBE state to a larger value in the following situations:\n\nThe link reliability on the network is poor, and packet loss may occur during packet transmission.\nThe peer device is busy processing services and cannot process NS messages in time.\n\nThis prevents ND entries from being mistakenly deleted, hence negatively affecting packet forwarding efficiency if no response is received from the neighbor within the specified period (calculated as Default number of probe retransmissions x Default interval of probe retransmissions).\n\nPrerequisites\n\nIPv6 has been enabled using the ipv6 enable command."
}