{
    "PageTitle": "ipv6 nd generate-rd-table enable",
    "FuncDef": "The ipv6 nd generate-rd-table enable command enables a device to generate ND entries based on host information synchronized from EVPN routes.\nThe undo ipv6 nd generate-rd-table enable command restores the default configuration and deletes ND entries generated based on host information synchronized from EVPN routes.\nBy default, a device is disabled from generating ND entries based on host information synchronized from EVPN routes.",
    "CLIs": [
        "ipv6 nd generate-rd-table enable",
        "undo ipv6 nd generate-rd-table enable"
    ],
    "ParentView": [
        "VBDIF interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bridge-domain 10",
            "[*HUAWEI-bd10] commit",
            "[~HUAWEI-bd10] quit",
            "[~HUAWEI] interface vbdif 10",
            "[*HUAWEI-Vbdif10] ipv6 enable",
            "[*HUAWEI-Vbdif10] ipv6 nd generate-rd-table enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn the NFVI distributed gateway scenario where BGP EVPN peer relationships are established between L2GWs/L3GWs and DC-GWs, L2GWs/L3GWs learn MAC address and ND information of interface processing units (main control boards) through the data plane and advertise the information to DC-GWs through EVPN routes. This allows ND entries to be generated for Layer 2 forwarding and ensures that user services run properly. To enable a device to generate ND entries based on host information synchronized from EVPN routes, run the ipv6 nd generate-rd-table enable command.\nPrerequisites\nIPv6 has been enabled using the ipv6 enable command in the VBDIF interface view.\nConfiguration Impact\nAfter the undo ipv6 nd generate-rd-table enable command is run, the device deletes ND entries generated based on host information synchronized from EVPN routes and will not generate ND entries upon receipt of host information synchronized from EVPN routes advertised by the peer."
}