{
    "PageTitle": "mac-change notify-nd disable",
    "FuncDef": "The mac-change notify-nd disable command disables association between MAC and ND.\nThe undo mac-change notify-nd disable command enables association between MAC and ND.\nBy default, association between MAC and ND is enabled.",
    "CLIs": [
        "mac-change notify-nd disable",
        "undo mac-change notify-nd disable"
    ],
    "ParentView": [
        "VLANIF interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] vlan 10",
            "[~HUAWEI-vlan10] quit",
            "[~HUAWEI] interface vlanif 10",
            "[~HUAWEI-Vlanif10] mac-change notify-nd disable",
            "Warning: This operation will reset the ND configuration on the VLANIF interface, causing the traffic to be forwarded in an unexpected direction. Continue? [Y/N]y"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA device supports association between MAC and ND by default. Association between MAC and ND is generally deployed on a gateway and applies to a network where multiple links are available between a user and the gateway or the interface through which a user accesses the gateway can change. After association between MAC and ND is configured, ND entries can be rapidly updated to ensure real-time and stable traffic forwarding. However, the ND entries learned by the VLANIF interface are synchronized globally, causing the number of ND entries on all interface boards to increase. To resolve this problem in scenarios where ND entries learned by the VLANIF interface do not need to be synchronized globally, run the mac-change notify-nd disable command to disable association between MAC and ND.\nPrecautions\nRunning the mac-change notify-nd disable command causes ND entries on the VLANIF interface to be reset, which may cause traffic forwarding failures. Therefore, exercise caution when running this command.\nThe interval for changing this configuration must be longer than 10 minutes."
}