{
    "PageTitle": "ipv6 nd neighbor-limit",
    "FuncDef": "The ipv6 nd neighbor-limit command configures the maximum number of dynamic neighbor entries allowed by an interface.\nThe undo ipv6 nd neighbor-limit command cancels the configuration.\n\nBy default, the maximum number of dynamic neighbor entries allowed by an interface is not configured.",
    "CLIs": [
        "ipv6 nd neighbor-limit <max-number>",
        "undo ipv6 nd neighbor-limit",
        "undo ipv6 nd neighbor-limit <max-number>"
    ],
    "ParentView": [
        "PW-VE interface view",
        "PW-VE sub-interface view",
        "40GE interface view",
        "Port extension interface view",
        "GE electrical interface view",
        "Eth-Trunk sub-interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "GE sub-interface view",
        "VBDIF interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "GE interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "100ge sub-interface view",
        "25GE interface view",
        "40GE sub-interface view",
        "Eth-Trunk interface view",
        "10GE sub-interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "max-number",
            "Info": "Specifies the maximum number of dynamic neighbor entries allowed by an interface.\nThe value is an integer ranging from 0 to 65536. Setting the max-number parameter to 0 equals to running the undo ipv6 nd neighbor-limit [ max-number ] command."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] ipv6 enable",
            "[*HUAWEI-GigabitEthernet1/0/0] ipv6 nd neighbor-limit 16000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\n\nUpon receipt of a large number of RA messages from an attacker, a device learns dynamic neighbor entries, which consumes high CPU and memory resources. To defend against RA flooding attacks, run the ipv6 nd neighbor-limit command to configure the maximum number of dynamic neighbor entries allowed by an interface.\nWhen the number of dynamic neighbor entries exceeds a specified threshold, a large amount of redundant information exists, and the device stops recording. In this case, you can run the reset ipv6 neighbors command to clear specified dynamic neighbor entries. However, this operation may affect IPv6 packet forwarding. Exercise caution when you perform this operation.\n\nPrerequisites\n\nBefore running this command, run the ipv6 enable command in the interface view to enable the IPv6 function."
}