{
    "PageTitle": "ipv6 nd collect host enable (Bridge domain view)",
    "FuncDef": "The ipv6 nd collect host enable command enables a device to flood ND entries or proxy ND entries through EVPN routes.\nThe undo ipv6 nd collect host enable command disables a device from flooding ND entries or proxy ND entries through EVPN routes.\nBy default, a device is not enabled to flood ND entries or proxy ND entries through EVPN routes.",
    "CLIs": [
        "ipv6 nd collect host enable",
        "undo ipv6 nd collect host enable"
    ],
    "ParentView": [
        "Bridge domain view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bridge-domain 10",
            "[*HUAWEI-bd10] ipv6 nd multicast-suppress proxy-reply enable",
            "[*HUAWEI-bd10] ipv6 nd collect host enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nproxy ND or converts multicast streams to unicast streams. If not, the device forwards the NS message based on the original process.\nAfter NS multicast suppression is enabled in Layer 2 interworking scenarios, run the ipv6 nd collect host enable command in the BD view to enable the flooding of proxy ND entries generated on a device through EVPN routes.\nWhen another device receives the flooded ND entries or proxy ND entries, a proxy ND table is generated on the local. In this manner, when the device receives NS messages again, it searches the local proxy ND table first. If a matching entry exists, the device simply implements proxy ND or converts multicast streams to unicast streams.\nPrerequisites\nIn Layer 2 interworking scenarios, NS multicast suppression has been enabled using the ipv6 nd multicast-suppress { proxy-reply [ unknown-options-unicast ] | unicast-forward } [ mismatch-discard ] enable command in the BD view.In Layer 3 interworking scenarios, NS multicast suppression has been enabled using the ipv6 nd multicast-suppress { proxy-reply [ unknown-options-unicast ] | unicast-forward } [ mismatch-discard ] enable command in the BD view and then IPv6 is enabled using the ipv6 enable command in the VBDIF interface view."
}