{
    "PageTitle": "ipv6 nd multicast-suppress dynamic expire-time",
    "FuncDef": "The ipv6 nd multicast-suppress dynamic expire-time command configures the aging time of dynamic proxy ND entries.\nThe undo ipv6 nd multicast-suppress dynamic expire-time command restores the default configuration.\nBy default, the aging time of dynamic proxy ND entries is 900s.",
    "CLIs": [
        "ipv6 nd multicast-suppress dynamic expire-time <expire-time-value>",
        "undo ipv6 nd multicast-suppress dynamic expire-time <expire-time-value>",
        "undo ipv6 nd multicast-suppress dynamic expire-time"
    ],
    "ParentView": [
        "Bridge domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "expire-time-value",
            "Info": "Specifies the aging time of dynamic proxy ND entries.\nThe value is an integer ranging from 60 to 86400, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bridge-domain 10",
            "[*HUAWEI-bd10] ipv6 nd multicast-suppress proxy-reply enable",
            "[*HUAWEI-bd10] ipv6 nd multicast-suppress dynamic expire-time 1000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe proxy ND entries need to be updated regularly to ensure communication reliability. Dynamic proxy ND entries have a life cycle. If a dynamic proxy ND entry is not updated before its life cycle ends, this entry will be deleted from the proxy ND table. Such a life cycle is called aging time. If a dynamic proxy ND entry is updated before its life cycle expires, the aging time of the entry is recalculated. To configure the aging time of dynamic proxy ND entries, run the ipv6 nd multicast-suppress dynamic expire-time command.\nPrerequisites\nNS multicast suppression has been enabled using the ipv6 nd multicast-suppress { proxy-reply [ unknown-options-unicast ] | unicast-forward } [ mismatch-discard ] enable command in the BD view.\nPrecautions\nDo not configure the aging time of dynamic proxy ND entries to a value more than four times of the aging time of MAC address entries (MAC address entries can be viewed using the display mac-address aging-time command)."
}