{
    "PageTitle": "ipv6 nd miss anti-attack rate-limit (interface view)",
    "FuncDef": "The ipipv6 nd miss anti-attack rate-limit command sets the rate limit value for ND Miss messages.\nThe undo ipv6 nd miss anti-attack rate-limit command deletes the rate limit value for ND Miss messages.\nBy default, the rate limit for ND Miss messages anti-attack function is disabled.",
    "CLIs": [
        "ipv6 nd miss anti-attack rate-limit <limit>",
        "undo ipv6 nd miss anti-attack rate-limit <limit>"
    ],
    "ParentView": [
        "PW-VE sub-interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "Port extension interface view",
        "GE electrical interface view",
        "Eth-Trunk sub-interface view",
        "50GE sub-interface view",
        "MP-group interface view",
        "400GE interface view",
        "10GE interface view",
        "GE sub-interface view",
        "VBDIF interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "GE interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "100ge sub-interface view",
        "25GE interface view",
        "40GE sub-interface view",
        "Eth-Trunk interface view",
        "10GE sub-interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "rate-limit limit",
            "Info": "Specify the speed limit value for ND Miss messages.\nThe value is an integer ranging from 0 to 5000, in pps."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] ipv6 enable",
            "[*HUAWEI-GigabitEthernet1/0/0] ipv6 nd miss anti-attack rate-limit 550"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen a device sends an IPv6 packet, if the MAC address corresponding to the destination IPv6 address of the IPv6 packet does not exist, an ND Miss message is generated. This consumes device resources and affects the processing of other services. To resolve this problem, run the ipv6 nd miss anti-attack rate-limit command to configure the rate at which ND Miss messages are sent. With this configuration, the device processes only the allowed number of ND Miss messages within a specified period to ensure normal service running.\nConfiguration Impact\nAfter the rate at which ND Miss messages are sent is limited, a device collects statistics about the number of received ND Miss messages. If the number of ND Miss messages received within a specified period exceeds the upper limit, the device discards the excess ND Miss messages.\nPrecautions\nIf the rate limit is too low and the login through Telnet fails because the device receives a large number of attack packets, you can log in to the device through the Console port to increase the rate limit."
}