{
    "PageTitle": "ipv6 nd proxy route enable",
    "FuncDef": "The ipv6 nd proxy route enable command enables the routed proxy ND function.\nThe undo ipv6 nd proxy route enable command disables the routed proxy ND function.\n\nBy default, the routed proxy ND function is not enabled.",
    "CLIs": [
        "ipv6 nd proxy route enable",
        "undo ipv6 nd proxy route enable"
    ],
    "ParentView": [
        "PW-VE sub-interface view",
        "40GE interface view",
        "Port extension interface view",
        "GE electrical interface view",
        "Eth-Trunk sub-interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "GE sub-interface view",
        "VBDIF interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "GE interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "100ge sub-interface view",
        "25GE interface view",
        "40GE sub-interface view",
        "Eth-Trunk interface view",
        "10GE sub-interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] ipv6 enable",
            "[*HUAWEI-GigabitEthernet1/0/1] ipv6 nd proxy route enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\n\nIf two hosts are on the same network segment and are isolated to be on different physical networks by a gateway configured with two different IP addresses, the hosts cannot communicate with each other. To address this problem, run the ipv6 nd proxy route enable command to enable the routed proxy ND function on the gateway connecting the two hosts. After the command is run, the gateway uses its own MAC address and the IPv6 address of the destination host to send the source host an NA packet as a reply. Specifically, the gateway takes the place of the destination host to reply with an NA packet. In this way, the hosts in the same network segment but different physical networks (the gateway connecting to the hosts are configured with two different gateway addresses) can communicate with each other.\n\nPrerequisites\n\nThe IPv6 function has been enabled using the ipv6 enable command.\n\nPrecautions\n\n\nProxy ND cannot be enabled on an interface configured with a CGA address. Otherwise, the replied NA packets that carry the CGA/RSA option may be discarded.\nMultiple types of proxy ND can be configured in the interface view. The priorities of these proxy ND types are as follows in descending order: any proxy ND > intra-VLAN proxy ND/inter-VLAN proxy ND/local proxy ND > routed proxy ND.\nProxy ND is not supported for the following types of packets:\nNS packets with a link-local address as the target address\nDAD NS packets with the source address of all 0s\nNS packets with the IP address of the local host as the target address."
}