{
    "PageTitle": "ipv6 nd proxy inter-access-vlan enable",
    "FuncDef": "The ipv6 nd proxy inter-access-vlan enable command enables the inter-VLAN proxy ND function.\nThe undo ipv6 nd proxy inter-access-vlan enable command disables the inter-VLAN proxy ND function.\n\nBy default, the inter-VLAN proxy ND function is not enabled.",
    "CLIs": [
        "ipv6 nd proxy inter-access-vlan enable",
        "undo ipv6 nd proxy inter-access-vlan enable"
    ],
    "ParentView": [
        "GE sub-interface view",
        "PW-VE sub-interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "Eth-Trunk sub-interface view",
        "400GE sub-interface view",
        "50GE sub-interface view",
        "100ge sub-interface view",
        "40GE sub-interface view",
        "10GE sub-interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/1.3",
            "[~HUAWEI-GigabitEthernet1/0/1.3] ipv6 enable",
            "[*HUAWEI-GigabitEthernet1/0/1.3] ipv6 nd proxy inter-access-vlan enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\n\nBy using VLANs, you can divide a network into different subnets and a large broadcast domain into several small ones. This implements user isolation between different VLANs, effectively reducing the impact scope for broadcast packets and improving network security.\nIn the following scenarios, the inter-VLAN proxy ND function needs to be enabled to allow communication between hosts:\n\nThe inter-VLAN proxy ND function needs to be enabled on the interfaces of two hosts in different VLANs.\nIn a VLAN aggregation scenario, if the hosts in sub-VLANs need to communicate with each other, the inter-VLAN proxy ND function needs to be enabled on the VLANIF interfaces in a super-VLAN.\n\n\nPrerequisites\n\nThe IPv6 function has been enabled using the ipv6 enable command.\n\nPrecautions\n\n\nThe IPv6 address of the interface enabled with proxy ND must be on the same network segment as the IPv6 address of the host connected to the interface.\nProxy ND cannot be enabled on an interface configured with a CGA address. Otherwise, the replied NA packets that carry the CGA/RSA option may be discarded.\nMultiple types of proxy ND can be configured in the interface view. The priorities of these proxy ND types are as follows in descending order: any proxy ND > intra-VLAN proxy ND/ inter-VLAN proxy ND/local proxy ND > routed proxy ND.\nInter-VLAN proxy ND is not supported for the devices that do not support configuration of VLAN segments.\nProxy ND is not supported for the following types of packets:\nNS packets with a link-local address as the target address\nDAD NS packets with the source address of all 0s\nNS packets with the target address and interface address on different network segments\nNS packets with the IP address of the local host as the target address."
}