{
    "PageTitle": "ipv6 nd proxy anyway enable",
    "FuncDef": "The ipv6 nd proxy anyway enable command enables any proxy ND function.\nThe undo ipv6 nd proxy anyway enable command disables the any proxy ND function.\n\nBy default, the any proxy ND function is not enabled.",
    "CLIs": [
        "ipv6 nd proxy anyway enable",
        "undo ipv6 nd proxy anyway enable"
    ],
    "ParentView": [
        "PW-VE sub-interface view",
        "40GE interface view",
        "Port extension interface view",
        "GE electrical interface view",
        "Eth-Trunk sub-interface view",
        "400GE interface view",
        "50GE sub-interface view",
        "10GE interface view",
        "GE sub-interface view",
        "VBDIF interface view",
        "VE sub-interface view",
        "GE interface view",
        "25GE sub-interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "25GE interface view",
        "100ge sub-interface view",
        "40GE sub-interface view",
        "Eth-Trunk interface view",
        "10GE sub-interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] ipv6 enable",
            "[*HUAWEI-GigabitEthernet1/0/1] ipv6 nd proxy anyway enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\n\nIn scenarios where servers are partitioned into VMs, to allow flexible deployment and migration of VMs on multiple servers or gateways, the common solution is to configure Layer 2 interworking between multiple gateways. However, this approach may lead to larger Layer 2 domains on the network and risks of broadcast storms. To resolve this problem, a common way is to enable any proxy ND on a VM gateway so that the gateway sends its own MAC address to the source VM and the traffic sent from the source VM to other VMs is transmitted over routes.\n\nPrerequisites\n\nThe IPv6 function has been enabled using the ipv6 enable command.\n\nPrecautions\n\n\nProxy ND cannot be enabled on an interface configured with a CGA address. Otherwise, the replied NA packets that carry the CGA/RSA option may be discarded.\nMultiple types of proxy ND can be configured in the interface view. The priorities of these proxy ND types are as follows in descending order: any proxy ND > intra-VLAN proxy ND/inter-VLAN proxy ND/local proxy ND > routed proxy ND.\nProxy ND is not supported for the following types of packets:\nNS packets with a link-local address as the target address\nDAD NS packets with the source address of all 0s\nNS packets with the IP address of the local host as the target address."
}