{
    "PageTitle": "ipv6 nd proxy local enable",
    "FuncDef": "The ipv6 nd proxy local enable command enables the local proxy ND function.\nThe undo ipv6 nd proxy local enable command disables the local proxy ND function.\nBy default, the local proxy ND function is not enabled.",
    "CLIs": [
        "ipv6 nd proxy local enable",
        "undo ipv6 nd proxy local enable"
    ],
    "ParentView": [
        "VBDIF interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bridge-domain 10",
            "[*HUAWEI-bd10] quit",
            "[*HUAWEI] interface vbdif 10",
            "[*HUAWEI-Vbdif10] ipv6 enable",
            "[*HUAWEI-Vbdif10] ipv6 nd proxy local enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn the EVC model, the member interfaces of a BD broadcast the received packets in the BD. To minimize broadcast traffic, split horizon can be configured on member interfaces that do not need to communicate with each other using the split-horizon enable command. After split horizon is enabled on member interfaces in a BD, users who are served by these interfaces are isolated. However, as services become more diverse and keep increasing, users have growing needs for intra-BD communication. To allow isolated users in a BD to communicate with each other, run the ipv6 nd proxy local enable command to enable the local proxy ND function on the VBDIF interface of the BD.\nPrerequisites\nThe IPv6 function has been enabled using the ipv6 enable command.\nPrecautions\nAfter local proxy ND is enabled, all users in the BD can communicate with each other.The IPv6 address of the interface enabled with proxy ND must be on the same network segment as the IPv6 address of the host connected to the interface.Proxy ND cannot be enabled on an interface configured with a CGA address. Otherwise, the replied NA packets that carry the CGA/RSA option may be discarded.Multiple types of proxy ND can be configured in the interface view. The priorities of these proxy ND types are as follows in descending order: any proxy ND > intra-VLAN proxy ND/inter-VLAN proxy ND/local proxy ND > routed proxy ND.Proxy ND is not supported for the following types of packets:NS packets with a link-local address as the target addressDAD NS packets with the source address of all 0sNS packets with the target address and interface address on different network segmentsNS packets with the IP address of the local host as the target address."
}