{
    "PageTitle": "ipv6 nd learning prefix strict disable",
    "FuncDef": "The ipv6 nd learning prefix strict disable command disables the strict prefix learning function for dynamic neighbor entries.\nThe undo ipv6 nd learning prefix strict disable command restores the default configuration.\nBy default, the strict prefix learning function for dynamic neighbor entries is enabled.",
    "CLIs": [
        "ipv6 nd learning prefix strict disable",
        "undo ipv6 nd learning prefix strict disable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 nd learning prefix strict disable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen a device receives a valid NS message on an interface, the device checks whether IPv6 addresses with the same network prefix exist on the interface. If so, the device replies with an NA message and generates dynamic neighbor entries. If not, the device performs the following operations:\nIf the strict prefix learning function for dynamic neighbor entries is enabled on the interface, the device simply discards the NS message and does not generate dynamic neighbor entries.If the strict prefix learning function for dynamic neighbor entries is disabled on the interface, the device replies with an NA message and generates dynamic neighbor entries.\n\nPrecautions\nThe interfaces that need to generate host routes do not support disabling of the strict prefix learning function for dynamic neighbor entries. The configuration in the system view does not take effect for such interfaces.After the strict prefix learning function is enabled for dynamic neighbor entries, the device does not delete the learned dynamic neighbor entries corresponding to different address prefixes. Instead, the device waits for the entries to automatically age out.The configuration of the strict prefix learning function for dynamic neighbor entries in the interface view has a higher priority than that in the system view."
}