{
    "PageTitle": "ipv6 nd anti-attack rate-limit source-ip all maximum",
    "FuncDef": "The ipv6 nd anti-attack rate-limit source-ip all maximum command sets the rate limit value for ND packets based on every source IP.\nThe undo ipv6 nd anti-attack rate-limit source-ip all maximum command deletes the rate limit value for ND packets based on every source IP.\nThe default rate limit for sending ND messages to the CPU based on any source IP address is 0.45 times the rate limit for sending ND messages to the CPU that is configured in the system view.",
    "CLIs": [
        "ipv6 nd { ns | na | rs | ra } anti-attack rate-limit source-ip all maximum <max-value>",
        "undo ipv6 nd { ns | na | rs | ra } anti-attack rate-limit source-ip all maximum <max-value>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "ns",
            "Info": "Indicates the rate at which NS messages are sent.\n-"
        },
        {
            "Parameters": "na",
            "Info": "Indicates the rate at which NA messages are sent.\n-"
        },
        {
            "Parameters": "rs",
            "Info": "Indicates the rate at which RS messages are sent.\n-"
        },
        {
            "Parameters": "ra",
            "Info": "Indicates the rate at which RA messages are sent.\n-"
        },
        {
            "Parameters": "maximum max-value",
            "Info": "Specify the rate limit value for ND packets based on every source IP.\nThe value is an integer ranging from 0 to 5000, in pps."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 nd ns anti-attack rate-limit source-ip all maximum 550"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 nd na anti-attack rate-limit source-ip all maximum 550"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 nd rs anti-attack rate-limit source-ip all maximum 550"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 nd ra anti-attack rate-limit source-ip all maximum 550"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf users send a large number of ND packets to a device. Many resources are diverted into processing these ND packets, and the processing of other services is affected. To resolve this problem, run the ipv6 nd anti-attack rate-limit source-ip all (interface view) command to set the rate limit value for ND packets based on any interface source IP, avoid the waste of equipment on processing ND packets to ensure the normal operation of other services.\nConfiguration Impact\nAfter set the rate limit value for ND packets based on any interface source IP, the device counts the number of received ND packets. If the number of ND packets received in a specified period exceeds the upper limit, the device discards the excess ND packets. As a result, the device may fail to process some valid ND packets, causing service interruptions.\nPrecautions\nIf the rate limit is too low and the login through Telnet fails because the device receives a large number of attack packets, you can log in to the device through the Console port to increase the rate limit."
}