{
    "PageTitle": "ipv6 nd ns multicast-enable",
    "FuncDef": "The ipv6 nd ns multicast-enable command enables a sub-interface for QinQ VLAN tag termination or Dot1q VLAN tag termination to send NS multicast packets.\nThe undo ipv6 nd ns multicast-enable command disables a sub-interface for QinQ VLAN tag termination or Dot1q VLAN tag termination from sending NS multicast packets.\nBy default, a sub-interface for QinQ VLAN tag termination or Dot1q VLAN tag termination is disabled from sending NS multicast packets.",
    "CLIs": [
        "ipv6 nd ns multicast-enable",
        "undo ipv6 nd ns multicast-enable"
    ],
    "ParentView": [
        "100ge sub-interface view",
        "10GE sub-interface view",
        "25GE sub-interface view",
        "400GE sub-interface view",
        "40GE sub-interface view",
        "50GE sub-interface view",
        "Eth-Trunk sub-interface view",
        "GE sub-interface view",
        "Global VE sub-interface view",
        "VE sub-interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 2/0/0.1",
            "[~HUAWEI-GigabitEthernet2/0/0.1] encapsulation qinq-termination",
            "[*HUAWEI-GigabitEthernet2/0/0.1] qinq termination pe-vid 100 ce-vid 10",
            "[*HUAWEI-GigabitEthernet2/0/0.1] ipv6 enable",
            "[*HUAWEI-GigabitEthernet2/0/0.1] ipv6 nd ns multicast-enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA sub-interface for QinQ VLAN tag termination or Dot1q VLAN tag termination on a route device can send NS multicast packets to actively learn ND entries or respond to NS packets to passively learn ND entries.\nWhen a sub-interface for QinQ VLAN tag termination or Dot1q VLAN tag termination needs to send multicast NS packets to actively learn ND entries but there is no corresponding ND entries, you need to run the ipv6 nd ns multicast-enable command to enable a sub-interface for QinQ VLAN tag termination or Dot1q VLAN tag termination to send NS multicast packets.\nPrerequisites\nRun the encapsulation qinq-termination [ local-switch | rt-protocol ] command in the sub-interface view to configure the mappings between control VLANs and sub-interfaces for VLAN tag termination.\nRun the ipv6 enable command in the sub-interface view to enable IPv6 on an interface.\nConfiguration Impact\nThe system does not send NS multicast packets when the ipv6 nd ns multicast-enable command is not run on the sub-interface for VLAN tag termination.The system tags NS multicast packets and forwards them through the sub-interface for VLAN tag termination when the ipv6 nd ns multicast-enable command is run on the sub-interface for VLAN tag termination.\nSending multicast NS packets consumes CPU resources. Therefore, do not enable a sub-interface for QinQ VLAN tag termination or Dot1q VLAN tag termination to send multicast NS packets when the CPU performance of the system is rather low."
}