{
    "PageTitle": "ipv6 nd ns retrans-timer",
    "FuncDef": "The ipv6 nd ns retrans-timer command sets the interval for sending NS messages.\nThe undo ipv6 nd ns retrans-timer command restores the default setting.\nBy default, the interval for sending NS messages is 1000 milliseconds.",
    "CLIs": [
        "ipv6 nd ns retrans-timer <interval>",
        "undo ipv6 nd ns retrans-timer"
    ],
    "ParentView": [
        "PW-VE interface view",
        "PW-VE sub-interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "GE electrical interface view",
        "Port extension interface view",
        "Eth-Trunk sub-interface view",
        "400GE interface view",
        "50GE sub-interface view",
        "10GE interface view",
        "MP-group interface view",
        "GE sub-interface view",
        "VBDIF interface view",
        "VE sub-interface view",
        "GE interface view",
        "25GE sub-interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "25GE interface view",
        "100ge sub-interface view",
        "Eth-Trunk interface view",
        "40GE sub-interface view",
        "10GE sub-interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "interval",
            "Info": "Specifies the interval for sending NS messages.\nThe value is an integer ranging from 1000 to 4294967295, in milliseconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] ipv6 enable",
            "[*HUAWEI-GigabitEthernet1/0/1] ipv6 nd ns retrans-timer 10000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe interval for sending NS messages provides the following functions:\nControlling the interval for a local Router to probe the reachability of neighborsControlling the interval for a local Router to perform DADBeing a parameter field in an RA message to notify the hosts of the interval for sending NS messages\n\nPrerequisites\nBefore running the ipv6 nd ns retrans-timer command to set the interval for sending NS messages, you need to run the ipv6 enable command in the interface view to enable the IPv6 function on the interface.\nConfiguration Impact\nFrequently sending NS messages results in the high CPU usage, which affects the system performance. Therefore, you are recommended to set the interval for sending NS messages to a longer value. The default interval, 1000 milliseconds, is recommended.\nThe ipv6 nd ns retrans-timer command is circular in nature. That is, if the intervals set two times are different, the latest setting takes effect.\nPrecautions\nCommonly, the interval for sending NS message is the same as that for sending RA messages. In the following cases, however, the interval for sending NS messages is of the default value 1000 milliseconds whereas the interval for sending NA messages is 0 milliseconds.\nThe interval for sending NS messages is not set, that is, the default value is used.The undo ipv6 nd ns retrans-timer command is run to restore the default setting.\nAfter a host receives an RA message with the interval for sending NA messages being 0 milliseconds from a Router, it uses the default interval, 1000 milliseconds for sending NS messages, consistent with that on the Router."
}