{
    "PageTitle": "ipv6 nd nud reachable-time",
    "FuncDef": "The ipv6 nd nud reachable-time command configures the neighbor reachable time.\nThe undo ipv6 nd nud reachable-time command restores the default neighbor reachable time.\n\nBy default, the IPv6 neighbor reachable time is 1200000 milliseconds.",
    "CLIs": [
        "ipv6 nd nud reachable-time <value>",
        "undo ipv6 nd nud reachable-time"
    ],
    "ParentView": [
        "PW-VE interface view",
        "PW-VE sub-interface view",
        "40GE interface view",
        "Port extension interface view",
        "GE electrical interface view",
        "Eth-Trunk sub-interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "GE sub-interface view",
        "VBDIF interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "GE interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "100ge sub-interface view",
        "25GE interface view",
        "40GE sub-interface view",
        "Eth-Trunk interface view",
        "10GE sub-interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "value",
            "Info": "Specifies the neighbor reachable time.\nThe value is an integer ranging from 1 to 3600000, in milliseconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] ipv6 enable",
            "[*HUAWEI-GigabitEthernet1/0/1] ipv6 nd nud reachable-time 10000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\n\nThe IPv6 neighbor reachable time provides the following functions:\n\nControlling the aging time of ND entries on a local Router\nBeing a parameter in an RA message to help a host to generate the neighbor reachable time\n\nEach RA message sent by a Router carries the neighbor reachable time so that all the nodes along the same link can use the same time.\n\nPrerequisites\n\nIPv6 has been enabled on the involved interface using the ipv6 enable command.\n\nConfiguration Impact\n\nA smaller neighbor reachable time set on a Router indicates that the Router can probe the neighbor reachability more quickly but more network bandwidth and CPU resources are occupied. Therefore, on a normal IPv6 network, you are not recommended to set the neighbor reachable time to a smaller value. The default value, 1200000 milliseconds, is recommended.\nThe ipv6 nd nud reachable-time command is circular in nature. That is, if the neighbor reachable times set two times are different, the latest setting takes effect.\n\nPrecautions\n\nCommonly, the neighbor reachable time set on a Router is the same as that carried in an RA message. In the following cases, however, the neighbor reachable time set on a Router is of the default value 1200000 milliseconds whereas the neighbor reachable time carried in the RA message is 0 milliseconds:\n\nThe neighbor reachable time is not set on the Router, that is, the default value is used.\nThe undo ipv6 nd nud reachable-time command is run to restore the default setting.\n\nAfter a host receives an RA message with the neighbor reachable time being 0 milliseconds, it uses the default neighbor reachable time 1200000 milliseconds, consistent with that on the Router."
}