{
    "PageTitle": "ipv6 nd ra router-lifetime",
    "FuncDef": "The ipv6 nd ra router-lifetime command sets the lifetime of the RA messages sent by a Router.\nThe undo ipv6 nd ra router-lifetime command restores the default setting.\nBy default, the lifetime for RA messages is three times of the maximum interval for advertising RA messages.",
    "CLIs": [
        "ipv6 nd ra router-lifetime <ra-lifetime>",
        "undo ipv6 nd ra router-lifetime"
    ],
    "ParentView": [
        "PW-VE interface view",
        "PW-VE sub-interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "GE electrical interface view",
        "Port extension interface view",
        "Serial interface view",
        "Eth-Trunk sub-interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "MP-group interface view",
        "10GE interface view",
        "GE sub-interface view",
        "VBDIF interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "GE interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "100ge sub-interface view",
        "25GE interface view",
        "40GE sub-interface view",
        "Eth-Trunk interface view",
        "10GE sub-interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "ra-lifetime",
            "Info": "Specifies the lifetime of the RA messages sent by a Router.\nThe value is 0 or an integer ranging from 4 to 9000, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] ipv6 enable",
            "[*HUAWEI-GigabitEthernet1/0/1] ipv6 nd ra router-lifetime 1000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA Router adds the lifetime of the RA message to the RA message before sending the RA message to the hosts on the local network segment. The lifetime indicates the validity period of this Router as a default router of these hosts.\nPrerequisites\nIPv6 has been enabled on the involved interface using the ipv6 enable command.\nConfiguration Impact\nIf a host receives an RA message with the lifetime field being 0 from a Router, it does not update the address of this Router in its own default router entries.\nPrecautions\nThe lifetime of the RA messages must be longer than or equal to the interval for sending RA messages. (By default, the maximum and minimum intervals for sending RA messages are 600 seconds and 200 seconds, respectively. You can run the ipv6 nd ra command to set a proper interval.) If the set lifetime of the RA messages is shorter than the set interval for sending RA messages, the system prompts an error. In such a case, you need to re-set the lifetime."
}