{
    "PageTitle": "ipv6 nd ra preference",
    "FuncDef": "The ipv6 nd ra preference command configures the default router preference value in the RA packets.\nThe undo ipv6 nd ra preference command restores the default router preference value in RA packets to be the default value.\nBy default, the router preference of RA packets is medium.",
    "CLIs": [
        "ipv6 nd ra preference { high | medium | low }",
        "undo ipv6 nd ra preference",
        "undo ipv6 nd ra preference { high | medium | low }"
    ],
    "ParentView": [
        "PW-VE interface view",
        "PW-VE sub-interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "GE electrical interface view",
        "Port extension interface view",
        "Serial interface view",
        "Eth-Trunk sub-interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "MP-group interface view",
        "GE sub-interface view",
        "VBDIF interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "GE interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "100ge sub-interface view",
        "25GE interface view",
        "40GE sub-interface view",
        "Eth-Trunk interface view",
        "10GE sub-interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "high",
            "Info": "Specifies the default router preference to be high.\n-"
        },
        {
            "Parameters": "medium",
            "Info": "Specifies the default router preference to be medium.\n-"
        },
        {
            "Parameters": "low",
            "Info": "Specifies the default router preference to be low.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] ipv6 enable",
            "[*HUAWEI-GigabitEthernet1/0/1] undo ipv6 nd ra halt",
            "[*HUAWEI-GigabitEthernet1/0/1] ipv6 nd ra preference high"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf there are multiple Routers on the links connected to a host, the host needs to select suitable Routers based on different destination addresses of the packets to be forwarded. Each Router advertises its default router priority and specific route information to the host so that the host can enhance its own capability of selecting suitable forwarding Routers based on different IP addresses of the packets to be forwarded.\nAfter receiving an RA message that contains route information, the host updates its own routing table. Before sending packets to other devices, the host can search the updated route information to select a suitable route to forward the packets.\nAfter receiving an RA message that contains the default router priority, the host updates its own default router list. If the host does not have any route to select when sending packets to other devices, the host will search the updated router list for the Router with the highest priority. If the Router with the highest priority becomes faulty, the host selects another Router in descending order of priority.\nTo set a default router priority in RA messages, run the ipv6 nd ra preference command. This setting allows the Router with the highest priority to function as the gateway for hosts.\nPrerequisites\nBefore running this command, run the ipv6 enable command on the interface view to enable the IPv6 function.\nBy default, the Router does not advertise RA packets. Therefore, to allow the default router preference to be advertised to the host, you need to run the undo ipv6 nd ra halt command to enable the function of advertising RA packets for the device.\nPrecautions\nIf the system is deleting the binding relationship between an interface and an IPv6 address family VPN instance, you are prompted not to run the ipv6 nd ra preference command."
}