{
    "PageTitle": "display ipv6 nd security timestamp",
    "FuncDef": "The display ipv6 nd security timestamp command displays the time stamp value of the last received and accepted SEND message (RDlast) and the local time at which the last SEND message for this peer is accepted (TSlast). The receiver records the two time values after receiving an SEND message.",
    "CLIs": [
        "display ipv6 nd security timestamp { <interface-name> | <interface-type> <interface-num> }"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "interface-name",
            "Info": "Specifies the name of an interface. That is, the RDlast and the TSlast values of the SEND message on the specified interface is displayed.\n-"
        },
        {
            "Parameters": "interface-type interface-num",
            "Info": "Specifies the type and the number of an interface. That is, the RDlast and the TSlast values of the SEND message on the specified interface is displayed.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display ipv6 nd security timestamp gigabitethernet 1/0/1",
            "Total Number of Timestamp Entries : 2",
            "Peer Address : FE80::1812:16D1:319F:B44F",
            "TSlast       : 4c209e350000",
            "RDlast       : 4c209e350000",
            "                             ",
            "Peer Address : FE80::3066:6FC:B4D7:5891",
            "TSlast       : 4c209e360000",
            "RDlast       : 4c209e360000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nYou can run the display ipv6 nd security timestamp command to view the RDlast and the TSlast values of an SEND message on an interface. Then, you can determine whether the difference between the receive time and the send time of the SEND message is out of the allowed time range based on the following formula.\nWhen a message is received from a new peer:-delta-value TSlast + (RDnew - RDlast) x (1 - drift-value) - fuzz-valuedelta-value, drift-value, and fuzz-value: parameters in the ipv6 nd security timestamp commandRDnew: the local time at which the new SEND message is receivedRDlast: the local time at which the last SEND message for this peer is acceptedTSnew: the timestamp value present in the new received SEND message (the time is recorded by the sender in the Timestamp option in the newly sent ND message)TSlast: the timestamp value of the last received and accepted SEND message (the time is recorded by the sender in the Timestamp option in the last sent ND message)\n\nPrerequisites\nIPv6 has been enabled on the involved interface using the ipv6 enable command in the interface view.\nFollow-up Procedure\nRun the ipv6 nd security strict command to enable the strict security mode on the interface.\nPrecautions\nIf no neighbor relationship is set up or no SEND message is transmitted between a local interface and a remote interface, running the display ipv6 nd security timestamp command does not display any command output."
}