{
    "PageTitle": "ipv6 nd stale-timeout (Interface view)",
    "FuncDef": "The ipv6 nd stale-timeout command sets the timeout period of the STALE state of ND entries.\nThe undo ipv6 nd stale-timeout command restores the default setting.\nBy default, the stale state aging time of ND entries is the same as that configured in the system view.",
    "CLIs": [
        "ipv6 nd stale-timeout <seconds>",
        "undo ipv6 nd stale-timeout"
    ],
    "ParentView": [
        "100ge sub-interface view",
        "100GE interface view",
        "10GE sub-interface view",
        "10GE interface view",
        "25GE sub-interface view",
        "25GE interface view",
        "400GE sub-interface view",
        "400GE interface view",
        "40GE sub-interface view",
        "40GE interface view",
        "50GE sub-interface view",
        "50GE interface view",
        "Eth-Trunk sub-interface view",
        "Eth-Trunk interface view",
        "GE optical interface view",
        "GE sub-interface view",
        "GE interface view",
        "GE electrical interface view",
        "Global VE sub-interface view",
        "PW-VE sub-interface view",
        "PW-VE interface view",
        "VBDIF interface view",
        "VE sub-interface view",
        "VLANIF interface view",
        "Port extension interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "seconds",
            "Info": "Specifies the timeout period of the STALE state of ND entries.\nThe value is an integer that ranges from 60 to 172800, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] ipv6 enable",
            "[*HUAWEI-GigabitEthernet1/0/1] ipv6 nd stale-timeout 3600"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe STALE state of an ND entry indicates that whether the neighbor is reachable is unknown. Probing whether the neighbor is reachable is not performed unless there is a packet to be sent to this neighbor.\nThe timeout period of the STALE state of ND entries is a variable. If you want to quickly clear invalid ND entries, you can set the timeout period to a smaller value through the ipv6 nd stale-timeout command to speed up entry aging.\nPrerequisites\nAfter the ipv6 nd stale-timeout command is run, the status of ND entries can be updated after the timeout period of the STALE state of ND entries expires.\nConfiguration Impact\nAfter the ipv6 nd stale-timeout command is run, the status of ND entries can be updated after the timeout period of the STALE state of ND entries expires.\nPrecautions\nThe system probes the validity of ND entries again after the timeout period of the STALE state of ND entries expires. If the neighbor is reachable, the ND entry status changes to REACHABLE; otherwise, the ND entry is deleted.\nAn ND entry contains information about the IPv6 address of the neighbor, link-layer address of the neighbor, status of the ND entry, interface name of the ND entry, time when the ND entry is created, VLAN ID of the ND entry, and VPN name of the neighbor. For detailed explanation, see the description of the output of the display ipv6 neighbors command."
}