{
    "PageTitle": "ipv6 nd hop-limit",
    "FuncDef": "The ipv6 nd hop-limit command sets the maximum number of hops through which IPv6 unicast packets sent by the Router are allowed to pass.\nThe undo ipv6 nd hop-limit command restores the default setting.\nBy default, the IPv6 unicast packets sent by the Router can pass through 64 hops.",
    "CLIs": [
        "ipv6 nd hop-limit <limit>",
        "undo ipv6 nd hop-limit"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "limit",
            "Info": "Specifies the hop limit.\nIt is an integer ranging from 1 to 255."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 nd hop-limit 100"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA hop limit on the Router provides the following functions:\nControlling the number of hops through which IPv6 unicast packets are allowed to pass.Helping a host automatically generate a hop limit\n\nPrerequisites\nIPv6 has been enabled on the involved interface using the ipv6 enable command.\nConfiguration Impact\nThe hop limit for unicast packets is set using the ipv6 nd hop-limit command in the system view.\nThe hop limit for RA messages can be set using the\nipv6 nd hop-limit command in the system view, or can be set using the\nipv6 nd ra hop-limit command in the interface view:\nIf the hop limit for RA messages is not set in the interface view or in the system view, the hop limit for RA messages is 64 by default.If the hop limit for RA messages is not set in the interface view but in the system view, the configuration in the system view takes effect.If the hop limit for RA messages is set in the interface view, the configuration in the interface view takes effect, no matter whether the hop limit is set in the system view.\n\nPrecautions\nThe hop limit for IPv6 unicast packets sent by the Router is usually of the same value as the hop limit carried in an RA message. In the following cases, however, the hop limit for IPv6 unicast packets sent by the Router is 64 (the default value) whereas the hop limit carried in an RA message is 0.\nNo hop limit is set for IPv6 unicast packets sent by the Router.The undo ipv6 nd hop-limit command is run to restore the default hop limit set on the Router.\nAfter receiving an RA message with the hop limit of 0, a host uses the default hop limit 64, which is the same as the default hop limit on the Router."
}