{
    "PageTitle": "default (OSPF view)",
    "FuncDef": "The default command configures default parameters for OSPF to import external routes. The parameters include the cost, type (Type 1 or Type 2), and tag.\nThe undo default command restores the default setting.\nBy default, the default cost of the external routes is 1; the type of the imported external routes is Type 2; the default tag value is 1.",
    "CLIs": [
        "default { cost { <costvalue> | inherit-metric } | tag <tagvalue> | type <typevalue> } *",
        "undo default { cost [ { <costvalue> | inherit-metric } ] | tag [ <tagvalue> ] | type [ <typevalue> ] } *"
    ],
    "ParentView": [
        "OSPF view"
    ],
    "ParaDef": [
        {
            "Parameters": "cost costvalue",
            "Info": "Specifies the default cost of the external routes imported by OSPF.\nThe value is an integer ranging from 0 to 16777214. The default value is 1."
        },
        {
            "Parameters": "inherit-metric",
            "Info": "Indicates that the cost of the imported route is the one carried in the route. If no cost is specified, the default cost set using the default command is used.\n-"
        },
        {
            "Parameters": "tag tagvalue",
            "Info": "Specifies the tag of the external routes.\nThe value is an integer ranging from 0 to 4294967295. The default value is 1."
        },
        {
            "Parameters": "type typevalue",
            "Info": "Specifies the type of the external routes.\nThe value is 1 or 2.\n1: Type 1 external route2: Type 2 external route\nThe default value is 2."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospf 100",
            "[*HUAWEI-ospf-100] default cost 10 tag 100 type 2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe imported external routes carry various parameters that can change the priorities and next hops of those routes in the OSPF routing table.\nBy setting default parameters for OSPF to import external routes, you can control OSPF route selection.\nThe route tag is used to identify protocol-related information. For example, it can be used to differentiate AS numbers when OSPF receives BGP routes. In addition, configuring tag can filter OSPF routes carrying tags.\nFollow-up Procedure\nThe default (OSPF) command has the lowest priority. Therefore, you need to check whether other commands are configured before running this command. Otherwise, the function of this command does not take effect.\nPrecautions\nYou can run the following commands to set the cost of imported routes. The following commands are listed in descending order of cost priorities.\napply costimport-route (OSPF)default (OSPF)\nThe priority of the default (OSPF) command is the lowest among the three commands. Therefore, ensure that the other two commands are not configured when configuring this command. Otherwise, this command cannot take effect."
}