{
    "PageTitle": "display ospf topology verbose",
    "FuncDef": "The display ospf topology verbose command displays the SPF tree information depending on process and area for OSPFv2.",
    "CLIs": [
        "display ospf [ <process-id> ] topology [ area { <area-id> | <area-ipv4> } ] verbose"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "process-id",
            "Info": "Specifies the ID of an OSPF process.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "area area-id",
            "Info": "Specifies the ID of an OSPF area.\nThe value is an integer ranging from 0 to 4294967295."
        },
        {
            "Parameters": "area-ipv4",
            "Info": "Specifies the ID of an OSPF area in IP address format.\nThe value is in the format of an IPv4 address."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display ospf topology verbose",
            "",
            "          OSPF Process 1 with Router ID 1.1.1.1",
            "Bits :",
            "B - ABR    E - ASBR    V - VIRTUAL    NT - NSSA translator",
            "",
            "Shortest Path Tree for Area: 0.0.0.0",
            "",
            "Node: Router    1.1.1.1    Cost: 0 Cost(tunnel): 0",
            "    BitFlags : B",
            "    Segment Routing Info:",
            "      Algorithm: SPF",
            "      SRGB: [160000 - 170000]",
            "    Neighbors: 1 (Children:(1) Parents:(0))",
            "    Neighbor List:",
            "        router  6.6.6.6, Child, cost: 100"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe display ospf topology command displays information about the topology based on which OSPF routes are calculated.\nPrerequisites\nTo view information about the topology based on which OSPF routes are calculated, including the time when route calculation is performed, cause of route calculation, and the number of changed routes, run the display ospf topology command. The command output helps you diagnose OSPF route flapping.\nIf segment routing is configured and a segment routing next hop exists, the display ospf topology verbose command displays the segment routing next hop. If segment routing anti-micro loop is configured and the device is in the anti-micro loop state, the display ospf topology verbose command displays the label stack of segment routing anti-micro loop."
}