{
    "PageTitle": "import-route limit",
    "FuncDef": "The import-route limit command configures a limit on the number of LSAs generated when an OSPF process imports external routes.\nThe undo import-route limit command deletes the limit configured on the number of LSAs generated when an OSPF process imports external routes.\nThe import-route limit command configures a limit on the number of LSAs generated when an OSPFv3 process imports external routes.\nThe undo import-route limit command deletes the limit configured on the number of LSAs generated when an OSPFv3 process imports external routes.\nBy default, OSPF does not limit the number of LSAs generated by imported external routes.",
    "CLIs": [
        "import-route limit <limit-number> [ threshold-alarm { upper-limit <upper-limit-value> | lower-limit <lower-limit-value> } * ]",
        "undo import-route limit [ <limit-number> ] [ threshold-alarm [ upper-limit <upper-limit-value> | lower-limit <lower-limit-value> ] * ]"
    ],
    "ParentView": [
        "OSPFv3 view",
        "OSPF view"
    ],
    "ParaDef": [
        {
            "Parameters": "limit-number",
            "Info": "Specifies a limit on the number of LSAs generated when an OSPFv3 process imports external routes.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "threshold-alarm",
            "Info": "Indicates an alarm threshold.\n-"
        },
        {
            "Parameters": "upper-limit upper-limit-value",
            "Info": "Specifies the upper alarm threshold, in percentage.\nThe value is an integer ranging from 1 to 100. The default value is 80."
        },
        {
            "Parameters": "lower-limit lower-limit-value",
            "Info": "Specifies the lower alarm threshold, in percentage.\nThe value is an integer ranging from 1 to 100. The default value is 70."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospfv3 100",
            "[*HUAWEI-ospfv3-100] import-route limit 3000 threshold-alarm upper-limit 85 lower-limit 75"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospf 100",
            "[*HUAWEI-ospf-100] import-route limit 3000 threshold-alarm upper-limit 85 lower-limit 75"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf OSPF imports a large number of external routes and advertises them to a device with a smaller routing table capacity, the device may restart unexpectedly. To address this problem, run the import-route limit command to configure a limit on the number of LSAs generated when an OSPF process imports external routes. Check the overload status based on the value of the Current status field in the display ospf brief command output.\nNormal: The number of LSAs generated when an OSPF process imports external routes is less than or equal to the lower alarm threshold (in percentage) multiplied by the maximum number allowed.Approach limit: The number of LSAs generated when an OSPF process imports external routes is approaching (reaching or exceeding 90% of) the upper alarm threshold.Exceed limit: The number of LSAs generated when an OSPF process imports external routes has reached or exceeded the maximum number allowed.\nEnsure that upper-limit-value is greater than or equal to lower-limit-value.\nThe system generates alarms based on the following rules:\nThe system generates the OSPF_1.3.6.1.4.1.2011.5.25.155.31.7 hwOspfv2ImportAseRouteThreshold alarm if the number of ASE LSAs generated when an OSPF process imports external routes exceeds the upper alarm threshold (in percentage) multiplied by the maximum number allowed.The system generates the OSPF_1.3.6.1.4.1.2011.5.25.155.31.8 hwOspfv2ImportAseRouteThresholdClear alarm if the number falls to or below the lower alarm threshold (in percentage) multiplied by the maximum number allowed.The system generates the OSPF_1.3.6.1.4.1.2011.5.25.155.31.9 hwOspfv2ImportAseRouteExceed alarm if the number of ASE LSAs generated when an OSPF process imports external routes is greater than or equal to the maximum number allowed.The system generates the OSPF_1.3.6.1.4.1.2011.5.25.155.31.10 hwOspfv2ImportAseRouteExceedClear alarm if the number of ASE LSAs generated when an OSPF process imports external routes falls below 90% of the maximum number allowed.The system generates the OSPF_1.3.6.1.4.1.2011.5.25.155.31.11 hwOspfv2ImportNssaRouteThreshold alarm if the number of NSSA LSAs generated when an OSPF process imports external routes exceeds the upper alarm threshold (in percentage) multiplied by the maximum number allowed.The system generates the OSPF_1.3.6.1.4.1.2011.5.25.155.31.12 hwOspfv2ImportNssaRouteThresholdClear alarm if the number falls to or below the lower alarm threshold (in percentage) multiplied by the maximum number allowed.The system generates the OSPF_1.3.6.1.4.1.2011.5.25.155.31.13 hwOspfv2ImportNssaRouteExceed alarm if the number of NSSA LSAs generated when an OSPF process imports external routes is greater than or equal to the maximum number allowed.\nThe system generates the OSPF_1.3.6.1.4.1.2011.5.25.155.31.14 hwOspfv2ImportNssaRouteExceedClear alarm if the number of NSSA LSAs generated when an OSPF process imports external routes falls below 90% of the maximum number allowed.\nIf OSPFv3 imports a large number of external routes and advertises them to a device with a smaller routing table capacity, the device may restart unexpectedly. To address this problem, run the import-route limit command to configure a limit on the number of LSAs generated when an OSPFv3 process imports external routes.\nEnsure that upper-limit-value is greater than or equal to lower-limit-value.\nThe system generates alarms based on the following rules:\nThe system generates the OSPFV3_1.3.6.1.4.1.2011.5.25.147.0.19 hwOspfv3ImportAseRouteExceed alarm if the number of AS-external-LSAs generated when an OSPFv3 process imports external routes is greater than or equal to the maximum number allowed.The system generates the OSPFV3_1.3.6.1.4.1.2011.5.25.147.0.20 hwOspfv3ImportAseRouteExceedClear alarm if the number of AS-external-LSAs generated when an OSPFv3 process imports external routes falls below 90% of the maximum number allowed.The system generates the OSPFV3_1.3.6.1.4.1.2011.5.25.147.0.17 hwOspfv3ImportAseRouteThreshold alarm if the number of AS-external-LSAs generated when an OSPFv3 process imports external routes exceeds limit-number * upper-limit-value /100.The system generates the OSPFV3_1.3.6.1.4.1.2011.5.25.147.0.18 hwOspfv3ImportAseRouteThresholdClear alarm if the number falls to or below limit-number * lower-limit-value /100."
}