{
    "PageTitle": "lsdb-overflow-limit",
    "FuncDef": "The lsdb-overflow-limit command configures a maximum number of external routes supported by the OSPF LSDB.\nThe undo lsdb-overflow-limit command deletes the configured maximum number of external routes supported by the OSPF LSDB.\nBy default, the maximum number of external routes supported by the OSPF LSDB is not set.",
    "CLIs": [
        "lsdb-overflow-limit <number>",
        "undo lsdb-overflow-limit [ <number> ]"
    ],
    "ParentView": [
        "OSPF view"
    ],
    "ParaDef": [
        {
            "Parameters": "number",
            "Info": "Specifies the maximum number of external routes supported by the OSPF LSDB.\nThe value is an integer ranging from 1 to 1000000."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospf 100",
            "[*HUAWEI-ospf-100] lsdb-overflow-limit 400000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the number of external routes (carried in Type 5 LSAs) imported by OSPF exceeds the value defined, excess external routes are discarded. To address this problem, run the lsdb-overflow-limit command to configure a maximum number of external routes supported by the OSPF LSDB. If the number of external routes imported by OSPF exceeds the configured maximum number, the device deletes self-generated non-default external routes to ensure the proper forwarding of other external routes. If a neighbor state is not full, the device stops establishing the neighbor and the neighbor state falls back to down.\nIf OSPF is in LSDB overflow status is displayed in the output of the display ospf brief command, the OSPF LSDB in the current OSPF process is overloaded. If OSPF LSDB is approaching overflow limit is displayed in the command output, the number of external routes in the OSPF LSDB has reached or exceeded 90% of the maximum number.\nThe device generates alarms based on the following rules:\nWhen the number of external routes in the OSPF LSDB reaches or exceeds 90% of the maximum number, the device generates the OSPF_1.3.6.1.4.1.2011.5.25.155.31.15 hwOspfv2LsdbApproachingOverflow alarm.\nWhen the number of external routes in the OSPF LSDB falls below 90% of the maximum number, the device generates the OSPF_1.3.6.1.4.1.2011.5.25.155.31.16 hwOspfv2LsdbApproachingOverflowClear alarm.\nWhen the number of external routes in the OSPF LSDB reaches the maximum number, the device generates the OSPF_1.3.6.1.4.1.2011.5.25.155.31.17 hwOspfv2LsdbOverflow alarm.\nWhen the number of external routes in the OSPF LSDB falls below the maximum number, the device generates the OSPF_1.3.6.1.4.1.2011.5.25.155.31.18 hwOspfv2LsdbOverflowClear alarm."
}