{
    "PageTitle": "silent-interface (OSPF view)",
    "FuncDef": "The silent-interface command disables an interface from receiving and sending OSPF packets.\nThe undo silent-interface command restores the default setting.\nBy default, an interface can receive and send OSPF packets.",
    "CLIs": [
        "silent-interface { all | { <interface-name> | <interface-type> <interface-number> } }",
        "undo silent-interface { all | { <interface-name> | <interface-type> <interface-number> } }"
    ],
    "ParentView": [
        "OSPF view"
    ],
    "ParaDef": [
        {
            "Parameters": "all",
            "Info": "Indicates all interfaces in a specified process.\n-"
        },
        {
            "Parameters": "interface-type",
            "Info": "Specifies the interface type.\n-"
        },
        {
            "Parameters": "interface-number",
            "Info": "Specifies the interface number.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospf 100",
            "[*HUAWEI-ospf-100] silent-interface GigabitEthernet2/0/0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo prevent the local router from sending its OSPF routing information to other routers on a network and from receiving routing update information advertised by other routers, run the silent-interface command.\nDisabling interfaces from receiving or sending OSPF packets is a solution to routing loops.\nConfiguration Impact\nAfter an OSPF interface is set to be in the silent state, the interface can still advertise its direct routes. Hello packets on the interface, however, will be blocked, and no neighbor relationship can be established on the interface. This can enhance the networking adaptability of OSPF and reduce the consumption of system resources.\nPrecautions\nIf the undo silent-interface command has been run in the current process, running the silent-interface all command causes the undo silent-interface command configuration to be deleted. As a result, the OSPF neighbor relationship established using the interface specified in the undo silent-interface command goes down."
}