{
    "PageTitle": "ospf network-type p2p peer-ip-ignore",
    "FuncDef": "The ospf network-type p2p peer-ip-ignore command sets the network type for an OSPF interface.\nBy default, the network type of an interface is determined by the physical interface.",
    "CLIs": [
        "ospf network-type p2p peer-ip-ignore"
    ],
    "ParentView": [
        "100GE interface view",
        "10GE interface view",
        "400GE interface view",
        "40GE interface view",
        "50GE interface view",
        "FlexE interface view",
        "GE optical interface view",
        "GE electrical interface view",
        "VLANIF interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "peer-ip-ignore",
            "Info": "Disables network segment check when IP address unnumbering is not configured for a P2P interface changed from a broadcast interface and the interface tries to establish an OSPF neighbor relationship. By default, if peer-ip-ignore is not specified in the command, OSPF checks the network segment of the two ends during which an OSPF neighbor relationship is to be established. Specifically, OSPF performs an AND operation on the local subnet mask and the local IP address and on the local subnet mask and the remote IP address. An OSPF neighbor relationship can be established only when the results on the two ends are the same.\n-"
        },
        {
            "Parameters": "p2p",
            "Info": "Indicates that the network type of the interface is changed to point-to-point.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] ospf network-type p2p peer-ip-ignore"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen link layer protocols remain unchanged, you can change network types and configure OSPF features to flexibly build networks.\nIf there are only two devices that run OSPF in the same network segment, the network type of an interface can be changed to P2P.\nPrecautions\nGenerally, the network types of two OSPF interfaces on the both ends of the link must be identical. Otherwise, the two interfaces cannot set up a neighbor relationship."
}