{
    "PageTitle": "ospf link-quality low incr-cost",
    "FuncDef": "The ospf link-quality low incr-cost command enables an OSPF interface to adjust the link cost based on link quality.\nThe undo ospf link-quality low incr-cost command disables an OSPF interface from adjusting the link cost based on link quality.\nBy default, an OSPF interface cannot adjust the link cost based on link quality.",
    "CLIs": [
        "ospf link-quality low incr-cost { max-reachable | <cost> }",
        "undo ospf link-quality low incr-cost"
    ],
    "ParentView": [
        "FlexE interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "25GE sub-interface view",
        "100GE interface view",
        "GE electrical interface view",
        "50GE interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Eth-Trunk interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "max-reachable",
            "Info": "Adjusts the link cost of an OSPF interface to the maximum link cost 65535.\n-"
        },
        {
            "Parameters": "cost",
            "Info": "Specifies the link cost adjustment value.\nAfter you specify this parameter:\nIf the link quality decreases, the link cost equals the original link cost plus the adjustment value. The maximum link cost allowed is 65535.If the link quality increases, the original link cost is restored.\nThe value is an integer ranging from 1 to 65534."
        },
        {
            "Parameters": "low",
            "Info": "Configures an OSPF interface to increase the link cost when the link quality is low.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] ospf enable area 1",
            "[*HUAWEI-GigabitEthernet1/0/0] ospf link-quality low incr-cost max-reachable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA bit error refers to the deviation between a bit that is sent and the bit that is received. Bit errors caused by optical fiber aging or optical signal jitter are inevitable on carrier networks. During data transmission, a high bit error rate will degrade or even interrupt services.\nTo ensure network reliability, run the ospf link-quality low incr-cost command to configure an OSPF interface to adjust the link cost based on link quality. If an OSPF interface detects that its link quality is low, the OSPF interface increases the link cost, so that its link, which has a higher bit error rate, is not used by the optimal route. After the link quality restores, the OSPF interface restores the link cost.\nPrerequisites\nOSPF has been enabled using the ospf enable command in the interface view."
}