{
    "PageTitle": "ospf smart-discover",
    "FuncDef": "The ospf smart-discover command enables smart-discover on an interface.\nThe undo ospf smart-discover command disables smart-discover from an interface.\nBy default, smart-discover is disabled on interfaces.",
    "CLIs": [
        "ospf smart-discover",
        "undo ospf smart-discover"
    ],
    "ParentView": [
        "Tunnel interface view",
        "VBDIF interface view",
        "FlexE interface view",
        "Cellular channel interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "100GE interface view",
        "GE electrical interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "GMPLS-UNI interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Eth-Trunk interface view",
        "POS interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] ospf smart-discover"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn most cases, devices periodically send Hello packets through OSPF interfaces. By sending Hello packets, devices set up and maintain neighbor relationships, and elect the DR and BDR on the multi-access network (broadcast or NBMA network). When setting up neighbor relationships or electing the DR and BDR on the multi-access network, interfaces can send Hello packets only when the Hello timer expires. This slows down the establishment of neighbor relationships and election of the DR and BDR.\nAfter smart-discover is configured, when the status of the neighbor relationship changes or the DR and BDR on the multi-access network changes, the device can send Hello packets to its neighbor immediately without waiting for the Hello timer to expire.\nProcedure\nOn broadcast and NBMA networks, neighbor relationships can be rapidly set up and a DR and a BDR can be rapidly elected.\nWhen the neighbor status becomes 2-way for the first time or returns to Init from the 2-way or higher state, the smart-discover-enabled interface sends Hello packets to a neighbor without waiting for the Hello timer to expire when detecting that the neighbor status changes.When the status of the interface functioning as the DR or BDR on the multi-access network changes, the smart-discover-enabled interface sends unsolicited Hello packets on the network segment and then runs for the DR or BDR.\nThe principle of setting up adjacencies rapidly on P2P or P2MP networks is the same as that on broadcast and NBMA networks.\n\nImplementation Procedure\nOn broadcast and NBMA networks, neighbor relationships can be rapidly set up and a DR and a BDR can be rapidly elected.\nWhen the neighbor status becomes 2-way for the first time or returns to Init from the 2-way or higher state, the smart-discover-enabled interface sends Hello packets to a neighbor without waiting for the Hello timer to expire when detecting that the neighbor status changes.When the status of the interface functioning as the DR or BDR on the multi-access network changes, the smart-discover-enabled interface sends unsolicited Hello packets on the network segment and then runs for the DR or BDR.\nThe principle of setting up adjacencies rapidly on P2P or P2MP networks is the same as that on broadcast and NBMA networks.\n\nConfiguration Impact\nThe interval at which Hello packets are sent by an interface is determined by the configured interval on the interface.\nPrecautions\nThe default interval at which Hello packets are sent varies with the network type."
}