{
    "PageTitle": "maximum load-balancing (OSPF view)",
    "FuncDef": "The maximum load-balancing command sets the maximum number of equal-cost routes for load balancing.\nThe undo maximum load-balancing command restores the default setting.\nThe default maximum number of equal-cost OSPF routes for load balancing is 64.",
    "CLIs": [
        "maximum load-balancing <number>",
        "undo maximum load-balancing"
    ],
    "ParentView": [
        "OSPF view"
    ],
    "ParaDef": [
        {
            "Parameters": "number",
            "Info": "Specifies the maximum number of equal-cost routes.\nThe value is an integer that ranges from 1 to 64."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospf 100",
            "[*HUAWEI-ospf-100] maximum load-balancing 2"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospf 100",
            "[*HUAWEI-ospf-100] undo maximum load-balancing"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a routing protocol discovers multiple routes with the same cost to one destination, they can carry out load balancing. The maximum load-balancing command sets the maximum number of equal-cost routes that can carry out load balancing. This optimizes route selection rules and meet traffic forwarding requirements on a complex network.\nConfiguration Impact\nPackets will be load-balanced by multiple equal-cost routes to one destination.\nLoad balancing is performed either per-destination or per-packet. By default, packets are load-balanced per-destination.\nThe undo maximum load-balancing command restores the default equal-cost routes that are discovered by OSPF for load balancing.\nFollow-up Procedure\nIf the number of equal-cost OSPF routes is greater than the value set using the maximum load-balancing command and specified routes need to be used for load balancing, run the nexthop ip-address weight value command to specify a high priority for the routes.\nPrecautions\nTo disable load balancing, set the value of number to 1."
}