{
    "PageTitle": "ospf dr-priority",
    "FuncDef": "The ospf dr-priority command sets the priority of an interface that runs for the DR or BDR.\nThe undo ospf dr-priority command restores the default value.\nBy default, the priority is 1.",
    "CLIs": [
        "ospf dr-priority <priovalue>",
        "undo ospf dr-priority"
    ],
    "ParentView": [
        "Tunnel interface view",
        "VBDIF interface view",
        "FlexE interface view",
        "Cellular channel interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "100GE interface view",
        "GE electrical interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "GMPLS-UNI interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Eth-Trunk interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "priovalue",
            "Info": "Specifies the priority of the interface that runs for the DR or BDR. The greater the value, the higher the priority.\nThe value is an integer ranging from 0 to 255. The default value is 1."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] ospf dr-priority 8"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe priority of an interface determines whether the interface is qualified to be a DR or BDR. The interface with the highest priority is elected as the DR or BDR. If the priority of an interface on a device is 0, the device cannot be elected as a DR or BDR. On a broadcast or an NBMA network, you can set the priority of an interface to control the DR or BDR selection.\nConfiguration Impact\nWhen the DR and BDR are elected on a network segment, they send DD packets to all neighboring nodes and set up adjacencies with all neighboring nodes.\nPrecautions\nRestarting or shutting down an interface will interrupt the OSPF adjacency between devices. Therefore, exercise caution when performing the operation.\nIf the priority of a device is re-configured, the DR or BDR on the network will not be re-elected. To change the DR or BDR, use either of the following methods. This, however, will interrupt the OSPF adjacency between devices. Therefore, exercise caution when performing the operation.\nRestart the OSPF processes on all devices.Run the shutdown and undo shutdown commands on the interfaces where OSPF adjacencies are set up.\nIn OSPF, the priority cannot be configured for null interfaces."
}