{
    "PageTitle": "local-mt enable (OSPF view)",
    "FuncDef": "The local-mt enable command enables OSPF local multicast topology (MT).\nThe undo local-mt enable command disables OSPF local MT.\nBy default, OSPF local MT is disabled.",
    "CLIs": [
        "local-mt enable",
        "undo local-mt enable"
    ],
    "ParentView": [
        "OSPF view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospf",
            "[*HUAWEI-ospf-1] enable traffic-adjustment",
            "[*HUAWEI-ospf-1] local-mt enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen multicast and an IGP Shortcut-enabled MPLS TE tunnel are configured on a network, the outbound interface of the route calculated by an IGP may not be a physical interface but a TE tunnel interface. The TE tunnel interface on the Device sends multicast Join packets over a unicast route to the multicast source address. The multicast Join packets are transparent to the Device from which the TE tunnel passes. As a result, the Device cannot generate multicast forwarding entries.\nTo resolve this problem, enable local MT. If the outbound interface of a calculated route is an IGP Shortcut-enabled TE tunnel interface, the routing management (RM) module creates an independent Multicast IGP (MIGP) routing table. Multicast packets are then forwarded along the routes in the MIGP routing table.\nPrecautions\nTo control the number of entries in the MIGP routing table and speed up the MIGP route lookup, run the local-mt filter-policy command to configure filtering conditions so that the device adds only the routes that match the filtering conditions to the multicast source address to the MIGP routing table. Configure a routing policy before you enable local MT, because if an excessive number of routes to a non-multicast source address exist in an MIGP routing table, the number of entries may exceed the upper limit.Local MT takes effect only on the OSPF process of a public network instance.Local MT does not support Forwarding Adjacency (FA)."
}