{
    "PageTitle": "hostname",
    "FuncDef": "The hostname command enables the OSPF dynamic hostname function.\nThe undo hostname command disables the OSPF dynamic hostname function.\nBy default, the OSPF dynamic hostname function is disabled.",
    "CLIs": [
        "hostname [ <host-name> ]",
        "undo hostname"
    ],
    "ParentView": [
        "OSPF view"
    ],
    "ParaDef": [
        {
            "Parameters": "host-name",
            "Info": "Specifies the OSPF hostname.\nThe value is a string of 1 to 255 characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospf 100",
            "[*HUAWEI-ospf-100] opaque-capability enable",
            "[*HUAWEI-ospf-100] hostname BLR"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo facilitate network management, configure dynamic hostnames to identify routers. After you run the hostname command to configure a dynamic hostname for a router, the router generates a router information (RI) Opaque LSA.\nRI Opaque LSAs are generated based on the following rules:\nThe rules based on which RI Opaque LSAs are generated on ASBRs are as follows:ASBRs that are connected to NSSA or Stub areas generate and flood Type 10 RI Opaque LSAs (Type 10 RI LSAs).ASBRs that are not connected to NSSA or Stub areas generate and flood AS RI LSAs (Type 11 RI LSAs).ASBRs that are connected to NSSA or Stub areas only do not generate RI Opaque LSAs within the AS.\nABRs and internal area routers flood RI Opaque LSAs to its connected areas.\nAfter a router receives a RI Opaque LSA, you can run the display ospf hostname-table command on the router to check the mapping between the router ID and the dynamic hostname.\n\nPrerequisites\nThe Opaque LSA capability has been enabled using the opaque-capability enable command.\nPrecautions\nIf you specify in this command, is advertised as the dynamic hostname. If no is specified in this command, the hostname specified in the sysname command is advertised as the dynamic hostname."
}