{
    "PageTitle": "ospf",
    "FuncDef": "The ospf command creates and runs an OSPF process.\nThe undo ospf command terminates an OSPF process.\nBy default, OSPF is disabled, that is, no OSPF process runs.",
    "CLIs": [
        "ospf <process-id> [ router-id <route-id> | vpn-instance <vpname> ] *",
        "ospf [ router-id <route-id> | vpn-instance <vpname> ] *",
        "undo ospf <process-id>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "process-id",
            "Info": "Specifies the ID of an OSPF process.\nThe value is an integer ranging from 1 to 4294967295. The default value is 1."
        },
        {
            "Parameters": "router-id route-id",
            "Info": "Specifies a router ID.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "vpn-instance vpname",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance huawei",
            "[*HUAWEI-vpn-instance-huawei] ipv4-family",
            "[*HUAWEI-vpn-instance-huawei-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-huawei] quit",
            "[*HUAWEI] ospf 100 router-id 10.10.10.1 vpn-instance huawei"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nYou can set OSPF parameters only after an OSPF process is created.\nOSPF supports multi-process. More than one OSPF process can run on the same device, and is independent of each other. Route interaction between different OSPF processes is similar to route interaction between different routing protocols.\nThe ID of an OSPF router can be configured. If no ID is specified for an OSPF router, the system automatically selects the largest IP address in loopback addresses as the router ID. If no loopback interface is configured, the largest IP address configured on the interface is selected as the router ID.\nIn any of the following situations, the router ID is re-selected:\nThe ospf command is used to re-configure an OSPF router ID.The system router ID is re-configured, and then the OSPF process is restarted.The IP address of the original system router ID is deleted, and then the OSPF process is restarted.\n\nConfiguration Impact\nAfter an OSPF process is disabled using undo ospf command, the receive end still maintains the LSAs generated by this OSPF process. These invalid LSAs occupy system memory and are not deleted until the LSA age field (aging time) reaches 3600 seconds.\nPrecautions\nAn interface on a device belongs to only one OSPF process.\nIf a VPN instance is specified, the OSPF process specified in this command belongs to this VPN instance. If no VPN instance is specified, the OSPF process specified in this command belongs to the global VPN instance. vpn-instance-name cannot be changed after being specified.\nSetting a unique router ID for each process on a device is recommended. If an incorrect operation or planning causes a router ID conflict between processes, route flapping occurs.\nBefore you run the undo ospf process-id command to delete an OSPF process, check whether SR is enabled. If SR is enabled, disable it and then delete the OSPF process. If SR remains and the OSPF process is reconfigured, the Opaque capability is changes, resulting in the remaining Opaque LSAs.\nRunning the undo ospf process-id command will also delete all configurations from the OSPF view. Therefore, exercise caution when running this command."
}