{
    "PageTitle": "ospf cost-fallback",
    "FuncDef": "The ospf cost-fallback multi-area command configures cost-fallback parameters for an Eth-Trunk multi-area adjacency interface.\nThe undo ospf cost-fallback multi-area command deletes the cost-fallback parameters configured for an Eth-Trunk multi-area adjacency interface.\nThe ospf cost-fallback command configures cost-fallback parameters for an Eth-Trunk interface.\nThe undo ospf cost-fallback command deletes cost-fallback parameter configurations of an Eth-Trunk interface.\nBy default, no cost-fallback parameters are configured for Eth-Trunk interfaces.",
    "CLIs": [
        "ospf cost-fallback <fallbackcost> threshold <fallbackbw> [ multi-area { <area-id> | <area-id> } ]",
        "undo ospf cost-fallback [ <fallbackcost> threshold <fallbackbw> ] [ multi-area { <area-id> | <area-id> } ]"
    ],
    "ParentView": [
        "Eth-Trunk interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "fallbackcost",
            "Info": "Specifies a fallback cost.\nThe value is an integer ranging from 1 to 65535."
        },
        {
            "Parameters": "threshold fallbackbw",
            "Info": "Specifies a fallback bandwidth threshold.\nThe value is an integer ranging from 1 to 4294967295, in Mbit/s."
        },
        {
            "Parameters": "area-id",
            "Info": "Specifies the ID of an OSPF area.\nThe value can be a decimal integer ranging from 0 to 4294967295 or in the format of an IP address."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Eth-Trunk 1",
            "[~HUAWEI-Eth-Trunk1] ospf cost-fallback 500 threshold 260"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospf 1",
            "[*HUAWEI-ospf-1] area 0",
            "[*HUAWEI-ospf-1-area-0.0.0.0] quit",
            "[*HUAWEI-ospf-1] area 1",
            "[*HUAWEI-ospf-1-area-0.0.0.1] quit",
            "[*HUAWEI-ospf-1] quit",
            "[*HUAWEI] interface Eth-Trunk 1",
            "[*HUAWEI-Eth-Trunk1] ospf enable 1 area 0",
            "[*HUAWEI-Eth-Trunk1] ospf enable multi-area 1",
            "[*HUAWEI-Eth-Trunk1] ospf cost-fallback 500 threshold 260 multi-area 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a member interface of an Eth-Trunk multi-area adjacency interface goes down, the remaining bandwidth of the Eth-Trunk multi-area adjacency interface may fail to meet user requirements. As a result, user services are affected. To address this problem, run the ospf cost-fallback multi-area command to configure cost-fallback parameters (fallback cost and bandwidth threshold) for the Eth-Trunk multi-area adjacency interface; if the remaining bandwidth of the interface goes below the bandwidth threshold, the cost of the interface is changed to the fallback cost which is higher than the normal cost, and traffic is then switched to an alternative path; when the remaining bandwidth of the interface reaches or exceeds the bandwidth threshold, the original cost is restored.\nPrerequisites\nThe ospf enable multi-area area-id command has been run."
}