{
    "PageTitle": "ospf smart-discover multi-area",
    "FuncDef": "The ospf smart-discover multi-area command enables smart-discover on a multi-area adjacency interface.\nThe undo ospf smart-discover multi-area command disables smart-discover on a multi-area adjacency interface.\nBy default, smart-discover is disabled on multi-area adjacency interfaces.",
    "CLIs": [
        "ospf smart-discover multi-area { <area-id> | <area-id> }",
        "undo ospf smart-discover multi-area { <area-id> | <area-id> }"
    ],
    "ParentView": [
        "Tunnel interface view",
        "VBDIF interface view",
        "FlexE interface view",
        "Cellular channel interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "100GE interface view",
        "GE electrical interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "GMPLS-UNI interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Eth-Trunk interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "area-id",
            "Info": "Specifies the ID of an OSPF area.\nThe value can be a decimal integer ranging from 0 to 4294967295 or in the format of an IP address."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospf 1",
            "[*HUAWEI-ospf-1] area 0",
            "[*HUAWEI-ospf-1-area-0.0.0.0] quit",
            "[*HUAWEI-ospf-1] area 1",
            "[*HUAWEI-ospf-1-area-0.0.0.1] quit",
            "[*HUAWEI-ospf-1] quit",
            "[*HUAWEI] interface GigabitEthernet1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] ospf enable 1 area 0",
            "[*HUAWEI-GigabitEthernet1/0/0] ospf enable multi-area 1",
            "[*HUAWEI-GigabitEthernet1/0/0] ospf smart-discover multi-area 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nGenerally, routers periodically send Hello packets through OSPF interfaces to establish and maintain OSPF neighbor relationships and elect a DR or BDR on a multi-access network (broadcast or NBMA network). However, Hello packets are not sent to neighbors until the Hello timer expires, which slows down the establishment of neighbor relationships and DR or BDR election.\nTo address this problem, run the ospf smart-discover multi-area command to enable smart-discover on a multi-area adjacency interface so that Hello packets are sent to neighbors immediately, regardless of the Hello timer.\nPrerequisites\nThe ospf enable multi-area command has been run.\nImplementation Procedure\nIf smart-discover is enabled on a broadcast or NBMA interface, it works as follows:\nIf the neighbor status reaches 2-way for the first time or returns to Init from 2-way or a higher state, the smart-discover-capable interface sends Hello packets to its neighbor immediately when detecting that the neighbor's status changes.If the interface status of the DR or BDR on the multi-access network changes, the smart-discover-capable interface sends Hello packets within its network segment and participates in DR or BDR election.\nThe fast neighbor relationship establishment process on a P2P or P2MP network is similar to that on a broadcast or NBMA network.\n\nConfiguration Impact\nThe interval at which Hello packets are sent is determined by the interval at which Hello packets are sent.\nPrecautions\nThe default interval for sending Hello packets varies according to the network type."
}