{
    "PageTitle": "advertise mpls-lsr-id",
    "FuncDef": "The advertise mpls-lsr-id command configures OSPF to advertise MPLS LSR IDs to multiple areas as intra-area routes.\nThe undo advertise mpls-lsr-id command cancels the configuration.\nBy default, OSPF does not advertise MPLS LSR IDs to multiple areas as intra-area routes.",
    "CLIs": [
        "advertise mpls-lsr-id",
        "advertise mpls-lsr-id cost <cost>",
        "undo advertise mpls-lsr-id"
    ],
    "ParentView": [
        "OSPF view"
    ],
    "ParaDef": [
        {
            "Parameters": "cost cost",
            "Info": "Specifies the cost of the advertised route.\nThe value is an integer ranging from 0 to 65535. By default, it is 0."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospf",
            "[*HUAWEI-ospf-1] advertise mpls-lsr-id"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen an ABR is the destination of tunnels in two areas, OSPF concludes that only one tunnel is valid because a tunnel is considered valid only when an intra-area route to the destination is reachable. In OSPF, an interface belongs only to one area. That is, routes to the IP address of a loopback interface are intra-area routes in only one area and inter-area routes in other areas. In this case, OSPF advertises intra-area routes with the MPLS LSR ID as the IP address to all areas connected to this device.\nPrerequisites\nMPLS TE has been enabled globally using the mpls te command.\nConfiguration Impact\nRunning this command may have the following impacts:\nIf the OSPF area where the local router resides does not have the interface whose IP address is the MPLS LSR ID, the type of the OSPF routes (with the MPLS LSR ID as the destination address) on the other routers in this OSPF area will be changed from inter- area to intra-area, and the cost will also be changed.If an OSPF Not-So-Stubby Area (NSSA) has the interface whose IP address is the MPLS LSR ID, and the forwarding address of the NSSA LSAs advertised in this area is the MPLS LSR ID, the forwarding address of these NSSA LSAs will be changed, and the NSSA LSAs will be re-advertised, causing route calculation."
}