{
    "PageTitle": "remote-lfa available-tunnel-destination (OSPF FRR view)",
    "FuncDef": "The remote-lfa available-tunnel-destination command configures a filtering policy to allow only the PQ node that matches the policy to be used as the next hop of an LFA link.\nThe undo remote-lfa available-tunnel-destination command restores the default configuration.\nBy default, no filtering policy is configured, and each PQ node can be used as a next hop of an LFA link.",
    "CLIs": [
        "remote-lfa available-tunnel-destination ip-prefix <ip-prefix-name>",
        "undo remote-lfa available-tunnel-destination ip-prefix <ip-prefix-name>"
    ],
    "ParentView": [
        "OSPF FRR view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-prefix ip-prefix-name",
            "Info": "Specifies the name of an IP prefix list.\nThe name is a string of 1 to 169 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip ip-prefix prefix1 permit 0.0.0.0 0 greater-equal 17 less-equal 18",
            "[*HUAWEI] ospf",
            "[*HUAWEI-ospf-1] frr",
            "[*HUAWEI-ospf-1-frr] loop-free-alternate",
            "[*HUAWEI-ospf-1-frr] remote-lfa tunnel ldp",
            "[*HUAWEI-ospf-1-frr] remote-lfa available-tunnel-destination ip-prefix prefix1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn most cases, Remote LFA obtains multiple PQ nodes using the LFA algorithm. In this situation, you can run the remote-lfa available-tunnel-destination command to configure a filtering policy to allow only the PQ node that matches the policy to be used as the next hop of an LFA link.\nPrerequisites\nFRR has been enabled and the FRR view has been displayed using the frr command.\nPrecautions\nIf the remote-lfa command is not run prior to the remote-lfa available-tunnel-destination command, the remote-lfa available-tunnel-destination command can be run, but its configuration does not take effect on interfaces.\nIf you run the remote-lfa command when the remote-lfa available-tunnel-destination command has been run, Remote LFA is disabled."
}