{
    "PageTitle": "rfc1583 compatible",
    "FuncDef": "The rfc1583 compatible command configures a device to comply with the route selection rules defined in RFC 1583. This configuration facilitates OSPF route selection.\nThe undo rfc1583 compatible command configures a device to comply with the route selection rules defined in RFC 2328.\nThe rfc1583 compatible command configures a device to comply with the route selection rules defined in RFC 1583. This configuration facilitates OSPFv3 route selection.\nThe undo rfc1583 compatible command configures a device to comply with the route selection rules defined in RFC 5340.\n\nBy default, OSPF configures the rules defined in RFC 1583.\n\n\nBy default, OSPFv3 configures the rules defined in RFC 5340.",
    "CLIs": [
        "rfc1583 compatible",
        "undo rfc1583 compatible"
    ],
    "ParentView": [
        "OSPFv3 view",
        "OSPF view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospfv3 1",
            "[*HUAWEI-ospfv3-1] rfc1583 compatible"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospf 1",
            "[*HUAWEI-ospf-1] undo rfc1583 compatible"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nRFC 2328 and RFC 1583 define different OSPF route selection rules. When enabling OSPF, configure the same route selection rules on all devices in the same OSPF area. For example, an OSPF device supports route selection rules defined in RFC 1583 by default. If the other Routers in the same OSPF area support route selection rules defined in RFC 2328, run the undo rfc1583 compatible command.\nRFC 5340 and RFC 1583 define different OSPFv3 route selection rules. When enabling OSPFv3, configure the same route selection rules on all devices in the same OSPFv3 area. For example, an OSPFv3 device supports route selection rules defined in RFC 5340 by default. If the other Routers in the same OSPFv3 area support route selection rules defined in RFC 1583, run the rfc1583 compatible command.\nFor intra-area and inter-area routes to the same destination outside an AS, the route with the smallest cost is selected based on the selection rules defined in RFC 1583 regardless of the route types. Based on the selection rules defined in RFC 2328, however, intra-area routes are preferentially selected. If the candidate routes are of the same type, the route with the smallest cost is selected."
}