{
    "PageTitle": "tiebreaker",
    "FuncDef": "The tiebreaker command sets the solution of selecting a backup path for OSPF IP FRR.\nThe undo tiebreaker command restores the default solution of selecting a backup path for OSPF IP FRR.\nThe tiebreaker command sets the solution of selecting a backup path for OSPFv3 IP FRR.\nThe undo tiebreaker command restores the default solution of selecting a backup path for OSPFv3 IP FRR.\n\nBy default, the solution of selecting a backup path for OSPF IP FRR is node-protection path first.\n\n\nBy default, the solution of selecting a backup path for OSPFv3 IP FRR is node-protection path first.",
    "CLIs": [
        "tiebreaker { node-protecting | lowest-cost } preference <preference>",
        "undo tiebreaker { node-protecting | lowest-cost } [ preference <preference> ]"
    ],
    "ParentView": [
        "OSPF FRR view",
        "OSPFv3 FRR view"
    ],
    "ParaDef": [
        {
            "Parameters": "node-protecting",
            "Info": "Sets the solution of selecting a backup path for IP FRR to node-protection path first.\n-"
        },
        {
            "Parameters": "lowest-cost",
            "Info": "Sets the solution of selecting a backup path for IP FRR to smallest-cost path first.\n-"
        },
        {
            "Parameters": "preference preference",
            "Info": "Specifies a priority for the solution. The larger the value, the higher the priority.\nThe value is an integer ranging from 1 to 255.\nBy default, the priority of the node-protection path first solution is 40, and the priority of the smallest-cost path first solution is 20."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospfv3 1",
            "[*HUAWEI-ospfv3-1] frr",
            "[*HUAWEI-ospfv3-1-frr] loop-free-alternate",
            "[*HUAWEI-ospfv3-1-frr] tiebreaker lowest-cost preference 255"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospf 1",
            "[*HUAWEI-ospf-1] frr",
            "[*HUAWEI-ospf-1-frr] loop-free-alternate",
            "[*HUAWEI-ospf-1-frr] tiebreaker lowest-cost preference 255"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, the solution of selecting a backup path for OSPF IP FRR is node-protection path first. In some cases, the solution needs to be changed to smallest-cost path first because of data forwarding capacity or link cost consideration. To change the solution of selecting a backup path for OSPF IP FRR to smallest-cost path first, run the tiebreaker command.\nPrerequisites\nThe OSPF FRR view has been displayed using the frr command, and OSPF IP FRR has been enabled using the loop-free-alternate command.\nThe OSPFv3 FRR view has been displayed using the frr command, and OSPF IP FRR has been enabled using the loop-free-alternate command."
}