{
    "PageTitle": "access-speed adjustment system-state",
    "FuncDef": "The access-speed adjustment system-state enable command configures the device to adjust the user access rate based on the system status.\nThe access-speed adjustment system-state disable command configures the device does not adjust the user access rate based on the system status..\nBy default, the device adjusts the user access rate based on the system status enabling strict check.",
    "CLIs": [
        "access-speed adjustment system-state { enable [ strict-check ] | disable }",
        "access-speed adjustment system-state { enable | disable } strict-check-l2tp"
    ],
    "ParentView": [
        "AAA view"
    ],
    "ParaDef": [
        {
            "Parameters": "strict-check",
            "Info": "Enables strict check, which allows the device to check the usages of access-queue, ppp-cpcar-drop, ppp-send-queue, and ppp-receive-queue. The device decreases the user access rate if the usage of any of these parameters is high.\n-"
        },
        {
            "Parameters": "strict-check-l2tp",
            "Info": "Enables strict-check-l2tp.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] access-speed adjustment system-state enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen the Router is not in a proper state, for example, the CPU or memory usage reaches 80%, run the access-speed adjustment system-state command so that the user access rate will be decreased.\nConfiguration Impact\nThe Router automatically adjusts the user access rate based on the CPU and memory usage of the main control boards and interface boards. When the CPU or memory usage of a main control board or interface board goes high, the Router decreases the user access rate. When the CPU or memory usage of a main control board or interface board restores, the Router increases the user access rate.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nYou are not advised to run the access-speed adjustment system-state disable command to disable the system from adjusting the user access rate based on system status."
}