{
    "PageTitle": "access leased-line connection chasten quickoffline",
    "FuncDef": "The access leased-line connection chasten quickoffline command enables suppression of leased line user access.\nThe undo access leased-line connection chasten command disables suppression of leased line user access.\nBy default, suppression of leased line user access is disabled.",
    "CLIs": [
        "access leased-line connection chasten <request-session> <request-period> <blocking-period> quickoffline",
        "undo access leased-line connection chasten [ <request-session> <request-period> <blocking-period> quickoffline ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "request-session",
            "Info": "Specifies the maximum number of connection requests allowed.\nThe value is an integer ranging from 1 to 10000."
        },
        {
            "Parameters": "request-period",
            "Info": "Specifies an interval at which connection requests can be sent.\nThe value is an integer ranging from 1 to 3600, in seconds."
        },
        {
            "Parameters": "blocking-period",
            "Info": "Specifies a blocking period for connection requests.\nThe value is an integer ranging from 1 to 3600, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] access leased-line connection chasten 5 60 600 quickoffline"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the duration or traffic volume quota delivered by the RADIUS server to a leased line user is 0, the leased line user can go online but will go offline immediately. This results in frequent login and logout of leased line users.\nTo prevent this problem, run the access leased-line connection chasten command to\nconfigure the maximum number of connection requests allowed, the interval at which connection requests can be sent, and a blocking period. After the leased line user has attempted the maximum number of connection requests allowed, the user's connection requests will be blocked.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}