{
    "PageTitle": "access frame-ip lease manage pool-exclude",
    "FuncDef": "The access frame-ip lease manage pool-exclude command enables lease management for IP addresses delivered by the RADIUS server but not in the domain address pool.\nThe undo access frame-ip lease manage pool-exclude command restores the default configuration.\nBy default, lease management is disabled for IP addresses delivered by the RADIUS server but not in the domain address pool.",
    "CLIs": [
        "access frame-ip lease manage pool-exclude",
        "undo access frame-ip lease manage pool-exclude"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] access gateway unnumbered loopback user-type ipoe",
            "[~HUAWEI] access frame-ip lease manage pool-exclude"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter the access gateway unnumbered loopback user-type ipoe command is run to configure gateway unnumbered, the RADIUS server can deliver IP addresses not in the domain address pool to common DHCP Layer 2 users. To enable lease management for these IP addresses, run the access frame-ip lease manage pool-exclude command.\nPrerequisites\nGateway unnumbered has been enabled using the access gateway unnumbered loopback user-type ipoe command in the system view.\nConfiguration Impact\nIf the BRAS does not receive any Renew or Rebind message from a user terminal after the user's lease expires, the BRAS automatically deletes the user entry to bring the user offline. The lease of a user can be delivered by the RADIUS server. The default lease is three days.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nThe access frame-ip lease manage pool-exclude command applies only to IP addresses delivered by the RADIUS server to common DHCP Layer 2 users but not in the domain address pool.\nIf the IP addresses delivered by the RADIUS server are in the domain address pool, you can run the frame-ip lease manage command in the IP address pool view to enable lease management for such IP addresses."
}