{
    "PageTitle": "access-line-id update online",
    "FuncDef": "The access-line-id update online command enables a device to update the Option 82 information of an online user through a DHCP Request message for lease renewal.\nThe undo access-line-id update online command disables a device from updating the Option 82 information of an online user through a DHCP Request message for lease renewal.\nBy default, the device is not enabled to update the Option 82 information of an online user.",
    "CLIs": [
        "access-line-id update online",
        "undo access-line-id update online"
    ],
    "ParentView": [
        "BAS interface view (GE)",
        "BAS interface view (VE)",
        "BAS interface view (trunk)"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1/0/1.1",
            "[~HUAWEI-GigabitEthernet1/0/1.1] bas",
            "[~HUAWEI-GigabitEthernet1/0/1.1] access-type layer2-subscriber",
            "[~HUAWEI-GigabitEthernet1/0/1.1] access-line-id update online"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo enable a device to update the Option 82 information of an online user through a DHCP Request message for lease renewal, run the access-line-id update online command so that the updated Option 82 information can be sent to the RADIUS server through an accounting packet.\nPrerequisites\nThe Layer 2 command user type or Layer 2 leased line user type has been configured using the access-type layer2-subscriber or access-type layer2-leased-line command in the BAS interface view.\nThe client-option82 command has been run in the BAS interface view to enable a device to trust the Access-Line-ID information sent from clients.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nThe dhcp option82-mismatch action offline and access-line-id update online commands cannot be both run in the same bas interface view.\nIf lease proxy is enabled using the dhcp lease-proxy command, when the BRAS functions as a proxy device to process renewal packets, the Option 82 information is not updated. The Option 82 information is updated only when a user sends renewal packets to a local or remote DHCP server."
}