{
    "PageTitle": "access-user dhcp recover-file",
    "FuncDef": "The access-user dhcp recover-file command restores the DHCPv4 user information saved in the CF card to the high-end memory. The DHCPv4 users include those who share one MAC address but go online from multiple sessions.\nBy default, DHCPv4 user information saved in the CF card is not restored to the high-end memory.",
    "CLIs": [
        "access-user dhcp recover-file <file-name>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "file-name",
            "Info": "Specifies the directory and name of the file from which DHCPv4 user information saved in the CF card is restored to the high-end memory.\nThe name is a string of 1 to 64 case-insensitive characters. If you want to save DHCPv4 user information in the CF card of the master main control board, specify the directory and file name as cfcard:/autosave/*.bak or *.bak. If you want to save DHCPv4 user information in the CF card of the slave main control board, specify the directory and file name as slave#cfcard:/autosave/*.bak. The file name extension must be .bak."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] access-user dhcp auto-save max-user-number 8000",
            "Info: This operation will use 7 MB continuous memory. Continue? [Y/N]:Y",
            "[~HUAWEI] access-user dhcp auto-recover enable",
            "[~HUAWEI] access-user dhcp recover-file cfcard:/autosave/user.bak",
            "Info: Are you sure to recover access-user information from cfcard:/autosave/user.bak? [Y/N]:"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the device is powered off and restarted, DHCPv4 user information saved in the high-end memory will be lost, affecting services. Run the access-user dhcp save-file command before powering off the device to write the DHCPv4 user information saved in the high-end memory to the CF card. After the device is restarted, run the access-user dhcp recover-file command to restore the DHCPv4 user information saved in the CF card to the high-end memory. The device then allows DHCPv4 users whose information is saved in the high-end memory to go online automatically.\nPrerequisites\nThe access-user dhcp save-file command has been run to write the DHCPv4 user information saved in the high-end memory to the CF card before the device is powered off.\nConfiguration Impact\nThe device reads DHCPv4 user information in the CF card and saves the information in the high-end memory. The new information does not override the original DHCPv4 user information saved in the high-end memory.\nPrecautions\nThis command is supported only on the admin VS.\nThe following DHCPv4 user information is saved: MAC address, IP address, VLAN, access interface, VPN instance name, domain name, lease, Option 82, Option 60, Option 61, and IP address of the DHCPv4 server. The DHCPv4 user information is used only when the DHCPv4 users go online automatically. To ensure security, do not save DHCPv4 user information in the CF card for a long time and clear it in time."
}