{
    "PageTitle": "access-speed adjustment system-state threshold https-redirect",
    "FuncDef": "The access-speed adjustment system-state threshold https-redirect command configures the CPU usage threshold that triggers the decrease of the flow establishment rate for HTTPS redirection and the CPU usage threshold for restoring the flow establishment rate of HTTPS redirection.\nThe undo access-speed adjustment system-state threshold https-redirect command restores the default value.\nBy default, the CPU usage threshold that triggers the decrease of the flow establishment rate for HTTPS redirection is 90%. The CPU usage threshold for restoring the flow establishment rate of HTTPS redirection is 85%.",
    "CLIs": [
        "access-speed adjustment system-state threshold https-redirect cpu-usage alarm <threshold-value> resume <threshold-value>",
        "undo access-speed adjustment system-state threshold [ https-redirect cpu-usage [ alarm <threshold-value> resume <threshold-value> ] ]"
    ],
    "ParentView": [
        "AAA view"
    ],
    "ParaDef": [
        {
            "Parameters": "resume threshold-value",
            "Info": "Specifies the resume threshold.\nThe value is an integer ranging from 1 to 99."
        },
        {
            "Parameters": "cpu-usage",
            "Info": "Indicates the CPU usage.\n-"
        },
        {
            "Parameters": "alarm threshold-value",
            "Info": "Specifies the alarm threshold.\nThe value is an integer ranging from 2 to 100."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] access-speed adjustment system-state threshold https-redirect cpu-usage alarm 85 resume 80"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the flow establishment rate for HTTPS redirection exceeds the threshold, the CPU usage may be high, which affects device performance. By default, the CPU usage threshold that triggers the decrease of the flow establishment rate for HTTPS redirection is 90%, and the CPU usage threshold that triggers a restoration of the flow establishment rate for HTTPS redirection is 85%.\nTo change the CPU usage threshold that triggers the decrease of the flow establishment rate for HTTPS redirection and the CPU usage threshold that triggers a restoration of that rate in order to prevent other services from being affected by a high CPU usage, run the access-speed adjustment system-state threshold https-redirect command.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nWhen the CPU usage is greater than the configured alarm threshold, the device decreases the HTTPS redirection flow creation rate. When the CPU usage is less than the resume threshold, the HTTPS redirection flow creation rate is called back."
}