{
    "PageTitle": "access-user dhcp auto-recover speed",
    "FuncDef": "The access-user dhcp auto-recover speed command configures the rate at which DHCPv4 users automatically go online after the device recovers from a fault.\nThe undo access-user dhcp auto-recover speed command restores the default configuration.\nBy default, the rate at which DHCPv4 users automatically go online after the device recovers from a fault is normal.",
    "CLIs": [
        "access-user dhcp auto-recover speed { slow | normal | fast }",
        "undo access-user dhcp auto-recover speed"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "slow",
            "Info": "Indicates that the maximum rate at which DHCPv4 users automatically go online after the NE40E recovers from a fault is 100/s.\n-"
        },
        {
            "Parameters": "normal",
            "Info": "Indicates that the maximum rate at which DHCPv4 users automatically go online after the NE40E recovers from a fault is 300/s.\n-"
        },
        {
            "Parameters": "fast",
            "Info": "Indicates that the maximum rate at which DHCPv4 users automatically go online after the NE40E recovers from a fault is 500/s.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] access-user dhcp auto-recover speed fast"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn DHCPv4 user access scenarios, users are logged out abnormally if the device restarts, or a board, subcard, or interface fails, causing a user information loss. However, if the DHCPv4 terminal fails to detect the fault, it will not send access requests to the device or re-dial up even after the fault is rectified. Therefore, the user cannot go online again. To resolve this problem, configure the device to automatically save user information before a fault occurs, and configure the device to allow users to automatically go online based on the saved user information after the fault is rectified. To adjust the rate at which DHCPv4 users automatically go online, run the access-user dhcp auto-recover speed command.\nThe DHCPv4 users include those who share one MAC address but go online from multiple sessions.\nPrerequisites\nThe access-user dhcp auto-save command has been run in the system view to configure the device to automatically save DHCPv4 user information.The access-user dhcp auto-save enable command has been run in the domain view.The access-user dhcp auto-recover enable command has been run in the system view to configure the device to allow users to automatically go online based on the saved user information.\n\nPrecautions\nThis command is supported only on the admin VS.\nIf the device already has the access-speed command configured, the device limits the user access rate based on the configured user access rate and system load. Therefore, the user access rate after the device recovers from a fault cannot be greater than that allowed by the device."
}