{
    "PageTitle": "access-line-id translate",
    "FuncDef": "The access-line-id translate command configures the format in which a circuit ID or a remote agent ID is transmitted.\nThe undo access-line-id translate command restores the default setting.\nBy default, a circuit ID or a remote agent ID is transmitted in the form of a string.",
    "CLIs": [
        "access-line-id translate { agent-circuit-id { hex | string } | agent-remote-id { hex | string } } *",
        "undo access-line-id translate"
    ],
    "ParentView": [
        "BAS interface view (GE)",
        "BAS interface view (VE)",
        "BAS interface view (trunk)"
    ],
    "ParaDef": [
        {
            "Parameters": "agent-circuit-id",
            "Info": "Indicates the format in which a circuit ID is transmitted.\n-"
        },
        {
            "Parameters": "hex",
            "Info": "Indicates that a circuit ID is transmitted in the format of a hexadecimal string.\n-"
        },
        {
            "Parameters": "string",
            "Info": "Specifies a string, in the form of which a remote agent ID is transmitted.\n-"
        },
        {
            "Parameters": "agent-remote-id",
            "Info": "Indicates the format in which a remote agent ID is transmitted.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] commit",
            "[~HUAWEI-GigabitEthernet1/0/1] bas",
            "[~HUAWEI-GigabitEthernet1/0/1-bas] client-option82",
            "[~HUAWEI-GigabitEthernet1/0/1-bas] option82-relay-mode include agent-circuit-id",
            "[~HUAWEI-GigabitEthernet1/0/1-bas] access-line-id translate agent-circuit-id hex"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf hex is configured, the value of the attribute is converted into a hexadecimal string. If string is specified or no parameter is specified, the value of the attribute is not converted. The option82-relay-mode subopt command can be used in the following cases:\nThe client-option82 or client-access-line-id and option82-relay-mode include or access-line-id include commands have been run on the BAS interface to use the Calling-Station-Id attribute, NAS-Port-Id attribute, or BB-Caller-Id attribute of a RADIUS packet to send Option 82 information to the RADIUS server.The client-option82 and option82-relay-mode dslam config-identify commands have been run on the BAS interface to use the Agent-CircuitID and Agent-RemoteID attributes of a RADIUS packet to send Option 82 information to the RADIUS server.The client-option82 or client-access-line-id and option82-relay-mode dslam config-identify or access-line-id dslam config-identify commands have been run on the BAS interface to use the Agent-CircuitID and Agent-RemoteID attributes of a RADIUS packet to send Option 82 information to the RADIUS server.\n\nPrerequisites\nBefore running this command, set the access type of the userto layer2 subscriber, layer2-leased-line, or layer3 subscriber by the access-type command.\nPrecautions\nThis command is supported only on the admin VS.\nThe functions of the access-line-id translate command and the option82-relay-mode subopt command are the same. Both of them are used to configure the format in which a circuit ID or a remote agent ID is transmitted. If they have been both run in the same view, the last configuration takes effect."
}