{
    "PageTitle": "access-delay",
    "FuncDef": "The access-delay command configures a response delay policy for access users on a BAS interface. Then, the system delays responding to the first packet sent by the user that goes online from this BAS interface according to the configured policy.\nThe undo access-delay command cancels the configuration.\nBy default, no response delay policy is configured for access users on a BAS interface.",
    "CLIs": [
        "access-delay <delay-time> [ odd-mac | even-mac | circuit-id-include <text-value> | load-balance-group <group-name> ]",
        "undo access-delay"
    ],
    "ParentView": [
        "BAS interface view (GE)",
        "BAS interface view (VE)",
        "BAS interface view (trunk)"
    ],
    "ParaDef": [
        {
            "Parameters": "odd-mac",
            "Info": "Applies the response delay policy to an access user with an odd MAC address on the BAS interface.\nYou can configure the response delay policies for the access users with odd MAC addresses and those with even MAC addresses concurrently. The configurations both take effect.If circuit-id-include, even-mac, or odd-mac is not specified, the system applies the response delay policy to all Layer 2 users who go online through the BAS interface.\n-"
        },
        {
            "Parameters": "even-mac",
            "Info": "Applies the response delay policy to an access user with an even MAC address on the BAS interface.\n-"
        },
        {
            "Parameters": "circuit-id-include text-value",
            "Info": "Applies the response delay policy to an access user whose Option 82 information (for a DHCP user) or PPPoE+ field (for a PPP user) matches the access node ID.\nThe value is a string of 1 to 200 characters in the format of a regular expression."
        },
        {
            "Parameters": "load-balance-group group-name",
            "Info": "Applies the response delay policy to users who go online through BAS interfaces in a load balancing group.Only BAS interfaces in the Up state are used for load balancing.\nThe value is a string of 1 to 31 case-insensitive characters, spaces not supported."
        },
        {
            "Parameters": "access-delay delay-time",
            "Info": "Specifies a response delay time for access users.\nThe value is an integer ranging from 1 to 2550, in 10 milliseconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1/0/1.1",
            "[~HUAWEI-GigabitEthernet1/0/1.1] commit",
            "[~HUAWEI-GigabitEthernet1/0/1.1] bas",
            "[~HUAWEI-GigabitEthernet1/0/1.1-bas] access-type layer2-subscriber",
            "[~HUAWEI-GigabitEthernet1/0/1.1-bas] access-delay 50 odd-mac"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] access delay load-balance group huawei",
            "[*HUAWEI] interface GigabitEthernet1/0/1.1",
            "[~HUAWEI-GigabitEthernet1/0/1.1] commit",
            "[*HUAWEI-GigabitEthernet1/0/1.1] bas",
            "[*HUAWEI-GigabitEthernet1/0/1.1-bas] access-type layer2-subscriber",
            "[*HUAWEI-GigabitEthernet1/0/1.1-bas] access-delay 50 load-balance-group huawei"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure a response delay policy for access users on a BAS interface, run the access-delay command. You can configure a response delay policy on a BAS interface only when the access type of the BAS interface is set to layer2-subscriber , layer3-subscriber or layer2-leased-line using the access-type command.\nYou can apply a response delay policy by specifying circuit-id-include, even-mac, odd-mac, or load-balance-group in the access-delay command.\nIf circuit-id-include is specified, you must run the client-option82 command in the BAS interface view to configure the device to trust the DHCP Option 82 field (for a DHCP user) or the PPPoE+ field (for a PPP user) for the response delay to take effect.If load-balance-group is specified, BAS interfaces in the same load balancing group either immediately respond to or delay responding to the received login requests for a configured period of time in accordance with MAC-address-based Hash results to implement inter-board load balancing.If no response delay time is configured for the load balancing group:\nIf the interface through which users go online is selected in a Hash operation, the interface immediately responds to the received login requests.If the interface through which users go online is not selected in a Hash operation, the interface responds to the received login requests after the delay time configured for the BAS interface elapses.\nIf a response delay time is configured for the load balancing group:\nIf the interface through which users go online is selected in a Hash operation, the interface responds to the received login requests after the delay time configured for the load balancing group elapses.If the interface through which users go online is not selected in a Hash operation, the interface responds to the received login requests after the delay time configured for the load balancing group plus the delay time configured for the BAS interface elapses.\n\n\nPrerequisites\nA load balancing group has been configured using the access-delay load-balance command if load-balance-group is specified.\nPrecautions\nThis command is supported only on the admin VS.\nIf load-balance-group is specified:\nInter-board load balancing implemented based on a configured response delay policy for BAS interfaces in a load balancing group takes effect for DHCP, DHCPv6, EAPOL, PPPoE, and PPPoev6 protocol packets only.For EAPOL, PPPoE, and PPPoEv6 users, the Hash-selected user access interface will immediately respond to the received login requests, whereas unselected user access interfaces will respond to the received login requests after the configured delay time elapses. For DHCPv4 and DHCPv6 users, the Hash-selected user access interface will immediately respond to the received login requests, whereas unselected user access interface will not respond to the received login requests.If a BAS interface in a load balancing group alternates between Up and Down for three or more times within 1 minute, the BAS interface is punished and not used for load balancing. The BAS interface is available for load balancing again after 5 minutes after the penalty suppression period times out.A maximum of 16 BAS interfaces can be added to a load balancing group."
}