{
    "PageTitle": "access https-redirect import certificate",
    "FuncDef": "The access https-redirect import certificate command imports the certificate and the mapped key. After the import succeeds, the device uses the imported certificate and mapped key to complete HTTPS interaction with the client.\nBy default, a device does not have a default certificate.",
    "CLIs": [
        "access https-redirect import certificate <certificate-file-name> key { der <der-file-name> | pem <pem-file-name> password <password> }"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "key",
            "Info": "Specifies the private key.\n-"
        },
        {
            "Parameters": "der der-file-name",
            "Info": "Specifies the key file name in DER format.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "pem pem-file-name",
            "Info": "Specifies the key file name in PEM format.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "password password",
            "Info": "Specifies the password of the key file in PEM format.\nThe value is a string of 1 to 128 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "certificate certificate-file-name",
            "Info": "Specifies the certificate name.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] access https-redirect import certificate huawei.cer key pem pemkey.pem password Asd12345"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, the device does not have a certificate. You can run the self-signed rsa modulus command to generate a certificate from signature certificate or run the access https-redirect import certificate command to import an external certificate and its private key to replace the imported or generated certificate and private key for HTTPS interaction with the client.\nPrerequisites\nBefore the access-https-redirect-import-certificate command is run, the certificate and associated private key should be uploaded to the device.\nPrecautions\nThe certificate size cannot exceed 10K.The certificate chain is not supported. Only the certificate file that contains one certificate can be imported.In case of repetitive import, the most recently imported certificate is used.The imported certificate must meet the X.509 standard.After the certificate and key are successfully imported, the key file is automatically deleted to reduce the risks of key disclosure.The public key algorithm in a certificate supports only the ECDSA and RSA types.You are advised to import an encrypted private key file to prevent private key information leakage.In VS mode, this command is supported only by the admin VS."
}