{
    "PageTitle": "access trigger packet-limit",
    "FuncDef": "The access trigger packet-limit command limits the rate at which repetitive ARP, IP, IPv6, and ND packets can be sent to the main control board to trigger users to go online, preventing excessive packets from causing high CPU usage on the main control board.\nThe undo access trigger packet-limit command restores the default configuration.\nBy default, the rate at which repetitive ARP, IP, IPv6, and ND packets can be sent to the main control board is limited to 1 per 30 seconds for each of the packet types.",
    "CLIs": [
        "access trigger packet-limit <packets-num> time <seconds>",
        "access trigger packet-limit <packets-num> time <seconds> all",
        "undo access trigger packet-limit [ <packets-num> time <seconds> ]",
        "undo access trigger packet-limit <packets-num> time <seconds> all"
    ],
    "ParentView": [
        "Slot view"
    ],
    "ParaDef": [
        {
            "Parameters": "time seconds",
            "Info": "Specifies a period.\nThe value is an integer ranging from 0 to 300, in seconds."
        },
        {
            "Parameters": "packet-limit packets-num",
            "Info": "Specifies the number of packets. It is the number of packets that can be sent to the main control board in a period specified by seconds. The device discards excess packets.\nThe value is an integer ranging from 1 to 500."
        },
        {
            "Parameters": "all",
            "Info": "Specifies all packets.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] slot 1",
            "[~HUAWEI-slot-1] access trigger packet-limit 1 time 60"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the device is attacked by a large number of ARP/IP/IPv6/ND packets or unauthorized users repeatedly send ARP/IP/IPv6/ND packets to go online, the main control board 's CPU usage goes high. To configure a limit on the number of ARP/IP/IPv6/ND packets that can be sent to the main control board , run the access trigger packet-limit command so that the device discard packets that exceed the configured limit.\nPrecautions\nIn VS mode, this command is supported only by the admin VS. \nRunning the access trigger packet-limit packets-num time 0 command can always cancel the rate limit on repetitive ARP, IP, IPv6, and ND packets, irrespective of the value of packets-num.\nYou are not advised to cancel the limitation on the number of ARP, IP, IPv6, and ND packets sent to the main control board for triggering user access.\nWhen more than one repetitive ARP, IP, IPv6, or ND packet is sent to the main control board in 30 seconds, the system pressure and CPU usage may be increased.\nThis command provides restriction based on users."
}