{
    "PageTitle": "access-trigger lease-end-time original",
    "FuncDef": "The access-trigger lease-end-time original command configures the device to apply the original lease time for DHCPv4 users that go online again after going offline abnormally.\nThe undo access-trigger lease-end-time original command restores the default configuration.\nBy default, the lease time for DHCPv4 users is reset after they abnormally go offline and then go online again.",
    "CLIs": [
        "access-trigger lease-end-time original",
        "undo access-trigger lease-end-time original"
    ],
    "ParentView": [
        "AAA view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] access-trigger lease-end-time original"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn DHCPv4 user access scenarios, users are logged out abnormally if the NE40E restarts, or a board, subcard, or interface fails. However, the DHCPv4 client cannot detect the fault and still records the original lease time used before the abnormal logout. After the NE40E recovers from the fault, and DHCPv4 users go online again, the NE40E recalculates the lease time for DHCPv4 users. As a result, the lease time recorded by the NE40E is different from that recorded by the DHCPv4 client. To resolve this problem, run the access-trigger lease-end-time original command so that the NE40E and DHCPv4 client record the same lease time.\nConfiguration Impact\nWhen the lease expires for DHCPv4 users that go online again after going offline abnormally is affected. If the access-trigger lease-end-time original command is not run, the NE40E resets the lease time and recalculates it for DHCPv4 users that go online again after going offline abnormally. Then the lease for these DHCPv4 users expires after another lease time elapses since the time they go online again.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}