{
    "PageTitle": "access-user dhcp auto-recover enable",
    "FuncDef": "The access-user dhcp auto-recover enable command enables automatic DHCPv4 user login.\nThe undo access-user dhcp auto-recover enable command disables automatic DHCPv4 user login.\nBy default, automatic DHCPv4 user login is disabled.",
    "CLIs": [
        "access-user dhcp auto-recover enable",
        "undo access-user dhcp auto-recover enable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] access-user dhcp auto-recover enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn a DHCPv4 user access scenario in which the NE40E functions as a BRAS, when the NE40E is restarted or its board, subcard, or interface is faulty, DHCPv4 users are logged out and their information is lost. If a DHCPv4 client does not detect the fault, the DHCPv4 client does not resend a DHCP request packet to the device or redial up after the fault is rectified. As a result, the DHCPv4 user cannot go online again. To address this problem, save DHCPv4 user information automatically before any fault occurs and allow the DHCPv4 users to go online automatically after the fault is rectified.\nAfter you run the access-user dhcp auto-recover enable command to enable automatic DHCPv4 user login, the NE40E allows the DHCPv4 users whose information is saved to go online automatically.\nThe DHCPv4 users include those who share one MAC address but go online from multiple sessions.\nPrerequisites\nThe access-user dhcp auto-save command has been run to enable automatic backup of DHCPv4 user information globally and configure the maximum number of the DHCPv4 users.The access-user dhcp auto-save enable (domain view) command has been run to enable automatic backup of DHCPv4 user information in a domain.\n\nConfiguration Impact\nDHCPv4 users who have gone offline due to a fault go online automatically after the fault is rectified. A maximum of 200 DHCPv4 users can go online in a second.\nThe larger the maximum number of DHCPv4 users whose information is automatically backed up, the longer it takes for all the DHCPv4 users to go online automatically.\nPrecautions\nThis command is supported only on the admin VS.\nIf the device is restarted without being powered off, user information saved in the high-end memory will not be lost. If the device is powered off and restarted, user information saved in the high-end memory will be lost. To ensure that users can go online automatically after the device is powered off and restarted, perform the following operations:\nBefore the device is powered off, run the access-user dhcp save-file command to write the DHCPv4 user information saved in the high-end memory to the CF card.After the device is restarted, run the access-user dhcp recover-file command to restore the DHCPv4 user information saved in the CF card to the high-end memory.\nThe following DHCPv4 user information is saved: MAC address, IP address, VLAN, access interface, VPN instance name, domain name, lease, Option 82, Option 60, Option 61, and IP address of the DHCPv4 server. The DHCPv4 user information is used only when the DHCPv4 users go online automatically.\nDuring automatic user access, if a new user goes online through client dial-up, the user may preempt the IP address of another user saved on the high-end memory. Then, the user whose IP address is preempted fails in automatic user access because no IP address is assigned to the user. After the lease is expired, the corresponding user information saved on the high-end memory will be deleted.\nDuring automatic recovery of user online, if users saved through high-end memory successfully apply for new IP addresses again re-dialup, the IP addresses in the user table of the high-end memory are updated as the newly applied IP addresses.\nWhen a user whose information is saved on the high-end memory performs re-dialup while the device is restarted or a board/subcard/interface fault occurs, the user may apply for the IP address of another user, causing an IP address conflict. The client then sends a Decline message, and the BRAS deletes the corresponding user information saved on the high-end memory."
}