{
    "PageTitle": "access-user dhcp auto-recover nosend-packet",
    "FuncDef": "The access-user dhcp auto-recover nosend-packet command disables a device from sending DHCPv4 messages to a remote DHCPv4 server when users automatically relog in to a device after the device recovers from a fault.\nThe undo access-user dhcp auto-recover nosend-packet command restores the default configuration.\nBy default, a device sends DHCPv4 messages to a remote DHCPv4 server when users automatically relog in to a device after the device recovers from a fault.",
    "CLIs": [
        "access-user dhcp auto-recover nosend-packet",
        "undo access-user dhcp auto-recover nosend-packet"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] access-user dhcp auto-recover nosend-packet"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen users automatically relog in to a device after the device recovers from a fault, the DHCPv4 module applies for IPv4 addresses for the users from the DHCPv4 server. If the DHCPv4 server assigns new IPv4 addresses to the users, the users fail to go online. To disable the device from sending DHCPv4 messages to the remote DHCPv4 server, run the access-user dhcp auto-recover nosend-packet command so that the DHCPv4 module does not send DHCPv4 messages to the remote DHCPv4 server when users automatically relog in to the device after the device recovers from a fault.\nPrerequisites\nThe access-user dhcp auto-recover nosend-packet command takes effect only after the following commands have been run:\nThe access-user dhcp auto-save command has been run in the system view to enable automatic backup of DHCPv4 user information and configure the maximum number of DHCPv4 users.The access-user dhcp auto-save enable (domain view) command has been run in the domain view to enable automatic backup of DHCPv4 user information in a domain.The access-user dhcp auto-recover enable command has been run in the system view to enable automatic DHCPv4 user login.\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}