{
    "PageTitle": "accounting-stop-packet include all-stack-ip user-type ipoe",
    "FuncDef": "The accounting-stop-packet include all-stack-ip user-type ipoe command configures a device to add all IP addresses assigned to an IPoE user to the user's accounting stop packets sent to a RADIUS server.\nThe undo accounting-stop-packet include all-stack-ip user-type ipoe command restores the default configuration.\nBy default, an IPoE user's accounting stop packet sent to a RADIUS server carries only the IP address of the stack where the user is currently online.",
    "CLIs": [
        "accounting-stop-packet include all-stack-ip user-type ipoe",
        "undo accounting-stop-packet include all-stack-ip user-type ipoe"
    ],
    "ParentView": [
        "AAA domain view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] domain huawei",
            "[*HUAWEI-aaa-domain-huawei] accounting-stop-packet include all-stack-ip user-type ipoe"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn a dual-stack IPoE access scenario, a RADIUS server may use the IP addresses carried in accounting stop packets to manage users' accounting information. By default, the accounting stop packet of a dual-stack IPoE user carries only the IP address of the stack where the user is currently online , without the IP address of the stack where the user has gone offline and has been released. To meet the IP address-based accounting management requirement of a RADIUS server, run the accounting-stop-packet include all-stack-ip user-type ipoe command to configure a device to add all IP addresses assigned to an IPoE user to the user's accounting stop packets sent to a RADIUS server.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nThe accounting-stop-packet include all-stack-ip user-type ipoe command is mutually exclusive with the ipoe-server multi-sessions per-mac enable command.If an IPv6 address pool has been bound to the domain and the dhcpv6-unshare-only command has been run in the prefix pool corresponding to the IPv6 address pool, running the accounting-stop-packet include all-stack-ip user-type ipoe command is not allowed.If an IPv6 address pool of the RUI-slave type has been bound to the domain, this IPv6 address pool has been bound to the RBS, and the dhcpv6-server destination rbs command has been run for the RBS, running the accounting-stop-packet include all-stack-ip user-type ipoe command is not allowed.In case of pre-authentication domain and post-authentication domain switching, you need to run this command in both the pre-authentication domain and post-authentication domain to make the function take effect."
}