{
    "PageTitle": "active port-bras",
    "FuncDef": "The active port-bras command activates the BRAS access function on interfaces.\nThe undo active port-bras command deactivates the BRAS access function on interfaces.\nBy default, the BRAS access function is not activated on interfaces.",
    "CLIs": [
        "active port-bras slot <slot-id> card <card-id> port <port-list>",
        "undo active port-bras slot <slot-id> card <card-id> [ port <port-list> ]"
    ],
    "ParentView": [
        "License view"
    ],
    "ParaDef": [
        {
            "Parameters": "card card-id",
            "Info": "Specifies the subcard ID.\nThe value is an integer that ranges from 1 to 31."
        },
        {
            "Parameters": "port port-list",
            "Info": "Specifies a list of interfaces. Interface IDs are separated by, or -.\nThe value is a string of 1 to 256 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "slot slot-id",
            "Info": "Specifies the slot ID.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] license",
            "[~HUAWEI-license] active port-bras slot 1 card 0 port 1",
            "Info: Use the display command to check the activation status of the port-bras licenses after committing the command."
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo allow Layer 2 and Layer 3 IPoE (DHCP, static, and leased-line) users, PPPoE users to access the network from interfaces, run the active port-bras command in the license view to activate the BRAS access function.\nPrerequisites\n The license file on the master main control board has been activated by running the license active <file-name> command. Interface-specific basic hardware licenses have been activated by running the active port-basic slot <slot-id> card <card-id> port <port-list> command.\n\nPrecautions\nIn VS mode, this command is supported only on the admin VS.\nBefore running the bas command to create a BAS interface on the GE and Eth-Trunk interface, you must run the active port-bras command to activate the BRAS access function on the interface.\nThe active port-bras command applies only to interfaces on an LPUI-240-CM (24 x 10GE)/LPUI-120-CM (12 x 10GE)/LPUI-120-CM (6 x 10GE+24GE)/LPUI-51-CM (48GE)/LPUI-480-CM (4 x 100GE)/LPUI-480-CM (48 x 10GE)/LPUI-480-CM (2x 100GE+24 x 10GE)/LPUI-1T-CM (16 x 50GE/8 x 100GE)/LPUI-1T-CM (32 x 25GE)/LPUI-242-CM-(24*10GE)."
}