{
    "PageTitle": "bas",
    "FuncDef": "The bas command creates a BAS interface and displays the BAS interface view.\nThe undo bas command deletes a BAS interface.\nBy default, no BAS interface is configured.",
    "CLIs": [
        "bas",
        "undo bas"
    ],
    "ParentView": [
        "Interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 2/0/1",
            "[~HUAWEI-GigabitEthernet2/0/1] bas"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf an interface is used for PPPoE or IPoE access, you need to run this command to configure the interface as a BAS interface.\nPrerequisites\nOnly an Ethernet interface or its sub-interface, a VE interface or its sub-interface, or an Eth-Trunk interface or its sub-interface can be set to a BAS interface.\nFollow-up Procedure\nRun the access-type command on the BAS interface to configure the user access type.\nPrecautions\nDuplicate Address Detect (DAD) is not supported if the interface set as the BAS interface.\nIf there is command configured on a BAS interface, the BAS interface cannot be deleted.\nIf the bas command is configured on an interface or sub-interface, the interface or sub-interface no longer supports MAC address learning or ARP learning. Do not configure the bas command on an interface or sub-interface that carries Layer 2 or Layer 3 forwarding services. Otherwise, the forwarding services are affected on the interface or sub-interface.\nIf a VSI has been bound to an interface using the l2 binding vsicommand, this interface and its sub-interfaces cannot be configured as a BAS interface.\nThe system prompts you to configure the backup protection function when you attempt to run the bas command on an inter-board Eth-Trunk interface that has two or more member interfaces or on a sub-interface of the Eth-Trunk interface.\nIPv6 interfaces:IPv6 takes effect after the ipv6 address auto link-local and ipv6 enable commands are run on a Layer 2 access interface.IPv6 takes effect after the ipv6 enable command is run and the specific IPv6 address is configured on a Layer 3 access interface.Otherwise, the IPv6 user who goes online from the interface will go offline.\nWhen an intra-board trunk contains interfaces on an eTM subcard and a non-eTM subcard, BAS access is not supported.\nBRAS access does not support virtual clusters.\nThis command is supported only on the admin VS."
}