{
    "PageTitle": "blacklist packet-rate",
    "FuncDef": "The blacklist packet-rate command configures the upper limit of the rate at which a user uses HTTPS to access an address.\nThe undo blacklist packet-rate command restores the default configuration.\nBy default, the upper limit of the rate at which a user uses HTTPS to access an address is 40 per minute.",
    "CLIs": [
        "blacklist packet-rate <packet-rate>",
        "undo blacklist packet-rate [ packet-rate ]"
    ],
    "ParentView": [
        "HTTPS redirect view"
    ],
    "ParaDef": [
        {
            "Parameters": "packet-rate packet-rate",
            "Info": "Specifies a packet transmission rate.\nThe value is an integer ranging from 5 to 600, in times/minute."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] domain abc",
            "[*HUAWEI-aaa-domain-abc] commit",
            "[~HUAWEI-aaa-domain-abc] web-server mode post",
            "[*HUAWEI-aaa-domain-abc] quit",
            "[*HUAWEI-aaa] quit",
            "[*HUAWEI] access https-redirect",
            "[*HUAWEI-access-https-redirect] js enable",
            "[*HUAWEI-access-https-redirect] blacklist packet-rate 30"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn web authentication scenarios, before user authentication succeeds, the device redirects HTTPS requests from clients to the web server. If a user maliciously and frequently accesses an address, HTTPS redirection will be triggered constantly, occupying device resources. You can run the blacklist packet-rate command to allow the device to add a destination address to the HTTPS redirection blacklist so that the user cannot perform HTTPS redirection after the rate at which the user uses HTTPS to access the destination address exceeds the upper limit.\nPrerequisites\nThe function to insert JavaScript scripts during web redirection has been enabled using the js enable command.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}