{
    "PageTitle": "blacklist aging-time",
    "FuncDef": "The blacklist aging-time command configures the aging time of the addresses in the HTTPS redirection blacklist.\nThe undo blacklist aging-time command restores the default configuration.\nBy default, the aging time of the addresses in the blacklist generated during HTTPS redirection is 259200 seconds. That is, the BRAS deletes an address from the blacklist 259200 seconds after the address is added to the blacklist.",
    "CLIs": [
        "blacklist aging-time <aging-time>",
        "undo blacklist aging-time [ aging-time ]"
    ],
    "ParentView": [
        "HTTPS redirect view"
    ],
    "ParaDef": [
        {
            "Parameters": "aging-time aging-time",
            "Info": "Specifies the aging time, in seconds.\nThe value is an integer ranging from 30 to 4294967295, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] access https-redirect",
            "[*HUAWEI-access-https-redirect] js enable",
            "[*HUAWEI-access-https-redirect] blacklist aging-time 60"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf an IPv4 or IPv6 address (except for the web server address) is added to the HTTPS redirection blacklist and then web authentication is performed on the user access network, using HTTPS to access this address does not trigger HTTPS redirection. You can run the blacklist aging-time command to configure the aging time of the addresses in the HTTPS redirection blacklist. After the time an IP address is within the HTTPS redirection blacklist reaches the aging time, the IP address will be deleted from the blacklist.\nPrerequisites\nThe function to insert the JavaScript script during web redirection has been enabled using the js enable command.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nThe aging time of the blacklist is affected by the change of the system time. After the system is changed to the aging time, the blacklist ages out."
}