{
    "PageTitle": "bras auto-upgrade enable",
    "FuncDef": "The bras auto-upgrade enable command enables a device to automatically block user access domains and boards and logs out online users.\nBy default, a device is disabled from automatically blocking user access domains and boards and logs out online users.",
    "CLIs": [
        "bras auto-upgrade enable"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> bras auto-upgrade enable",
            "Warning: Running the command will log out users on the BAS interface. Once logged out, the users can no longer go online. If the command has been run, reset the device. The configuration of this command is not saved in the configuration file. Therefore, after the reset, configurations on the device are restored to those before the command was run.",
            "<HUAWEI> reboot",
            "MPU 17:",
            "Next startup system software: cfcard:/VxxxRxxCxxBxxx.cc",
            "Next startup saved-configuration file: cfcard:/vrpcfg.cfg",
            "Next startup paf file: default",
            "Next startup patch package: cfcard:/VxxxRxxxSPH001.PAT",
            "Warning: Current configuration will be saved to the next startup saved-configuration file! Continue? [Y/N]:y",
            "Now saving the current configuration...........",
            "Save the configuration successfully.",
            "System will reboot! Continue? [Y/N]:y",
            "Warning: other user is upgrading, please reboot later.",
            "Are you sure to reboot Now? Please select [Y/N]:y",
            "Info: Block all slot.",
            "Info: Cut all users.",
            "Info: Total users need cut 0, already cut users 0 ",
            "Info: Cut all users finish."
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBefore a device upgrade, you must manually block the user access domains and boards of the device and log out online users, then run the reboot command to restart the device after users go offline. Instead, you can run the bras auto-upgrade enable command to automatically block the user access domains and boards of the device and log out online users, then run the reboot command to restart the device.\nIn RUI scenarios, logging out RUI users is not required.\nConfiguration Impact\nAfter the bras auto-upgrade enable and reboot commands are run in sequence, the system automatically blocks user access domains and boards and logs out online users (common users and administrators). After the users go offline, the system is rebooted. The bras auto-upgrade enable command is not stored in the configuration file of the system, and therefore must be run each time you need this function.\nFollow-up Procedure\nRun the reboot command to reboot the system.\nIf this command is run, upgrade staff need to restart the device. This command does not generate configuration file and is not stored in the configuration file. After the device is restarted, the device configuration remains unchanged.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}