{
    "PageTitle": "chasten redirect-packet",
    "FuncDef": "The chasten redirect-packet command restricts the number of HTTPS redirection packets that can be sent as a reply within a specified period.\nThe undo chasten redirect-packet command restores the default configuration.\nBy default, the number of HTTPS redirect packet send is 300, the period of HTTPS redirect packet send is 30 seconds, the period of HTTPS  blocked is 30 seconds, the TCP SYN packet processing rate in blocking state is 1 per second",
    "CLIs": [
        "chasten redirect-packet <send-number> <send-period> <blocking-period> <blocking-rate>",
        "undo chasten redirect-packet <send-number> <send-period> <blocking-period> <blocking-rate>"
    ],
    "ParentView": [
        "HTTPS redirect view"
    ],
    "ParaDef": [
        {
            "Parameters": "redirect-packet send-number",
            "Info": "Specifies the number of response redirection packets.\nThe value is an integer ranging from 1 to 10000."
        },
        {
            "Parameters": "redirect-packet send-period",
            "Info": "Specifies the time for responding to redirection packets.\nThe value is an integer ranging from 1 to 3600, in seconds."
        },
        {
            "Parameters": "redirect-packet blocking-period",
            "Info": "Specifies the block time for HTTPS flow setup.\nThe value is an integer ranging from 1 to 3600, in seconds."
        },
        {
            "Parameters": "redirect-packet blocking-rate",
            "Info": "Specifies the TCP SYN packet processing rate in blocking state.\nThe value is an integer that ranges from 1 to 10, in packets/second."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] access https-redirect",
            "[~HUAWEI-access-https-redirect] chasten redirect-packet 10000 3000 3000 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo prevent some users from using HTTPS TCP SYN packets with changing destination IP addresses to attack the device so that the HTTPS redirection function is not affected for other users, you need to restrict the rate at which HTTPS redirection packets are sent as a reply to each user. You can run the chasten redirect-packet command to configure the number of seconds during which a device is frozen if the number of HTTPS redirection packets replied by the device to the user within a specified period exceeds the preset threshold. Within this freezing period, the device discards the HTTPS TCP SYN packets sent by the user.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}