{
    "PageTitle": "chasten flow",
    "FuncDef": "The chasten flow command restricts the maximum number of times HTTPS flows can be established on a device.\nThe undo chasten flow command restores the default configuration.\nBy default, the number of HTTPS flow tables to be created is 300, the time for creating the HTTPS flow table is 30 seconds, the block time for HTTPS flow setup is 30 seconds, the TCP SYN packet processing rate in blocking state is 1 per second",
    "CLIs": [
        "chasten flow <connection-sessions> <connection-period> <blocking-period> <blocking-rate>",
        "undo chasten flow <connection-sessions> <connection-period> <blocking-period> <blocking-rate>"
    ],
    "ParentView": [
        "HTTPS redirect view"
    ],
    "ParaDef": [
        {
            "Parameters": "flow connection-sessions",
            "Info": "Specifies the number of HTTPS flow tables to be created.\nThe value is an integer ranging from 1 to 10000."
        },
        {
            "Parameters": "flow connection-period",
            "Info": "Specifies the time for creating the HTTPS flow table.\nThe value is an integer ranging from 1 to 3600, in seconds."
        },
        {
            "Parameters": "flow blocking-period",
            "Info": "Specifies the block time for HTTPS flow setup.\nThe value is an integer ranging from 1 to 3600, in seconds."
        },
        {
            "Parameters": "flow blocking-rate",
            "Info": "Specifies the TCP SYN packet processing rate in blocking state.\nThe value is an integer ranging from 1 to 10, in packets/second."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] access https-redirect",
            "[~HUAWEI-access-https-redirect] chasten flow 9000 3000 3000 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo prevent some users from using HTTPS TCP SYN packets with changing destination IP addresses to attack the device so that the HTTPS redirection function is not affected for other users, you need to restrict the rate at which HTTPS flows are established. You can run the chasten flow command to configure the number of seconds during which a device is frozen if the number of HTTPS flows established on the device within a specified period exceeds the preset threshold. Within this freezing period, the device discards the extra HTTPS TCP SYN packets sent by the user.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nIf both the chasten flow(slot) and chasten flow commands are run, the chasten flow(slot) command configuration takes effect."
}