{
    "PageTitle": "client-option60",
    "FuncDef": "The client-option60 command configures the attributes of the vendor-class (dhcpv4 option60/dhcpv6 option16) fields in DHCP packets so that the DHCP server can assign IP addresses from the corresponding address pool based on the domain name.\nThe undo client-option60 command cancels the configuration.\nBy default, the device does not trust the vendor-class information sent from the DHCP client.",
    "CLIs": [
        "client-option60",
        "undo client-option60"
    ],
    "ParentView": [
        "BAS interface view (GE)",
        "BAS interface view (VE)",
        "BAS interface view (trunk)"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] commit",
            "[~HUAWEI-GigabitEthernet1/0/1] bas",
            "[~HUAWEI-GigabitEthernet1/0/1-bas] client-option60"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter the client-option60 command is run on the BAS interface, the device considers the vendor-class information in the DHCP packets coming through the BAS interface valid and obtains user domain information from the vendor-class (dhcpv4 option60/dhcpv6 option16) field.\nIf user domain information is obtained from the vendor-class information, the character string following the domain name delimiter (defaulting to < ) in the vendor-class (dhcpv4 option60/dhcpv6 option16) field is used as the domain name. If no user domain information is obtained from the vendor-class information, the device performs the following procedure to continue searching for the information. If there is no domain name delimiter in the field, the device performs a fuzzy or accurate match of the domain name information based on the configured mode. The procedure will stop if user domain information is obtained.\nCheck if the client-option60 or client-vendor-class command is configured on the BAS interface. If the command is configured, obtain user domain information from the command configuration.Check if the dhcp option-60 or vendor-class command is configured in the system view. If the command is configured, obtain user information from the command configuration.Use the authorization domain configured on the BAS interface as the user domain.\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}