{
    "PageTitle": "client-option37",
    "FuncDef": "The client-option37 command enables the device to trust the information in the Option 37 field of DHCPv6 messages sent by the client.\nThe undo client-option37 command restores the default configuration.\nBy default, the device does not trust the information in the Option 37 field of DHCPv6 messages sent by the client.",
    "CLIs": [
        "client-option37 [ basinfo-insert ft-telecom ]",
        "undo client-option37 [ basinfo-insert ft-telecom ]"
    ],
    "ParentView": [
        "BAS interface view (GE)",
        "BAS interface view (VE)",
        "BAS interface view (trunk)"
    ],
    "ParaDef": [
        {
            "Parameters": "basinfo-insert ft-telecom",
            "Info": "encapsulates Option 37 information into a DHCP packet in ft telecom format.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 2/0/1",
            "[~HUAWEI-GigabitEthernet2/0/1] bas",
            "[~HUAWEI-GigabitEthernet2/0/1-bas] access-type layer2-subscriber",
            "[~HUAWEI-GigabitEthernet2/0/1-bas] client-option37"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter the client-option37 command is run, the server trusts the information in the Option 37 field of DHCPv6 messages sent by the client and sends the information in the Option 37 field to the RADIUS server. Option37 functions the same as the remote ID of Option 82 in DHCPv4. Option 37 indicates the ID of the broadband user access line, including the system DUID, interface, and VLAN information. Carriers determine how the Option 37 is filled.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nAfter the client-option37 command is run, if the request packet sent by a client does not carry Option 37, the dhcpv6 option-37 any-format decode enable command can be run so that the packets sent by the BAS to the server carry the default Option 37 (in the format of enterprise code + DUID). If the dhcpv6 option-37 any-format decode enable command is not run, such packets will not carry the default Option 37."
}