{
    "PageTitle": "client-vendor-class",
    "FuncDef": "The client-vendor-class command configures the device to trust the vendor-class (dhcpv4 option60/dhcpv6 option16) information in DHCP packets.\nThe undo client-vendor-class command cancels the configuration.\nBy default, the device does not trust the vendor-class information sent from the DHCP client.",
    "CLIs": [
        "client-vendor-class",
        "undo client-vendor-class"
    ],
    "ParentView": [
        "BAS interface view (GE)",
        "BAS interface view (VE)",
        "BAS interface view (trunk)"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] commit",
            "[~HUAWEI-GigabitEthernet1/0/1] bas",
            "[~HUAWEI-GigabitEthernet1/0/1-bas] client-vendor-class"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter the client-vendor-class command is run on the BAS interface, the NE40E considers the vendor-class information in the DHCP packets coming through the BAS interface valid and obtains user domain information from the vendor-class field.\nIf user domain information is obtained from the vendor-class information, the character string following the domain name delimiter (defaulting to @) in the vendor-class field is used as the domain name. If no user domain information is obtained from the vendor-class information, the NE40E performs the following procedure to continue searching for the information. If there is no domain name delimiter in the field, the NE40E performs a fuzzy or accurate match of the domain name information based on the configured mode. The procedure will stop if user domain information is obtained.\nCheck if the client-option60 or client-vendor-class command is configured on the BAS interface. If the command has been configured, obtain user domain information from the command configuration.Check if the dhcp option-60 or vendor-class command is configured in the system view. If the command is configured, obtain user information from the command configuration.Use the authorization domain configured on the BAS interface as the user domain.\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}