{
    "PageTitle": "default-password-template",
    "FuncDef": "The default-password-template command binds a user password template to a BAS interface.\nThe undo default-password-template command unbinds the user password template from a BAS interface.\nBy default, no user password template is bound to a BAS interface and the user password or user password generation mode configured in the system view is used.",
    "CLIs": [
        "default-password-template <template-name>",
        "undo default-password-template"
    ],
    "ParentView": [
        "BAS interface view (GE)",
        "BAS interface view (VE)",
        "BAS interface view (trunk)"
    ],
    "ParaDef": [
        {
            "Parameters": "template-name",
            "Info": "Specifies a user password template name.\nThe value is a string of 1 to 31 case-sensitive characters without spaces."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] default-password template pwd1 cipher huawei123",
            "[*HUAWEI-aaa] commit",
            "[~HUAWEI-aaa] quit",
            "[~HUAWEI] interface GigabitEthernet 1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] bas",
            "[~HUAWEI-GigabitEthernet1/0/1-bas] access-type layer2-subscriber",
            "[~HUAWEI-GigabitEthernet1/0/1-bas] default-password-template pwd1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe default-password template command can be used to configure a user password template for users who use the same user password generation mode. After the user password template is bound to a BAS interface, users that get online from the BAS interface can directly use configurations of the user password template.\nPrerequisites\nBefore binding the user password template to the BAS interface, run the default-password template command to configure a user password template. In addition, enable BAS on the interface and configure the access mode.\nConfiguration Impact\nIf this command is configured for multiple times, only the last configuration takes effect. Users that have been online are not affected. Users that get online after the command is configured will be affected.\nAfter the user password template is bound to a BAS interface, both the binding users that get online from the BAS interface and Web/fast authentication users use the user password or user password generation configured by the user password template.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}