{
    "PageTitle": "default-user-name-template",
    "FuncDef": "The default-user-name-template command binds a user name template to a Broadband Access Server (BAS) interface.\nThe undo default-user-name-template command cancels the binding of user name templates.\nBy default, no user name template is bound to a BAS interface. That is, a BAS interface uses the global user name template.",
    "CLIs": [
        "default-user-name-template <template-name>",
        "undo default-user-name-template"
    ],
    "ParentView": [
        "BAS interface view (GE)",
        "BAS interface view (VE)",
        "BAS interface view (trunk)"
    ],
    "ParaDef": [
        {
            "Parameters": "template-name",
            "Info": "Specifies a user name template.\nThe value is a string of 1 to 31 case-sensitive characters without spaces."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] default-user-name template kouki include sysname",
            "[~HUAWEI-aaa] commit",
            "[~HUAWEI-aaa] quit",
            "[~HUAWEI] interface GigabitEthernet 1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] commit",
            "[~HUAWEI-GigabitEthernet1/0/1] bas",
            "[~HUAWEI-GigabitEthernet1/0/1-bas] default-user-name-template kouki"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo use a user name template to generate a user name for a user on a BAS interface, bind the user name template to the BAS interface.\nPrerequisites\nBefore configuring this command, you must create corresponding user name templates in the AAA view through the default-user-name command.\nConfiguration Impact\nIf the default-user-name-template command is run more than once, the latest configuration overrides the previous one. The configuration takes effect only for users who are activated after the command is run.\nPrecautions\nThis command is supported only on the admin VS.\nIf a user name template is bound to a BAS interface using the default-user-name-template command and the user name generation mode is configured using the default-user-name include command in the AAA view, the user name template bound to the BAS interface takes effect. If using a user name template to generate a user name fails, the user name generation mode configured in the AAA view is still not used. Instead, allow the system to automatically generate a user name."
}