{
    "PageTitle": "delete chasten-user",
    "FuncDef": "The delete chasten-user command deletes information about an HTTPS redirection suppression user on the board in a specified slot.",
    "CLIs": [
        "delete chasten-user slot <slotid> [ { ip-address <ip-address> | ipv6-address <ipv6-address/length> } [ vpn-instance <instance-name> ] ]"
    ],
    "ParentView": [
        "HTTPS redirect view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address ip-address",
            "Info": "Specifies the user IPv4 address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "ipv6-address ipv6-address/length",
            "Info": "ipv6-address: Specifies a user IPv6 address.\nlength: Specifies the prefix length of an IPv6 address.\nipv6-address: The value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X.\nlength: The value is an integer, ranging from 0 to 128."
        },
        {
            "Parameters": "vpn-instance instance-name",
            "Info": "Specifies the VPN instance name.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported.  If spaces are used, the string must start and end with double quotation marks (\"). In addition, the VPN instance name cannot be _public_."
        },
        {
            "Parameters": "slot slotid",
            "Info": "Specifies the slot.\nThe value is a string of 1 to 16 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] access https-redirect",
            "[~HUAWEI-access-https-redirect] delete chasten-user slot 1 ip-address 10.10.10.1 vpn-instance hw"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] access https-redirect",
            "[~HUAWEI-access-https-redirect] delete chasten-user slot 1 ipv6-address 2001:db8:1::1/128 vpn-instance hw"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe delete chasten-user command can be used in the following scenarios to reconfigure information about an HTTPS redirection suppression user.\nRun the delete chasten-user command to manually release a user's chasten status and allow the user to process HTTPS redirection.Before running the display access https-redirect chasten-user command to view statistics of a suppressed user within a specified period, run the delete chasten-user command to clear the original statistics.\n\nConfiguration Impact\nClearing entries of an HTTPS redirection user terminates HTTPS redirection suppression on the user.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}