{
    "PageTitle": "deny-domain-list",
    "FuncDef": "The deny-domain-list command specifies a list of domains in which users are not allowed to access the BAS interface.\nThe undo deny-domain-list command cancels the previous configuration.\nBy default, all domains are allowed to access.",
    "CLIs": [
        "deny-domain-list <domainlist-name>",
        "undo deny-domain-list"
    ],
    "ParentView": [
        "BAS interface view (GE)",
        "BAS interface view (VE)",
        "BAS interface view (trunk)"
    ],
    "ParaDef": [
        {
            "Parameters": "domainlist-name",
            "Info": "Specifies the list of domains in which users are not allowed to access the BAS interface. The domain list must have been created.\nThe list name is a string of 1 to 32 characters excluding *, ?, and \". The value is not case sensitive."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] domain-list domlist1",
            "[~HUAWEI-aaa-domainlist-domlist1] commit",
            "[~HUAWEI-aaa-domainlist-domlist1] quit",
            "[~HUAWEI-aaa] quit",
            "[~HUAWEI] interface GigabitEthernet 1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] commit",
            "[~HUAWEI-GigabitEthernet1/0/1] bas",
            "[~HUAWEI-GigabitEthernet1/0/1-bas] access-type layer2-subscriber",
            "[~HUAWEI-GigabitEthernet1/0/1-bas] deny-domain-list domlist1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo prevent users in certain domains from accessing the BAS interface, you need to run the deny-domain-list command.\nPrerequisites\nThe access-type command has been run to set the access type to layer2-subscriber.\nConfiguration Impact\nIf the deny-domain-list command is run on the BAS interface, users in the domains specified by this command are not allowed to access the BAS interface, but users of other domains are allowed to access the BAS interface. If the deny-domain-list command is not run, all domain users can access the BAS interface.\nPrecautions\nThis command is supported only on the admin VS.\nThe deny-domain-list command cannot be configured together with the permit-domain-list, permit-domain, or deny-domain command on the BAS interface."
}