{
    "PageTitle": "dhcpv6-server replace client-duid",
    "FuncDef": "The dhcpv6-server replace client-duid command configures the device that functions as a DHCPv6 relay agent to replace the client DUID in a DHCPv6 message sent from a client with the one it generates for that client before sending the message to a server.\nThe undo dhcpv6-server replace client-duid command restores the default configuration.\nBy default, the device retains the client DUIDs in received DHCPv6 messages when sending them to a server.",
    "CLIs": [
        "dhcpv6-server replace client-duid",
        "undo dhcpv6-server replace client-duid"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dhcpv6-server replace client-duid"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen one-to-many mapping between one MAC address and many sessions is enabled, if clients have the same client DUID, the client DUID cannot uniquely identify a DHCPv6 client. To allow a server to use a client DUID to uniquely identify a client, run the dhcpv6-server replace client-duid command so that the NE40E replaces the client DUID in a DHCPv6 message sent from a client with the one it generates for that client before sending the message to the server.\nAfter the DHCPv6 relay agent receives a reply message, the relay agent replaces the client DUID in the message with the original one before sending the message to the client.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nThe dhcpv6-server replace client-duid command cannot be used together with the reserved ipv6-address { mac | duid } [ lease ] command in the remote address pool view. After the reserved ipv6-address mac lease command is run in the remote address pool view, the DHCP server cannot detect a user logout and reserves a lease for the address of the user. If the dhcpv6-server replace client-duid command is run in the remote address pool view, the DHCP server replaces the DUID of the user. As a result, the server cannot query the user, or the client DUID check fails after the user is found."
}