{
    "PageTitle": "dhcp option include redirect ds-domain enable",
    "FuncDef": "The dhcp option include redirect ds-domain enable command enables identify enterprise users and redirect them to a specified BA classification domain. The enterprise user identification is based on the character string carried in the Optional field of an ACK packet sent by the DHCP server.\nThe undo dhcp option include redirect ds-domain enable command restores the default configuration.\nBy default, the function to redirect users with specified Option information to a specified BA classification domain is disabled.",
    "CLIs": [
        "dhcp option <option-code> include <option-include> redirect ds-domain enable",
        "undo dhcp option <option-code> include <option-include> redirect ds-domain enable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "include option-include",
            "Info": "Specifies a character string in the Option field.\nThe value is a string of 1 to 32 characters."
        },
        {
            "Parameters": "option option-code",
            "Info": "Specifies an Option code.\nThe value is an integer ranging from 224 to 254."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dhcp option 224 include oro redirect ds-domain enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nACK packets sent by the DHCP server carry specific Option information. To enable the device to identify enterprise users based on a specified character string in the Option field and redirect them to a specified BA classification domain, run the dhcp option command. If the user is considered an enterprise user, the device re-selects a BA classification policy for the user. If the user is considered a family user, the originally configured BA classification policy still takes effect. To control the parsing of Option actions and contents in ACK packets on the BRAS, run the dhcp option command.\nImplementation Procedure\nRun the redirect ds-domain command to specify a BA classification domain to which enterprise users are redirected.\nPrecautions\nIf the dhcp option command is run more than once, the latest configuration overrides the previous one.The configuration takes effect only for new users."
}