{
    "PageTitle": "display vlan-statistics interface",
    "FuncDef": "The display vlan-statistics interface command displays statistics about user packets with specified VLAN IDs on a specified interface.",
    "CLIs": [
        "display vlan-statistics interface { <interface-name> | <interface-type> <interface-number> } pevlan <pevlan-id> [ cevlan <cevlan-id> ] [ verbose ]",
        "display vlan-statistics interface { <interface-name> | <interface-type> <interface-number> } cevlan <cevlan-id>"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "pevlan pevlan-id",
            "Info": "Displays statistics about user packets with a specified single or outer VLAN ID on a specified interface.\nThe value is an integer ranging from 1 to 4094."
        },
        {
            "Parameters": "cevlan cevlan-id",
            "Info": "Displays statistics about user packets with a specified inner VLAN ID on a specified interface.\nThe value is an integer ranging from 1 to 4094."
        },
        {
            "Parameters": "verbose",
            "Info": "Displays verbose information.\n-"
        },
        {
            "Parameters": "interface interface-type",
            "Info": "Displays statistics about user packets on a specified interface.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display vlan-statistics interface gigabitethernet 1/0/2.1 pevlan 1",
            "Interface Name: GigabitEthernet1/0/2.1  ",
            "  input: 0 packets, 0 bytes",
            "  output: 0 packets, 0 bytes",
            "  ipv4 input: 0 packets, 0 bytes",
            "  ipv4 output: 0 packets, 0 bytes",
            "  ipv6 input: 0 packets, 0 bytes",
            "  ipv6 output: 0 packets, 0 bytes"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn some networks, each device is assigned a unique outer VLAN ID. Statistics about upstream and downstream user traffic on an interface bound to a VLAN help diagnose whether a device is working properly. If no user traffic exists on the device for a long time, the device may fail and requires a further check.\nTo check statistics about user packets with specified VLAN IDs on a specified interface, run the display vlan-statistics command. The command output helps you analyze interface faults.\nIf interface . and pevlan are specified, statistics about user packets with pevlan-id as the single VLAN ID are displayed on the specified dot1q sub-interface.If interface ., pevlan , and cevlan are specified, statistics about user packets with as the outer VLAN ID and cevlan-id as the inner VLAN ID are displayed on the specified QinQ sub-interface.If interface and pevlan are specified, statistics about user packets with pevlan-id as the single VLAN ID are displayed for the dot1q sub-interface on the specified interface and statistics about user packets with as the outer VLAN ID are displayed for the QinQ sub-interface on the specified interface.If interface and cevlan are specified, statistics about user packets with as the inner VLAN ID are displayed for the QinQ sub-interface on the specified interface.\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}