{
    "PageTitle": "http-redirect",
    "FuncDef": "The http-redirect command redirects login users to an authentication web page.\nThe undo http-redirect command cancels the configuration.\nBy default, the http redirect function is disabled.",
    "CLIs": [
        "http-redirect [ plus ]",
        "undo http-redirect [ plus ]"
    ],
    "ParentView": [
        "Traffic behavior view"
    ],
    "ParaDef": [
        {
            "Parameters": "plus",
            "Info": "Http redirect plus.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic behavior b1",
            "[~HUAWEI-behavior-b1] http-redirect"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo redirect login users to an authentication web page, run the http-redirect command. Running the http-redirect command implements redirection functions:\nAfter users go online, the redirection web page is displayed for forcible advertisement push.After web users go online, users can only access the web server or limited resources in the pre-authentication domain.The web process is reused to limit users to access specified network resources. When users access other resources, a prompt page is displayed.\nThe web address forcibly pushed to users is configured in the user online domain.\n\nPrerequisites\nUser online settings are completed. The web address forcibly pushed to users has been configured in the user online domain.The http-redirect command has been configured in the traffic behavior profile.When using traffic classification to define a redirection web page, run the rule command to configure the advanced ACL rule to match the port number associated with the HTTP address.\n\nPrecautions\nThe policy-based routing and BRAS redirection are mutually exclusive in one traffic behavior.\nThe configured web page is only pushed to users after the http-redirect command is configured.\nIf the AAA domain configured the IPv4 and IPv6 address of Portal Server, without user web address, the user web address will not be matched after IPv6 address matched. That may be led to The web address forcibly pushed to users failed."
}