{
    "PageTitle": "ip unr",
    "FuncDef": "The ip unr command configures route tags for IPv4 users.\nThe undo ip unr command restores the default route tag.\nThe default tag is set to 0, which means that user routes are not classified.",
    "CLIs": [
        "ip unr { local-pool-tag <tag-value> | remote-pool-tag <tag-value> | framed-route-tag <tag-value> | framed-ip-netmask-tag <tag-value> | framed-ip-address-tag <tag-value> | dynamic-pool-tag <tag-value> } *",
        "undo ip unr { local-pool-tag | remote-pool-tag | framed-route-tag | framed-ip-netmask-tag | framed-ip-address-tag | dynamic-pool-tag } *"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "local-pool-tag tag-value",
            "Info": "Specifies the route tag of the network segment generated by an IPv4 local address pool.\nThe value is an integer ranging from 0 to 4294967295."
        },
        {
            "Parameters": "remote-pool-tag tag-value",
            "Info": "Specifies the route tag of the network segment generated by an IPv4 remote address pool.\nThe value is an integer ranging from 0 to 4294967295."
        },
        {
            "Parameters": "framed-route-tag tag-value",
            "Info": "Specifies the route tag of the network segment generated based on the Framed-Route attribute delivered by the RADIUS server.\nThe value is an integer ranging from 0 to 4294967295."
        },
        {
            "Parameters": "framed-ip-netmask-tag tag-value",
            "Info": "Specifies the route tag of the network segment generated based on the IP-Netmask attribute delivered by the RADIUS server.\nThe value is an integer ranging from 0 to 4294967295."
        },
        {
            "Parameters": "framed-ip-address-tag tag-value",
            "Info": "Specifies the route tag of the host route generated based on the IPv4 address delivered by the RADIUS server.\nThe value is an integer ranging from 0 to 4294967295."
        },
        {
            "Parameters": "dynamic-pool-tag tag-value",
            "Info": "Specifies the route tag of the network segment generated by an IPv4 dynamic address pool.\nThe value is an integer ranging from 0 to 4294967295."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip unr framed-route-tag 10",
            "[~HUAWEI] ip unr framed-ip-netmask-tag 20",
            "[~HUAWEI] ip unr framed-ip-address-tag 20"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nConfiguring tags and using routing policies allows various user routes to be advised to specific networks.\nConfiguration Impact\nThe ip unr command takes effect globally, and routes are classified based on tags. Tag values are specified in routing policies to advertise routes to specific networks.\nThis command takes effect on routes of new access users, routes of a new IPv4 address pool, and routes of a modified IPv4 address pool. However, this command does not take effect on UNR routes that have been generated on the device.\nRoute tags of different types can be configured at the same time. If a type of route has multiple tags configured, the latest configuration takes effect.\nFollow-up Procedure\nSpecify a behavior to process a route that matches a specified tag value in a routing policy. Use a routing protocol to import the routes based on the specified routing policy.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}