{
    "PageTitle": "ipoe-server multi-sessions per-mac enable",
    "FuncDef": "The ipoe-server multi-sessions per-mac enable command enables one-to-many mapping between one MAC address and many sessions to allow a device to assign IP addresses to DHCPv4, DHCPv6, and ND users with the same MAC address.\nThe undo ipoe-server multi-sessions per-mac enable command disables one-to-many mapping between one MAC address and many sessions of DHCPv4, DHCPv6, and ND users.\nBy default, one-to-many mapping between one MAC address and many sessions is disabled, and the device assigns IP addresses only to DHCPv4, DHCPv6, and ND users with different MAC addresses.",
    "CLIs": [
        "ipoe-server multi-sessions per-mac enable",
        "undo ipoe-server multi-sessions per-mac enable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipoe-server multi-sessions per-mac enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, the device that functions as a BRAS or DHCP server assigns IP addresses only to DHCPv4, DHCPv6, and ND users with different MAC addresses. To allow the device to assign IP addresses to DHCPv4, DHCPv6, and ND users with the same MAC address, run the ipoe-server multi-sessions per-mac enable command. The device then assigns different session IDs to the users with the same MAC address, and the users are identified by these session IDs.\nWhen the device functions as a BRAS, users with the same MAC address must go online through different VLANs or interfaces. Packets from these users can carry Option 82 or not. However, if the user packets carry Option 82, they must carry different Option 82 field values.\nWhen the device functions as a network-side DHCP server, packets from users with the same MAC address must carry different Option 82 field values.\nPrerequisites\nNo DHCPv4, DHCPv6, or ND users are online or available in RUI scenarios.\nPrecautions\nThis command is supported only on the admin VS.\nAfter one-to-many mapping between one MAC address and multiple sessions is enabled for IPoE users, note the following restrictions:\nEAP authentication and RADIUS proxy are not supported.The address reservation function is not supported.A PPPoE user cannot preferentially go online when the PPPoE user and an IPoE user with the same MAC address request to go online at the same time.A DHCP server cannot proactively send DHCP response packets to clients.In remote address pool scenarios, if the DHCP server does not support one-to-many mapping between one MAC address and multiple sessions, users may fail to go online.The function to log out an online dynamic IPv6 user when a static IPv6 user with the same MAC address request to go online is not supported.IPv6 multicast is not supported.\nWhen automatic backup of DHCPv4 user information and one-to-many mapping between one MAC address and many sessions for users are both used, note the following:\nWhen automatic backup of DHCPv4 user information is enabled, changing the one-to-many mapping between one MAC address and many sessions for users clears all autosave entries in the memory.For autosave files that are saved when the one-to-many mapping between one MAC address and many sessions for users is enabled, after the one-to-many mapping is disabled, only one user from the multiple users using the same MAC address saved in the autosave files can go online.For autosave files that are saved when the one-to-many mapping between one MAC address and many sessions for users is disabled, after the one-to-many mapping is enabled, users whose Option 82 information is not saved in the autosave files cannot go online by sending packets.The ipoe-server multi-sessions per-mac enable, ipv6-pool address-assign-mode eui-64, and dhcpv6-server destination commands cannot be configured at the same time.If the Option 82 field carried in the Request packet is inconsistent with that carried in the Discover packet, users fail to go online."
}