{
    "PageTitle": "layer3-subscriber subnet-session",
    "FuncDef": "The layer3-subscriber subnet-session command configures a mask so that an IPv4 address segment and authentication domain name are specified for Layer 3 static users.\nThe undo layer3-subscriber subnet-session command cancels the configuration.\nBy default, no IPv4 address segment or authentication domain name is specified for Layer 3 static users through a mask.",
    "CLIs": [
        "layer3-subscriber subnet-session <start-ip-address> { <mask-address> | <mask-length> } [ vpn-instance <instance-name> ] domain-name <domain-name>",
        "undo layer3-subscriber subnet-session <start-ip-address> { <mask-address> | <mask-length> } [ vpn-instance <instance-name> ] [ domain-name <domain-name> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "start-ip-address",
            "Info": "Specifies a start IPv4 address for the address segment to which Layer 3 static users belong.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "mask-length",
            "Info": "Specifies a mask length.\nThe value is an integer ranging from 1 to 32."
        },
        {
            "Parameters": "vpn-instance instance-name",
            "Info": "Specify a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "domain-name domain-name",
            "Info": "Specifies a domain name.\nThe value is a string of 1 to 64 case-insensitive characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] layer3-subscriber subnet-session 1.1.1.1 24 domain-name huawei"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn the scenario where Layer 3 static users access an enterprise network, all user terminals are on the same network segment, and the users need to be authenticated on the BRAS before they can access the network. To allow the BRAS to centrally manage enterprise users, run the layer3-subscriber subnet-session command to configure a mask. When the first user in an enterprise goes online, the BRAS generates a network segment route. Subsequent users in the enterprise do not need to be authenticated on the BRAS, and the BRAS directly forwards the user traffic. This allows the BRAS to centrally manage user access and perform authentication and accounting for all terminal users of the enterprise.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}