{
    "PageTitle": "link-account resolve",
    "FuncDef": "The link-account resolve command enables the device to send accounting-request packets carrying link-account information to a RADIUS server.\nThe undo link-account resolve command restores the default configuration.\nBy default, the sent accounting-request packets do not carry link-account information.",
    "CLIs": [
        "link-account resolve",
        "undo link-account resolve"
    ],
    "ParentView": [
        "BAS interface view (GE)",
        "BAS interface view (VE)",
        "BAS interface view (trunk)"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1/0/2.1",
            "[*HUAWEI-GigabitEthernet1/0/2.1] commit",
            "[*HUAWEI-GigabitEthernet1/0/2.1] user-vlan 100",
            "[*HUAWEI-GigabitEthernet1/0/2.1-vlan-100-100] vlan 100 description client1",
            "[*HUAWEI-GigabitEthernet1/0/2.1-vlan-100-100] quit",
            "[*HUAWEI-GigabitEthernet1/0/2.1] commit",
            "[*HUAWEI-GigabitEthernet1/0/2.1] bas",
            "[*HUAWEI-GigabitEthernet1/0/2.1-bas] access-type layer2-subscriber",
            "[*HUAWEI-GigabitEthernet1/0/2.1-bas] link-account resolve"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf an accounting server needs to account the users getting online without authentication, it must differentiate users. The link-account resolve command can be used to enable the device to send accounting-request packets carrying link-account information to the accounting server, thereby differentiating users.\nPrerequisites\nThe access-type is configured to Layer 2 subscriber .\nConfiguration Impact\nThe RADIUS No.25 attribute for accounting-request packets sent by the device to a RADIUS accounting server is affected.\nAn interface fills in the link-account information in the RADIUS No.25 attribute class if both the following situations are met:\nUsers getting online from the interface do not need to be authenticated and RADIUS accounting is configured on the interface.VLANs and VLAN descriptions are configured on the interface.\n\nPrecautions\nThis command is supported only on the admin VS.\nThe link-account resolve command cannot be configured in the BAS interface views of GigabitEthernet, Eth-Trunk, or Virtual-Ethernet interfaces."
}