{
    "PageTitle": "nas logic-port (BAS interface view)",
    "FuncDef": "The nas logic-port command specifies the logical interface of the interface.\nThe undo nas logic-port command deletes the logical interface of the interface.\nBy default, an interface has no logical interface.",
    "CLIs": [
        "nas logic-port { <interface-type> <interface-number> | <interface-name> }",
        "undo nas logic-port"
    ],
    "ParentView": [
        "BAS interface view (GE)",
        "BAS interface view (VE)",
        "BAS interface view (trunk)"
    ],
    "ParaDef": [
        {
            "Parameters": "interface-type",
            "Info": "Specifies the interface type of the logic interface. An Ethernet, GE, Eth-Trunk, can be specified as a logic interface in the BAS interface view or RBP view. Only an Eth-Trunk interface can be specified as a logic interface in the Eth-Trunk interface view. The format of logical interface numbers is \"slot number/subcard number/interface number.\".\n-"
        },
        {
            "Parameters": "interface-number",
            "Info": "Specifies the interface number of the logic interface. An Ethernet, GE, Eth-Trunk, can be specified as a logic interface in the BAS interface view or RBP view. Only an Eth-Trunk interface can be specified as a logic interface in the Eth-Trunk interface view. The format of logical interface numbers is \"slot number/subcard number/interface number.\".\nThe value is a string of 1 to 63 characters."
        },
        {
            "Parameters": "interface-name",
            "Info": "Specifies the interface name of the logic interface.\nThe value is a string of 1 to 63 characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet2/0/0.1",
            "[*HUAWEI-GigabitEthernet2/0/0.1] commit",
            "[*HUAWEI-GigabitEthernet2/0/0.1] bas",
            "[*HUAWEI-GigabitEthernet2/0/0.1-bas] access-type layer2-subscriber",
            "[*HUAWEI-GigabitEthernet2/0/0.1-bas] nas logic-port GigabitEthernet1/0/1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe nas logic-port and nas logic-sysname commands are applied to the remote backup of user information. Through these commands, the NAS-Port, NAS-Port-ID, and Option82 information in the packets that the primary and secondary devices send to the RADIUS and DHCP servers are identical.\nConfigure the same logical host name and logical interface on the BAS interfaces that back up each other. The NAS-Port, NAS-Port-ID, and Option 82 information in the packets that the primary and secondary devices send to the RADIUS and DHCP servers are identical.\nConfiguration Impact\nAfter the logical host name and logical interface are configured on the BAS interface:\nNames of pre-authentication and bound authentication IPoE users are generated by the logical port number.When the system needs to generate Option82 information because no user carries Option82 information or to change Option82 information because Option82 information about untrusted users is configured on the NE40E, Option82 information is generated by the logical host name and logical interface.The NAS-Port and NAS-Port-ID of the RADIUS authentication are generated by the logical host name and logical interface. If host name information is excluded in the NAS-Port and NAS-Port-ID, the NAS-Port and NAS-Port-ID are generated by the logical interface.\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nYou cannot configure logical interfaces to BAS interfaces of the leased line type on the NE40E.\nWhen this command is configured both in the profile view and in the BAS interface view, only the one configured in the profile view takes effect.\nIf the nas logic-port command is used in the profile, Eth-Trunk interface, and BAS interface views, the configuration in the profile view takes effect.\nIf the nas logic-port command is run on an Eth-Trunk interface, the configuration takes effect for all Eth-Trunk sub-interfaces in the BAS interface view. This command cannot be run in the Eth-Trunk sub-interface view.\nIf the nas logic-port command is used in the Eth-Trunk interface and BAS interface views, the configuration in the BAS interface view takes effect."
}