{
    "PageTitle": "nas logic-ip (BAS interface view)",
    "FuncDef": "The nas logic-ip command configures the logical IP address of the BAS interface or Eth-Trunk interface.\nThe undo nas logic-ip command deletes the logical IP address of the BAS interface or Eth-Trunk interface.\nBy default, the BAS interface or Eth-Trunk interface has no logical IP address.",
    "CLIs": [
        "nas logic-ip <ip-address>",
        "undo nas logic-ip"
    ],
    "ParentView": [
        "BAS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address",
            "Info": "Specifies the logical IP address.\nThe dotted decimal notation is adopted. The format is X.X.X.X. The value cannot be 0.0.0.0 or 255.255.255.255."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] bas",
            "[*HUAWEI-GigabitEthernet1/0/1-bas] access-type layer2-subscriber",
            "[*HUAWEI-GigabitEthernet1/0/1-bas] nas logic-ip 1.1.1.1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe nas logic-ip command is applied to the remote backup of user information. Through this command, the NAS-IP-Address information in the packets that the primary and secondary devices send to the RADIUS and DHCP servers is identical.\nConfigure the same logical IP address on the BAS interfaces that back up each other. In this way, the NAS-IP-Address information in the packets that the primary and secondary devices send to the RADIUS and DHCP servers is identical.\nPrerequisites\nBefore configuring the logical IP address, you must set the access type of the BAS interface to layer2-subscriber.\nConfiguration Impact\nAfter the logical IP address is configured on the BAS interface, the NAS-IP-Address information in the packets sent to the RADIUS and DHCP servers from the NE40E is generated by the logical IP address of the BAS interface.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nWhen this command is configured both in the profile view and in the BAS interface view, only the one configured in the profile view takes effect. If the nas logic-ip command is used on a trunk interface, the configuration takes effect on the trunk interface and its sub-interfaces. If the nas logic-ip command is used in the profile, Eth-trunk interface, and BAS interface views, the configuration in the profile view takes effect. If the nas logic-ip command is used in the Eth-trunk interface and BAS interface views, the configuration in the BAS interface view takes effect. If the nas logic-ip command is used in the Eth-trunk interface view, the interface type can only be Eth-Trunk."
}