{
    "PageTitle": "option37-relay-mode include remote-id",
    "FuncDef": "The option37-relay-mode include remote-id command enables a device to delete enterprise number carried in the Option 37 field from a DHCPv6 Solicit or Request message to be sent to the UM component.\nThe undo dhcpv6 option-37 rebuild self-define send-to-server command restores the default configuration.\nBy default, the device does not remove any information from Option 37 in a DHCPv6 Solicit or Request message to be sent to the UM component.",
    "CLIs": [
        "option37-relay-mode include remote-id",
        "undo option37-relay-mode include remote-id"
    ],
    "ParentView": [
        "BAS interface view (GE)",
        "BAS interface view (VE)",
        "BAS interface view (trunk)"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] commit",
            "[~HUAWEI-GigabitEthernet1/0/1] bas",
            "[~HUAWEI-GigabitEthernet1/0/1-bas] access-type layer2-subscriber",
            "[~HUAWEI-GigabitEthernet1/0/1-bas] option37-relay-mode include remote-id"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA 4-byte enterprise number is carried in DHCPv6 Option 37. The current implementation allows the device to carry both enterprise number and remote ID in a Solicit or Request message to be sent to the UM component but only remote ID in a Discover or Request message to be sent to the UM component. If the RADIUS attribute Agent-Remote-Id is used for authentication for IPv4 and IPv6 dual-stack users, the information carried in the Agent-Remote-Id attribute of a DHCPv4 message and a DHCPv6 message is different. To resolve this problem, run the option37-relay-mode include remote-id command in the BAS interface view to enable the device to save all the information of Option 37 but carry only remote ID in a DHCPv6 Solicit or Request message to be sent to the UM component. This ensures that only remote ID information is encapsulated into the Agent-Remote-Id attribute of both DHCPv4 and DHCPv6 login requests.\nPrerequisites\nThe NE40E has been enabled to trust the information in the Option 37 field of DHCPv6 messages sent by clients using the client-option37 command.The NE40E has been enabled to trust the information in the Option 18 field of DHCPv6 messages sent by clients using the client-option18 command.\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}