{
    "PageTitle": "permit-domain-list",
    "FuncDef": "The permit-domain-list command specifies a list of domains in which the users are allowed to access the BAS interface. Users in other domains are not allowed to access the BAS interface.\nThe undo permit-domain-list command cancels the previous configuration.\nBy default, users in all domains are allowed to access the BAS interface.",
    "CLIs": [
        "permit-domain-list <domainlist-name>",
        "undo permit-domain-list"
    ],
    "ParentView": [
        "BAS interface view (GE)",
        "BAS interface view (VE)",
        "BAS interface view (trunk)"
    ],
    "ParaDef": [
        {
            "Parameters": "domainlist-name",
            "Info": "Specifies the list of domains in which the users are allowed to access the BAS interface. The domain list must have been created.\nThe value is a string of 1 to 32 characters excluding *, ?, and \". The value is not case sensitive."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] bas",
            "[*HUAWEI-GigabitEthernet1/0/1-bas] access-type layer2-subscriber",
            "[*HUAWEI-GigabitEthernet1/0/1-bas] permit-domain-list domlist1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe permit-domain-list command can be used to specify a list of domains in which the users are allowed to access the BAS interface.\nPrerequisites\nThe access-type command has been run to set the access type to layer2-subscriber.\nConfiguration Impact\nIf the permit-domain-list command is run, only the users in the specified domains on the domain list can access the BAS interface. Otherwise, all domain users can access the BAS interface.\nIf the permit-domain-list command is run more than once to configure the list of domains whose users are allowed to access by using the BAS interface, the latest configuration overrides the previous one.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nThe permit-domain-list command cannot be configured together with the deny-domain-list, deny-domain, or permit-domain command on one BAS interface."
}