{
    "PageTitle": "reset access trigger user-table",
    "FuncDef": "The reset access trigger user-table command deletes information about users whose access packets are limited on a board.",
    "CLIs": [
        "reset access trigger user-table slot <slot-id> [ interface { <interface-type> <interface-number> | <interface-name> } ] [ mac-address <mac-address> ] [ ip-address <ip-address> ] [ prefix <prefix-address> ] [ ipv6-address <ipv6-address> ]",
        "reset access trigger user-table all"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "interface interface-type",
            "Info": "Deletes detailed information about users on a specified interface.\n-"
        },
        {
            "Parameters": "mac-address mac-address",
            "Info": "Deletes detailed information about the user with a specified MAC address.\nThe value is a 12-digit hexadecimal number, in the format of H-H-H. Each H is 4 digits. If an H contains fewer than 4 digits, the left-most digits are padded with zeros. For example, e0 is displayed as 00e0."
        },
        {
            "Parameters": "ip-address ip-address",
            "Info": "Deletes detailed information about the user with a specified IPv4 address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "prefix prefix-address",
            "Info": "Deletes detailed information about the user with a specified IPv6 prefix.\nThe value is a 32-bit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "ipv6-address ipv6-address",
            "Info": "Deletes detailed information about the user with a specified IPv6 address.\nThe value is a 32-bit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "all",
            "Info": "Deletes information about users whose access packets are limited on all boards.\n-"
        },
        {
            "Parameters": "slot slot-id",
            "Info": "Deletes information about users whose access packets are limited on the board in a specified slot.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset access trigger user-table slot 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter the access trigger packet-limit command is run to configure a limit on the number of ARP/IP/IPv6/ND packets that can be sent to the main control board, you can run the reset access trigger user-table command to delete information about users whose access packets are limited.\nPrerequisites\nThe access trigger packet-limit command has been run.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}