{
    "PageTitle": "reset vlan-statistics",
    "FuncDef": "The reset vlan-statistics command deletes statistics about user packets with specified VLAN IDs from a specified interface.",
    "CLIs": [
        "reset vlan-statistics interface { <interface-name> | <interface-type> <interface-number> } all",
        "reset vlan-statistics interface { <interface-name> | <interface-type> <interface-number> } cevlan <cevlan-id>",
        "reset vlan-statistics interface { <interface-name> | <interface-type> <interface-number> } pevlan <pevlan-id> [ cevlan <cevlan-id> ]"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "interface-name",
            "Info": "Deletes statistics about user packets from a specified interface name.\n-"
        },
        {
            "Parameters": "all",
            "Info": "Clear all statistics in the interface.\n-"
        },
        {
            "Parameters": "interface interface-type interface-number",
            "Info": "Deletes statistics about user packets from a specified interface.\n-"
        },
        {
            "Parameters": "cevlan cevlan-id",
            "Info": "Deletes statistics about user packets with a specified inner VLAN ID from a specified interface.\nThe value is an integer ranging from 1 to 4094."
        },
        {
            "Parameters": "pevlan pevlan-id",
            "Info": "Deletes statistics about user packets with a specified single or outer VLAN ID from a specified interface.\nThe value is an integer ranging from 1 to 4094."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset vlan-statistics interface GigabitEthernet 1/0/1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBefore collecting statistics about user packets with a specified outer VLAN ID, inner VLAN ID, or any VLAN ID on a specified interface within a period, run the reset vlan statistics command to delete the existing traffic statistics of this interface.\nIf interface <interface-type> <interface-number>.<subinterface-number> and pevlan <pevlan-id> are specified, statistics about user packets with <pevlan-id> as the single VLAN ID are deleted from the specified dot1q sub-interface.If interface <interface-type> <interface-number>.<subinterface-number>, pevlan <pevlan-id>, and cevlan <cevlan-id> are specified, statistics about user packets with pevlan-id as the outer VLAN ID and cevlan-id as the inner VLAN ID are deleted from the specified QinQ sub-interface.If interface <interface-type> <interface-number> and pevlan <pevlan-id> are specified, statistics about user packets with pevlan-id as the single VLAN ID are deleted from the dot1q sub-interface on the specified interface and statistics about user packets with pevlan-id as the outer VLAN ID are deleted from the QinQ sub-interface on the specified interface.If interface <interface-type> <interface-number> and cevlan <cevlan-id> are specified, statistics about user packets with cevlan-id as the inner VLAN ID are deleted from the QinQ sub-interface on the specified interface.If all is specified, all user packets with any VLAN ID on the interface are deleted.\n\nPrecautions\nThis command is supported only on the admin VS.\nStatistics cannot be restored after you delete them. Therefore, exercise caution when running the reset vlan statistics command."
}