{
    "PageTitle": "reset access statistics packet discard",
    "FuncDef": "The reset access statistics packet discard mac-spoofing command clears statistics about MAC-spoofing-dropped packets of access users.\nThe reset access statistics packet discard urpf command clears statistics about URPF-dropped packets of access users.",
    "CLIs": [
        "reset access statistics packet discard { mac-spoofing | urpf } [ ipoe | pppoe ] [ ipv4 | ipv6 ] { interface { <interface-type> <interface-name> | <interface-number> } | slot <slot-id> }"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "mac-spoofing",
            "Info": "Clears statistics about MAC-spoofing-dropped packets of access users.\n-"
        },
        {
            "Parameters": "urpf",
            "Info": "Clears statistics about URPF-dropped packets of access users.\n-"
        },
        {
            "Parameters": "ipoe",
            "Info": "Clears statistics about URPF-dropped packets of IPoX users.\n-"
        },
        {
            "Parameters": "pppoe",
            "Info": "Clears statistics about URPF-dropped packets of PPPoX users.\n-"
        },
        {
            "Parameters": "ipv4",
            "Info": "Clears statistics about MAC-spoofing-dropped IPv4 packets.\n-"
        },
        {
            "Parameters": "ipv6",
            "Info": "Clears statistics about MAC-spoofing-dropped IPv6 packets.\n-"
        },
        {
            "Parameters": "interface-type interface-number",
            "Info": "Specifies the type and number of an interface.\n-"
        },
        {
            "Parameters": "slot slot-id",
            "Info": "Specifies a slot ID.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset access statistics packet discard urpf slot 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBefore collecting statistics about MAC-spoofing-dropped packets over a specified period, run the reset access statistics packet discard mac-spoofing command to clear the existing statistics.\nBefore collecting statistics about URPF-dropped packets over a specified period, run the reset access statistics packet discard urpf command to clear the existing statistics.\nConfiguration Impact\nStatistics about MAC-spoofing-dropped packets cannot be restored after they are cleared. Exercise caution when running this command.\nStatistics about URPF-dropped packets cannot be restored after they are cleared. Exercise caution when running this command.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}