{
    "PageTitle": "service-identify",
    "FuncDef": "The service-identify command configures the service identification mode.\nThe undo service-identify command cancels the configured service identification mode.\nBy default, there is no service identification mode.",
    "CLIs": [
        "service-identify { inner-vlan | outer-vlan | dscp | dhcp-option60 | vendor-class }",
        "service-identify { 8021p { inner-vlan | outer-vlan } }",
        "undo service-identify"
    ],
    "ParentView": [
        "Service policy view"
    ],
    "ParaDef": [
        {
            "Parameters": "inner-vlan",
            "Info": "Indicates that services are identified based on the inner VLAN ID.\n-"
        },
        {
            "Parameters": "outer-vlan",
            "Info": "Indicates that services are identified based on the outer VLAN ID.\n-"
        },
        {
            "Parameters": "dscp",
            "Info": "Indicates that services are identified based on the DSCP value.\n-"
        },
        {
            "Parameters": "dhcp-option60",
            "Info": "Indicates that services are identified based on the VENDOR-CLASS(DHCPv4 OPTION60/DHCPv6 OPTION16).\n-"
        },
        {
            "Parameters": "vendor-class",
            "Info": "Indicates that services are identified based on the VENDOR-CLASS(DHCPv4 OPTION60/DHCPv6 OPTION16).\n-"
        },
        {
            "Parameters": "8021p",
            "Info": "Indicates that services are identified based on the 802.1p field in the inner VLAN tag or the outer VLAN tag.\nThe parameter is supported only on the admin VS.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] service-identify-policy test",
            "[*HUAWEI-serviceid-policy-test] service-identify inner-vlan"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter you create a service identification policy by using the service-identify-policy command in the system view, you must run the service-identify command to configure the service identification mode for the policy.\nFor single-tagged VLAN packets from users, services can be identified based on the inner VLAN ID or the 802.1p field in the inner VLAN tag.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}