{
    "PageTitle": "time-range qos-profile",
    "FuncDef": "The time-range qos-profile command configures the time range during which a QoS profile takes effect.\nThe undo time-range qos-profile command cancels the configuration.\nBy default, this function is disabled.",
    "CLIs": [
        "time-range qos-profile <time-range-name> <profile-name>",
        "undo time-range qos-profile <time-range-name>",
        "undo time-range qos-profile"
    ],
    "ParentView": [
        "AAA domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "time-range-name",
            "Info": "Specifies the name of a time range. This time range must have been specified in the system view.\nThe value is a string of 1 to 31 characters."
        },
        {
            "Parameters": "profile-name",
            "Info": "Specifies the name of a QoS profile. The QoS profile must have been created in the system view.\nThe value is a string of 1 to 63 characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] time-range range1 12:00 to 23:59 Mon",
            "[*HUAWEI] time-range range2 09:00 to 21:00 working-day",
            "[*HUAWEI] qos-profile 2m",
            "[*HUAWEI-qos-profile-2m] car cir 2000",
            "[*HUAWEI-qos-profile-2m] quit",
            "[*HUAWEI] aaa",
            "[*HUAWEI-aaa] domain domain1",
            "[*HUAWEI-aaa-domain-domain1] commit",
            "[*HUAWEI-aaa-domain-domain1] time-range qos-profile enable",
            "[*HUAWEI-aaa-domain-domain1] time-range qos-profile range1 2m",
            "[*HUAWEI-aaa-domain-domain1] time-range qos-profile range2 2m"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThis command can be used to configure the QoS profile to take effect during a time range for users in the AAA domain.\nA QoS profile can be configured to take effect during multiple time ranges for users in an AAA domain.\nConfiguration Impact\nThe QoS profile specified by this command takes effect during the set time range.\nThe QoS profile that is not specified by this command takes effect during the time range excluding the set time.\nPrecautions\nThis command is supported only on the admin VS.\nThis command is invalid for VPN leased line users, Layer 2 leased line users, Layer 3 leased line users, or LNS users.\nThis command cannot be configured if a flow queue in four-flow-queue mode is configured in the specified profile.\nThe command cannot be configured while the qos-profile is in time-range mode.\nThe command cannot be configured while the qos-profile is in 8cos-enhance mode."
}