{
    "PageTitle": "trust vpn-instance framed-ipv6-pool",
    "FuncDef": "The trust vpn-instance framed-ipv6-pool command configures a device to trust the VPN instance bound to the IPv6 address pool or IPv6 address pool group that the RADIUS server uses to deliver IP addresses to Layer 2 IPv6 users.\nThe undo trust vpn-instance framed-ipv6-pool command restores the default configuration.\nBy default, a device trusts the VPN instance bound to the domain to which Layer 2 IPv6 users belong.",
    "CLIs": [
        "trust vpn-instance framed-ipv6-pool",
        "undo trust vpn-instance framed-ipv6-pool"
    ],
    "ParentView": [
        "AAA domain view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] domain huawei",
            "[*HUAWEI-aaa-domain-huawei] commit",
            "[~HUAWEI-aaa-domain-huawei] trust vpn-instance framed-ipv6-pool"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, a domain cannot have both public and private network users or have users belonging to different VPN instances. To enable users belonging to different VPN instances or public and private network users access the network through the same BAS interface and coexist in the same domain, run the trust vpn-instance framed-ipv6-pool command. After this command is run, the device trust only the VPN instance bound to the IPv6 address pool or IPv6 address pool group that the RADIUS server uses to deliver IPv6 addresses.\nConfiguration Impact\nAfter the trust vpn-instance framed-ipv6-pool command is configured, the device trusts only the VPN instance bound to the IPv6 address pool or IPv6 address pool group that the RADIUS server uses to deliver IPv6 addresses. If the trust vpn-instance framed-ipv6-pool command is not configured but the trust vpn-instance access-interface command is configured, the device trusts only the VPN instance bound to the BAS interface through which Layer 2 IPv6 users go online. If the trust vpn-instance access-interface command is not configured, the device trusts only the VPN instance bound to the domain to which Layer 2 IPv6 users belong.\nPrecautions\nThis command applies only to Layer 2 common IPv6 users and static IPv6 users.\nIf the RADIUS server has delivered the RADIUS attribute HW-VPN-Instance(HUAWEI-94), the trust vpn-instance framed-ipv6-pool configuration will not take effect.\nIn VS mode, this command is supported only by the admin VS."
}