{
    "PageTitle": "user-policy interface-down",
    "FuncDef": "The user-policy interface-down command configures a policy for online users when an interface goes Down. The policy can be forcibly logging out the users or keeping the users online.\nThe undo user-policy interface-down command restores the default configuration.\nBy default, when an interface goes Down, the online users are forcibly logged out.",
    "CLIs": [
        "user-policy interface-down { offline | online }",
        "undo user-policy interface-down"
    ],
    "ParentView": [
        "BAS interface view",
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "offline",
            "Info": "Specifies the policy of forcibly logging out online users when an interface goes Down.\n-"
        },
        {
            "Parameters": "online",
            "Info": "Specifies the policy of keeping the users online when an interface goes Down.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] user-policy interface-down offline"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] bas",
            "[*HUAWEI-GigabitEthernet1/0/1-bas] access-type layer2-subscriber",
            "[*HUAWEI-GigabitEthernet1/0/1-bas] user-policy interface-down online"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen an interface goes Down due to an interface fault or a direct link fault, the users on the interface are logged out. When the interface recovers and goes Up, the users go online through the interface again. If an interface constantly goes Up and Down due to an interface fault or a direct link fault, the users also go online and offline through the interface constantly. To address this problem, run the user-policy interface-down command to configure a policy for online users when an interface goes Down.\nConfiguration Impact\nIf the user-policy interface-down command is configured in both the system view and the BAS interface view, whether users are logged out when the BAS interface goes Down depends on whether the user-policy interface-down command is configured on the BAS interface, and whether users are logged out when another BAS interface goes Down depends on the configuration in the system view.\nPrecautions\nThis command is supported only on the admin VS.\nAfter you run the user-policy interface-down online command to keep users online when an interface goes Down, the detection mechanisms, including the ARP probe and PPP keepalive, configured for users still take effect. Specifically, if the detection fails, the users are forcibly logged out."
}