{
    "PageTitle": "user detect retransmit",
    "FuncDef": "The user detect retransmit command sets an interval and the number of times for detecting users in the AAA domain view.\nThe undo user detect command restores the default setting of user detection.\nBy default, detection is performed.",
    "CLIs": [
        "user detect retransmit <num> interval <time>",
        "undo user detect"
    ],
    "ParentView": [
        "AAA domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "num",
            "Info": "Indicates the number of times for detecting users by sending ARP packets.\nThe value ranges from 2 to 120."
        },
        {
            "Parameters": "interval time",
            "Info": "Indicates the interval for detecting users by sending ARP packets.\nThe value ranges from 0 to 1800, in seconds. When the value is 0, no detection is performed."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] domain test",
            "[*HUAWEI-aaa-domain-test] user detect retransmit 10 interval 50"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen the network is unstable, link flapping occurs frequently, and online users are often forced to get offline due to detection failures. To avoid frequent detection failures, the detection timeout period is set to 20 minutes in the BAS interface view. After a delinquent user recharges its account, the user terminal needs to be restarted. During the restart (about 50 to 80 seconds), the device needs to sense the restart and force the user to get offline. Therefore, the detection interval and the maximum number of detection failures need to be configured using the user detect command in the AAA domain view so that the user is forced to get offline during the terminal restart.\nPrecautions\nThis command is supported only on the admin VS.\nIf the detection interval and the maximum number of detection failures are configured on both a BAS interface and an AAA domain, the configurations for the AAA domain take effect.\nIf the retransmission interval is less than 30 seconds, users may be logged out due to detection failures.\nIf the number of retransmissions is less than 5, the retransmission interval is less than 30 seconds, users may be logged out due to detection failures."
}