{
    "PageTitle": "user-basic-service-ip-type",
    "FuncDef": "The user-basic-service-ip-type command configures an IP address type by using which domain users can get online.\nThe undo user-basic-service-ip-type command restores the default configuration.\nBy default, users can get online by using an IP address whose IP type does not need to be specified.",
    "CLIs": [
        "user-basic-service-ip-type { ipv4 | ipv6 | ipv6-pd } *",
        "undo user-basic-service-ip-type"
    ],
    "ParentView": [
        "AAA domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv4",
            "Info": "Indicates that IPv4 addresses must be assigned to users.\n-"
        },
        {
            "Parameters": "ipv6",
            "Info": "Indicates that IPv6 addresses must be assigned to users.\n-"
        },
        {
            "Parameters": "ipv6-pd",
            "Info": "Indicates that IPv6 delegation prefixes must be assigned to users that request IPv6 delegation prefixes.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] domain huawei",
            "[*HUAWEI-aaa-huawei] commit",
            "[*HUAWEI-aaa-huawei] user-basic-service-ip-type ipv4 ipv6"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nDuring dual-stack user access, if the user-basic-service-ip-type command is run to configure the IP address type as IPv4, the device checks whether the IPv4 stack is online when the IPv6 address is used for user access. If the IPv4 stack is not online, the user cannot go online from the IPv6 stack. In a similar way, if the IP address type is set to IPv6, the device checks whether the IPv6 stack is online when the IPv4 address is used for user access. If the IPv6 stack is not online, the user cannot go online from the IPv4 stack.\nConfiguration Impact\nWhen the user-basic-service-ip-type command is run, the address pool of a specified IP type must exist. For example, if the IPv6 type is specified, but an IPv6 address pool is not configured or IPv6 addresses are not assigned successfully, users cannot get online.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nThe user-basic-service-ip-type command takes effect on access users."
}