{
    "PageTitle": "vendor-class partial-match",
    "FuncDef": "The vendor-class partial-match command configures the partial match between vendor-class(DHCPv4 OPTION60/DHCPv6 OPTION16) strings and domain names when service identification based on vendor-class(DHCPv4 OPTION60/DHCPv6 OPTION16) in Dynamic Host Configuration Protocol (DHCP) packets is configured.\nThe undo vendor-class partial-match command cancels the partial match between vendor-class(DHCPv4 OPTION60/DHCPv6 OPTION16) strings and domain names.\nBy default, the service identification mode is domain included, that is, strictly matching the domain name.",
    "CLIs": [
        "vendor-class partial-match { domain-included | included-in-domain }",
        "undo vendor-class partial-match"
    ],
    "ParentView": [
        "Service policy view"
    ],
    "ParaDef": [
        {
            "Parameters": "domain-included",
            "Info": "Specifies the customized options of the vendor contains domain name.\n-"
        },
        {
            "Parameters": "included-in-domain",
            "Info": "Specifies the customized options of the vendor contains a part of domain name.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] service-identify-policy test",
            "[*HUAWEI-serviceid-policy-test] undo service-identify",
            "[*HUAWEI-serviceid-policy-test] service-identify vendor-class",
            "[*HUAWEI-serviceid-policy-test] vendor-class partial-match"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBefore configuring this command, you need to run the service-identify-policy command in the system view to create service identification policies, and to configure the mode of identifying services represented by VENDOR-CLASS(DHCPv4 OPTION60/DHCPv6 OPTION16) by running the service-identify command.\nThe vendor-class partial-match command functions the same as the option60 partial-match command. Both commands are used to configure the type of match between the vendor-class string and domain name as partial match. If both commands are configured, the latest configuration takes effect.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}