{
    "PageTitle": "vendor-class dhcpv6",
    "FuncDef": "The vendor-class dhcpv6 command configures a mapping between the vendor-class attribute and a DHCPv6 option code as well as the offset value.\nThe undo vendor-class dhcpv6 command restores the default setting.\nBy default, the vendor-class attribute corresponds to DHCPv6 Option16 and the default offset value is 0.",
    "CLIs": [
        "vendor-class dhcpv6 { option-code <option-code> | offset <offset> } *",
        "undo vendor-class dhcpv6 [ option-code | offset ]"
    ],
    "ParentView": [
        "BAS interface view (GE)",
        "BAS interface view (VE)",
        "BAS interface view (trunk)",
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "option-code option-code",
            "Info": "Specifies a DHCPv6 option code. Configures a mapping between the vendor-class attribute and a DHCPv6 Option code.\nThe value is an integer ranging from 1 to 255."
        },
        {
            "Parameters": "offset offset",
            "Info": "Specifies the offset value of the vendor-class attribute.\nThe value is an integer ranging from 1 to 254."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] vendor-class dhcpv6 option-code 17 offset 4"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 2/0/1.1",
            "[*HUAWEI-GigabitEthernet2/0/1.1] commit",
            "[~HUAWEI-GigabitEthernet2/0/1.1] bas",
            "[*HUAWEI-GigabitEthernet2/0/1.1-bas] access-type layer2-subscriber",
            "[*HUAWEI-GigabitEthernet2/0/1.1-bas] vendor-class dhcpv6 option-code 17 offset 4"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen the terminal does not carry the vendor-class information using DHCPv6 Option16, you can run the vendor-class dhcpv6 command to configure the mapping between the vendor-class attribute and a DHCPv6 option code.\nPrerequisites\nBefore configuring the vendor-class dhcpv6 command on the BAS interface, enable BAS on the interface and configure Layer 2 or Layer 3 access mode.\nConfiguration Impact\nIf this command is configured for multiple times, only the last configuration takes effect. Users that have been online are not affected. Users that get online after the command is configured will be affected.\nAfter the command is configured in the system view, all DHCPv6 users authenticated using the vendor-class attribute. In addition, this command can be configured only when all terminals use the same DHCPv6 option and offset value.\nThe mapping between the vendor-class attribute and a DHCPv6 option code as well as the offset value can be configured on a BAS interface and the configuration takes effect on users that get online from the BAS interface.\nPrecautions\nThis command is supported only on the admin VS.\nIf the vendor-class dhcpv6 command is run in the BAS interface view, the configuration takes effect for users accessing through the BAS interface."
}