{
    "PageTitle": "vlan domain",
    "FuncDef": "The vlan domain command specifies the mapping between packets with the specified VLAN IDs and domains.\nThe undo vlan domain command cancels the mapping between packets with the specified VLAN IDs and domains.\nBy default, there is no mapping between packets with the specified VLAN IDs and domains.",
    "CLIs": [
        "vlan <vlan-id1> [ <vlan-id2> ] domain <domain-name>",
        "undo vlan <vlan-id1> [ <vlan-id2> ] domain <domain-name>"
    ],
    "ParentView": [
        "Service policy view"
    ],
    "ParaDef": [
        {
            "Parameters": "vlan-id1",
            "Info": "Specifies the start VLAN ID. For a double-tagged packet, this parameter specifies the start VLAN ID of the inner or outer tag of the packet.\nThe value is an integer that ranges from 1 to 4094."
        },
        {
            "Parameters": "vlan-id2",
            "Info": "Specifies the end VLAN ID. For a double-tagged packet, this parameter specifies the end VLAN ID of the inner or outer tag of the packet.\nThe value ranges from start-vlan-id + 1 to 4094."
        },
        {
            "Parameters": "domain-name",
            "Info": "Specifies the domain name.\nIt is a string of 1 to 64 case-insensitive characters without spaces."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] domain huawei",
            "[*HUAWEI-aaa-domain-huawei] commit",
            "[~HUAWEI-aaa-domain-huawei] quit",
            "[~HUAWEI-aaa] quit",
            "[~HUAWEI] service-identify-policy test",
            "[~HUAWEI-serviceid-policy-test] service-identify inner-vlan",
            "[~HUAWEI-serviceid-policy-test] vlan 100 200 domain huawei"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBefore configuring the vlan domain command, you need to run the service-identify-policy command in the system view to create service identification policies, and to configure the mode of identifying services represented by the inner or outer VLAN ID by running the service-identify command.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}