{
    "PageTitle": "web-auth-server user-query version1 query-sequence",
    "FuncDef": "The web-auth-server user-query version1 query-sequence command configures the web authentication server, that is, the external web server.\nThe undo web-auth-server user-query version1 query-sequence command deletes the IP address of the configured web authentication server, or restores related parameters to the default values.\nBy default, there is no shared key between the web authentication server and the device; the IP address of the device is not reported, and the number of the port receiving packets is 50100, and the web authentication server is not detected.",
    "CLIs": [
        "web-auth-server user-query version1 query-sequence acct-session-id user-name mac ip-address",
        "web-auth-server user-query version1 query-sequence acct-session-id user-name ip-address mac",
        "web-auth-server user-query version1 query-sequence acct-session-id mac user-name ip-address",
        "web-auth-server user-query version1 query-sequence acct-session-id mac ip-address user-name",
        "web-auth-server user-query version1 query-sequence acct-session-id ip-address user-name mac",
        "web-auth-server user-query version1 query-sequence acct-session-id ip-address mac user-name",
        "web-auth-server user-query version1 query-sequence user-name acct-session-id mac ip-address",
        "web-auth-server user-query version1 query-sequence user-name acct-session-id ip-address mac",
        "web-auth-server user-query version1 query-sequence user-name mac acct-session-id ip-address",
        "web-auth-server user-query version1 query-sequence user-name mac ip-address acct-session-id",
        "web-auth-server user-query version1 query-sequence user-name ip-address acct-session-id mac",
        "web-auth-server user-query version1 query-sequence user-name ip-address mac acct-session-id",
        "web-auth-server user-query version1 query-sequence mac acct-session-id user-name ip-address",
        "web-auth-server user-query version1 query-sequence mac acct-session-id ip-address user-name",
        "web-auth-server user-query version1 query-sequence mac user-name acct-session-id ip-address",
        "web-auth-server user-query version1 query-sequence mac user-name ip-address acct-session-id",
        "web-auth-server user-query version1 query-sequence mac ip-address acct-session-id user-name",
        "web-auth-server user-query version1 query-sequence mac ip-address user-name acct-session-id",
        "web-auth-server user-query version1 query-sequence ip-address acct-session-id user-name mac",
        "web-auth-server user-query version1 query-sequence ip-address acct-session-id mac user-name",
        "web-auth-server user-query version1 query-sequence ip-address user-name acct-session-id mac",
        "web-auth-server user-query version1 query-sequence ip-address user-name mac acct-session-id",
        "web-auth-server user-query version1 query-sequence ip-address mac acct-session-id user-name",
        "web-auth-server user-query version1 query-sequence ip-address mac user-name acct-session-id",
        "undo web-auth-server user-query version1 query-sequence"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "acct-session-id",
            "Info": "Specifies a sessionID.\nIndicates the priority of information that the web server uses the query interface to query. The sequence of the four parameters is configurable. The former a parameter, the higher the priority. By default, the parameters are listed as user MAC address, user IP address, user name, and sessionID in descending order of the query priority.\n-"
        },
        {
            "Parameters": "user-name",
            "Info": "Specifies a user name.\nIndicates the priority of information that the web server uses the query interface to query. The sequence of the four parameters is configurable. The former a parameter, the higher the priority. By default, the parameters are listed as user MAC address, user IP address, user name, and sessionID in descending order of the query priority.\n-"
        },
        {
            "Parameters": "ip-address",
            "Info": "Specifies a user IP address.\nIndicates the priority of information that the web server uses the query interface to query. The sequence of the four parameters is configurable. The former a parameter, the higher the priority. By default, the parameters are listed as user MAC address, user IP address, user name, and sessionID in descending order of the query priority.\n-"
        },
        {
            "Parameters": "mac",
            "Info": "Specifies a user MAC address.\nIndicates the priority of information that the web server uses the query interface to query. The sequence of the four parameters is configurable. The former a parameter, the higher the priority. By default, the parameters are listed as user MAC address, user IP address, user name, and sessionID in descending order of the query priority.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] web-auth-server user-query version1 query-sequence  ip-address mac acct-session-id user-name"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen the web authentication is adopted, you must configure the web authentication server and configure the domain to which the web authentication server belongs.\nIf the device communicates with the web authentication server through Portal V2.0 or a later Portal version, a shared key must be configured.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}