{
    "PageTitle": "web-auth-server",
    "FuncDef": "The web-auth-server command configures the web authentication server, that is, the external web server.\nThe undo web-auth-server command deletes the IP address of the configured web authentication server, or restores related parameters to the default values.\nBy default, there is no shared key between the web authentication server and the device; the IP address of the device is not reported, and the number of the port receiving packets is 50100, and the web authentication server is not detected.",
    "CLIs": [
        "web-auth-server { <ip-address> | <ipv6-address> } [ vpn-instance <instance-name> ] [ port <portnum> [ all ] ] [ key { simple <simple-key> | cipher <cipher-key> } ] [ nas-ip-address ] [ detect-time <time-value> ] [ user-query { exclude pre-domain | version1 } ]",
        "undo web-auth-server { <ip-address> | <ipv6-address> } [ vpn-instance <instance-name> ] [ port [ all ] | key | nas-ip-address | detect-time ] [ user-query { exclude pre-domain | version1 } ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address",
            "Info": "Specifies the IP address of the web authentication server.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "ipv6-address",
            "Info": "Specifies the IPv6 address of the web authentication server.\nThe value is a 32-bit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "vpn-instance instance-name",
            "Info": "Specifies the name of the VPN instance to which the web authentication server belongs.\nThe value is a string of 1 to 31  case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "port portnum",
            "Info": "Specifies the number of the port through which the web authentication server receives a notification message from the device.\nThe value is an integer ranging from 1 to 65535."
        },
        {
            "Parameters": "all",
            "Info": "If the parameter all is configured, the destination port ID of a Web response packet is the specified port ID.\nIf the parameter all is not configured, the destination port ID of a Web response packet is the source port ID of the corresponding Web request packet.\nBy default, the parameter all is not configured.\n-"
        },
        {
            "Parameters": "key",
            "Info": "Specifies the key type of the web authentication server.\n-"
        },
        {
            "Parameters": "simple simple-key",
            "Info": "Specifies the shared key of the web authentication server in simple text.\nIt is a string of 1 to 128 characters. It is case sensitive, excluding special characters of command lines such as space and question mark."
        },
        {
            "Parameters": "cipher cipher-key",
            "Info": "Specifies the shared key of the web authentication server in ciphertext.The?value?can?be?in?simple?text?or?ciphertext.\nThe value is a string of 1 to 128 case-sensitive characters in simple text or a string of 1 to 268 case-sensitive characters in ciphertext. The string can contain spaces if it is enclosed in double quotation marks (\")."
        },
        {
            "Parameters": "nas-ip-address",
            "Info": "Indicates whether the IP address of the device is reported. By default, the IP address of the device is not reported.\n-"
        },
        {
            "Parameters": "detect-time time-value",
            "Info": "Specifies detection interval of the web authentication server, in minutes.\nThe value is an integer ranging from 1 to 65535."
        },
        {
            "Parameters": "user-query",
            "Info": "User information query request.\n-"
        },
        {
            "Parameters": "exclude pre-domain",
            "Info": "After this parameter is configured and the device receives request packets for user information from the web authentication server, the device sends success packets to the web authentication server only if users are online and in the authentication domain.\nIf this parameter is not configured and the device receives request packets for user information from the web authentication server, the device sends success packets to the web authentication server as long as users are online.\n-"
        },
        {
            "Parameters": "version1",
            "Info": "After this parameter is configured, when the web server uses the query interface to query information, the device provides the user information obtained based on user MAC and IP addresses as well as the user information obtained based on the user name and accounting ID. The user information is queried based on the MAC address, IP address, user name, and session ID in descending order of priority.\nThe information returned includes the accounting ID, user status, user name, user IP address, user MAC address, user gateway, remaining time, online time, and downstream bandwidth.\nIf this parameter is not configured, user information can be queried only based on user MAC and IP addresses, and the information returned includes the MAC and IP addresses, upstream and downstream traffic, and physical information of users.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] web-auth-server 10.1.1.8"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] web-auth-server 192.168.1.2 user-query version1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen the web authentication is adopted, you must configure the web authentication server and configure the domain to which the web authentication server belongs.\nIf the device communicates with the web authentication server through Portal V2.0 or a later Portal version, a shared key must be configured.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}