{
    "PageTitle": "web-auth-server source-ip",
    "FuncDef": "The web-auth-server source-ip command enables a device to receive the interface IP address in the portal packets sent by the web autentication server.\nThe undo web-auth-server source-ip command disables a device from receiving the interface IP address in the portal packets sent by the web autentication server.\nBy default, the device is not enabled to listen for any portal packets received from the web authentication server.",
    "CLIs": [
        "web-auth-server { source-ip <source-ip> | source-ipv6 <source-ipv6> } [ vpn-instance <vpn-instance> ]",
        "web-auth-server { source-ip | source-ipv6 } all",
        "undo web-auth-server { source-ip <source-ip> | source-ipv6 <source-ipv6> } [ vpn-instance <vpn-instance> ]",
        "undo web-auth-server { source-ip | source-ipv6 } all"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "source-ip source-ip",
            "Info": "Specifies the number of the port through which the device receives packets from the web authentication server.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "source-ipv6 source-ipv6",
            "Info": "Specifies source ipv6 address.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "vpn-instance vpn-instance",
            "Info": "Specifies a VPN instance name. The VPN instance specified must have been configured.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "all",
            "Info": "Specifies that portal packets can be received from all interface IP addresses of the device.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] web-auth-server source-ip 10.1.1.1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] web-auth-server source-ipv6 2001:db8:1::1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\n@tableContent@\nScenario(In English)\n\nProducts\n\n\n\nIn web authentication scenarios, if a device wants to receive the portal packets from a web authentication server, the IP address and port number of the portal packets sent by the web authentication server must be configured. The port number can be configured using the web-auth-server listening-port command. By default, the port number of the portal packets received by the device is 2000. However, by default, no portal packets can be received by interface IP addresses from the web authentication server. Therefore, the following commands need to be run:\n- If the source-ip parameter is specified, configure the IP address of the interface connecting to the web authentication server. Socket listening needs to be enabled to allow the device to obtain portal packets from the web authentication server based on the interface IP address and port number of the device. \n- If the web-auth-server { source-ip | source-ipv6 } all command is run, the device can receive portal packets from the web authentication server from all interface IP addresses. To ensure that the device can properly receive portal packets from the web authentication server, the port number of the portal packets received by the device must be the same as the destination port number in the portal packets sent by the web authentication server. \n- If the web-auth-server { source-ip | source-ipv6 } all command is run and the source-ip parameter is specified, the effect is the same as that when only the web-auth-server { source-ip | source-ipv6 } all command is run.\n\n\n\n\n\nPrecautions\nIn web authentication scenarios, the web-auth-server source-ip command must be configured. Otherwise, the device cannot receive portal packets from the web authentication server.If the source-ip parameter is specified, a maximum of five IPv4 addresses or five IPv6 addresses can be configured.\n-There are security risks when the keyword all is specified to allow portal packets to be received from all interface IP addresses.Therefore, do not configure the all parameter. You are advised to configure a specific IP address."
}