{
    "PageTitle": "web-auth-server version",
    "FuncDef": "The web-auth-server version command configures a version for the portal protocol used for communication between the device and web server.\nThe undo web-auth-server version command restores a version for the portal protocol used for communication between the device and web server to the default setting.\nBy default, the device supports only Portal V3.0.",
    "CLIs": [
        "web-auth-server version { v2 [ v1 ] | v3 }",
        "undo web-auth-server version { v2 [ v1 ] | v3 }"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "v2",
            "Info": "Configures Portal V2.0.\n-"
        },
        {
            "Parameters": "v1",
            "Info": "Configures Portal V1.0.\n-"
        },
        {
            "Parameters": "v3",
            "Info": "Configures Portal V3.0.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] web-auth-server version v2"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] web-auth-server version v3"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure a version for the portal protocol used for communication between the device and web server, run the web-auth-server version command. Portal V1.0 does not provide the authenticator, and therefore no encryption is needed. If an encryption algorithm is used, configuring Portal V1.0 is not recommended. The Portal V2.0 authenticator uses MD5 encryption that has low security, which may bring security risks. The Portal V3.0 authenticator uses SHA256 encryption that has high security, and therefore is recommended, configuring Portal V2.0 is not recommended.If only Portal V2.0 is configured, Portal V3.0 is compatible, but Portal V1.0 is disabled. If Portal V3.0 is configured, the authenticator carried in packets can only be encrypted and decrypted using SHA256, and Portal V1.0 and Portal V2.0 are disabled. In other words, the device that has Portal V3.0 configured cannot process Portal V1.0 or Portal V2.0 packets.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}