{
    "PageTitle": "web-auth-server source",
    "FuncDef": "The web-auth-server source command configures the source interface from which the device sends packets to the web authentication server. This interface must have an IP address used as the source IP address of the packet.\nThe undo web-auth-server source-interface command removes this source interface.\nBy default, no source interface from which the device sends packets to the web authentication server is configured.",
    "CLIs": [
        "web-auth-server source interface { <interface-type> <interface-number> | <interface-name> }",
        "undo web-auth-server source"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "interface-type",
            "Info": "Specifies the source interface type, either the physical interface or the loopback interface.\n-"
        },
        {
            "Parameters": "interface-number",
            "Info": "Specifies the source interface number. Different types of interfaces have different number formats.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "interface-name",
            "Info": "Specifies the source interface name.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface loopback 0",
            "[~HUAWEI-LoopBack0] commit",
            "[~HUAWEI-LoopBack0] quit",
            "[~HUAWEI] web-auth-server source interface LoopBack 0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen a web server is deployed in a VPN and the device sends a packet to the web server, the IP address of the source interface configured using the web-auth-server source command is preferentially selected. If no source interface is configured, select the outbound interface with reachable route based on the VPN ID and destination IP address as the source IP address. If the required route is not found, select the IP address of any interface within the VPN as the source IP address.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}