{
    "PageTitle": "whitelist session-car web-auth-server",
    "FuncDef": "The whitelist session-car web-auth-server command sets values for the Portal session CAR parameters.\nThe undo whitelist session-car web-auth-server command restores the default values for the Portal session CAR parameters.\nBy default, the CIR, CBS, PIR, and PBS of Portal session CAR are 512 kbit/s, 64000 bytes, 768 kbit/s, and 96000 bytes, respectively.",
    "CLIs": [
        "whitelist session-car web-auth-server { cir <cir-value> | cbs <cbs-value> | pir <pir-value> | pbs <pbs-value> } *",
        "undo whitelist session-car web-auth-server [ cir <cir-value> | cbs <cbs-value> | pir <pir-value> | pbs <pbs-value> ] *"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "cir cir-value",
            "Info": "Specifies the committed information rate (CIR).\nThe value is an integer ranging from 0 to 1000000, in kbit/s.The default value is 512kbit/s."
        },
        {
            "Parameters": "cbs cbs-value",
            "Info": "Specifies the committed burst size (CBS).\nThe value is an integer ranging from 0 to 9000000, in bytes.The default value is 64000bytes."
        },
        {
            "Parameters": "pir pir-value",
            "Info": "Specifies the peak information rate (PIR).\nThe value is an integer ranging from 0 to 1000000, in kbit/s. The default value is 768. pir-value must be greater than or equal to cir-value. When you attempt to set a pir-value smaller than cir-value, the following error message will be displayed: \"Error: The pir must be greater than or equal to the cir.\""
        },
        {
            "Parameters": "pbs pbs-value",
            "Info": "Specifies the peak burst size (PBS).\nThe value is an integer ranging from 0 to 9000000, in bytes. The default value is 96000. pbs-value must be greater than or equal to cbs-value. When you attempt to set a pbs-value smaller than cbs-value, the following error message will be displayed: \"Error: The pbs must be greater than or equal to the cbs.\""
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] whitelist session-car web-auth-server cir 1000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the configured Portal session CAR parameters do not meet service bandwidth requirements, you can run the whitelist session-car web-auth-server command to modify the bandwidth values as needed.\nPrecautions\nThis command is supported only on the admin VS.\npir-value must be greater than or equal to cir-value. When you attempt to set a pir-value value smaller than cir-value, the following error message will be displayed:\"Error:The pir must be greater than or equal to the cir.\"\npbs-value must be greater than or equal to cbs-value. When you attempt to set a pbs-value value smaller than cbs-value, the following error message will be displayed: \"Error:The pbs must be greater than or equal to the cbs.\""
}