{
    "PageTitle": "wlan option82 decode-mode",
    "FuncDef": "The wlan option82 decode-mode command enables a BAS interface to parse the AP MAC address and SSID in Option 82.\nThe undo wlan option82 decode-mode command disables a BAS interface from parsing the AP MAC address and SSID in Option 82.\nBy default, BAS interfaces do not parse the AP MAC address and SSID in Option 82.",
    "CLIs": [
        "wlan option82 decode-mode { { type1 | type2 } * | type3 } ap-mac",
        "wlan option82 decode-mode { { type1 | type2 } * | type3 } ssid",
        "undo wlan option82 decode-mode { { type1 | type2 } * | type3 } ap-mac",
        "undo wlan option82 decode-mode { { type1 | type2 } * | type3 } ssid"
    ],
    "ParentView": [
        "BAS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "type1",
            "Info": "Indicates the Cisco mode.\n-"
        },
        {
            "Parameters": "type2",
            "Info": "Indicates the Ruskus mode.\n-"
        },
        {
            "Parameters": "type3",
            "Info": "Indicates the Huawei mode.\n-"
        },
        {
            "Parameters": "ap-mac",
            "Info": "Indicates the AP MAC address.\n-"
        },
        {
            "Parameters": "ssid",
            "Info": "Indicates the SSID.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] bas",
            "[*HUAWEI-GigabitEthernet1/0/1-bas] access-type layer2-subscriber",
            "[*HUAWEI-GigabitEthernet1/0/1-bas] commit",
            "[*HUAWEI-GigabitEthernet1/0/1-bas] wlan option82 decode-mode type1 ap-mac"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen the device sends user packets carrying Option 82 that contains the AP MAC address and SSID to an AAA or RADIUS server or sends redirection packets carrying Option 82 that contains the AP MAC address to terminals, to allow the device to parse the AP MAC address and SSID in Option 82, run the wlan option82 decode-mode command.\nConfigure type1 if user packets received on a BAS interface are sent from Cisco devices. Configure type2 if user packets received on a BAS interface are sent from Ruskus devices. Configure both if the types of user packets received on a BAS interface cannot be determined.\nThe type3 parameter indicates the AP-MAC and SSID carried in option82 circuit id, which is in the format of 00-10-A4-23-19-C0:Enterprise1-SSID-NAME. The type3 parameter is mutually exclusive with { type1 | type2 }*. The latter configuration overrides the previous one. If type3 is configured, the wlan option82 decode-mode type3 ssid and wlan option82 decode-mode type3 ap-mac command needs to be run.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}