{
    "PageTitle": "dhcpv6 relay access-limit vlan any",
    "FuncDef": "The dhcpv6 relay access-limit vlan any command configures the maximum number of access DHCPv6 clients on a DHCPv6 relay interface. The configured maximum number applies to DHCPv6 clients that go online through single or double VLANs that do not have such a limit configured.\nThe undo dhcpv6 relay access-limit vlan any command deletes the maximum number of access DHCPv6 clients on a DHCPv6 relay interface.\nBy default, the maximum number of access DHCPv6 clients is not limited on DHCPv6 relay interfaces. Only the maximum number of DHCPv6 clients on the entire device is limited.",
    "CLIs": [
        "dhcpv6 relay access-limit <limit-number> vlan any",
        "undo dhcpv6 relay access-limit [ <limit-number> ] vlan any"
    ],
    "ParentView": [
        "100ge sub-interface view",
        "10GE sub-interface view",
        "25GE sub-interface view",
        "400GE sub-interface view",
        "40GE sub-interface view",
        "50GE sub-interface view",
        "Eth-Trunk sub-interface view",
        "GE sub-interface view",
        "Global VE sub-interface view",
        "PW-VE sub-interface view",
        "VE sub-interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "limit-number",
            "Info": "Specifies the maximum number of access DHCPv6 clients on a DHCPv6 relay interface.\nThe value is an integer ranging from 0 to 65536."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0.2",
            "[~HUAWEI-GigabitEthernet1/0/0.2] dhcpv6 relay access-limit 1 vlan any"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo limit the maximum number of access DHCPv6 clients during network planning or service adjustment, run the dhcpv6 relay access-limit command.\nThe dhcpv6 relay access-limit limit-number vlan any command configures the maximum number of DHCPv6 clients that can go online through single or double VLANs that do not have such a limit configured. This configuration is not counted in the 16 VLAN ranges allowed. Run this command to limit the maximum number of access DHCPv6 clients on a DHCPv6 relay interface in a specified VLAN. For example, if DHCPv6 clients send double-tagged packets to go online, each pair of VLAN tags identifies a VLAN. Run the dhcpv6 relay access-limit 1 vlan any command to configure a DHCPv6 relay interface to allow only one client that sends double-tagged VLAN packets to go online. This configuration protects the device against packets with changing MAC addresses and DUIDs.\nConfiguration Impact\nThis command takes effect for subsequent DHCPv6 clients that go online. The maximum number of online DHCPv6 clients is not limited.\nPrecautions\nIf the dhcpv6 relay access-limit command is run with a VLAN range specified, and then the undo dhcpv6 relay access-limit command is run with a smaller VLAN range specified, the first VLAN range is divided into two parts. After the VLAN range specified in the dhcpv6 relay access-limit command is divided into 16 parts, the undo dhcpv6 relay access-limit command can no longer be run."
}