{
    "PageTitle": "dhcpv6 duid",
    "FuncDef": "The dhcpv6 duid command configures a DHCP Unique Identifier (DUID) for a DHCPv6 device.\nThe undo dhcpv6 duid command deletes the DUID configured for a DHCPv6 device.\nBy default, a DHCPv6 device does not have a DUID.",
    "CLIs": [
        "dhcpv6 duid { <duid-value> | llt }",
        "undo dhcpv6 duid"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "duid-value",
            "Info": "Specifies a DUID.\nThe value is a string of 8 to 28, not case-sensitive characters, spaces not supported in hexadecimal notation."
        },
        {
            "Parameters": "llt",
            "Info": "Indicates that a DUID is generated using DUID-LLT mode.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dhcpv6 duid 0CC084D303000912"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dhcpv6 duid llt"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA DUID uniquely identifies a DHCPv6 device. Each DHCPv6 client or server must have a DUID. The server's DUID is carried in the Server Identifier option in DHCPv6 messages, and the client's DUID is carried in the Client Identifier option in DHCPv6 messages. A DHCPv6 server and a client use DUIDs to identify each other.\nThe DUID is optional for DHCPv6 relay agents. The DUID of a DHCPv6 relay agent is carried in the Remote-Id option. The DHCPv6 server identifies relay agents based on their DUIDs carried in the Remote-Id option.\nTo configure a DUID or configure the DUID generation mode, run the dhcpv6 duid command.\nDUID-LLT: The DUID is generated based on the device's link-layer address plus time. The link-layer address can belong to any network interface connected to the device. The device must store the DUID in stable storage and must continue to use this DUID even if the network interface used to generate the DUID is removed.\nConfiguration Impact\nChanging the DUID of a DHCPv6 client may affect the authentication and lease renewal of online users.\nIf the dhcpv6 duid command is run more than once, the latest configuration overrides the previous one."
}