{
    "PageTitle": "dhcpv6 relay",
    "FuncDef": "The dhcpv6 relay command specifies the destination IPv6 address for DHCPv6 messages on an inbound interface.\nThe undo dhcpv6 relay command deletes the destination IPv6 address specified for DHCPv6 messages on an inbound interface.\nBy default, neither an outbound interface nor destination IPv6 address is specified for DHCPv6 messages on an interface.",
    "CLIs": [
        "dhcpv6 relay { interface { <interface-name> | <interface-type> <interface-number> } | destination <ipv6-address> }",
        "undo dhcpv6 relay { interface { <interface-name> | <interface-type> <interface-number> } | destination <ipv6-address> | all }"
    ],
    "ParentView": [
        "40GE interface view",
        "VE sub-interface view",
        "GE interface view",
        "Port extension interface view",
        "100GE interface view",
        "GE electrical interface view",
        "Global VE sub-interface view",
        "Sub-interface view",
        "50GE interface view",
        "400GE interface view",
        "10GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Eth-Trunk interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "interface interface-type interface-number",
            "Info": "Specifies an outbound interface for DHCPv6 messages.\n-"
        },
        {
            "Parameters": "interface-name",
            "Info": "Specifies an outbound interface for DHCPv6 messages.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "destination ipv6-address",
            "Info": "Specifies a destination IPv6 address for DHCPv6 messages.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "all",
            "Info": "Delete all the outbound interface or destination IPv6 address for DHCPv6 messages on an inbound interface.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] dhcpv6 relay interface GigabitEthernet 1/0/2",
            "[*HUAWEI-GigabitEthernet1/0/1] dhcpv6 relay destination 2001:db8::2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo allow a DHCPv6 relay agent to relay messages sent from DHCPv6 clients on a network segment, run the dhcpv6 relay command on the relay interface that connects to the network segment. After the DHCPv6 relay interface receives DHCPv6 messages, it forwards the DHCPv6 messages to the specified outbound interface or destination IPv6 address. The destination IPv6 address can be an interface address on the next-hop DHCPv6 relay agent or the DHCPv6 server.\nPrecautions\nAn interface supports a maximum of eight dhcpv6 relay command instances. If multiple outbound interfaces and destination IPv6 addresses are specified, the DHCPv6 relay agent forwards one copy of packets to each outbound interface and destination IPv6 address. The default destination address of packets forwarded by the specified outbound interfaces is the multicast address (FF05::1:3)."
}