{
    "PageTitle": "dhcpv6 relay source-interface",
    "FuncDef": "The dhcpv6 relay source-interface command configures the IP address of a specified interface as the source IP address used by a DHCPv6 relay agent to forward packets.\nThe undo dhcpv6 relay source-interface command cancels the configuration of setting the IP address of a specified interface to the source IP address used by a DHCPv6 relay agent to forward packets.\nBy default, a DHCPv6 relay agent uses the IPv6 address of the outbound interface as the source IPv6 address of DHCPv6 packets.",
    "CLIs": [
        "dhcpv6 relay source-interface { <interface-name> | <interface-type> <interface-num> }",
        "undo dhcpv6 relay source-interface [ <interface-name> | <interface-type> <interface-num> ]"
    ],
    "ParentView": [
        "40GE interface view",
        "VE sub-interface view",
        "GE interface view",
        "Port extension interface view",
        "100GE interface view",
        "GE electrical interface view",
        "Global VE sub-interface view",
        "Sub-interface view",
        "50GE interface view",
        "400GE interface view",
        "10GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Eth-Trunk interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "interface-name",
            "Info": "Specifies the name of an interface.\n-"
        },
        {
            "Parameters": "interface-type",
            "Info": "Specifies the type of an interface. This parameter and interface-num together specify an interface.\n-"
        },
        {
            "Parameters": "interface-num",
            "Info": "Specifies the number of an interface. This parameter and interface-type together specify an interface.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] ipv6 enable",
            "[*HUAWEI-GigabitEthernet1/0/1] dhcpv6 relay source-interface GigabitEthernet 1/0/2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nGenerally, a DHCPv6 relay agent uses the IP address of the outbound interface as the source IP address for packet forwarding. In some scenarios, if a DHCP relay agent needs to forward packets with the IPv6 address of a specified interface as the source IP address, run the dhcpv6 relay source-interface command.\nPrecautions\nIf a specified interface has multiple IPv6 addresses, the smallest IPv6 address is used as the source address of the packets forwarded by a DHCPv6 relay agent.\nBoth the dhcpv6 relay source-interface and dhcpv6 relay source-ip-address commands can specify the source IP address used by a DHCP relay agent to forward packets. These two commands are mutually exclusive. If both of the two commands are run on a DHCP relay interface, the latter configuration overrides the former one."
}