{
    "PageTitle": "dhcpv6 export pd-route",
    "FuncDef": "The dhcpv6 export pd-route command enables a DHCPv6 relay agent to advertise DHCPv6 PD routes.\nThe undo dhcpv6 export pd-route command restores the default configuration.\nBy default, DHCPv6 relay agents are not enabled to advertise DHCPv6 PD routes.",
    "CLIs": [
        "dhcpv6 export pd-route",
        "undo dhcpv6 export pd-route"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dhcpv6 export pd-route"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn DHCPv6 (IA_PD) scenarios, a DHCPv6 relay agent generates a PD route based on the DHCPv6 PD prefix assigned by the DHCPv6 server to a DHCPv6 client. By default, this PD route applies only to the relay agent and is not advertised. Other devices cannot obtain the routes destined for the CPE and its attached user terminals. As a result, the user terminals cannot access the network.\nTo allow devices to obtain routes destined for the CPE and its attached user terminals, perform either of the following operations:\nConfigure a summarized route with a DHCPv6 PD prefix and use a routing protocol to advertise the route to other devices. This method is recommended because it does not require other devices to learn many routes, so it has little impact on the core network.Run the dhcpv6 export pd-route command to allow a DHCPv6 relay agent to automatically advertise the PD routes it generated to other devices. Because the PD routes generated on the DHCPv6 relay agent are destined for clients and the clients are constantly applying for and releasing prefixes, PD routes cannot be dynamically summarized. Advertising all PD routes has a large impact on the core network. Therefore, this method is not recommended.\n\nPrecautions\nThis command takes effect only for PD routes that are generated after the command is run. The PD routes that are generated before this command is run still apply only to the relay agent."
}