{
    "PageTitle": "dhcpv6 relay pd-route degrade-cost",
    "FuncDef": "The dhcpv6 relay pd-route degrade-cost command configures a cost value for PD routes generated by the backup device in a DHCPv6 relay dual-device hot standby scenario.\nThe undo dhcpv6 relay pd-route degrade-cost command restores the default configuration.\nThe default cost value of PD routes generated by the backup device is 0 in a DHCPv6 relay dual-device hot standby scenario.",
    "CLIs": [
        "dhcpv6 relay pd-route degrade-cost <cost-value>",
        "undo dhcpv6 relay pd-route degrade-cost [ <cost-value> ]"
    ],
    "ParentView": [
        "40GE interface view",
        "VE sub-interface view",
        "GE interface view",
        "Port extension interface view",
        "100GE interface view",
        "GE electrical interface view",
        "Global VE sub-interface view",
        "Sub-interface view",
        "50GE interface view",
        "400GE interface view",
        "10GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Eth-Trunk interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "cost-value",
            "Info": "Specifies a cost value for PD routes generated by the backup device.\nThe value is an integer ranging from 1 to 4294967295."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] dhcpv6 relay pd-route degrade-cost 50"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn a DHCPv6 relay dual-device hot standby scenario, after DHCPv6 relay dual-device hot standby is deployed on the master and backup devices, the backup device synchronizes DHCPv6 user entries from the master device in real time and generates PD routes. By default, the cost values of PD routes generated by the master and backup devices are both 0 (highest priority). To ensure that service traffic sent to users can be correctly forwarded to the master device, run the dhcpv6 relay pd-route degrade-cost command to increase the cost value of PD routes generated by the backup device. This allows service routes sent to the users to converge on the master device.\nConfiguration Impact\nAfter this command is run, the cost value of PD routes generated by the DHCPv6 relay interface on the backup device is adjusted based on the VRRP/VRRP6 status in a DHCPv6 relay dual-device hot standby scenario.\nIf the VRRP/VRRP6 status is Master, the cost value of PD routes is set to the default value 0 (highest priority).If the VRRP/VRRP6 status is Backup, the cost value of PD routes is set to the value specified by cost-value.\n\nPrecautions\nThis command takes effect only for PD routes generated by the backup device in a DHCPv6 relay dual-device hot standby scenario.This command must be configured on the same interface as DHCPv6 relay.In a DHCPv6 relay dual-device hot standby scenario, running the reset dhcpv6 relay userinfo table command on the master device clears user entries on both the master and backup devices, but running this command on the backup device clears user entries only on the backup device."
}