{
    "PageTitle": "dhcpv6 ipsec",
    "FuncDef": "The dhcpv6 ipsec command enables IPsec on a DHCPv6 relay agent.\nThe undo dhcpv6 ipsec command disables IPsec on a DHCPv6 relay agent.\nBy default, IPsec is disabled on DHCPv6 relay agents.",
    "CLIs": [
        "dhcpv6 ipsec sa <sa-name> [ peer <peer-ipv6-address> [ vpn-instance <vpn-instance> ] ]",
        "undo dhcpv6 ipsec sa <sa-name> [ peer <peer-ipv6-address> [ vpn-instance <vpn-instance> ] ]",
        "undo dhcpv6 ipsec"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "peer peer-ipv6-address",
            "Info": "Specifies an IPv6 address.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "vpn-instance vpn-instance",
            "Info": "Specifies a VPN instance name.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "sa sa-name",
            "Info": "Specifies an IPsec SA name.\nIt is a string of 1 to 15 case-sensitive characters, spaces not supported. The characters can be letters or numbers, hyphens (-) not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipsec sa sa1",
            "[*HUAWEI-ipsec-sa-sa1] quit",
            "[*HUAWEI] dhcpv6 ipsec sa sa1 peer 2001:db8::1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo defend against DoS attacks, run the dhcpv6 ipsec command so that IPsec can be implemented on packets exchanged between DHCPv6 relay agents and between a DHCPv6 relay agent and a server. If packets from a DHCPv6 client must travel through multiple relay agents before they arrive at a server, IPsec must run between each pair of devices that the packets pass through. For example, if client A sends packets to server D through relay agents B and C in sequence, IPsec must run between relay agents B and C and also between relay agent C and server D.\nPrerequisites\nAn IPsec SA has been configured.\nPrecautions\nThe DHCPv6 relay agent can use different SAs to authenticate packets exchanged with different peer IPv6 addresses.If no peer IPv6 address is specified, all DHCPv6 messages sent and received on the DHCPv6 relay agent are authenticated by the same SA.The dhcpv6 ipsec command with a peer IPv6 address specified takes precedence over the dhcpv6 ipsec command without a peer IPv6 address specified."
}