{
    "PageTitle": "dhcpv6 relay strict-check interface-info",
    "FuncDef": "The dhcpv6 relay strict-check interface-info command enables a DHCPv6 relay interface to check the physical information of DHCPv6 messages.\nThe undo dhcpv6 relay strict-check interface-info command disables a DHCPv6 relay interface from checking the physical information of DHCPv6 messages.\nBy default, DHCPv6 relay interfaces are not allowed to check the physical information of DHCPv6 messages.",
    "CLIs": [
        "dhcpv6 relay strict-check interface-info",
        "undo dhcpv6 relay strict-check interface-info"
    ],
    "ParentView": [
        "40GE interface view",
        "VE sub-interface view",
        "GE interface view",
        "Port extension interface view",
        "100GE interface view",
        "GE electrical interface view",
        "Global VE sub-interface view",
        "Sub-interface view",
        "50GE interface view",
        "400GE interface view",
        "10GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Eth-Trunk interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0.10",
            "[~HUAWEI-GigabitEthernet1/0/0.10] dhcpv6 relay strict-check interface-info"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the location of a WLAN user changes, the physical information (user access interface, PE-VLAN ID, and CE-VLAN ID) of DHCPv6 messages from that user will also change. In this case, the DHCPv6 relay agent does not need to check the physical information of DHCPv6 messages.\nHowever, the physical information of DHCPv6 messages from fixed network users does not change unless an error occurs. To allow a DHCPv6 relay interface to check the physical information of DHCPv6 messages for security purposes, run the dhcpv6 relay strict-check interface-info command.\nConfiguration Impact\nAfter this command is run on a DHCPv6 relay interface, the interface checks the physical information of received DHCPv6 messages. If the physical information is different from that in DHCPv6 client entries, the interface discards the messages."
}