{
    "PageTitle": "dhcpv6 relay link-address",
    "FuncDef": "The dhcpv6 relay link-address command configures a DHCPv6 relay gateway address.\nThe undo dhcpv6 relay link-address command restores the default DHCPv6 relay gateway address.\nBy default, a DHCPv6 relay agent selects the first configured global unicast address from an interface with DHCPv6 relay enabled as its gateway address.",
    "CLIs": [
        "dhcpv6 relay link-address <ipv6-address>",
        "undo dhcpv6 relay link-address <ipv6-address>"
    ],
    "ParentView": [
        "40GE interface view",
        "VE sub-interface view",
        "GE interface view",
        "100GE interface view",
        "GE electrical interface view",
        "Port extension interface view",
        "Global VE sub-interface view",
        "Sub-interface view",
        "50GE interface view",
        "400GE interface view",
        "10GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Eth-Trunk interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv6-address",
            "Info": "Specifies an IPv6 address as the gateway address.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] dhcpv6 relay link-address 2001:db8::4"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe IPv6 address of the first DHCPv6 relay agent is used as the DHCPv6 relay gateway address for clients and is carried in the link-address field in DHCPv6 relay messages. The DHCPv6 server uses the link-address field to determine the network segment on which a client resides so that the server can assign an IPv6 address on this network segment to the client.\nIf a DHCPv6 relay gateway address is not configured, the DHCPv6 relay interface randomly selects a global unicast address as the gateway address, which does not facilitate proper address planning and allocation. To allow clients connecting to a DHCPv6 relay interface to obtain IPv6 addresses on the same network segment, run the dhcpv6 relay link-address command to configure a gateway address. Then the DHCPv6 relay interface uses this configured gateway address for all DHCPv6 request messages it receives.\nPrecautions\nThe configured DHCPv6 relay gateway address must be a global unicast address of the DHCPv6 relay interface.\nAn interface can have only one IPv6 address configured as the DHCPv6 relay gateway address. If a gateway address has been configured for an interface and the dhcpv6 relay link-address command is run, the newly configured gateway address replaces the original one."
}