{
    "PageTitle": "reset dhcpv6 relay client-info",
    "FuncDef": "The reset dhcpv6 relay client-info command clears DHCPv6 client login failure and logout records on a DHCPv6 relay agent.",
    "CLIs": [
        "reset dhcpv6 relay client-info { offline-record | online-fail-record } interface { <interface-name> | <interface-type> <interface-number> } [ pevlan <pevlan-id> [ <end-pevlan-id> ] [ cevlan <cevlan-id> [ <end-cevlan-id> ] ] ]",
        "reset dhcpv6 relay client-info { offline-record | online-fail-record } mac-address <mac-address-data>",
        "reset dhcpv6 relay client-info { offline-record | online-fail-record } client-duid <client-duid-data>",
        "reset dhcpv6 relay client-info { offline-record | online-fail-record }",
        "reset dhcpv6 relay client-info all"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "offline-record",
            "Info": "Clears DHCPv6 client logout records.\n-"
        },
        {
            "Parameters": "online-fail-record",
            "Info": "Clears DHCPv6 client login failure records.\n-"
        },
        {
            "Parameters": "interface interface-type interface-number",
            "Info": "Clears DHCPv6 client login failure and logout records on a specified DHCPv6 relay interface.\n-"
        },
        {
            "Parameters": "pevlan pevlan-id end-pevlan-id",
            "Info": "Clears login failure and logout records of DHCPv6 clients that send packets with a specified outer VLAN ID.\npevlan-id specifies the start outer VLAN ID.end-pevlan-id specifies the end outer VLAN ID. end-pevlan-id must be greater than or equal to pevlan-id. pevlan-id and pevlan-id specify a VLAN range.If end-pevlan-id is not specified, only login failure and logout records of DHCPv6 clients that send packets with the outer VLAN ID specified by pevlan-id are displayed.\nThe value is an integer ranging from 1 to 4094."
        },
        {
            "Parameters": "cevlan cevlan-id end-cevlan-id",
            "Info": "Clears login failure and logout records of DHCPv6 clients that send packets with a specified inner VLAN ID.\ncevlan-id specifies the start inner VLAN ID.end-cevlan-id specifies the end inner VLAN ID. end-cevlan-id must be greater than or equal to cevlan-id. end-cevlan-id and cevlan-id specify a VLAN range.If end-cevlan-id is not specified, only login failure and logout records of DHCPv6 clients that send packets with the inner VLAN ID specified by cevlan-id are displayed.\nThe value is an integer ranging from 1 to 4094."
        },
        {
            "Parameters": "mac-address mac-address-data",
            "Info": "Clears login failure and logout records of the DHCPv6 client with a specified MAC address.\nThe value is a 12-digit hexadecimal number, in the format of H-H-H. Each H is 4 digits. If an H contains fewer than 4 digits, the left-most digits are padded with zeros. For example, e0 is displayed as 00e0. The MAC address cannot be set to FFFF-FFFF-FFFF."
        },
        {
            "Parameters": "client-duid client-duid-data",
            "Info": "Clears login failure and logout records of the DHCPv6 client with a specified DUID.\nThe value is a hexadecimal number that ranges from 1 to 260, excluding 0x."
        },
        {
            "Parameters": "all",
            "Info": "Clears all DHCPv6 client login failure and logout records.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset dhcpv6 relay client-info offline-record interface GigabitEthernet 1/0/0 pevlan 1 100 cevlan 1 10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBefore collecting statistics about DHCPv6 client login failure and logout records in a period of time on a DHCPv6 relay agent, run the reset dhcpv6 relay client-info command to clear the existing statistics.\nThis command clears all DHCPv6 client login failure and logout records if no parameter is specified and clears specified DHCPv6 client login failure and logout records if a parameter is specified.\nPrecautions\nStatistics about DHCPv6 client login failure and logout records cannot be restored they are cleared. Exercise caution when running the reset dhcpv6 relay client-info command."
}