{
    "PageTitle": "atm cell transfer",
    "FuncDef": "The atm cell transfer command configures an ATM serial interface to work in ATM cell transport mode.\nThe undo atm cell transfer command restores the default configuration.\nBy default, an ATM serial interface works in ATM AAL5 SDU frame transport mode.",
    "CLIs": [
        "atm cell transfer",
        "undo atm cell transfer"
    ],
    "ParentView": [
        "IMA group interface view",
        "Serial interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface serial 1/0/0:1",
            "[~HUAWEI-Serial1/0/0:1] link-protocol atm",
            "[*HUAWEI-Serial1/0/0:1] atm cell transfer"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nATM cell relay is a technology used to transmit ATM cells over PWE3 virtual circuits (VCs).\nIt includes ATM cell transport and ATM AAL5 SDU frame transport modes. To switch between the two modes, run the atm cell transfer command.\nATM cell transport methods include 1-to-1 VCC, N-to-1 VCC, 1-to-1 VPC, and N-to-1 VPC. To simulate different types of ATM virtual connections, run the atm cell transfer command to switch to the ATM cell transport mode.When services are carried by a great number of AAL5 frames on an ATM network, use the default transport mode or run the undo atm cell transfer command. This ensures that PSN bandwidth resources are fully utilized.\n\nFollow-up Procedure\nCreate a PVC, configure a VPI/VCI mapping, and create an MPLS L2VPN connection.\nOnce an L2VPN connection is established, the PVC created cannot be deleted unless you delete the established L2VPN connection.\nPrecautions\nATM cell relay can be configured only on an interface or sub-interface. If you have run the atm cell transfer command on an interface, you cannot create sub-interfaces on the interface. If you have created sub-interfaces on an interface, you cannot run the atm cell transfer command on the interface.\nThe atm cell transfer command can be run in the serial interface view only after the link layer protocol of the interface is configured as ATM."
}