{
    "PageTitle": "atm interface-type",
    "FuncDef": "The atm interface-type command sets an ATM interface type.\nThe undo atm interface-type command restores the default ATM interface type.\nBy default, the type of an ATM interface is UNI.",
    "CLIs": [
        "atm interface-type { uni | nni }",
        "undo atm interface-type"
    ],
    "ParentView": [
        "Global IMA-group interface view",
        "IMA group interface view",
        "Serial interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "uni",
            "Info": "Sets the ATM interface type to UNI. If a device works on the user side, set the type of the ATM interface connecting to its peer device to UNI.\n-"
        },
        {
            "Parameters": "nni",
            "Info": "Sets the ATM interface type to NNI. If a device works on the network side, set the type of the ATM interface connecting to its peer device to NNI.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface serial 1/0/0:0",
            "[~HUAWEI-Serial1/0/0:0] link-protocol atm",
            "[*HUAWEI-Serial1/0/0:0] atm interface-type nni"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nInterfaces on an ATM network are divided into the following types:\nUNI: connects a data terminal equipment (DTE) to a data circuit-terminating equipment (DCE).NNI: connects DCEs.\nA DTE accesses a network through a DCE.\nPerform the following operations based on the ATM device location on the network.\nIf the device works on the user side, run the atm interface-type uni command to set the type of the ATM interface connecting to its peer device to UNI.If the device works on the network side, run the atm interface-type nni command to set the type of the ATM interface connecting to its peer device to NNI.\n\nConfiguration Impact\nRunning the atm interface-type command will change the VPI value range. For details, see the pvc command.\nPrecautions\nThe atm interface-type command can be run in the view of a serial interface only after the link layer protocol of the interface is configured as ATM."
}