{
    "PageTitle": "atm service",
    "FuncDef": "The atm service command specifies the service type of PVCs and PVPs and parameters.\nThe undo atm service command restores the default configuration.\nBy default, the service type of PVCs and PVPs is UBR.",
    "CLIs": [
        "atm service <svcName> { { cbr <pcr> <cdvt> } | { { nrt-vbr | rt-vbr } <pcr> <scr> <mbs> <cdvt> } | { ubr <pcr> [ <cdvt> ] } | { ubr-plus <pcr> <mcr> <cdvt> } }",
        "undo atm service <svcName>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "svcName",
            "Info": "Specifies the name of a service.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "cbr",
            "Info": "Specifies the service type of PVCs and PVPs as the Constant Bit Rate (CBR).\n-"
        },
        {
            "Parameters": "pcr",
            "Info": "Specifies the peak cell rate (PCR) at which ATM cells are sent.\nThe value varies according to product subcards."
        },
        {
            "Parameters": "cdvt",
            "Info": "Specifies the cell delay variation tolerance (CDVT) value.\nThe value varies according to product subcards."
        },
        {
            "Parameters": "nrt-vbr",
            "Info": "Specifies the service type of PVCs and PVPs as the Non Real Time-Variable Bit Rate (NRT-VBR).\n-"
        },
        {
            "Parameters": "rt-vbr",
            "Info": "Specifies the service type of PVCs and PVPs as the Real Time-Variable Bit Rate (RT-VBR).\n-"
        },
        {
            "Parameters": "scr",
            "Info": "Specifies the sustainable cell rate (SCR) at which ATM cells are sent.\nThe value varies according to product subcards.\n."
        },
        {
            "Parameters": "mbs",
            "Info": "Specifies the maximum burst size (MBS) of ATM cells sent, specifically, the maximum number of ATM cells that can be transmitted by an interface.\nThe value varies according to product subcards."
        },
        {
            "Parameters": "ubr",
            "Info": "Specifies the service type of PVCs and PVPs as the Unspecified Bit Rate (UBR).\n-"
        },
        {
            "Parameters": "ubr-plus",
            "Info": "Specifies the service type of PVCs and PVPs as the minimum guaranteed rate.\n-"
        },
        {
            "Parameters": "mcr",
            "Info": "Specifies the minimum cell rate (MCR) at which ATM cells are sent.\nThe value varies according to product subcards."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] atm service huawei rt-vbr 200 150 20 50"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo limit traffic entering an ATM network within a proper range, run the atm service command to specify a service type for PVCs or PVPs and specify parameters for the service type. This helps prevent the impact of burst traffic and ensures efficient usage of network resources by implementing ATM traffic shaping.\nFollow-up Procedure\nRun the service command to apply the service type of PVCs and PVPs."
}