{
    "PageTitle": "differential-delay",
    "FuncDef": "The differential-delay command sets the maximum link differential delay for an IMA group.\nThe undo differential-delay command restores the default setting.\nBy default, the maximum link differential delay between member links in an IMA group is 25 ms.",
    "CLIs": [
        "differential-delay <diffDelay>",
        "undo differential-delay"
    ],
    "ParentView": [
        "Global IMA-group interface view",
        "IMA group interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "diffDelay",
            "Info": "Sets the maximum link differential delay for an IMA group.\nThe value is an integer ranging from 25 to 120, in milliseconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface ima-group 1/0/0",
            "[*HUAWEI-Ima-group 1/0/0] differential-delay 50"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAn IMA group is a logical link that consists of one or more physical links. It provides more bandwidth than a single link. The bandwidth of the logical link is approximately equal to the sum of the bandwidth of all member links. Datagrams in an IMA group consist of those from member links.\nLink differential delay is the difference of delays for sending packets along member links in an IMA group. To set the maximum link differential delay for an IMA group, run the differential-delay command. The difference of delays for sending datagrams along member links in an IMA group must be less than or equal to the value configured using this command.\nTo improve bandwidth usage of IMA channels and prevent empty packets from consuming bandwidth, set a smaller maximum link differential delay when traffic is heavy on the network.\nPrecautions\nConfiguring the differential-delay command interrupts traffic over member links in an IMA group. After you configure this command, the IMA group renegotiates and reestablishes IMA links."
}