{
    "PageTitle": "display atm pvc-info",
    "FuncDef": "The display atm pvc-info command displays PVC configuration.\nThe display atm pvc-info statistics command displays PVC statistics.",
    "CLIs": [
        "display atm pvc-info [ statistics [ interface { <interface-type> <interface-number> | <interface-name> } ] | interface { <interface-type> <interface-number> | <interface-name> } [ pvc <pvc-name> [ <vpivci> ] ] ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "interface",
            "Info": "Specifies an interface.\n-"
        },
        {
            "Parameters": "interface-type",
            "Info": "Specifies an interface type.\n-"
        },
        {
            "Parameters": "interface-number",
            "Info": "Specifies an interface number.\n-"
        },
        {
            "Parameters": "interface-name",
            "Info": "Specifies an interface name.\n-"
        },
        {
            "Parameters": "pvc pvc-name",
            "Info": "Displays configuration about a PVC with a specified name.\nThe value is created using the pvc command. The value of vpi/vci for each PVC must be unique on an ATM interface (including its sub-interfaces).\nThe value is a string of 1 to 16 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "vpivci",
            "Info": "Specifies a virtual path identifier (VPI) / virtual channel identifier (VCI).The PVC identified by vpivci must have been created.\nvpi: The value is an integer, and its range varies with the interface type.\nUNI interface: The value ranges from 0 to 255.NNI interface: The value ranges from 0 to 4095.\nvci: The value is an integer ranging from 0 to 2 and from 5 to 65535. Generally, the VCI value 65535 is reserved for special use and it is recommended that this value not be used."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display atm pvc-info statistics",
            "ATM PVC-info statistics for interface Global-Ima-Group1.1:",
            "Maximum VCs: 4096",
            "Total VCs  : 1",
            "UP VCs     : 1     DOWN VCs   : 0",
            "Static VCs : 1",
            "ATM PVC-info statistics for interface Global-Ima-Group1.2:",
            "Maximum VCs: 4096",
            "Total VCs  : 1",
            "UP VCs     : 1     DOWN VCs   : 0",
            "Static VCs : 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nATM is connection-oriented. ATM connections are logical connections, called VCs. Each VC is identified by a VPI/VCI. A VPI/VCI is of local significance for a link between ATM devices and is translated on the ATM devices. When a VC connection is released, the VPI/VCI value for the connection is also reclaimed and can be used by another connection.\nIf a PVC has been configured on an interface, run the display atm pvc-info command to view the configuration and statistics about the PVC.\nWhen you use the display atm pvc-info command, note the following:\nIf you do not specify any parameter, the command displays information about all PVCs on all ATM interfaces.If you specify interface, the command displays information about all PVCs on the specified interface.\nIf PVC is configured on multiple interfaces, to check PVC statistics on each interface, you need to run the display this command on each interface, which is time-consuming. To address issue, run the display atm pvc-info statistics command to check PVC statistics on all interfaces.\n\nPrerequisites\nThe ATM PVC configurations have been complete.\nPrecautions\nIf PVC has not been configured on an interface, no information is displayed.\nIf the interface parameter is not specified in the command, PVC statistics on all interfaces on which PVC has been configured are displayed."
}