{
    "PageTitle": "ima ima-group",
    "FuncDef": "The ima ima-group command adds a serial interface to a specified IMA-group interface.\nThe undo ima ima-group command deletes a serial interface from an IMA-group interface.\nBy default, no serial interface is added to an IMA-group interface.",
    "CLIs": [
        "ima { <iftype> <ifnumber> | <ifname> }",
        "undo ima ima-group"
    ],
    "ParentView": [
        "Serial sub-interface view",
        "Serial interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "iftype",
            "Info": "Specifies an interface type.\nima-group"
        },
        {
            "Parameters": "ifnumber",
            "Info": "Specifies the number of an IMA-group interface.The value is in slot/card/group number format. The slot number and card number must be the same as those of the interface to be added to the IMA group.\n-"
        },
        {
            "Parameters": "ifname",
            "Info": "Specifies an interface name.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface serial 1/0/0:0",
            "[~HUAWEI-Serial1/0/0:0] link-protocol atm",
            "[*HUAWEI-Serial1/0/0:0] ima ima-group 1/0/0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo add a serial interface to a specified IMA-group interface, run the ima ima-group command. This configuration improves bandwidth usage flexibility.\nPrerequisites\nAn IMA-group interface has been created. For details, see the interface ima-group command.\nConfiguration Impact\nAfter a serial interface is added to an IMA-group interface, the configuration of Layer 3 services on the interface does not take effect.\nPrecautions\nBefore you change the link layer protocol configured on a serial interface added to an IMA-group interface, run the undo ima ima-group command to delete the interface from the IMA-group interface.\nBefore you delete the link first added to an IMA-group interface from the group, run the undo interface ima-group command to delete the IMA-group interface.\nThe ima ima-group command can be run in the view of a serial interface only after the link layer protocol of the interface is configured as ATM.\nOn the CR5D00C8CF71 subcard, serial interfaces that are created on CPOS interfaces numbered from 0 to 3 can only be bound to IMA-group interfaces numbered from 1 to 256. Serial interfaces that are created on CPOS interfaces numbered from 4 to 7 can only be bound to IMA-group interfaces numbered from 257 to 512."
}