{
    "PageTitle": "map pvp",
    "FuncDef": "The map pvp command configures the mapping between local and peer VPIs.\nThe undo map pvp command deletes the mapping between local and peer VPIs.\nBy default, the mapping between local and peer VPIs is not configured.",
    "CLIs": [
        "map pvp <vpiValue> [ bidirectional ]",
        "undo map pvp"
    ],
    "ParentView": [
        "ATM-PVP view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpiValue",
            "Info": "Specifies the value of the peer VPI.\nThe value is an integer, and its range varies with the interface type.\nUNI interface: The value ranges from 0 to 255.NNI interface: The value ranges from 0 to 4095."
        },
        {
            "Parameters": "bidirectional",
            "Info": "Indicates bidirectional mapping between local and peer VPI/VCIs.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Serial 1/0/0:0",
            "[~HUAWEI-Serial1/0/0:0] link-protocol atm",
            "[*HUAWEI-Serial1/0/0:0] quit",
            "[*HUAWEI] interface serial 1/0/0:0.1",
            "[*HUAWEI-Serial1/0/0:0.1] pvp 20",
            "[*HUAWEI-Serial-pvp-Serial1/0/0:0.1-20] map pvp 30"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nATM cell relay is a technique used to transmit ATM cells over PWE3 VCs. By interconnecting ATM networks over a PSN, ATM cell relay emulates traditional ATM services when they are transmitted over the PSN. This allows end users to be unaware of network differences and protects carriers' investment during network integration and construction.\nIn some ATM cell relay modes, such as 1-to-1 VPC and N-to-1 VPC, when you create PVPs on PEs, you can use the VPI values for the PVPs on the connected CEs. You do not need to configure the VPI values. Through L2VC connections, the system automatically identifies the PVPs as the same VP and completes the VPI mapping. To configure the mapping between local and peer VPIs, run the map pvp command. This configuration helps implement ATM cell relay.\nIf the local and peer VPI values are different, you need to run the map pvp command. Note the following:\nIf you do not specify bidirectional, the command configures unidirectional mapping between local and peer VPIs. Specifically, the mapping is performed only on the interface in the outbound direction.If you specify bidirectional, the command configures bidirectional mapping between local and peer VPIs. Specifically, the mapping is performed on the interface in both inbound and outbound directions.\n\nPrecautions\nIf the local and peer VPI values are the same, do not configure the mapping between them. The mapping is not performed on the interface in inbound or outbound direction."
}