{
    "PageTitle": "atm-bundle",
    "FuncDef": "The atm-bundle command adds a sub-interface to an ATM bundle interface.\nThe undo atm-bundle command removes a sub-interface from an ATM bundle interface.\nBy default, no sub-interface is added to an ATM bundle interface.",
    "CLIs": [
        "atm-bundle <bundle-id>",
        "undo atm-bundle"
    ],
    "ParentView": [
        "IMA-group sub-interface view",
        "Serial interface view",
        "Serial sub-interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "bundle-id",
            "Info": "Specifies the number of an ATM bundle interface.\nThe value is an integer ranging from 0 to 1023."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface atm-bundle 1",
            "[*HUAWEI-Atm-Bundle1] quit",
            "[*HUAWEI] interface serial 1/0/0:0.1",
            "[*HUAWEI-serial1/0/0:0.1] pvc 3/33",
            "[*HUAWEI-serial1/0/0:0.1-pvc-3/33] quit",
            "[*HUAWEI-serial1/0/0:0.1] atm-bundle 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo add an IMA-group sub-interface or a serial sub-interface to an existing ATM bundle interface, run the atm-bundle command. This allows nodeBs to use a PW to transmit services of the same type to an RNC.\nPrerequisites\nAn ATM bundle interface has been created using the interface atm-bundle command.\nBefore a serial sub-interface is added to an ATM bundle interface to transparently transmit ATM cells, the serial interface must have been encapsulated with ATM, and a PVC or PVP must have been created on the serial sub-interface. Otherwise, the serial sub-interface fails to be added to the ATM bundle interface.\nConfiguration Impact\nAn IMA-group sub-interface or serial sub-interface can be a member of only one ATM bundle interface.\nPrecautions\nAn IMA-group sub-interface or serial sub-interface can be a member of only one ATM bundle interface. After an ATM bundle interface has max members, no more interfaces can be added. If you attempt to add another sub-interface to the ATM bundle interface.\nIf member interfaces of an ATM bundle interface need to be removed, the first added member interface must be the last one to be removed. Otherwise, the system displays an error messages.\nTwo inter-board sub-interfaces cannot be added to the same ATM-bundle interface on the CR5D00C8CF71 subcards. Serial and IMA sub-interfaces that are created on CPOS interfaces numbered from 0 to 3 cannot be added to the same ATM-bundle interface where serial or IMA sub-interfaces that are created on CPOS interfaces numbered from 4 to 7 reside."
}