{
    "PageTitle": "pvp",
    "FuncDef": "The pvp command creates a PVP and displays the PVP view.\nThe undo pvp command deletes a PVP.\nBy default, no PVP is created.",
    "CLIs": [
        "pvp <vpiValue>",
        "undo pvp <vpiValue>"
    ],
    "ParentView": [
        "IMA-group sub-interface view",
        "Serial interface view",
        "Serial sub-interface view",
        "Global IMA-group sub-interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpiValue",
            "Info": "Specifies the VPI.\nThe value is an integer, and its range varies with the interface type.\nUNI interface: The value ranges from 0 to 255.NNI interface: The value ranges from 0 to 4095."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface serial 1/0/0:0",
            "[~HUAWEI-Serial1/0/0:0] link-protocol atm",
            "[*HUAWEI-Serial1/0/0:0] quit",
            "[*HUAWEI] interface serial 1/0/0:0.1",
            "[*HUAWEI-Serial1/0/0:0.1] pvp 3",
            "[*HUAWEI-Serial1/0/0:0.1-pvp-3]"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nATM cell relay is a technique used to transmit ATM cells over PWE3 VCs. By interconnecting ATM networks over a PSN, ATM cell relay emulates traditional ATM services when they are transmitted over the PSN. This allows end users to be unaware of network differences and protects carriers' investment during network integration and construction.\nIn some ATM cell relay modes, such as 1-to-1 VPC and N-to-1 VPC, when you create PVPs on PEs, you can use the VPI values for the PVPs on the connected CEs. The VCI values are unneeded. Through L2VC connections, the system automatically identifies the PVPs as the same VP and completes the VPI mapping. To create a PVP and specify its VPI, run the pvp command.\nPrerequisites\nIf the pvp command is to be configured on a serial sub-interface, the link layer protocol of the serial sub-interface must have been configured as ATM.\nPrecautions\nThe VPI value of a PVP must be unique on an interface and its sub-interfaces."
}