{
    "PageTitle": "trap-threshold (ATM service)",
    "FuncDef": "The trap-threshold atm command sets an alarm generation and clearing thresholds for the number of dropped packets, disordered packets, or unknown cells on an ATM-PWE3.\nThe undo trap-threshold atm command restores the default configuration.\nBy default, the alarm generation and clearing thresholds for ATM service transport performance is 100 and 1, respectively.",
    "CLIs": [
        "trap-threshold { atmpw-lospkt-exc | atmpw-misorderpkt-exc | atmpw-unknowncell-exc } trigger-threshold <trigger-threshold> resume-threshold <resume-threshold>",
        "undo trap-threshold { atmpw-misorderpkt-exc | atmpw-unknowncell-exc | atmpw-lospkt-exc }"
    ],
    "ParentView": [
        "Global IMA-group sub-interface view",
        "IMA-group sub-interface view",
        "IMA group interface view",
        "Serial sub-interface view",
        "Serial interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "atmpw-lospkt-exc",
            "Info": "Sets the alarm generation and clearing thresholds for the number of packets dropped in one second on an ATM-PWE3.\n-"
        },
        {
            "Parameters": "atmpw-misorderpkt-exc",
            "Info": "Sets the alarm generation and clearing thresholds for the number of disordered packets received in one second on an ATM-PWE3.\n-"
        },
        {
            "Parameters": "atmpw-unknowncell-exc",
            "Info": "Sets the alarm generation and clearing thresholds for the number of unknown cells generated in one second on an ATM-PWE3.\n-"
        },
        {
            "Parameters": "trigger-threshold trigger-threshold",
            "Info": "Specifies an alarm generation threshold.\nThe value is an integer ranging from 1 to 1000. The default value is 100."
        },
        {
            "Parameters": "resume-threshold resume-threshold",
            "Info": "Specifies an alarm clearing threshold. resume-threshold-value must be smaller than trigger-threshold-value.\nThe value is an integer ranging from 1 to 1000. The default value is 1."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface serial 2/0/0:1",
            "[*HUAWEI-Serial2/0/0:1] trap-threshold atmpw-lospkt-exc trigger-threshold 50 resume-threshold 5"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure alarm generation and clearing thresholds for the number of dropped packets, disordered packets, or unknown cells on an ATM-PWE3, run the trap-threshold atm command. If the number of dropped packets, disordered packets, or unknown cells reaches the alarm generation threshold, the system generates an alarm and sends it to the NMS. If the number of dropped packets, disordered packets, or unknown cells falls below the alarm clearing threshold, the system generates a clear alarm and sends it to the NMS. The alarm function is enabled by default.\nPrerequisites\nIf the trap-threshold atm command is to be configured in the serial sub-interface view, ATM must have been configured as the link layer protocol of the serial sub-interface."
}