{
    "PageTitle": "display mpls l2vpn qos",
    "FuncDef": "The display mpls l2vpn qos command displays QoS information.",
    "CLIs": [
        "display mpls l2vpn qos [ peer-address <peer-address> ] vc-id <vc-id> vc-type { ppp | hdlc | ethernet | vlan | atm-aal5-sdu | atm-trans-cell | atm-nto1-vcc | atm-nto1-vpc | atm-1to1-vcc | atm-1to1-vpc | atm-aal5-pdu | ip-interworking | ip-layer2 | satop-e1 | satop-t1 | satop-e3 | cesopsn-basic | cep }",
        "display mpls l2vpn qos pw-template <pw-template-name>",
        "display mpls l2vpn qos interface { <interface-name> | <interface-type> <interface-number> } [ secondary | bypass ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "peer-address peer-address",
            "Info": "Specifies the IPv4 address of a peer PE.\nThe value is an IPv4 address in dotted decimal notation (X.X.X.X), for example, 10.1.1.1."
        },
        {
            "Parameters": "vc-id vc-id",
            "Info": "Displays QoS information about a PW with the specified VC ID.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "vc-type",
            "Info": "Displays QoS information about PWs with the specified encapsulation type.\n-"
        },
        {
            "Parameters": "ppp",
            "Info": "PPP is a link layer protocol that specifies how to encapsulate and transmit network layer packets over P2P links.\n-"
        },
        {
            "Parameters": "hdlc",
            "Info": "HDLC is a bit-oriented link layer protocol.\n-"
        },
        {
            "Parameters": "ethernet",
            "Info": "This encapsulation type is used when Ethernet packets do not carry VLAN information.\n-"
        },
        {
            "Parameters": "vlan",
            "Info": "This encapsulation type is used when Ethernet packets carry VLAN information.\n-"
        },
        {
            "Parameters": "atm-aal5-sdu",
            "Info": "One PW carries the AAL5 SDUs of one PVC.\n-"
        },
        {
            "Parameters": "atm-trans-cell",
            "Info": "ATM cells are transmitted over PWE3 VCs.\n-"
        },
        {
            "Parameters": "atm-nto1-vcc",
            "Info": "One PW carries the ATM cells of multiple PVCs.\n-"
        },
        {
            "Parameters": "atm-nto1-vpc",
            "Info": "One PW carries the ATM cells of multiple PVPs.\n-"
        },
        {
            "Parameters": "atm-1to1-vcc",
            "Info": "One PW carries the ATM cells of one PVC.\n-"
        },
        {
            "Parameters": "atm-1to1-vpc",
            "Info": "One PW carries the ATM cells of one PVP.\n-"
        },
        {
            "Parameters": "atm-aal5-pdu",
            "Info": "One PW carries the AAL5 PDUs of one PVC.\n-"
        },
        {
            "Parameters": "ip-interworking",
            "Info": "This encapsulation type is used for interworking between Huawei devices.\n-"
        },
        {
            "Parameters": "ip-layer2",
            "Info": "This encapsulation type is used for interworking between Huawei devices and non-Huawei devices.\n-"
        },
        {
            "Parameters": "satop-e1",
            "Info": "SAToP is insensitive to the E1 frame structure and encapsulates a whole E1 frame into a PW packet.\n-"
        },
        {
            "Parameters": "satop-t1",
            "Info": "SAToP is insensitive to the T1 frame structure and encapsulates a whole T1 frame into a PW packet.\n-"
        },
        {
            "Parameters": "satop-e3",
            "Info": "SAToP is insensitive to the E3 frame structure and encapsulates a whole E3 frame into a PW packet.\n-"
        },
        {
            "Parameters": "cesopsn-basic",
            "Info": "CES is sensitive to E1 and T1 frame structures. E1 or T1 signals can be encapsulated into packets based on timeslots.\n-"
        },
        {
            "Parameters": "cep",
            "Info": "This encapsulation type is used for CEP services.\n-"
        },
        {
            "Parameters": "pw-template pw-template-name",
            "Info": "Displays QoS information about PWs that use the specified PW template.\nThe value is a string of 1 to 19 case-sensitive characters, spaces not supported.\nThe string can contain spaces if it is enclosed in double quotation marks (\")."
        },
        {
            "Parameters": "interface interface-type interface-number",
            "Info": "Displays QoS information about a PW with the specified AC interface.\n-"
        },
        {
            "Parameters": "interface interface-name",
            "Info": "Displays QoS information about a PW with the specified AC interface.\n-"
        },
        {
            "Parameters": "secondary",
            "Info": "Displays QoS information about the secondary PW.\n-"
        },
        {
            "Parameters": "bypass",
            "Info": "Displays QoS information about the bypass PW.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display mpls l2vpn qos vc-id 100 vc-type vlan",
            "Using VC ID 100 VC Type VLAN Display Local LDP QoS:",
            "",
            "------------------------------------------------",
            "  L2VPN QoS CIR value        : 2000",
            "  L2VPN QoS PIR value        : 3000",
            "  L2VPN QoS qos-profile name : qp1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe VPN services carried over a tunnel have different resource requirements. To meet the resource requirements of L2VPN services carried over a tunnel without affecting the quality of other VPN services, configure L2VPN QoS. To check QoS information about L2VPN after QoS is configured, run the display mpls l2vpn qos command."
}