{
    "PageTitle": "encryption-algorithm",
    "FuncDef": "The encryption-algorithm command specifies an encryption algorithm for an IKE proposal.\nThe undo encryption-algorithm command restores the default setting.\nBy default, 256-bit AES-CBC is used as the encryption algorithm.",
    "CLIs": [
        "encryption-algorithm { 3des-cbc | aes-cbc { 128 | 192 | 256 } | des-cbc | aes-gcm-128 { 128 | 192 | 256 } }",
        "undo encryption-algorithm [ 3des-cbc | aes-cbc { 128 | 192 | 256 } | des-cbc | aes-gcm-128 { 128 | 192 | 256 } ]"
    ],
    "ParentView": [
        "IKE proposal view"
    ],
    "ParaDef": [
        {
            "Parameters": "3des-cbc",
            "Info": "Specifies the 192-bit 3DES-CBC encryption algorithm for an IKE proposal.\nThe encryption algorithms 3DES have a low security, which may bring security risks. If protocols allowed, using more secure encryption algorithms, such as AES, is recommended.\n-"
        },
        {
            "Parameters": "aes-cbc",
            "Info": "Specifies the AES-CBC encryption algorithm for an IKE proposal. There are three values for the key length, to provide security protection of different levels.\nThe available options are 128, 192, and 256, indicating that the AES key length can be 128 bits, 192 bits, and 256 bits respectively. By default, the AES key length is 256 bits."
        },
        {
            "Parameters": "128",
            "Info": "Specifies the key length of 128 bits.\n-"
        },
        {
            "Parameters": "192",
            "Info": "Specifies the key length of 192 bits.\n-"
        },
        {
            "Parameters": "256",
            "Info": "Specifies the key length of 256 bits.\n-"
        },
        {
            "Parameters": "des-cbc",
            "Info": "Specifies the 64-bit DES-CBC encryption algorithm for an IKE proposal.\nThe encryption algorithms DES have a low security, which may bring security risks. If protocols allowed, using more secure encryption algorithms, such as AES, is recommended.\n-"
        },
        {
            "Parameters": "aes-gcm-128",
            "Info": "Specifies the AES-GCM-128 encryption algorithm for an IKE proposal. There are three values for the key length, to provide security protection of different levels.\nThe available options are 128, 192, and 256, indicating that the AES key length can be 128 bits, 192 bits, and 256 bits respectively."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ike proposal 10",
            "[*HUAWEI-ike-proposal-10] encryption-algorithm aes-cbc 256"
        ]
    ],
    "ExtraInfo": "To improve the system security, using the DES-CBC/3DES-CBC encryption algorithm for the IKE negotiation is not recommended.\nAfter the aes-gcm-128 { 128 | 192 | 256 } parameter is configured in the encryption-algorithm command, the integrity mechanism configured using the integrity-algorithm command fails."
}