{
    "PageTitle": "ike proposal",
    "FuncDef": "The ike proposal command creates an IKE proposal and enters the IKE proposal view.\nThe undo ike proposal command deletes an IKE proposal.\nBy default, no IKE proposal is configured.",
    "CLIs": [
        "ike proposal <proposal-number>",
        "undo ike proposal <proposal-number>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "proposal-number",
            "Info": "Indicates the number of an IKE proposal.\nIt is an integer that ranges from 1 to 100."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ike proposal 20",
            "[*HUAWEI-ike-proposal-20]"
        ]
    ],
    "ExtraInfo": "In the IKE proposal view, you can define parameters, including authentication method, encryption algorithm, authentication algorithm, integrity algorithm, DH group ID and SA duration, for the IKE proposal by using the authentication-method, authentication-algorithm, dh, encryption-algorithm, integrity-algorithm, and sa duration commands.\nThe following parameters are present in the default proposal:\nEncryption algorithm is AES-CBC-256Authentication algorithm is SHA2-256Authentication method is Pre-Shared KeySA duration and is 86400 seconds\nThe encryption algorithms DES/SHA1 (in digital signature scenarios) have a low security, which may bring security risks. If protocols allowed, using more secure encryption algorithms, such as AES/SHA2/HMAC-SHA2, is recommended.\nBoth sides of the negotiation can be configured with more than one IKE proposal. They negotiate from the IKE proposal with the highest priority to select one in which both sides of the negotiation has the same encryption algorithm, authentication algorithm, authentication method, and DH group ID. The SA duration is decided by the initiator of the negotiation and need no agreement.\nIf you specify the IKE proposal in the ike peer of the initiator of the negotiation, only the specified IKE proposal is sent during IKE negotiation. The responder searches for only the IKE proposal matching with that specified by the initiator. If such IKE proposal cannot be found, the negotiation fails.\nIf no IKE proposal is specified in the ike peer of the initiator of the negotiation, all IKE proposals are sent during the IKE negotiation. The responder searches for the IKE proposals matching with these proposals sent by the initiator one by one."
}