{
    "PageTitle": "remote-address (IKE peer view)",
    "FuncDef": "The remote-address command configures the remote address or address range for the IKE peer.\nThe undo remote-address command restores the default setting.\nBy default, the IP address or address segment of the IKE peer is not set.",
    "CLIs": [
        "remote-address [ authentication-address | vpn-instance <vpn-instance-name> ] <remote-low-address> [ <remote-high-address> ]",
        "undo remote-address [ authentication-address ]"
    ],
    "ParentView": [
        "IKE peer view"
    ],
    "ParaDef": [
        {
            "Parameters": "authentication-address",
            "Info": "Indicates the authentication address.\n-"
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Indicates the name of the VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "remote-low-address",
            "Info": "Indicates the start address of the peer IP address range.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "remote-high-address",
            "Info": "Indicates the end address of the peer IP address range.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ike peer peer1",
            "[*HUAWEI-ike-peer-peer1] remote-address 192.168.0.1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf remote-high-address is not specified in the command, only one address is configured for the IKE peer. If the peer address is configured as an address segment, this IKE peer can be applied by the IPSec policy template only.\nWhen the IKE peer is quoted by the IPSec policy or IPSec policy template, you cannot run the remote-address command to modify the peer IP address of the IKE peer.\nvpn-instance-name configured in remote-address should be same as the vpn-instance-name configured in interface to which policy is applied.\nPrecautions\nIf the same local IP address is configured in different IPsec policies and these IPsec policies are applied to different IPsec tunnels, the IPsec tunnels cannot load-balance traffic.\nIf the same local IP address is configured in different IPsec policies and is bound to a physical inbound interface in some IPsec policies and not bound to any physical inbound interface in other IPsec policies, after these IPsec policies are applied to different IPsec tunnels, the IPsec tunnels cannot load-balance traffic."
}