{
    "PageTitle": "pki whitelist enable (ike)",
    "FuncDef": "The pki whitelist enable command enables the PKI whitelist check function for an IKE peer.\nThe pki whitelist disable command disables the PKI whitelist check function for an IKE peer.\nThe undo pki whitelist command restores the default configuration.\nBy default, the global PKI whitelist check configuration is used.",
    "CLIs": [
        "pki whitelist { enable | disable }",
        "undo pki whitelist { enable | disable }"
    ],
    "ParentView": [
        "IKE peer view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ike peer 1",
            "[*HUAWEI-ike-peer-1] pki whitelist enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn LTE scenarios, a security gateway and base stations use certificates to negotiate IPsec tunnels. The PKI whitelist on the security gateway can be used to uniformly manage certificates of base stations. If PKI whitelist check is enabled on the security gateway using the pki whitelist enable command, the common names in the certificate subjects of base stations must be imported to the security gateway's PKI whitelist for certificate verification of the base stations.\nConfiguration Impact\nAfter PKI whitelist check is enabled for an IKE peer using the pki whitelist enable command and the IKE peer receives certificate authentication packets from a remote device, the IKE peer checks whether the common names in the remote certificate subjects match the PKI whitelist. If not, the authentication fails.\nAfter PKI whitelist check is disabled from an IKE peer using the pki whitelist disable command and the IKE peer receives certificate authentication packets from a remote device, the IKE peer does not check whether the common names in the remote certificate subjects match the PKI whitelist.\nAfter the default configuration is restored using the undo pki whitelist { enable | disable } command, the global PKI whitelist check configuration is used.\nPrecautions\nThe common names are case-sensitive.\nThe changes in the PKI whitelist check status of an IKE peer do not affect IPsec tunnels that have been established."
}