{
    "PageTitle": "ike dpd",
    "FuncDef": "The ike dpd command enables the dead peer detection (DPD) function.\nThe undo ike dpd command restores the default configuration.\nBy default, the DPD function is disabled",
    "CLIs": [
        "ike dpd interval <check-interval> [ <retry-interval> ]",
        "ike dpd [ on-demand ] <check-interval> [ <retry-interval> ] [ immediately ]",
        "undo ike dpd"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "check-interval",
            "Info": "Indicates the interval of transmitting DPD packets.\nIt is an integer that ranges from 10 to 3600, in seconds."
        },
        {
            "Parameters": "retry-interval",
            "Info": "Indicates the interval of timeout retransmission of DPD packets.\nIt is an integer that ranges from 2 to 60, in seconds. The default value is 5 seconds."
        },
        {
            "Parameters": "on-demand",
            "Info": "Indicates that the DPD function works in traffic-triggering mode.\n-"
        },
        {
            "Parameters": "immediately",
            "Info": "Indicates the mode of becoming effective immediately.\n-"
        },
        {
            "Parameters": "interval",
            "Info": "Indicates that the DPD function works in polling mode.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ike dpd on-demand 30 5"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nPay attention to the following items:\ninterval being configured indicates that the DPD function is in polling mode and DPD packets are sent periodically. If traffic from the peer end is not received within the check-interval, DPD packets are sent periodically.on-demand being configured indicates that the DPD function is in traffic-triggering mode and DPD packets are sent only when there is no traffic in the tunnel. When the local end sends packets, if traffic from the peer end is not received within the check-interval, DPD packets are sent.If interval or on-demand is not configured, the DPD function is in traffic-triggering mode by default.retry-interval can be configured for a maximum of 3 times. If retry-interval is not configured, the interval for retransmitting the DPD packet is three seconds.\nSetting a parameter value lower than the configured one is not recommended.\n\nPrecautions\nThe IKE DPD function must be configured so that both ends of an IPsec tunnel can detect the peer status and maintain consistent IPsec tunnel status to ensure uninterrupted IPsec services."
}