{
    "PageTitle": "integrity-algorithm",
    "FuncDef": "The integrity-algorithm command sets the integrity algorithm to be used in an IKE proposal.\nThe undo integrity-algorithm command restores the default setting.\nBy default, the integrity algorithm to be used in an IKE proposal is HMAC-SHA2-256.",
    "CLIs": [
        "integrity-algorithm { aes-xcbc-96 | hmac-md5-96 | hmac-sha1-96 | hmac-sha2-256 | hmac-sha2-384 | hmac-sha2-512 }",
        "undo integrity-algorithm [ aes-xcbc-96 | hmac-md5-96 | hmac-sha1-96 | hmac-sha2-256 | hmac-sha2-384 | hmac-sha2-512 ]"
    ],
    "ParentView": [
        "IKE proposal view"
    ],
    "ParaDef": [
        {
            "Parameters": "aes-xcbc-96",
            "Info": "Indicates that the integrity algorithm is AES-XCBC-96.\nTo improve the system security, using the AES-XCBC-96 integrity algorithm for the IKEv2 negotiation is not recommended.\n-"
        },
        {
            "Parameters": "hmac-md5-96",
            "Info": "Indicates that the integrity algorithm is HMAC-MD5-96.\nTo improve the system security, using the HMAC-MD5-96 integrity algorithm for the IKEv2 negotiation is not recommended.\n-"
        },
        {
            "Parameters": "hmac-sha1-96",
            "Info": "Indicates that the integrity algorithm is HMAC-SHA1-96.\nTo improve the system security, using the HMAC-SHA1-96 integrity algorithm for the IKEv2 negotiation is not recommended.\n-"
        },
        {
            "Parameters": "hmac-sha2-256",
            "Info": "Indicates that the integrity algorithm is HMAC-SHA2-256.\n-"
        },
        {
            "Parameters": "hmac-sha2-384",
            "Info": "Indicates that the integrity algorithm is HMAC-SHA2-384.\n-"
        },
        {
            "Parameters": "hmac-sha2-512",
            "Info": "Indicates that the integrity algorithm is HMAC-SHA2-512.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ike proposal 20",
            "[*HUAWEI-ike-proposal-20] integrity-algorithm hmac-sha2-256"
        ]
    ],
    "ExtraInfo": "The security of hmac-md5-96, hmac-sha1-96, aes-xcbc-96 , hmac-sha2-256, hmac-sha2-384 and hmac-sha2-512 ascends gradually, and thus the calculation time increases accordingly.\nThe configuration is valid only for IKEv2 protocol.\nTo improve the system security, using the AES-XCBC-96, HMAC-MD5-96 and HMAC-SHA1-96 integrity algorithms for the IKEv2 negotiation is not recommended."
}