{
    "PageTitle": "ipsec policy",
    "FuncDef": "The ipsec policy command creates or modifies an IPSec policy and displays the IPSec policy view.\nThe undo ipsec policy command deletes an IPSec policy.\nBy default, the IPSec policy is not created.",
    "CLIs": [
        "ipsec policy <policy-name> <policy-seqnum> [ isakmp ]",
        "ipsec policy <policy-name> <policy-seqnum> isakmp template <tempname>",
        "ipsec policy <policy-name> profile",
        "undo ipsec policy <policy-name> [ <policy-seqnum> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "policy-name",
            "Info": "Indicates the name of the IPSec policy.\nIt is a string of 1 to 15 case sensitive characters."
        },
        {
            "Parameters": "policy-seqnum",
            "Info": "Indicates the sequence number of the IPsec policy.\nIt is an integer that ranges from 1 to 10000. The smaller the value is, the higher the priority is."
        },
        {
            "Parameters": "isakmp",
            "Info": "Sets up SA through the IKE negotiation.\n-"
        },
        {
            "Parameters": "template tempname",
            "Info": "Indicates the name of the policy template.\nIt is a string of 1 to 15 case sensitive characters."
        },
        {
            "Parameters": "profile",
            "Info": "Specifies to use the IPsec framework to create IPsec policies.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipsec policy policy1 1 isakmp"
        ]
    ],
    "ExtraInfo": "To create an IPsec policy, it is necessary to specify the negotiation mode. Once the IPsec policy is established, its negotiation mode cannot be modified. If you need to change the negotiation mode, you must delete the IPsec policy first, and then specify a different negotiation mode for it when recreating the IPsec policy.\nSecurity policies with the same name form a security policy group. A name and sequence number can determine a unique security policy. The smaller seq-number is, the higher the priority is. Applying a security policy group on an interface is actually equal to applying all security policies in security group. Therefore, different SAs can be adopted to protect different data flows.\nThe ipsec policy policy-name seq-number isakmp template template-name command establishes an IPsec policy according to the template through IKE negotiation. Before using this command, the template-name should have been created through ipsec policy-template command. During the negotiation and policy matching, the parameters defined in the template should be compliant and the other parameters are decided by the initiator. The parameters acl, proposal and IKE-peer are mandatory in the policy template configuration, whereas other parameters are optional.\nOnly one IPsec policy in an IPsec policy group can quote the IPsec policy template.\nConfiguring the IPsec policy with the lowest priority to quote the IPsec policy template is recommended."
}