{
    "PageTitle": "ipsec load-optimize",
    "FuncDef": "The ipsec load-optimize command delivers the SA information established with the peer tunnel to a specified CPU on the VSU manually.\nBy default, no SA information established with the peer tunnel is delivered to a specified CPU on the VSU manually.",
    "CLIs": [
        "ipsec load-optimize { peer-ip <ip-address> [ peer-port <port> ] [ vpn-instance <vpn-name> ] } [ local-ip <ip-address> ] to { target-service-location <location-id> }"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "peer-ip ip-address",
            "Info": "Specifies the peer IP address.\nThe value is an IPv4 address in dotted decimal notation (X.X.X.X), for example, 10.1.1.1."
        },
        {
            "Parameters": "peer-port port",
            "Info": "Specifies the peer port number.\nThe value is an integer ranging from 1 to 65535."
        },
        {
            "Parameters": "vpn-instance vpn-name",
            "Info": "Specifies a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "local-ip ip-address",
            "Info": "Specifies the local IP address.\nThe value is an IPv4 address in dotted decimal notation (X.X.X.X), for example, 10.1.1.1."
        },
        {
            "Parameters": "target-service-location location-id",
            "Info": "Specifies the target service location id.\nThe value is an integer ranging from 1 to 255."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipsec load-optimize peer-ip 10.1.1.1 local-ip 10.2.2.2 to target-service-location"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen a large number of IPSec tunnels are established between devices, the SA information of IPSec tunnels is evenly distributed on the CPUs of the VSU, and the corresponding traffic volume of different SA information may be different. Unbalanced load of traffic among CPUs of the VSU will occur when the corresponding traffic volume of some SA information is large. To make full use of each CPU, configure the ipsec load-optimize command to transfer the SA information established with the peer tunnel to a specified CPU on the VSU manually, achieving a balanced load of traffic among CPUs.\nPrecautions\nThe CPU usage on the VSU can be viewed using the display health command. Based on the CPU usage, you can deliver the SA information established with the peer tunnel to the CPU with lower usage manually.\nSA information of each CPU on the VSU can be viewed using the display ike sa command.\nWhen users use this command to transit tunnels, a few packets will be discarded."
}