{
    "PageTitle": "ah authentication-algorithm",
    "FuncDef": "The ah authentication-algorithm command configures the authentication algorithm for Authentication Header (AH).\nThe undo ah authentication-algorithm command restores the default authentication algorithm for AH.\nBy default, the authentication algorithm for AH is SHA2-256.",
    "CLIs": [
        "ah { authentication-algorithm { md5 | sha1 | sha2-256 | sha2-384 | sha2-512 } }",
        "undo ah authentication-algorithm"
    ],
    "ParentView": [
        "IPsec proposal view"
    ],
    "ParaDef": [
        {
            "Parameters": "md5",
            "Info": "Configures Message Digest 5 (MD5) as the authentication algorithm for AH.\nTo ensure high security, do not use the MD5 algorithm as the AH authentication algorithm.\n-"
        },
        {
            "Parameters": "sha1",
            "Info": "Configures Secure Hash Algorithm-1 (SHA-1) as the authentication algorithm for AH.\nTo ensure high security, do not use the SHA-1 algorithm as the AH authentication algorithm.\n-"
        },
        {
            "Parameters": "sha2-256",
            "Info": "Configures SHA2-256 as the authentication algorithm for AH.\n-"
        },
        {
            "Parameters": "sha2-384",
            "Info": "Configures SHA2-384 as the authentication algorithm for AH.\n-"
        },
        {
            "Parameters": "sha2-512",
            "Info": "Configures SHA2-512 as the authentication algorithm for AH.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipsec proposal prop1",
            "[*HUAWEI-ipsec-proposal-prop1] transform ah",
            "[*HUAWEI-ipsec-proposal-prop1] ah authentication-algorithm sha2-256"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAH is used to prevent protocol packets from being intercepted or modified and implement origin authentication during protocol packet transmission. AH implements the Hash algorithm on the sending and receiving parties and checks protocol packet integrity and authenticity.\nAH currently supports MD5, SHA-1, SHA2-256, SHA2-384, SHA2-512 authentication algorithms.\nMD5 is faster than SHA-1, but is less secure.\nPrerequisites\nThe transform command has been configured to select AH before the authentication algorithm for AH is configured.\nPrecautions\nThe authentication algorithms on both IPsec peers must be identical."
}