{
    "PageTitle": "sa anti-replay",
    "FuncDef": "The sa anti-replay window command configures the anti-reply window size.\nThe undo sa anti-replay window command cancels the anti-reply window size configuration.\nThe sa anti-replay eanble and undo sa anti-replay disable commands start the anti-replay function in an IPsec policy.\nThe undo sa anti-replay eanble and sa anti-replay disable commands cancel the anti-replay function in an IPsec policy.\nBy default, the anti-replay function is globally enabled and takes effect for each IPsec policy.",
    "CLIs": [
        "sa anti-replay enable",
        "sa anti-replay disable",
        "sa anti-replay window { <window-size> }",
        "undo sa anti-replay enable",
        "undo sa anti-replay disable",
        "undo sa anti-replay window"
    ],
    "ParentView": [
        "IPsec profile view",
        "IPsec policy template view",
        "ISAKMP IPsec policy view"
    ],
    "ParaDef": [
        {
            "Parameters": "disable",
            "Info": "Disables the anti-replay function in an IPsec policy.\n-"
        },
        {
            "Parameters": "window-size",
            "Info": "Indicates the anti-reply window size.\nIt is an integer and can take any one the following values: 32, 64, 128, 256, 512 or 1024. The default value is 1024."
        },
        {
            "Parameters": "enable",
            "Info": "Enables the anti-replay function in an IPsec policy.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipsec policy policy1 1 isakmp",
            "[*HUAWEI-ipsec-policy-isakmp-policy1-1] sa anti-replay disable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the live network is attacked by replay packets, you can enable the anti-replay function to protect the device against replay attacks. If the live network is so complex that packets reach the device in disorder, you can disable the anti-replay function to prevent packet loss. The anti-replay function is globally enabled by default. If packet loss occurs on a large number of IPSec tunnels, globally disable the anti-replay function. If packet loss occurs on a few IPSec tunnels, enable the anti-replay function in a specific IPSec policy.\nTherefore, the anti-replay function in an IPSec policy is more granular than that enabled globally.\nConfiguration Impact\nIf the anti-replay function is enabled globally and in an IPSec policy, the anti-replay function in the IPSec policy takes effect preferentially.\nWhen the anti-replay function is enabled globally and disabled in an IPSec policy, the anti-replay function does not take effect in the IPsec policy but takes effect in the other IPSec policies.When the anti-replay function is disabled globally and enabled in an IPsec policy, the anti-replay function takes effect in the IPsec policy but does not in the other IPsec policies.\nIf the anti-replay function is disabled in an IPSec policy, the anti-replay configuration configured globally also takes effect for this IPSec policy.\nIf the sa anti-replay command is run several times, the latest configuration overrides the previous one."
}