{
    "PageTitle": "esp encryption-algorithm",
    "FuncDef": "The esp encryption-algorithm command configures the encryption algorithm for Encapsulating Security Payload (ESP).\nThe undo esp encryption-algorithm command configures ESP not to encrypt protocol packets.\nBy default, AES-256 encryption algorithm is used for ESP.",
    "CLIs": [
        "esp encryption-algorithm aes",
        "esp encryption-algorithm { 3des | des | { aes | aes-gcm-128 } { 128 | 192 | 256 } }",
        "undo esp encryption-algorithm"
    ],
    "ParentView": [
        "IPsec proposal view"
    ],
    "ParaDef": [
        {
            "Parameters": "3des",
            "Info": "Indicates that ESP uses Triple Data Encryption Standard (3DES) to encrypt protocol packets.\nThe encryption algorithms 3DES have a low security, which may bring security risks. If protocols allowed, using more secure encryption algorithms, such as AES, is recommended.\n-"
        },
        {
            "Parameters": "des",
            "Info": "Indicates that ESP uses Data Encryption Standard (DES) to encrypt protocol packets.\nThe encryption algorithms DES have a low security, which may bring security risks. If protocols allowed, using more secure encryption algorithms, such as AES, is recommended.\n-"
        },
        {
            "Parameters": "aes",
            "Info": "Indicates that ESP uses AES-CBC encryption algorithm to encrypt protocol packets. There are three values for the key length, to provide security protection of different levels.\n-"
        },
        {
            "Parameters": "128",
            "Info": "Specifies the key length of 128 bits.\n-"
        },
        {
            "Parameters": "192",
            "Info": "Specifies the key length of 192 bits.\n-"
        },
        {
            "Parameters": "256",
            "Info": "Specifies the key length of 256 bits.\n-"
        },
        {
            "Parameters": "aes-gcm-128",
            "Info": "Indicates that ESP uses AES-GCM-128 encryption algorithm to encrypt protocol packets. There are three values for the key length, to provide security protection of different levels.\nOnly the VSU board supports this parameter.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipsec proposal prop1",
            "[*HUAWEI-ipsec-proposal-prop1] transform esp",
            "[*HUAWEI-ipsec-proposal-prop1] esp encryption-algorithm aes 256"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIPsec uses authentication and encryption algorithms to protect protocol packet transmission, preventing protocol packets from being intercepted or modified. Therefore, specify an encryption algorithm before using ESP to ensure security.\n3DES is more secure than DES. AES is more secure than 3DES.\nPrerequisites\nYou can configure an encryption algorithm only after ESP is used.\nPrecautions\nThe undo esp encryption-algorithm command does not restore the default encryption algorithm but configures ESP not to encrypt protocol packets.\nThe encryption algorithm and authentication algorithm cannot be both set to NULL for ESP.\nThe encryption algorithms on both IPsec peers must be identical."
}