{
    "PageTitle": "ipsec policy (profile) (tunnel interface view)",
    "FuncDef": "The ipsec policy command applies an IPSec profile on the tunnel interface.\nThe undo ipsec policy command restores the default setting.\nBy default, the IPSec profile is not applied on the tunnel interface.",
    "CLIs": [
        "ipsec policy <profile-name> service-instance-group <service-group-name>",
        "undo ipsec policy"
    ],
    "ParentView": [
        "Tunnel interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "profile-name",
            "Info": "Specifies the name of an IPSec profile applied on the interface.\nIt is a string of 1 to 15 case insensitive characters."
        },
        {
            "Parameters": "service-instance-group service-group-name",
            "Info": "Specifies the name of an IPSec service group instance.\nIt is a string of 1 to 31 case insensitive characters, which cannot include the hyphen(-)."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipsec policy profile1 profile",
            "[*HUAWEI] interface Tunnel 10",
            "[*HUAWEI-Tunnel10] tunnel-protocol ipsec",
            "[*HUAWEI-Tunnel10] ipsec policy profile1 service-instance-group test1"
        ]
    ],
    "ExtraInfo": "An IPSec profile is similar to an IPSec policy. However, different from an IPSec policy, an IPSec profile is identified by its name, and can only be configured in IKE negotiation mode. The IPSec profile does not support ACL configuration. The IPSec profile can be applied to only an IPSec tunnel interface. An IPSec profile defines IPSec proposals used to protect data flows, IKE negotiation parameters for SA setup, SA lifetime, and PFS status. After an IPSec profile is applied to an IPSec tunnel interface, only one IPSec tunnel is created. The IPSec tunnel protects all the data flows routed to the IPSec tunnel interface, simplifying IPSec policy management.\nOn a tunnel interface, only one IPSec profile can be applied. If you want to apply another security profile, you must cancel application of the current IPSec profile. An IPSec profile can only be applied on one interface."
}