{
    "PageTitle": "sa authentication-hex inbound esp",
    "FuncDef": "The sa authentication-hex command sets an authentication in hexadecimal format or cipher text for Security Associations (SAs).\nThe undo sa authentication-hex command deletes an authentication key from SAs.\nBy default, no authentication key is created.",
    "CLIs": [
        "sa authentication-hex { inbound esp [ cipher ] <auth-in-esp> }",
        "sa authentication-hex inbound esp plain <plain-auth-in-esp>",
        "undo sa authentication-hex inbound esp"
    ],
    "ParentView": [
        "IPsec SA view"
    ],
    "ParaDef": [
        {
            "Parameters": "inbound",
            "Info": "Indicates SA parameters for incoming protocol packets.\n-"
        },
        {
            "Parameters": "esp",
            "Info": "Indicates SA parameters for Encapsulating Security Payload (ESP). If the security proposal applied to an SA uses ESP, esp must be configured in the sa authentication-hex command.\n-"
        },
        {
            "Parameters": "cipher",
            "Info": "Indicates the ciphertext type.\n-"
        },
        {
            "Parameters": "auth-in-esp",
            "Info": "Specifies a ciphertext key used for authentication.\nThe value is in hexadecimal notation.If authentication algorithm SHA2-256 is used, the length of the key is 32 bytes.If authentication algorithm SHA2-384 is used, the length of the key is 48 bytes.If authentication algorithm SHA2-512 is used, the length of the key is 64 bytes\n\n\nThe corresponding cipher data ranges from 20 to 392."
        },
        {
            "Parameters": "plain plain-auth-in-esp",
            "Info": "Specifies a simple text password key used for authentication.\nThe value is in hexadecimal notation.If authentication algorithm SHA2-256 is used, the length of the key is 32 bytes.If authentication algorithm SHA2-384 is used, the length of the key is 48 bytes.If authentication algorithm SHA2-512 is used, the length of the key is 64 bytes\n\n\nThe corresponding cipher data ranges from 20 to 392."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipsec sa sa1",
            "[*HUAWEI-ipsec-sa-sa1] sa authentication-hex inbound esp abcdeF1234567891abcdeF1234567891"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAH and ESP can use either MD5, SHA-1, or SHA-2 that require an authentication key in the string or hexadecimal format. If an authentication key in the hexadecimal format is required, run the sa authentication-hex command.\nPrecautions\nSet parameters for both inbound and outbound SAs.\nSA parameters on both IPsec peers must be identical. The authentication key for incoming protocol packets on the local end must be identical with that for outgoing protocol packets on the peer end and vice versa.\nThe authentication key can be in the hexadecimal or string format. To configure an authentication key in the string format, run the sa string-key command. If multiple authentication keys are configured, the latest one takes effect. The formats of authentication keys on both IPsec peers must be identical. If an authentication key in the string format is configured on one end and an authentication key in the hexadecimal format on another end, the two ends cannot communicate.\nUpdating the key every 90 days is recommended."
}