{
    "PageTitle": "sa encryption-hex outbound esp",
    "FuncDef": "The sa encryption-hex command configures an encryption key for manual Security Association (SA) in hexadecimal format.\nThe undo sa encryption-hex command deletes an encryption key for manual SA configured in hexadecimal format.\nBy default, no encryption key is created.",
    "CLIs": [
        "sa encryption-hex { outbound esp [ cipher ] <encry-out-esp> }",
        "sa encryption-hex outbound esp plain <plain-encry-out-esp>",
        "undo sa encryption-hex outbound esp"
    ],
    "ParentView": [
        "IPsec SA view"
    ],
    "ParaDef": [
        {
            "Parameters": "outbound",
            "Info": "Specifies SA parameters for incoming protocol packets.\n-"
        },
        {
            "Parameters": "esp",
            "Info": "Specifies SA parameters for Encapsulating Security Payload (ESP) . If the security proposal applied to an SA uses ESP, esp must be configured in the sa encryption-hex command.\n-"
        },
        {
            "Parameters": "cipher",
            "Info": "Indicates the ciphertext type.\n-"
        },
        {
            "Parameters": "encry-out-esp",
            "Info": "Specifies a ciphertext key used for encryption.\nThe value is in hexadecimal notation.\nIf encryption algorithm Data Encryption Standard (DES) is used, the length of the key is 8 bytes.If encryption algorithm Triple Data Encryption Standard (3DES) is used, the length of the key is 24 bytes.If encryption algorithm Advanced Encryption Standard 128 (AES-128) is used, the length of the key is 16 bytes.If encryption algorithm Advanced Encryption Standard 192 (AES-192) is used, the length of the key is 24 bytes.If encryption algorithm Advanced Encryption Standard 256 (AES-256) is used, the length of the key is 32 bytes.\nThe corresponding cipher data ranges from 20 to 432.\nThe encryption algorithms DES/3DES have a low security, which may bring security risks. If protocols allowed, using more secure encryption algorithms, such as AES, is recommended."
        },
        {
            "Parameters": "plain plain-encry-out-esp",
            "Info": "Specifies a simple text password key used for encryption.\nThe value is in hexadecimal notation.\nIf encryption algorithm Data Encryption Standard (DES) is used, the length of the key is 8 bytes.If encryption algorithm Triple Data Encryption Standard (3DES) is used, the length of the key is 24 bytes."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipsec sa sa1",
            "[*HUAWEI-ipsec-sa-sa1] sa encryption-hex outbound esp abcdABCD1357abcdABCD1357abcdABCD1357abcdABCD1357abcdABCD1357abcd"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nESP security protocol support encryption of IP protocol packets. The algorithm used for encryption/decryption is either DES, 3DES or AES. These algorithms need a key either in hexadecimal format to operate. The hexadecimal key to be used for encryption is configured using the sa encryption-hex command.\nIf sa encryption-hex command is configured, then the encryption key configured using sa string-key command is deleted automatically.\nUpdating the key every 90 days is recommended."
}