{
    "PageTitle": "ipv6-filter",
    "FuncDef": "This command enables lawful interception (LI) of packets that match specific entries in an existing IPv6 filter.",
    "CLIs": [
        "ipv6-filter <ipv6-filter-id> entry <entry-id> [ <entry-id> ] [ intercept-id <intercept-id> [ intercept-id ] ] [ session-id <session-id> [ session-id ] ]",
        "no ipv6-filter <ipv6-filter-id> [ entry <entry-id> [ <entry-id> ] ]"
    ],
    "ParentView": [
        "config>li>li-source"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv6-filter-id",
            "Info": "Specifies the IPv6 filter ID whose entries are to be intercepted. If the ipv6-filter-id does not exist, an error will occur and the command will not execute. Intercepting packets will commence when the ipv6-filter-id is defined on a SAP or IPv6 interface."
        },
        {
            "Parameters": "entry-id",
            "Info": "Specifies the IPv6 filter entries to use as match criteria for lawful intercept (LI). The entry keyword begins a list of entry-id s for interception. Multiple entry-id entries can be specified with a single command. Each entry-id must be separated by a space. Up to <N><n> 8 entry IDs may be specified in a single command."
        },
        {
            "Parameters": "intercept-id",
            "Info": "Specifies the intercept ID that is inserted into the packet header for all mirrored packets of the associated li-source entry.   This intercept ID can be used (for example by a downstream LI Gateway) to identify the particular LI session to which the packet belongs. For all types of li-source entries (filter, nat, sap, subscriber), when the mirror service is configured with ip-udp-shim routable encap, an intercept-id field (as part of the routable encap) is always present in the mirrored packets. If there is no intercept ID configured for an li-source entry, then the default value will be inserted. When the mirror service is configured with ip-gre routable encapsulation, no intercept-id is inserted and none should be specified against the li-source entries. Values-1 to 4294967295 (32b) For nat li-source entries that are using a mirror service that is not configured with routable encap."
        },
        {
            "Parameters": "session-id",
            "Info": "Specifies the session-id that is inserted into the packet header for all mirrored packets of the associated li-source entry.   This session-id can be used (for example by a downstream LI Gateway) to identify the particular LI session to which the packet belongs. The session-id is only valid and used for mirror services that are configured with ip-udp-shim routable encap (config>mirror>mirror-dest>encap#ip-udp-shim). For all types of li-source entries (filter, nat, sap, subscriber), when the mirror service is configured with ip-udp-shim routable encapsulation, a session-id field (as part of the routable encapsulation) is always present in the mirrored packets.   If there is no session-id configured for an li-source entry,\nthen the default value will be inserted. When a mirror service is configured with ip-gre routable encap, no session-id is inserted and none should be specified against the li-source entries."
        },
        {
            "Parameters": "id",
            "Info": "Specifies the session-id value to insert into the header of the mirrored packets. Values-1 to 4,294,967,295 (32b)."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}