{
    "PageTitle": "li-ipv6-filter",
    "FuncDef": "This command enables lawful interception (LI) of packets that match specific entries in an existing LI IPv6 filter that has been associated with a normal IPv6 filter. The specification of an li-ipv6-filter entry as an li-source means that packets matching the li-ipv6-filter entry will be intercepted on all interfaces/saps/and so on, where the associated normal ip-filter(s) are applied.",
    "CLIs": [
        "li-ipv6-filter <filter-name> entry <li-entry-id> [ <li-entry-id> ] [ intercept-id <intercept-id> [ intercept-id ] ] [ session-id <session-id> [ session-id ] ]",
        "no li-ipv6-filter <filter-name> [ entry <li-entry-id> [ <li-entry-id> ] ]"
    ],
    "ParentView": [
        "config>li>li-source"
    ],
    "ParaDef": [
        {
            "Parameters": "filter-name",
            "Info": "Specifies the name of the li-ipv6-filter up to 32 characters."
        },
        {
            "Parameters": "li-entry-id",
            "Info": "Specifies the entry ID in the li-ipv6-filter that is to be used as an LI source criteria. Values-1 to 65535."
        },
        {
            "Parameters": "intercept-id",
            "Info": "Specifies the intercept ID that is inserted into the packet header for all mirrored packets of the associated li-source entry. This intercept-id can be used (for example by a downstream LI gateway) to identify the particular LI session to which the packet belongs. For all types of li-source entries (filter, nat, sap, or subscriber), when the mirror service is configured with ip-udp-shim routable encap, an intercept-id field (as part of the routable encapsulation) is always present in the mirrored packets. If there is no intercept-id configured for an li-source entry, then the default value will be inserted. When the mirror service is configured with IP GRE routable encap, no intercept ID is inserted and none should be specified against the LI source entries."
        },
        {
            "Parameters": "session-id",
            "Info": "Specifies the session ID that is inserted into the packet header for all mirrored packets of the associated li-source entry. This session-id can be used (for example, by a downstream LI gateway) to identify the particular LI session to which the packet belongs. The session-id is only valid and used for mirror services that are configured with ip-udp-shim routable encap (config>mirror>mirror-dest>encap>ip-udp-shim). For all types of li-source entries (filter, nat, sap, subscriber), when the mirror service is configured with ip-udp-shim routable encap, a session-id field (as part of the routable encap) is always present in the mirrored packets. If there is no session ID configured for an li-source entry, then the default value is inserted. When a mirror service is configured with IP GRE routable encap, no session ID is inserted and none should\nbe specified against the li-source entries."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}