{
    "PageTitle": "mac-filter",
    "FuncDef": "This command enables lawful interception (LI) of packets that match specific entries in an existing MAC filter. Multiple entries can be created using unique entry-id numbers within the filter. The router implementation exits the filter on the first match found and executes the actions in accordance with the accompanying action command. For this reason, entries must be sequenced correctly from most to least explicit.",
    "CLIs": [
        "mac-filter <mac-filter-id> entry <entry-id> [ <entry-id> ] [ intercept-id <intercept-id> [ intercept-id ] ] [ session-id [ session-id ] [ [ session-id ] ] ]",
        "no mac-filter <mac-filter-id>"
    ],
    "ParentView": [
        "config>li>li-source"
    ],
    "ParaDef": [
        {
            "Parameters": "mac-filter-id",
            "Info": "Specifies the MAC filter ID. If the mac-filter-id does not exist, an error will occur and the command will not execute."
        },
        {
            "Parameters": "entry-id",
            "Info": "The MAC filter entries to use as match criteria."
        },
        {
            "Parameters": "intercept-id",
            "Info": "Specifies the intercept-id that is inserted into the packet header for all mirrored packets of the associated li-source entry.   This intercept-id can be used (for example by a downstream LI gateway) to identify the particular LI session to which the packet belongs. For all types of li-source entries (filter, nat, sap, subscriber), when the mirror service is configured with ip-udp-shim routable encap, an intercept-id field (as part of the routable encap) is always present in the mirrored packets.   If there is no intercept-id configured for an li-source entry, then the default value will be inserted. When the mirror service is configured with ip-gre routable encap, no intercept-id is inserted and none should be specified against the li-source entries. Values-1 to 4294967295 (32b) - For nat li-source entries that are using a mirror service that is not configured with routable encapsulation."
        },
        {
            "Parameters": "session-id",
            "Info": "Specifies the session-id that is inserted into the packet header for all mirrored packets of the associated li-source entry. This session-id can be used (for example by a downstream LI gateway) to identify the particular LI session to which the packet belongs. The session-id is only valid and used for mirror services that are configured with ip-udp-shim routable encap (config>mirror>mirror-dest>encap>ip-udp-shim). For all types of li-source entries (filter, nat, sap, or subscriber), when the mirror service is configured with ip-udp-shim routable encap, a session-id field (as part of the routable encap) is always present in the mirrored packets.   If there is no session-id configured for an li-source entry, then the default value\nwill be inserted. When a mirror service is configured with ip-gre routable encap, no session-id is inserted and none should be specified against the li-source entries. Values-1 to 4,294,967,295 (32b)."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}