{
    "PageTitle": "subscriber",
    "FuncDef": "This command adds hosts of a subscriber to mirroring service.",
    "CLIs": [
        "subscriber <sub-ident-string> [ sap <sap-id> [ ip <ip-address> ] [ mac <ieee-address> ] | sla-profile <sla-profile-name> ] [ fc { [ be ] [ l2 ] [ af ] [ l1 ] [ h2 ] [ ef ] [ h1 ] [ nc ] } ] { [ ingress ] [ egress ] } [ intercept-id <intercept-id> ] [ session-id <session-id> ] [ host-type <host-type> ] [ family <ip-family> ]",
        "no subscriber <sub-ident-string>"
    ],
    "ParentView": [
        "config>li>li-source"
    ],
    "ParaDef": [
        {
            "Parameters": "sub-ident-string",
            "Info": "Specifies the name of the subscriber identification policy."
        },
        {
            "Parameters": "sap-id",
            "Info": "Specifies the physical port identifier portion of the SAP definition."
        },
        {
            "Parameters": "ip-address",
            "Info": "Specifies the service IP address (system IP address) of the remote device sending LI traffic. If 0.0.0.0 is specified, any remote router is allowed to send to this service. Values-1.0.0.1 to 223.255.255.254."
        },
        {
            "Parameters": "mac-address",
            "Info": "Specifies a MAC address when defining a static host. The MAC address must be specified for anti-spoof ip-mac and arp-populate. Multiple static hosts may be configured with the same MAC address given that each definition is distinguished by a unique IP address."
        },
        {
            "Parameters": "sla-profile-name",
            "Info": "Specifies an SLA profile name, up to 32 characters. Each host of a subscriber can use a different sla-profile. This option allows interception of only the hosts using the specified sla-profile. In some deployments sla-profiles are assigned per type of traffic. There can be, for example, a specific sla-profile for voice traffic (which could be used for all SIP-hosts)."
        },
        {
            "Parameters": "fc",
            "Info": "The name of the forwarding class with which to associate LI traffic. The forwarding class name must already be defined within the system. If the fc-name does not exist, an error will be returned and the fc command will have no effect. If the fc-name does exist, the forwarding class associated with fc-name will override the default forwarding class. Values-be, l2, af, l1, h2, ef, h1, nc."
        },
        {
            "Parameters": "ingress",
            "Info": "Specifies information for the ingress policy."
        },
        {
            "Parameters": "egress",
            "Info": "Specifies information for the egress policy."
        },
        {
            "Parameters": "intercept-id",
            "Info": "Specifies the intercept-id that is inserted into the packet header for all mirrored packets of the associated li-source entry.   This intercept-id can be used (for example by a downstream LI Gateway) to identify the particular LI session to which the packet belongs. Values-1 to 4294967295 (32b) For nat li-source entries that are using a mirror service that is not configured with routable encap."
        },
        {
            "Parameters": "session-id session-id",
            "Info": "This command configures the session-id that is inserted into the packet header for all mirrored packets of the associated li-source entry.   This session-id can be used (for example by a downstream LI gateway) to identify the particular LI session to which the packet belongs. The session-id is only valid and used for mirror services that are configured with ip-udp-shim routable encapsulation (config>mirror>mirror-dest>encap>ip-udp-shim). Values-1 to 4,294,967,295 (32b)."
        },
        {
            "Parameters": "host-type",
            "Info": "Specifies the host type for lawful intercept. The anti-spoof filter on the SAP must be configured as ip-mac. Values-any, ipoe, ppp."
        },
        {
            "Parameters": "ip-family",
            "Info": "Specifies the IP family for lawful intercept. The anti-spoof filter on the SAP must be configured as ip-mac. Values-any, ipv4, ipv6."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}