{
    "PageTitle": "subscriber",
    "FuncDef": "This command adds hosts of a subscriber to mirroring service.",
    "CLIs": [
        "subscriber <sub-ident-string> [ sap <sap-id> [ ip <ip-address> ] [ mac <ieee-address> ] | sla-profile <sla-profile-name> ] [ fc { [ be ] [ l2 ] [ af ] [ l1 ] [ h2 ] [ ef ] [ h1 ] [ nc ] } ] { [ ingress ] [ egress ] } [ host-type <host-type> ] [ family <ip-family> ]",
        "no subscriber <sub-ident-string>"
    ],
    "ParentView": [
        "config>mirror>mirror-source"
    ],
    "ParaDef": [
        {
            "Parameters": "sub-ident-string",
            "Info": "Specifies the name of the subscriber identification policy."
        },
        {
            "Parameters": "sap-id",
            "Info": "Specifies the physical port identifier portion of the SAP definition."
        },
        {
            "Parameters": "ip-address",
            "Info": "Specifies the service IP address (system IP address) of the remote device sending LI traffic. If 0.0.0.0 is specified, any remote router is allowed to send to this service. Values-1.0.0.1 to 223.255.255.254."
        },
        {
            "Parameters": "mac-address",
            "Info": "Specify this optional parameter when defining a static host. The MAC address must be specified for anti-spoof ip-mac and arp-populate. Multiple static hosts may be configured with the same MAC address given that each definition is distinguished by a unique IP address."
        },
        {
            "Parameters": "sla-profile-name",
            "Info": "Each host of a subscriber can use a different sla-profile. This option allows interception of only the hosts using the specified sla-profile. In some deployments sla-profiles are assigned per type of traffic. There can be, for example, a specific sla-profile for voice traffic (which could be used for all SIP-hosts). The name can have up to 32 characters."
        },
        {
            "Parameters": "fc",
            "Info": "Specifies the name of the forwarding class with which to associate traffic. The forwarding class name must already be defined within the system. If the fc-name does not exist, an error will be returned and the fc command will have no effect. If the fc-name does exist, the forwarding class associated with fc-name will override the default forwarding class. Values-be, l2, af, l1, h2, ef, h1, nc."
        },
        {
            "Parameters": "ingress",
            "Info": "Specifies information for the ingress policy."
        },
        {
            "Parameters": "egress",
            "Info": "Specifies information for the egress policy."
        },
        {
            "Parameters": "host-type",
            "Info": "Specifies the host type for mirroring. The anti-spoof filter on the SAP must be configured as ip-mac. Values-any, ipoe, ppp."
        },
        {
            "Parameters": "ip-family",
            "Info": "Specifies the IP family for mirroring. The anti-spoof filter on the SAP must be configured as ip-mac. Values-any, ipv4, ipv6."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}