{
    "PageTitle": "allow-address-change",
    "FuncDef": "The allow-address-change command configures the device to use the changed source IP address of packets replied by the LNS as the destination IP address of packets to be sent during tunnel establishment or hello detection process.\nThe undo allow-address-change command restores the default configuration.\nBy default, the device does not respond to the LNS's source IP address change during tunnel establishment or hello detection process.",
    "CLIs": [
        "allow-address-change { setup-only | always }",
        "undo allow-address-change [ setup-only | always ]"
    ],
    "ParentView": [
        "L2TP group view"
    ],
    "ParaDef": [
        {
            "Parameters": "setup-only",
            "Info": "Uses the changed source IP address of SCCRP packets replied by the LNS as the destination IP address of packets for subsequent tunnel negotiation.\n-"
        },
        {
            "Parameters": "always",
            "Info": "Uses the changed source IP address of SCCRP, Hello, or ZLB packets replied by the LNS as the destination IP address of packets for subsequent tunnel negotiation or detection.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] l2tp-group lac1",
            "[~HUAWEI-l2tp-lac1] allow-address-change setup-only"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen the device functions as an LAC to communicate with an LNS of another vendor, if source IP addresses of packets sent from the LNS always change, and the destination IP address of packets sent from the LAC is different from that configured on the LNS, tunnel establishment fails. To prevent this problem, run the allow-address-change command.\nIf the source IP addresses change on the LNS only in tunnel establishment phase, run the allow-address-change setup-only command in the L2TP group view of the device.\nIf the source IP addresses change on the LNS in both the tunnel establishment and hello detection phases, run the allow-address-change always command in the L2TP group view of the device.\nConfiguration Impact\nAfter the allow-address-change command is run, the device uses the source IP address of packets replied by the LNS as the destination IP address of packets to be sent for tunnel negotiation and detection.\nIn the display l2tp tunnel command output, the Remote Address field indicates the LNS IP address configured in the L2TP group or delivered by the RADIUS server; the Lns-reply Address field indicates the source IP address of SCCRP packets replied by the LNS."
}