{
    "PageTitle": "bind source",
    "FuncDef": "The bind source command binds an interface to an LNS group.\nThe undo bind source command unbinds an interface from an LNS group.\nBy default, no interface is bound to an LNS group.",
    "CLIs": [
        "bind source { <interface-type> <interface-num> | <interface-name> }",
        "undo bind source [ <interface-type> <interface-num> | <interface-name> ]"
    ],
    "ParentView": [
        "LNS group view"
    ],
    "ParaDef": [
        {
            "Parameters": "interface-type",
            "Info": "Specifies the type of an interface bound to an LNS group.\n-"
        },
        {
            "Parameters": "interface-num",
            "Info": "Specifies the number of an interface bound to an LNS group.\n-"
        },
        {
            "Parameters": "interface-name",
            "Info": "Specifies the name of an interface bound to an LNS group.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface loopback 0",
            "[~HUAWEI-LoopBack0] commit",
            "[~HUAWEI-LoopBack0] quit",
            "[~HUAWEI] lns-group backgroup",
            "[*HUAWEI-lns-group-backgroup] bind source loopback 0"
        ]
    ],
    "ExtraInfo": "To bind an interface to an LNS group, run the bind source command. Each LNS group uses the IP address of a bound interface as the source address to communicate with a LAC. The device can determine the LNS group for processing an SCCRQ message from a LAC based on this address.\nTo bind an LNS group to multiple source addresses, bind the LNS group to multiple interfaces.\nAn interface bound to an LNS group sends a received SCCRQ message to the corresponding tunnel board for processing only if the destination address of the message is the IP address of the interface.\nAfter an interface is bound to an LNS group, the interface cannot be used for other purposes, for example, configured as an RBS source interface or LAC source interface. Likewise, an interface already used for other purposes (for example, configured as an RBS source interface or LAC source interface) cannot be bound to an LNS group."
}