{
    "PageTitle": "calling-number-avp cevlan-offset",
    "FuncDef": "The calling-number-avp cevlan-offset command configures an LAC to add an offset to the CE-VLAN ID (inner VLAN ID) of ICRQ packets to be sent.\nThe undo calling-number-avp cevlan-offset command restores the default configuration.\nBy default, no offset is added to the CE-VLAN ID of ICRQ packets.",
    "CLIs": [
        "calling-number-avp cevlan-offset <offset-value>",
        "undo calling-number-avp cevlan-offset"
    ],
    "ParentView": [
        "BAS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "offset-value",
            "Info": "Specifies an offset for the CE-VLAN ID.\nThe value is an integer ranging from 1 to 4094."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] l2tp-group test",
            "[*HUAWEI-I2tp-group test] calling-number-avp format include cevlan",
            "[*HUAWEI-I2tp-group test] commit",
            "[~HUAWEI-I2tp-group test] quit",
            "[~HUAWEI] interface GigabitEthernet 1/0/0.5",
            "[*HUAWEI-GigabitEthernet1/0/0.5] commit",
            "[*HUAWEI-GigabitEthernet1/0/0.5] bas",
            "[*HUAWEI-GigabitEthernet1/0/0.5-bas] calling-number-avp cevlan-offset 20"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf packets sent from different DSLAMs have the same CE-VLAN ID, and the CE-VLAN ID must be identified in the ICRQ packets to be sent by the LAC, run the calling-number-avp cevlan-offset command to configure an offset for the CE-VLAN ID.\nPrerequisites\nThe calling-number-avp cevlan-offset command takes effect only after the CE-VLAN ID to be encapsulated in ICRQ packets has been specified in the calling-number-avp format include cevlan command.\nConfiguration Impact\nAfter this command is run, the LAC adds an offset to the CE-VLAN ID and then encapsulates the CE-VLAN ID to the ICRQ packets. For example, if the CE-VLAN ID of user access packets is 30, and the calling-number-avp cevlan-offset 20 command is run, the CE-VLAN ID of 50 is encapsulated in the ICRQ packets.\nIf a VLAN ID is greater than 4094 after an offset is added, the offset is not added for the CE-VLAN ID in ICRQ packets."
}