{
    "PageTitle": "l2tp-authorize",
    "FuncDef": "The l2tp-authorize command configures domain name-based authorization for L2TP users.\nThe undo l2tp-authorize command cancels domain name-based authorization for L2TP users.\nBy default, L2TP users do not adopt domain name-based authorization.",
    "CLIs": [
        "l2tp-authorize password { simple <simple-password> | cipher <ciper-password> }",
        "undo l2tp-authorize"
    ],
    "ParentView": [
        "AAA domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "simple simple-password",
            "Info": "Specifies a simple password.\nWhen configuring an authentication password, select the ciphertext mode. For security purposes, use an eight-character or longer password that contains at least two types of the following: uppercase letters, lowercase letters, digits, and special characters. You are advised to configure your password in ciphertext mode and change it periodically.\nThe value is a string of 1 to 16 case-sensitive characters."
        },
        {
            "Parameters": "cipher ciper-password",
            "Info": "Specifies a password in ciphertext.\nThe value is a string of 1 to 128 case-sensitive characters if non-encrypted characters are entered."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[*HUAWEI] l2tp-group lac1",
            "[*HUAWEI-l2tp-lac1] commit",
            "[*HUAWEI-l2tp-lac1] quit",
            "[~HUAWEI] aaa",
            "[*HUAWEI-aaa] domain huawei",
            "[*HUAWEI-aaa-domain-huawei] l2tp-group lac1",
            "[*HUAWEI-aaa-domain-huawei] l2tp-authorize password cipher Root@123"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter the l2tp-authorize command is run, the domain name, rather than each user name and password, is used to authorize L2TP users. This faciliates implementing batch services.\nThe l2tp-authorize command is a case-sensitive string without such metacharacters as spaces and question marks that can be in ciphertext or simple text. The simple password is a character string of 1 to 16 characters, for example, 1234567. The cipher password displayed as 1 to 128 characters.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}