{
    "PageTitle": "mandatory-lcp",
    "FuncDef": "The mandatory-lcp command conducts the mandatory LCP protocol renegotiation of the LNS and the Client.\nThe undo mandatory-lcp command deletes the renegotiation.\nBy default, the renegotiation is not conducted.",
    "CLIs": [
        "mandatory-lcp [ on-mismatch ]",
        "mandatory-lcp on-mismatch strict",
        "undo mandatory-lcp [ on-mismatch ]",
        "undo mandatory-lcp on-mismatch strict"
    ],
    "ParentView": [
        "L2TP group view"
    ],
    "ParaDef": [
        {
            "Parameters": "on-mismatch",
            "Info": "Indicates the renegotiation performed when a user LCP parameter on the LNS is inconsistent with that on the LTS or on the LAC, excluding the MRU and authentication type. If a user LCP parameter on the LNS is consistent with that on the LTS or on the LAC, proxy authentication, instead of LCP renegotiation is performed.\n-"
        },
        {
            "Parameters": "strict",
            "Info": "Indicates the renegotiation performed when a user LCP parameter on the LNS is inconsistent with that on the LTS or on the LAC, including the MRU and authentication type,MRU inconsistency will trigger renegotiation only when LNS MRU is less than LAC MRU.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] l2tp-group huawei",
            "[*HUAWEI-l2tp-huawei] mandatory-lcp"
        ]
    ],
    "ExtraInfo": "The mandatory-lcp command enables the LCP renegotiation between the LNS and the client regardless of agent authentication information of the NAS. If some PPP clients do not support the LCP renegotiation, the LCP renegotiation fails. A NAS-initialized VPN client, before a PPP session begins, performs PPP negotiation with the NAS. After the negotiation succeeds, the NAS initializes the tunnel connection and sends the negotiation information to the LNS. According to received information, the LNS judges whether the client is valid or not."
}