{
    "PageTitle": "reset l2tp tunnel",
    "FuncDef": "The reset l2tp tunnel command disconnects the L2TP tunnel and all sessions on this tunnel.",
    "CLIs": [
        "reset l2tp tunnel lac { tunnel-name <remote-name> | tunnel-item <tunnel-item> } [ session <session-id> ]",
        "reset l2tp tunnel lns slot <slot-id> { tunnel-name <remote-name> | tunnel-item <tunnel-item> }"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "tunnel-name remote-name",
            "Info": "Resets L2TP connection of a specified remote name.\nIt is a string of 1 to 253 characters."
        },
        {
            "Parameters": "tunnel-item tunnel-item",
            "Info": "Resets the L2TP tunnel connection with the specified tunnel ID.\nThe value of local ID for L2TP tunnel ranges from 1 to 65535."
        },
        {
            "Parameters": "session session-id",
            "Info": "Specifies the ID of a session to be torn down.\nThe value is an integer ranging from 1 to 65535."
        },
        {
            "Parameters": "lns",
            "Info": "Resets L2TP tunnel connection of LNS.\nThe value of local ID for L2TP tunnel ranges from 1 to 65535."
        },
        {
            "Parameters": "slot slot-id",
            "Info": "Resets the L2TP tunnel on the specified tunnel board.\n-"
        },
        {
            "Parameters": "lac",
            "Info": "Resets L2TP tunnel connection of LAC.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset l2tp tunnel lac tunnel-name AS8010"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen the user on the peer end initiates a call again, the tunnel can be re-established. You can disconnect the tunnel by specifying name of the peer end of the tunnel. When a remote user calls in again, the tunnel can be reestablished.\nIf no tunnel is matched, the command does not affect any tunnel. If multiple matching tunnels exist (with the same name but different IP addresses), all of them are disconnected.\nThe session parameter specifies a session to be torn down. After the test l2tp-tunnel command is run to test tunnels and sessions, the reset l2tp tunnel command can be run to tear down the tunnels and sessions.\nYou can delete the L2TP tunnel with a specified IP address, regardless of whether the IP address belongs to a public network or VPN.\nPrerequisites\nOnly after the tunnel-name has been established, the reset l2tp tunnel command can be run to tear down it.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}