{
    "PageTitle": "reset l2tp tunnel lac remote-address",
    "FuncDef": "The reset l2tp tunnel lac remote-address command disconnects the L2TP tunnel and all sessions on this tunnel.",
    "CLIs": [
        "reset l2tp tunnel lac remote-address <ip-address> [ l2tp-group <group-name> ]"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "l2tp-group group-name",
            "Info": "Resets the L2TP tunnel with a specified L2TP group.\nThe value is a string of 1 to 32 characters."
        },
        {
            "Parameters": "remote-address ip-address",
            "Info": "Resets the L2TP tunnel with a specified remote IP address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "lac",
            "Info": "Resets L2TP tunnel connection of LAC.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset l2tp tunnel lac remote-address 2.2.2.2 l2tp-group huawei"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen the user on the peer end initiates a call again, the tunnel can be re-established. You can disconnect the tunnel by specifying name of the peer end of the tunnel. When a remote user calls in again, the tunnel can be reestablished.\nIf no tunnel is matched, the command does not affect any tunnel. If multiple matching tunnels exist (with the same name but different IP addresses), all of them are disconnected. If you specify the parameter , only the matched tunnel is disconnected.\nTo delete the L2TP tunnel with a specified remote IP address, specify the remote-address [ l2tp-group ] parameter in the reset l2tp tunnel command.\nYou can delete the L2TP tunnel with a specified IP address, regardless of whether the IP address belongs to a public network or VPN.\nPrerequisites\nOnly after the tunnel-name has been established, the reset l2tp tunnel command can be run to tear down it.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}