{
    "PageTitle": "tunnel load-sharing",
    "FuncDef": "The tunnel load-sharing command enables load balancing.\nThe undo tunnel load-sharing command disables load balancing.\nBy default, load balancing is disabled.",
    "CLIs": [
        "tunnel load-sharing",
        "undo tunnel load-sharing"
    ],
    "ParentView": [
        "L2TP group view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] l2tp-group huawei",
            "[*HUAWEI-l2tp-huawei] tunnel load-sharing"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen the device functions as an LAC to connect to multiple LNSs, the device by default attempts to establish a connection with each LNS in the order in which the LNSs are configured, until an LNS responds to the connection request and a tunnel is established. The other LNSs then function as the backup LNSs.\nIf an LNS cannot load all the L2TP service, you can allocate the service to multiple LNSs based on weight using the LNS load balancing.\nPrecautions\nLoad balancing can be implemented for tunnels in an L2TP group based on the master/backup status, weight, or priority. If tunnels have been configured in an L2TP group, the load balancing configurations cannot be changed.\nThe tunnel load-sharing and tunnel-per-user commands are mutually exclusive.\nThe tunnel load-sharing and tunnel priority commands are mutually exclusive.\nTo implement load balancing based on tunnel attributes delivered by a RADIUS server, you are advised to choose one of the following deployment modes:\nRun the tunnel priority command in the L2TP group view to enable priority-based load balancing. Configure the RADIUS server to deliver multiple tag groups with the same Tunnel-Preference value. Configure only one Tunnel-Server-Endpoint value for each tag group.Run the tunnel load-sharing command in the L2TP group view to enable load balancing. Configure the RADIUS server to deliver one or more tag groups. Configure multiple Tunnel-Server-Endpoint values for each tag group. If multiple tag groups are delivered by the RADIUS server, load balancing is implemented based on the Tunnel-Server-Endpoint values of the first tag group."
}