{
    "PageTitle": "tunnel name",
    "FuncDef": "The tunnel name command specifies the local name of a tunnel.\nThe undo tunnel name command restores the default tunnel name.\nBy default, the local name of a tunnel is the device name.",
    "CLIs": [
        "tunnel name <tunnel-name> [ lns-ip <lns-ip> ]",
        "undo tunnel name [ lns-ip <lns-ip> ]"
    ],
    "ParentView": [
        "L2TP group view"
    ],
    "ParaDef": [
        {
            "Parameters": "tunnel-name",
            "Info": "Specifies the name of the local end of a tunnel.\nThe name is a character string of 1 to 253 characters."
        },
        {
            "Parameters": "lns-ip lns-ip",
            "Info": "Specifies the IP address of an LNS.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] l2tp-group 1",
            "[*HUAWEI-l2tp-1] tunnel name itsme"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn creating an L2TP group, the local name of a tunnel is initiated to the device name.\nThe tunnel name command specifies other names as the local name.\nTo configure a tunnel name based on a specified LNS IP address, specify the lns-ip parameter.\nThe tunnel name is used when the LAC and LNS negotiate tunnel parameters. Different tunnel authentication modes have different requirements for the tunnel name.\nIn local tunnel authentication mode, the LAC and LNS do not require the tunnel name. Only the tunnel password is used. The LNS selects an L2TP group to respond to the connection request of the LAC according to the tunnel name. Ensure that the tunnel name configured on the LAC is the same as the peer tunnel name configured on the LNS. You do not need to configure the local tunnel name on the LNS.In AAA authentication mode, the LAC and LNS consider the L2TP tunnel as a user, so the tunnel name must be in the format of username.\n\nPrecautions\nThe tunnel name command specifies other names as the local name."
}