{
    "PageTitle": "tunnel priority",
    "FuncDef": "The tunnel priority command configures priority-based load balancing for tunnels.\nThe undo tunnel priority command deletes the priority-based load balancing configuration.\nBy default, tunnels use the master/backup load balancing mode.",
    "CLIs": [
        "tunnel priority",
        "undo tunnel priority"
    ],
    "ParentView": [
        "L2TP group view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] l2tp-group group1",
            "[*HUAWEI-l2tp-group1] tunnel priority"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen the device functions as an LAC to connect to multiple LNSs, the device by default attempts to establish a connection with each LNS in the order in which the LNSs are configured, until an LNS responds to the connection request and a tunnel is established. The other LNSs then function as the backup LNSs. If you want multiple LNSs to load-balance traffic based on priorities, run the tunnel priority command.\nThe device preferentially establishes tunnels based on the LNS IP carried in the RADIUS No. 67 attribute (Tunnel-Server-Endpoint) and the priority delivered in the RADIUS No. 83 attribute (Tunnel-Preference). If the RADIUS attributes are not delivered, the device establishes tunnels based on the locally configured LNS IP and priority.\nConfiguration Impact\nAfter the tunnel priority command is run, the following situations are available:\nThe device establishes a tunnel with the LNS with the highest priority. If the LNS with the highest priority is unavailable, the device selects an LNS based on the LNS priorities in descending order.\nIf multiple LNSs have the same priority, the device establishes tunnels with the LNSs, and load balancing is implemented between these tunnels.\nPrecautions\nLoad balancing can be implemented for tunnels in an L2TP group based on the master/backup status, weight, or priority. If tunnels have been established in an L2TP group, the load balancing configurations cannot be changed.\nThe tunnel priority and tunnel-per-user commands are mutually exclusive.\nThe tunnel priority and tunnel load-sharing commands are mutually exclusive."
}