{
    "PageTitle": "tunnel password",
    "FuncDef": "The tunnel password command specifies a password for tunnel authentication.\nThe undo tunnel password command deletes the password.\nBy default, tunnel authentication is enabled, and no password is used.",
    "CLIs": [
        "tunnel password [ lns-ip <lns-ip-address> ] { simple password | cipher <cipher-password> }",
        "undo tunnel password",
        "undo tunnel password lns-ip <lns-ip-address>"
    ],
    "ParentView": [
        "L2TP group view"
    ],
    "ParaDef": [
        {
            "Parameters": "lns-ip lns-ip-address",
            "Info": "Specifies the IP address of an LNS.\n-"
        },
        {
            "Parameters": "simple password",
            "Info": "Specifies a password in simple text.\nWhen configuring an authentication password, select the ciphertext mode because the password is saved in configuration files in plaintext if you select simple mode, which has a high risk. To ensure device security, change the password periodically.\n-"
        },
        {
            "Parameters": "cipher cipher-password",
            "Info": "Specifies a password in ciphertext.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] l2tp-group 1",
            "[*HUAWEI-l2tp-1] tunnel password cipher Root@123"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nFor the sake of security, it is recommended to enable the tunnel authentication.When configuring an authentication password, select the ciphertext mode because the password is saved in configuration files in simple text if you select simple text mode, which has a high risk. To ensure device security, change the password periodically.\nIf the tunnel authentication is enabled on LAC side or LNS side, the other end must also be enabled with authentication.\nTo configure a tunnel password based on a specified LNS IP addresses, specify the lns-ip parameter.\nPrecautions\nWhen you configure a tunnel password based on an LNS IP address, the LNS IP address must be that configured using the start l2tp ip ip-address command. Otherwise, the configuration does not take effect."
}