{
    "PageTitle": "peer enable (BGP IPv6 SR-Policy address family view) (IPv6)",
    "FuncDef": "The peer enable command enables a BGP device to exchange routes with a specified peer in the address family view.\nThe undo peer enable command disables a BGP device from exchanging routes with a specified peer.\nBy default, only the peer in the BGP IPv4 unicast address family view is automatically enabled.",
    "CLIs": [
        "peer <ipv6-address> enable",
        "undo peer <ipv6-address> enable"
    ],
    "ParentView": [
        "BGP IPv6 SR-Policy address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv6-address",
            "Info": "IPv6 peer address.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 2001:DB8:1::1 as-number 200",
            "[*HUAWEI-bgp] ipv6-family sr-policy",
            "[*HUAWEI-bgp-af-ipv6-srpolicy] peer 2001:DB8:1::1 enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, only peers in the BGP IPv4 unicast address family are automatically enabled. After the peer as-number command is used in the BGP view, the system automatically runs the peer enable command to enable a peer. In other address family view, however, a peer must be enabled manually.\nAfter the undo default ipv4-unicast command is run, the peer enable command needs to be run in the BGP view or the BGP-IPv4 unicast address family view to enable the IPv4 unicast address family for the created BGP peer.\nConfiguration Impact\nEnabling or disabling a BGP peer in an address family, for example, running the peer enable command or the undo peer enable command in a VPNv4 address family, causes teardown and re-establishment of the BGP connection of the peer in other address families.\nPrecautions\nTo configure a 6PE device to send labeled routes, specify an IPv4 unicast address for the peer of the device in the IPv6 unicast address family view.\nTo run the command in the BGP VPN instance IPv4 address family view or BGP VPN instance IPv6 address family view, ensure that the related BGP peers and BGP peer groups have been configured in the BGP VPN instance.\nIf the peer enable command is run for a peer in the BGP public address family view when the peer has established peer relationships with other peers in other address families, these peer relationships will be disconnected and reestablished, which may cause route flapping. Therefore, exercise caution when running this command."
}