{
    "PageTitle": "8021p-outbound",
    "FuncDef": "The 8021p-outbound command converts the internal CoSs and colors of the downstream VLAN packets in the current DS domain into the 802.1p values.\nThe undo 8021p-outbound command restores the default mappings from CoSs and colors to 802.1p values.\nBy default, the mappings between internal CoSs and colors to 802.1p values are displayed as Table 1.",
    "CLIs": [
        "8021p-outbound <service-class> <color> map <8021p-value>",
        "undo 8021p-outbound [ <service-class> <color> ]"
    ],
    "ParentView": [
        "DiffServ domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "service-class",
            "Info": "Specifies the CoS.\nThe value is an enumerated type and can be EF, AF1, AF2, AF3, AF4, BE, CS6, or CS7."
        },
        {
            "Parameters": "color",
            "Info": "Specifies the color used to mark the packets.\nThe value is an enumerated type and can be green, yellow, or red."
        },
        {
            "Parameters": "map 8021p-value",
            "Info": "Specifies the 802.1p value of VLAN packets predefined by the system.\nThe value is an integer ranging from 0 to 7."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] diffserv domain test",
            "[*HUAWEI-dsdomain-test] 8021p-outbound af1 green map 5"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter QoS scheduling on the VLAN packets is implemented and the VLAN packets need to leave the DS domain, this command can be configured to convert the internal CoSs and colors of the VLAN packets into the 802.1p values.\nTable 1 Default mappings from internal CoSs and colors to 802.1p valuesService\n\nColor\n\n8021.p\n\n\n\nbe\n\ngreen\\yellow\\red\n\n0\n\n\naf1\n\ngreen\\yellow\\red\n\n1\n\n\naf2\n\ngreen\\yellow\\red\n\n2\n\n\naf3\n\ngreen\\yellow\\red\n\n3\n\n\naf4\n\ngreen\\yellow\\red\n\n4\n\n\nef\n\ngreen\\yellow\\red\n\n5\n\n\ncs6\n\ngreen\\yellow\\red\n\n6\n\n\ncs7\n\ngreen\\yellow\\red\n\n7\n\n\n\n\n\nPrerequisites\nConfigure the DS domain in system view and go to the Diff-Serv domain view.\nConfiguration Impact\nWhen the downstream VLAN packets leave the DS domain, the configured mappings from internal CoSs and colors to 802.1p values are used to remark the external VLAN packets.\nPrecautions\nIf service-class and color are not specified, you can run the undo 8021p-outbound command to restore all the default mappings from CoSs and colors of packets to 802.1p values."
}