{
    "PageTitle": "classifier behavior(Traffic policy view)",
    "FuncDef": "The classifier behavior command specifies the traffic behavior for the traffic classifier in the policy.\nThe undo classifier command cancels the configuration.\nBy default, the traffic behavior is not specified for the traffic classifier in the traffic policy.",
    "CLIs": [
        "classifier <classifier-name> behavior <behavior-name> [ precedence <precedence-value> ]",
        "undo classifier <classifier-name>"
    ],
    "ParentView": [
        "Traffic policy view"
    ],
    "ParaDef": [
        {
            "Parameters": "classifier-name",
            "Info": "Specifies the name of a predefined traffic classifier and is defined by the system or users through the traffic classifier command.\nThe value is a case-sensitive string that ranges from 1 to 127 characters."
        },
        {
            "Parameters": "behavior-name",
            "Info": "Specifies the name of a predefined traffic behavior and is defined by the system or users through the traffic behavior command.\nThe value is a case-sensitive string that ranges from 1 to 127 characters."
        },
        {
            "Parameters": "precedence precedence-value",
            "Info": "Specifies the precedence of a classifier. The smaller the value, the higher the precedence. That is, the action of the classifier is preferentially performed. You can change the step between policies through the step command to add new policies.\nThe value is an integer that ranges from 1 to 5119."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic classifier c1",
            "[*HUAWEI-classifier-c1] quit",
            "[*HUAWEI] traffic behavior b1",
            "[*HUAWEI-classifier-b1] quit",
            "[*HUAWEI] traffic policy p1",
            "[*HUAWEI-trafficpolicy-p1] classifier c1 behavior b1 precedence 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo perform a specific traffic behavior for the traffic that matches a certain rule on an interface, you need to apply traffic policies on the interface.\nPrerequisites\nThe traffic classifier, traffic behavior, and traffic policy are created in the system view.\nPrecautions\nThe undo classifier command cannot be used to delete the system-defined classifier. In the traffic policy view, one traffic classifier can be associated with only one traffic behavior, and you can configure the classifier-and-behavior-association for a maximum of 255 traffic classifiers.In the traffic behavior view, you can configure multiple actions. You, however, must ensure that these actions do not conflict.\nWhen the traffic policy in which traffic classifiers and traffic behaviors are bound is applied to an interface, you can modify the rules in traffic classifiers, actions in traffic behaviors, and binding relationships between traffic classifiers and traffic behaviors. The later configurations automatically overrides the previous ones. Therefore, you do not need to cancel the application of the traffic policy before modifying it.\nA traffic policy configured with redirection is applied to only the inbound direction of an interface."
}