{
    "PageTitle": "diffserv domain",
    "FuncDef": "The diffserv domain command defines a DS domain and displays the DS domain view. group set.\nThe undo diffserv domain command deletes a DS domain.\nBy default, the system predefines the default domain and the 5p3d domain .",
    "CLIs": [
        "diffserv domain { <ds-domain-name> | default | 5p3d } [ domain-id <domain-id-value> ]",
        "diffserv domain { <ds-domain-name> | default | 5p3d }",
        "undo diffserv domain { <ds-domain-name> | default | 5p3d } [ domain-id <domain-id-value> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "ds-domain-name",
            "Info": "Specifies the name of a DS domain.\nThe value is a string of 1 to 48 case-sensitive characters."
        },
        {
            "Parameters": "default",
            "Info": "Specifies the default DS domain, which is predefined in the system.\n-"
        },
        {
            "Parameters": "5p3d",
            "Info": "Specifies the 5p3d DS domain, which is predefined in the system.\n-"
        },
        {
            "Parameters": "domain-id domain-id-value",
            "Info": "Specifies the ID of a DS domain.\nThe value is an integer ranging from 1 to 31."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] diffserv domain d1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA DS domain consists of a group of connected DS nodes that provide the same service policy and implement the same PHB\nIf the specific service policy and PHB group set need to be defined according to the priorities of packets, you can configure a DS domain through the diffserv domain command. The mappings between priorities of packets and CoSs and colors are described in the DS domain.\nConfiguration Impact\nWhen the DS domain is applied to an interface, simple traffic classification is implemented for the packets on the interface based on the mappings in the DS domain.\nFollow-up Procedure\nAfter the DS domain is configured, you need to configure traffic classifiers for different external priorities and set the mappings between external priorities and PHBs. If no mapping is configured, simple traffic classification is implemented according to the default mappings.\nPrecautions\nIf a DS domain has been applied to an interface, the DS domain cannot be deleted. A maximum of 32 DS domains can be configured in a system, including a default domain and a 5p3d domain. The default and 5p3d domains cannot be deleted.\nIn VS mode, this command applies only to the admin VS and cannot be configured in other VSs. This command takes effect on all VSs."
}