{
    "PageTitle": "display traffic policy not-support vlanif",
    "FuncDef": "The display traffic policy not-support policy interface outbound command displays the rules, in a specified traffic policy, that cannot be applied to outgoing traffic on a specified interface.",
    "CLIs": [
        "display traffic policy not-support policy <policy-name> interface { <interface-name> | <interface-type> <interface-number> } outbound"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "policy-name",
            "Info": "Specifies the name of a traffic policy.\nThe value is a string of 1 to 127 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "interface-type",
            "Info": "Specifies an interface type.\nCurrently, the value can only be vlanif."
        },
        {
            "Parameters": "interface-number",
            "Info": "Specifies an interface number.\nThe value is an integer ranging from 1 to 4094."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display traffic policy not-support policy test interface Vlanif 1 outbound",
            "if-match *** (ipv4 acl)",
            "  if-match ipv6 ***"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter rules are configured in a traffic policy, you can run the display traffic policy not-support policy interface outbound command to check whether the configured rules are supported on the specified VLANIF interface.\nThe command output shows whether the IPv4 or IPv6 rules configured in the traffic policy are supported on the VLANIF interface but does not show the rule content.\nBy default, IPv4 rules can be applied to outgoing traffic on a VLANIF interface. Only when the mac-change notify-arp disable command is configured on a VLANIF interface and IPv4 rules are configured in the outbound traffic policy that is applied to the VLANIF interface, the command output shows the IPv4 rules that are not supported.By default, IPv6 rules cannot be applied to outgoing traffic on a VLANIF interface. Therefore, the command output shows the IPv6 rules that are not supported as long as IPv6 rules are configured in the outbound traffic policy that is applied to a VLANIF interface.If all IPv4 and IPv6 rules in an outbound traffic policy are supported, no command output is displayed."
}