{
    "PageTitle": "host-packet dscp",
    "FuncDef": "The host-packet dscp command configures mappings between DSCP values of protocol packets and internal priorities and between DSCP values and colors.\nThe undo host-packet dscp command deletes mappings between DSCP values of protocol packets and internal priorities and between DSCP values and colors.\nBy default, protocol packets enter the CS6 queue without the color during internal queue scheduling.",
    "CLIs": [
        "host-packet dscp <dscp-value> map local-service <cos-value> [ color <color> ]",
        "undo host-packet dscp <dscp-value> [ map local-service <cos-value> color <color> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "dscp-value",
            "Info": "Sets the DSCP value of protocol packets.\nThe value is an integer that ranges from 0 to 63."
        },
        {
            "Parameters": "local-service cos-value",
            "Info": "Sets the internal priority.\nThe value can be BF, AF1, AF2, AF3, AF4, EF, CS6, or CS7."
        },
        {
            "Parameters": "color color",
            "Info": "Sets the color of the internal priority.\nThe value can be green, yellow, or red. The default value is green."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] host-packet dscp 24 map local-service ef color green"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, protocol packets enter the CS6 queue without the color during internal queue scheduling. To facilitate internal scheduling of protocol packets, use the host-packet dscp map command to configure mappings between DSCP values of protocol packets and internal priorities and between DSCP values and colors.\nPrerequisites\nThe DSCP values of protocol packets that the host delivers have been configured using the host-packet type command.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}