{
    "PageTitle": "if-match vxlan-qos-local-id",
    "FuncDef": "The if-match vxlan-qos-local-id command configures a matching rule based on a QoS policy ID in VXLAN packets.\nThe undo if-match vxlan-qos-local-id command deletes a matching rule based on a QoS policy ID in VXLAN packets.\nBy default, no matching rule based on a QoS policy ID in VXLAN packets is configured.",
    "CLIs": [
        "if-match vxlan-qos-local-id <qos-local-id-value>",
        "if-match ipv6 vxlan-qos-local-id <qos-local-id-value>",
        "undo if-match vxlan-qos-local-id <qos-local-id-value>",
        "undo if-match ipv6 vxlan-qos-local-id <qos-local-id-value>"
    ],
    "ParentView": [
        "Traffic classifier view"
    ],
    "ParaDef": [
        {
            "Parameters": "qos-local-id-value",
            "Info": "Specifies a QoS policy ID in VXLAN packets.\nThe value is an integer that ranges from 1 to 7."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic classifier c1",
            "[*HUAWEI-classifier-c1] if-match vxlan-qos-local-id 2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter the function of filling QoS policy IDs in VXLAN headers is enabled, different QoS policy IDs can be configured for VXLAN packets. To classify traffic based on such a QoS policy ID to implement a different traffic policy, run the if-match vxlan-qos-local-id command in the traffic classifier view to configure a matching rule. Then configure a traffic behavior, configure a traffic policy and associate the traffic classifier with the traffic behavior, and apply the traffic policy to the corresponding interface.\nPrecautions\nThe traffic classifier configured with the if-match vxlan-qos-local-id command cannot be applied to a global UCL or ACL.\nThe if-match vxlan-qos-local-id and if-match qos-local-id commands cannot both be configured in a traffic classifier where the relationship between rules is AND.\nIf the qppb-policy qos-local-id both inbound command has been run on the interface to which a traffic policy is applied, the if-match vxlan-qos-local-id command cannot be run for the interface.\nIf the if-match vxlan-qos-local-id command is configured for a cascaded traffic policy, the command can be issued but does not take effect."
}