{
    "PageTitle": "if-match ipv6 next-header",
    "FuncDef": "The if-match ipv6 next-header command configures a matching rule for complex traffic classification based on the value of the next IPv6 header.\nThe undo if-match ipv6 next-header command cancels the configuration.\nBy default, the matching rule for complex traffic classification based on the value of the next IPv6 header is not configured in traffic classifier view",
    "CLIs": [
        "if-match ipv6 next-header <header-number> first-next-header",
        "undo if-match ipv6 next-header <header-number> first-next-header"
    ],
    "ParentView": [
        "Traffic classifier view"
    ],
    "ParaDef": [
        {
            "Parameters": "header-number",
            "Info": "Specifies the value of the next header, which indicates the type of the header following the basic header.\nThe value is an integer ranging from 0 to 255."
        },
        {
            "Parameters": "first-next-header",
            "Info": "Indicates that header-number is the value of the first next header of an IPv6 packet.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic classifier class1",
            "[*HUAWEI-classifier-class1] if-match ipv6 next-header 43 first-next-header"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo perform the traffic policy based on the value of the next IPv6 header, you can run this command to configure a matching rule for complex traffic classification based on the value of the next IPv6 header. Then, you can configure the traffic behavior and traffic policy, and apply the policy to interfaces.\nPrerequisites\nA traffic classifier is configured in the system view and the traffic classifier view is displayed.\nConfiguration Impact\nThe traffic action in the traffic behavior bound to the traffic classifier is performed for the traffic matching the specified value of the next IPv6 header.\nFollow-up Procedure\nYou need to configure the traffic behavior and traffic policy, bind the traffic behavior to the traffic classifier in the traffic policy, and apply the traffic policy to interfaces.\nPrecautions\nYou can configure more than one matching rules to match the next IPv6 header in one traffic classifier."
}