{
    "PageTitle": "if-match destination-mac",
    "FuncDef": "The if-match destination-mac command configures a matching rule for complex traffic classification based on destination MAC addresses of packets.\nThe undo if-match destination-mac command cancels the configuration.\nBy default, the matching rule for complex traffic classification based on destination MAC addresses of packets is not configured in traffic classifier view.",
    "CLIs": [
        "if-match destination-mac <mac-address>",
        "undo if-match destination-mac <mac-address>"
    ],
    "ParentView": [
        "Traffic classifier view"
    ],
    "ParaDef": [
        {
            "Parameters": "mac-address",
            "Info": "Specifies the destination MAC address to be matched.\nIt is in the format of H-H-H with each H representing four hexadecimal digits."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic classifier c1",
            "[*HUAWEI-classifier-c1] if-match destination-mac 00e0-fc12-3456"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure a certain traffic policy for the traffic with a certain destination MAC address, you can run this command in the traffic classifier view to configure a matching rule for complex traffic classification based on the destination MAC address. Then, you can configure the corresponding traffic behavior and traffic policy and apply the policy to interfaces.\nPrerequisites\nA traffic classifier is configured in the system view and the traffic classifier view is displayed.\nConfiguration Impact\nThe traffic action in the traffic behavior bound to the traffic classifier is performed for the traffic matching the specified destination MAC address.\nFollow-up Procedure\nYou need to configure the traffic behavior and traffic policy, bind the traffic behavior to the traffic classifier in the traffic policy, and apply the traffic policy to interfaces.\nPrecautions\nThis rule based on the destination MAC address is valid for only outbound policies.\nThis command can be used to set more than one destination MAC address for one traffic classifier to match the packets with different destination MAC addresses."
}