{
    "PageTitle": "if-match qos-local-id",
    "FuncDef": "The if-match qos-local-id command configures a matching rule to classify traffic based on the QoS policy ID.\nThe undo if-match qos-local-id command deletes a matching rule that is configured based on the QoS policy ID.\nBy default, the matching rule to classify traffic based on the QoS policy ID is not configured in traffic classifier view.",
    "CLIs": [
        "if-match qos-local-id <qos-local-id>",
        "undo if-match qos-local-id <qos-local-id>"
    ],
    "ParentView": [
        "Traffic classifier view"
    ],
    "ParaDef": [
        {
            "Parameters": "qos-local-id",
            "Info": "QoS policy ID.\nThe value is an integer ranging from 1 to 255."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic classifier c1",
            "[*HUAWEI-classifier-c1] if-match qos-local-id 2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nYou can set different qos-local-id values for routes based on the BGP route attributes. If traffic classification must be implemented based on qos-local-id values of routes, run the if-match qos-local-id command to configure a matching rule based on the QoS policy ID, configure a traffic behavior, and then configure and apply a traffic policy to the related interface.\nPrerequisites\nThe mapping between BGP routes and QoS local route tags has been defined in a routing policy, and QPPB has been enabled on an inbound interface.\nConfiguration Impact\nTraffic is classified according to the matched rule and corresponding traffic behaviors are implemented.\nFollow-up Procedure\nIf the if-match qos-local-id command is configured, run the qppb-policy qos-local-id { destination | source } inbound command to apply a QPPB traffic policy to incoming traffic on the interface.\nPrecautions\nWhen QPPB and MF classification are configured on both the inbound and outbound interfaces and CAR behaviors are configured, the lower rate limit takes effect.\nWhen QPPB and MF classification are configured on both the inbound and outbound interfaces and non-CAR traffic behaviors are configured, the behavior configured in QPPB takes effect for incoming packets, and the behavior configured in MF classification takes effect for outgoing packets.\nWhen QPPB and MF classification are configured on both the inbound and outbound interfaces and different traffic behaviors are configured for QPPB and MF classification, both behaviors take effect."
}