{
    "PageTitle": "if-match ip-precedence",
    "FuncDef": "The if-match ip-precedence command configures an IPv4-precedence-based or IPv6-precedence-based matching rule.\nThe undo if-match ip-precedence command deletes an IPv4-precedence-based or IPv6-precedence-based matching rule..\nBy default, the matching rule for complex traffic classification based on IP precedence is not configured in traffic classifier view",
    "CLIs": [
        "if-match ip-precedence <ip-precedence>",
        "if-match ipv6 ip-precedence <ip-precedence>",
        "undo if-match ip-precedence <ip-precedence>",
        "undo if-match ipv6 ip-precedence <ip-precedence>"
    ],
    "ParentView": [
        "Traffic classifier view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-precedence",
            "Info": "Specifies the value of IP precedence.\nIt is an integer ranging from 0 to 7."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic classifier class1",
            "[*HUAWEI-classifier-class1] if-match ipv6 ip-precedence 1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic classifier class1",
            "[*HUAWEI-classifier-class1] if-match ip-precedence 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo perform different traffic policies for different traffic classifiers according to the IP precedence of packets, you can run this command to configure a matching rule for complex traffic classification based on IP precedence. Then, you need to bind the traffic behavior to the traffic classifier in the traffic policy, and apply the policy to interfaces.\nPrerequisites\nA traffic classifier is configured in the system view and the traffic classifier view is displayed.\nConfiguration Impact\nThe traffic action in the traffic behavior bound to the traffic classifier is performed for the packets with the specified IP precedence.\nFollow-up Procedure\nYou need to configure the traffic behavior and traffic policy, bind the traffic behavior to the traffic classifier in the traffic policy, and apply the traffic policy to interfaces.\nPrecautions\nYou can configure a maximum of eight such rules for a traffic classifier. That is, one traffic classifier can match a maximum of eight levels of IP precedence, and the later configuration does not override the previous one.\nAfter the configuration, the values of IP precedence are sorted in the order they are configured. A matching rule can be deleted only when all IP precedence values specified to be deleted are the same as those that are specified in the matching rule. The deletion order can be different from the configuration order.\nThe if-match ipv6 ip-precedence command is mutually exclusive with the match-type ipv6 qos-local-id enable command."
}