{
    "PageTitle": "if-match dscp",
    "FuncDef": "The if-match dscp command configures a matching rule for complex traffic classification based on DSCP values.\nThe undo if-match dscp command cancels the configuration.\nBy default, the matching rule for complex traffic classification based on DSCP values is not configured in traffic classifier view.",
    "CLIs": [
        "if-match ipv6 dscp <dscp-value>",
        "if-match dscp <dscp-value>",
        "undo if-match ipv6 dscp <dscp-value>",
        "undo if-match dscp <dscp-value>"
    ],
    "ParentView": [
        "Traffic classifier view"
    ],
    "ParaDef": [
        {
            "Parameters": "dscp-value",
            "Info": "Specifies the DSCP value of IPv4 or IPv6 packets to be matched.\nThe DSCP value of an IPv4 packet is an integer ranging from 0 to 63 or a keyword of EF, default, or in the range of AF11-AF13, AF21-AF23, AF31-AF33, AF41-AF43, and CS1-CS7. The DSCP value of an IPv6 packet can be an integer ranging from 0 to 63."
        },
        {
            "Parameters": "ipv6",
            "Info": "Indicates that traffic classification is performed according to the DSCP values in IPv6 packets.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic classifier class1",
            "[*HUAWEI-classifier-class1] if-match dscp 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo perform different traffic policies for different traffic classifiers according to the DSCP values of packets, you can run this command to configure a matching rule for complex traffic classification based on DSCP values. Then, you need to configure the traffic behavior and traffic policy, and apply the policy to interfaces.\nPrerequisites\nA traffic classifier is configured in the system view and the traffic classifier view is displayed.\nConfiguration Impact\nThe traffic action in the traffic behavior bound to the traffic classifier is performed for the packets with the specified DSCP value.\nFollow-up Procedure\nYou need to configure the traffic behavior and traffic policy, bind the traffic behavior to the traffic classifier in the traffic policy, and apply the traffic policy to interfaces.\nPrecautions\nWith this command, you can define multiple rules for the same classifier. The later configuration does not override the previous one.\nIn traffic classification, packets match traffic policies in the order the policies are configured.\nA matching rule can be deleted only when all DSCP values are the same as those that are specified in the matching rule. The deletion order can be different from the configuration order."
}