{
    "PageTitle": "if-match any",
    "FuncDef": "The if-match any command configures a matching rule for complex traffic classification for all IPv4 or IPv6 packets.\nThe undo if-match any command cancels the configuration.\nBy default, the matching rule for complex traffic classification for all IPv4 or IPv6 packets is not configured in traffic classifier view.",
    "CLIs": [
        "if-match ipv6 any",
        "if-match any",
        "undo if-match ipv6 any",
        "undo if-match any"
    ],
    "ParentView": [
        "Traffic classifier view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv6",
            "Info": "Indicates all IPv6 packets.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic classifier class1",
            "[*HUAWEI-classifier-class1] if-match any"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo process all IPv4 or IPv6 packets in a uniform manner, you need to run this command to match all IPv4 or IPv6 packets.\nPrerequisites\nA traffic classifier is configured in the system view and the traffic classifier view is displayed.\nConfiguration Impact\nIf the traffic behavior and traffic policy are configured for the matched IPv4 or IPv6 packets, the traffic policy configured later does not take effect.\nPrecautions\nIf ipv6 is specified, it indicates that all IPv6 packets are involved in the complex traffic classification.\nIf ipv6 is not specified, it indicates that all IPv4 packets are involved in the complex traffic classification.\nIf you run the command with the parameter any, you set traffic policing parameters for all flows. The policies are matched in the order they are configured.\nIf both any and acl are configured, the earlier configuration takes effect. For example, if any is configured earlier, the command carrying any takes effect whereas that carrying acl does not; otherwise, the command carrying acl takes effect (the case of taking effect of a policy is the same as when only acl is used) whereas that carrying any does not."
}