{
    "PageTitle": "if-match mpls-exp",
    "FuncDef": "The if-match mpls-exp command defines a matching rule to classify traffic based on the value of the MPLS EXP field.\nThe undo if-match mpls-exp command cancels the configuration.\nBy default, the matching rule to classify traffic based on the value of the MPLS EXP field is not configured in traffic classifier view.",
    "CLIs": [
        "if-match mpls-exp <exp-value>",
        "undo if-match mpls-exp <exp-value>"
    ],
    "ParentView": [
        "Traffic classifier view"
    ],
    "ParaDef": [
        {
            "Parameters": "exp-value",
            "Info": "Specifies the EXP value of the MPLS packet to be matched.\nThe value is an integer ranging from 0 to 7."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic classifier class1",
            "[*HUAWEI-classifier-class1] if-match mpls-exp 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo perform different traffic policies for different traffic classifiers according to the EXP values of packets, you can run this command to configure a matching rule for complex traffic classification based on EXP values. Then, you need to configure the traffic behavior and traffic policy, and apply the policy to interfaces.\nPrerequisites\nA traffic classifier is configured in the system view and the traffic classifier view is displayed.\nConfiguration Impact\nThe traffic action in the traffic behavior bound to the traffic classifier is performed for the packets matching the specified EXP value.\nFollow-up Procedure\nYou need to configure the traffic behavior and traffic policy, bind the traffic behavior to the traffic classifier in the traffic policy, and apply the traffic policy to interfaces.\nPrecautions\nYou can configure a maximum of eight such rules for a traffic classifier. That is, one traffic classifier can match a maximum of eight MPLS EXP priorities. The later configuration does not override the previous one.\nAfter the configuration, the MPLS EXP values are sorted in the configuration order.\nA matching rule can be deleted only when all MPLS EXP values are the same as those that are specified in the matching rule. The deletion order can be different from the configuration order."
}