{
    "PageTitle": "intelligent-flow",
    "FuncDef": "The intelligent-flow command sets service classes and colors for burst elephant flows, steady elephant flows, and other flows.\nThe undo intelligent-flow command restores the default configuration.\nBy default, no service class or color is set for burst elephant flows, steady elephant flows, or other flows.",
    "CLIs": [
        "intelligent-flow elephant-flow-burst <elephant-flow-burst-pri-value> color <color-value> elephant-flow-steady <elephant-flow-steady-pri-value> color <color-value> other-flow <other-flow-pri-value> color <color-value> [ no-remark ]",
        "undo intelligent-flow",
        "undo intelligent-flow elephant-flow-burst <elephant-flow-burst-pri-value> color <color-value> elephant-flow-steady <elephant-flow-steady-pri-value> color <color-value> other-flow <other-flow-pri-value> color <color-value> [ no-remark ]"
    ],
    "ParentView": [
        "Traffic behavior view"
    ],
    "ParaDef": [
        {
            "Parameters": "elephant-flow-burst-pri-value",
            "Info": "Specifies the service class of burst elephant flows.\nThe value is case-insensitive and can be EF, AF1, AF2, AF3, AF4, BE, CS6, or CS7."
        },
        {
            "Parameters": "color-value",
            "Info": "Specifies a flow color.\nThe value can be green, yellow, or red."
        },
        {
            "Parameters": "elephant-flow-steady-pri-value",
            "Info": "Specifies the service class of steady elephant flows.\nThe value is case-insensitive and can be EF, AF1, AF2, AF3, AF4, BE, CS6, or CS7."
        },
        {
            "Parameters": "other-flow-pri-value",
            "Info": "Specifies the service class of other flows.\nThe value is case-insensitive and can be EF, AF1, AF2, AF3, AF4, BE, CS6, or CS7."
        },
        {
            "Parameters": "no-remark",
            "Info": "Enables no-remark.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic behavior b1",
            "[*HUAWEI-behavior-b1] intelligent-flow elephant-flow-burst af1 color yellow elephant-flow-steady af2 color yellow other-flow af3 color green no-remark"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nNetwork traffic can be classified as elephant or mice flows by traffic volume. For example, video and web browsing service flows are usually elephant ones and are insensitive to latency, and game service flows are usually mice ones and are sensitive to latency. Elephant flows can be further classified as burst or steady elephant flows. For example, video and download service flows are burst elephant ones, and video conferencing and CloudVR service flows are steady elephant ones. On a network, elephant flows consume a large amount of bandwidth, which causes network link congestion and service quality deterioration. In addition, user experience resulting from mice flows deteriorates. To ensure user experience resulting from mice flows, run the intelligent-flow command to lower the service classes of burst and steady elephant flows, reducing their priorities. This ensures that mice flows are not affected by elephant flows.\nPrerequisites\nA traffic behavior has been configured.\nPrecautions\nBefore configuring this command, you are advised to run the intelligent-flow enable slot command in the slot view to enable intelligent flow classification on the board. After the intelligent-flow command is run in a traffic behavior, bind the traffic behavior to a traffic policy, and apply the traffic policy to an interface. In this way, the priority of elephant flows can be reduced."
}