{
    "PageTitle": "ip netstream sampler except deny-action",
    "FuncDef": "The ip netstream sampler except deny-action command configures NetStream sampling not to be applied to traffic matching the ACL rule or traffic behavior of deny.\nThe undo ip netstream sampler except deny-action command configures NetStream sampling to be applied to traffic matching the ACL rule or traffic behavior of deny.\nBy default, NetStream is applied to traffic matching the ACL rule or traffic behavior of deny.",
    "CLIs": [
        "ip netstream sampler except deny-action",
        "undo ip netstream sampler except deny-action"
    ],
    "ParentView": [
        "Traffic behavior view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic behavior b1",
            "[*HUAWEI-behavior-b1] deny",
            "[*HUAWEI-behavior-b1] ip netstream sampler except deny-action"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen NetStream sampling is configured and an ACL rule or traffic behavior of deny is configured for multi-field (MF) classification, the device performs NetStream sampling on the packets that match the ACL rule or traffic behavior by default. If a large number of packets matching the deny ACL rule or traffic behavior are sent, an exception alarm is generated. However, these packets are discarded and do not trigger any traffic exception. As a result, the device incorrectly generates the alarm. To resolve this problem, configure NetStream sampling not to be applied to packets matching the ACL rule or traffic behavior of deny.\nPrerequisites\n Run the ip netstream sampler to slot self command in the slot view. Configure interface- or flow-specific sampling. To configure interface-specific sampling, run the ip netstream sampler command in the system view or interface view; To configure flow-specific sampling, run the ip netstream sampler command in the traffic behavior view. Run the deny command in the traffic behavior view or run the rule command with deny being specified in the ACL view.\n\nPrecautions\nThis command is supported only in interface ACL scenarios."
}