{
    "PageTitle": "load-balance",
    "FuncDef": "The load-balance command sets the load balancing mode.\nThe undo load-balance command restores the default load balancing mode. The default load balancing mode is per-flow load balancing.\nBy default, flow-based load balancing is performed for received packets based on Layer 3 information (source and destination IP addresses).",
    "CLIs": [
        "load-balance { flow [ l2 | l3 ] | packet }",
        "undo load-balance [ flow [ l2 | l3 ] | packet ]"
    ],
    "ParentView": [
        "Traffic behavior view"
    ],
    "ParaDef": [
        {
            "Parameters": "flow",
            "Info": "Specifies performs per-flow load balancing.\n-"
        },
        {
            "Parameters": "l2",
            "Info": "Specifies performing per-flow load balancing based on Layer 2 information (source and destination MACs) about IP packets.\n-"
        },
        {
            "Parameters": "l3",
            "Info": "Specifies performing per-flow load balancing based on Layer 3 information (source and destination addresses and its ports) about IP packets.\n-"
        },
        {
            "Parameters": "packet",
            "Info": "Specifies performs per-packet load-balancing.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic behavior test",
            "[*HUAWEI-behavior-test] load-balance packet"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn general, the configuration rule is to perform per-flow load balancing for TCP packets and per-packet load balancing for UDP packets.\nPrerequisites\nThe traffic behavior has been configured.\nFollow-up Procedure\nConfigure the traffic classifier and traffic policy and apply the policy to corresponding interfaces.\nPrecautions\nThe traffic behavior relevant to the traffic action takes effect only in the inbound direction of an interface and works only on IP packet forwarding. The device performs per-flow load balancing for the received IP packets based on the source and destination IP addresses."
}