{
    "PageTitle": "mpls l2vc diffserv domain",
    "FuncDef": "The mpls l2vc diffserv domain command specifies a DS domain to which a VLL-enabled interface is bound and to which the private network tag preference to be marked belongs.\nThe undo mpls l2vc diffserv domain command restores the default setting.\nBy default, the private network tag preference that a VLL-enabled interface uses is marked to be that in the default domain.",
    "CLIs": [
        "mpls l2vc diffserv domain { 5p3d | <domain-name> | default }",
        "undo mpls l2vc diffserv domain"
    ],
    "ParentView": [
        "100GE interface view",
        "10G LAN interface view",
        "10G WAN interface view",
        "50GE interface view",
        "50|100GE interface view",
        "Eth-Trunk sub-interface view",
        "Eth-Trunk interface view",
        "FlexE interface view",
        "GE sub-interface view",
        "GE electrical interface view",
        "Global VE interface view",
        "IP-Trunk interface view",
        "MP-group interface view",
        "POS interface view",
        "VE sub-interface view",
        "Serial interface view",
        "Port extension interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "5p3d",
            "Info": "Indicates the DS domain with the name 5P3D that is predefined by the system. 5P3D domain takes effect only in the Layer 2 GE interface view or GE sub-interface view.\n-"
        },
        {
            "Parameters": "domain-name",
            "Info": "Specifies the name of a DS domain.\nThe value is a string of 1 to 48 case-sensitive characters."
        },
        {
            "Parameters": "default",
            "Info": "Specifies the default domain.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] diffserv domain ds1",
            "[*HUAWEI-dsdomain-ds1] quit",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] mpls l2vc diffserv domain ds1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn the VLL networking, after a PE receives user packets, the PE's AC interface encapsulates a private network tag into the user packets and then the PE's PW interface encapsulates a public network tag into the user packets. Both tags have their own EXP values.\nBy default, when the trust upstream command is configured on the AC or PW interface to bind the interface to a DS domain, the EXP values of the public network tag and the private network tag are changed to the same value. In this case, carriers fail to differentiate services or users based on the EXP values of inner (private network) tags and outer (public network) tags."
}