{
    "PageTitle": "mpls-exp-outbound",
    "FuncDef": "The mpls-exp-outbound command converts the CoSs and colors of the downstream MPLS packets into the EXP values.\nThe undo mpls-exp-outbound command restores the default settings.\nBy default, the mappings from internal CoSs and colors to EXP values are shown in Table 1 in Usage Scenario.",
    "CLIs": [
        "mpls-exp-outbound <service-class> <color> map <exp>",
        "undo mpls-exp-outbound [ <service-class> <color> ]"
    ],
    "ParentView": [
        "DiffServ domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "service-class",
            "Info": "Specifies the CoS value.\nThe value is of the enumeration type. It is case-insensitive and can be EF, AF1, AF2, AF3, AF4, BE, CS6, or CS7."
        },
        {
            "Parameters": "color",
            "Info": "Specifies the color used to mark the packet.\nThe value is an enumeration type and can be green, yellow, or red."
        },
        {
            "Parameters": "map exp",
            "Info": "Specifies the EXP value of the MPLS packet.\nThe value is an integer ranging from 0 to 7."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] diffserv domain d1",
            "[*HUAWEI-dsdomain-d1] mpls-exp-outbound af1 green map 5"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen the packets leave the DS domain, you need to run the mpls-exp-outbound command to convert the CoSs and colors of MPLS packets into the EXP values.\nTable 1 Default mappings from internal CoSs and colors to EXP valuesService\n\nColor\n\nEXP\n\n\n\nbe\n\ngreen\n\n0\n\n\naf1\n\ngreen\\yellow\\red\n\n1\n\n\naf2\n\ngreen\\yellow\\red\n\n2\n\n\naf3\n\ngreen\\yellow\\red\n\n3\n\n\naf4\n\ngreen\\yellow\\red\n\n4\n\n\nef\n\ngreen\n\n5\n\n\ncs6\n\ngreen\n\n6\n\n\ncs7\n\ngreen\n\n7\n\n\n\n\n\nPrerequisites\nA DS domain is created.\nPrecautions\nThis command is supported only on the admin VS.\nIf service-classcolor is not specified, the undo mpls-exp-outbound command restores all default mappings from internal CoSs to EXP values of downstream MPLS packets."
}