{
    "PageTitle": "mpls-exp-inbound",
    "FuncDef": "The mpls-exp-inbound command converts the EXP values of the upstream MPLS packets into the corresponding CoSs and color the packets.\nThe undo mpls-exp-inbound command restores the default settings.\nBy default, the mappings from EXP values to CoSs and colors are shown in Table 1 in Usage Scenario.",
    "CLIs": [
        "mpls-exp-inbound <exp> phb <service-class> [ <color> ]",
        "undo mpls-exp-inbound [ <exp> ]"
    ],
    "ParentView": [
        "DiffServ domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "exp",
            "Info": "Specifies the EXP value of the MPLS packet.\nThe value is an integer ranging from 0 to 7."
        },
        {
            "Parameters": "phb service-class",
            "Info": "Specifies the CoS value.\nThe value is an enumerated type and can be case-insensitive EF, AF1, AF2, AF3, AF4, BE, CS6, or CS7."
        },
        {
            "Parameters": "color",
            "Info": "Specifies the color used to mark the packet.\nThe value is an enumerated type and can be green, yellow, or red."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] diffserv domain d1",
            "[*HUAWEI-dsdomain-d1] mpls-exp-inbound 2 phb af1 green"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo implement QoS scheduling for upstream MPLS packets that carry MPLS EXP priorities, you need to run this command to configure mappings from MPLS EXP priorities of packets to internal CoSs and color the packets.\nTable 1 Default mappings from EXP values to CoSs and colorsEXP\n\nService\n\nColor\n\n\n\n0\n\nbe\n\ngreen\n\n\n1\n\naf1\n\ngreen\n\n\n2\n\naf2\n\ngreen\n\n\n3\n\naf3\n\ngreen\n\n\n4\n\naf4\n\ngreen\n\n\n5\n\nef\n\ngreen\n\n\n6\n\ncs6\n\ngreen\n\n\n7\n\ncs7\n\ngreen\n\n\n\n\n\nPrerequisites\nA DS domain is created.\nImplementation Procedure\nAfter the DS domain is bound to the inbound interface of packets, QoS performs congestion management and avoidance according to the CoSs and colors mapped to the EXP values.\nPrecautions\nThis command is supported only on the admin VS.\nIf exp is not specified, the undo mpls-exp-inbound command restores all default mappings from EXP values of upstream MPLS packets to internal CoSs and colors to the defaults."
}