{
    "PageTitle": "qos default-service-class",
    "FuncDef": "The qos default-service-class command configures the upstream traffic on an interface to enter the specified queue.\nThe undo qos default-service-class command cancels the configuration.\nBy default, the upstream traffic on an interface to enter the BE queue.",
    "CLIs": [
        "qos default-service-class <service-class>",
        "undo qos default-service-class"
    ],
    "ParentView": [
        "100GE interface view",
        "10G LAN interface view",
        "10G WAN interface view",
        "40GE interface view",
        "50GE interface view",
        "50|100GE interface view",
        "Eth-Trunk interface view",
        "FlexE interface view",
        "GE optical interface view",
        "GE electrical interface view",
        "IP-Trunk interface view",
        "MP-group interface view",
        "POS interface view",
        "PW-VE sub-interface view",
        "Serial interface view",
        "Bridge domain view",
        "Port extension Layer 2 interface view",
        "Port extension sub-interface view",
        "Port extension interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "service-class",
            "Info": "Indicates the CoS of the queue that upstream traffic on an interface enters.\nThe value is of the enumeration type. It is case-insensitive and can be EF, AF1, AF2, AF3, AF4, BE, CS6, or CS7."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] qos default-service-class af1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThis command is used to specify the CoS of the queue that the upstream traffic on an interface enters to implement congestion avoidance. In the DiffServ model, the system reserves eight service queues for each port, and their CoSs are respectively BE, AF1, AF2, AF3, AF4, EF, CS6, and CS7. For the queue whose CoS is AF1, AF2, AF3, AF4, or BE, WFQ is used to assign bandwidth to queue taking part in the scheduling according to the weights of the queues by default. For the queue whose CoS is EF, CS6, or CS7, PQ scheduling is configured by default.\nIf the qos default-service-class command is run on an interface for incoming traffic for multiple times, the last configuration takes effect. After this command is executed, other queue configuration commands cannot be enabled. This command is mutually exclusive with BA classification command."
}