{
    "PageTitle": "qos subscriber-access member-link-scheduler distribute",
    "FuncDef": "The qos subscriber-access member-link-scheduler distribute command configures weight-based bandwidth allocation for member interfaces of a trunk for common users.\nThe undo qos subscriber-access member-link-scheduler distribute command cancels weight-based bandwidth allocation for member interfaces of a trunk for common users.\nBy default, bandwidth allocation is not implemented for trunk member interfaces for common users based on weights.",
    "CLIs": [
        "qos subscriber-access member-link-scheduler distribute inbound",
        "undo qos subscriber-access member-link-scheduler distribute inbound"
    ],
    "ParentView": [
        "Eth-Trunk interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Eth-Trunk 1",
            "[~HUAWEI-Eth-Trunk1] qos subscriber-access member-link-scheduler distribute inbound"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, when common users access a Eth-Trunk interface and car or user-queue is configured on the trunk interface, if all trunk member interfaces are on the same network processor or traffic management module of the same board, the trunk member interfaces share the bandwidth configured on the trunk interface. Otherwise, the rate limit of each trunk member network processor or traffic management module is the one configured on the trunk interface. In this case, the traffic rate on the trunk interface multiplies, and rate limiting fails. After the qos subscriber-access member-link-scheduler distribute inbound command is configured, the maximum rate of traffic on a trunk interface is equal to the bandwidth configured on the trunk interface, and bandwidth is allocated to the trunk's member interfaces based on the weight, which is specified using the distribute-weight command.\nPrecautions\nIf the user-group-queue inbound command is run in the user VLAN view on a trunk sub-interface, the qos subscriber-access member-link-scheduler distribute inbound command cannot be run on the trunk interface.If the qos subscriber-access member-link-scheduler distribute inbound command is configured on a trunk interface, the user-group-queue inbound command cannot be configured in the user VLAN view on the trunk sub-interface.If the qos-profile inbound command is run in the user VLAN view on a trunk sub-interface, the qos subscriber-access member-link-scheduler distribute inbound command cannot be run on the trunk interface.If the qos subscriber-access member-link-scheduler distribute inbound command is configured on a trunk interface, the qos-profile inbound command cannot be configured in the user VLAN view on the trunk sub-interface.If both qos-profile inbound and bas are configured on a trunk interface or sub-interface, the qos subscriber-access member-link-scheduler distribute inbound command cannot be configured on the trunk interface.If the qos subscriber-access member-link-scheduler distribute inbound command is run on a trunk interface and the bas command is run on the trunk interface or sub-interface, the qos-profile inbound command cannot be run on the trunk interface or sub-interface.If the qos subscriber-access member-link-scheduler distribute inbound command is run on a trunk interface and the qos-profile inbound command is run on the trunk interface or sub-interface, the bas command cannot be run on the trunk interface or sub-interface.The bandwidth split function on the user side does not support the split of the flow-queue shaping bandwidth. Therefore, the traffic rate on the Eth-Trunk interface may multiply.The bandwidth split function on the user side does not support the split of the DAA or EDSG service bandwidth. Therefore, the traffic rate on the Eth-Trunk interface may multiply."
}