{
    "PageTitle": "qos channel alarm",
    "FuncDef": "The qos channel alarm command configures the bandwidth or channel usage threshold for a resource pool.\nThe undo qos channel alarm command cancels the configuration.\nBy default, no bandwidth or channel usage thresholds are configured for a resource pool.",
    "CLIs": [
        "qos channel alarm { quantity | bandwidth } threshold <value> [ pool-0 | pool-1 ]",
        "undo qos channel alarm { quantity | bandwidth } [ pool-0 | pool-1 ]"
    ],
    "ParentView": [
        "Slot view"
    ],
    "ParaDef": [
        {
            "Parameters": "quantity",
            "Info": "Indicates the number of banknotes.\n-"
        },
        {
            "Parameters": "bandwidth",
            "Info": "Indicates the channel bandwidth.\n-"
        },
        {
            "Parameters": "threshold value",
            "Info": "Specifies the bandwidth or channel usage threshold, in percentage.\nThe value is an integer ranging from 1 to 100."
        },
        {
            "Parameters": "pool-0",
            "Info": "Indicates resource pool 0.\n-"
        },
        {
            "Parameters": "pool-1",
            "Info": "Indicates resource pool 1.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] slot 1",
            "[*HUAWEI-slot-1] qos channel alarm bandwidth threshold 60"
        ]
    ],
    "ExtraInfo": "To configure the bandwidth or channel usage threshold for a resource pool, run the qos channel alarm command. After this command is run on a device, the device periodically reads the data at the bottom layer. When the bandwidth or channel usage exceeds or falls below the threshold, a log is generated. If a log indicating that the bandwidth or channel usage exceeds the threshold already exists, no such logs will be generated, even if the bandwidth or channel usage exceeds the threshold again. If a log indicating that the bandwidth or channel usage falls below the threshold already exists, no such logs will be generated, even if the bandwidth or channel usage falls below the threshold again. After the undo qos channel alarm command is run, no logs indicating that the bandwidth or channel usage exceeds or falls below the thresholds are generated."
}