{
    "PageTitle": "qos leased-line-access member-link-scheduler distribute",
    "FuncDef": "The qos leased-line-access member-link-scheduler distribute command configures weight-based bandwidth allocation for member interfaces of a trunk for leased line users.\nundo qos leased-line-access member-link-scheduler distribute command cancels weight-based bandwidth allocation for member interfaces of a trunk for leased line users.\nBy default, bandwidth allocation is not implemented for trunk member interfaces for leased line users based on weights.",
    "CLIs": [
        "qos leased-line-access member-link-scheduler distribute { inbound | outbound }",
        "undo qos leased-line-access member-link-scheduler distribute { inbound | outbound }"
    ],
    "ParentView": [
        "Eth-Trunk interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "inbound",
            "Info": "Configures weight-based bandwidth allocation for upstream traffic of member interfaces of a trunk for leased line users.\n-"
        },
        {
            "Parameters": "outbound",
            "Info": "Configures weight-based bandwidth allocation for downstream traffic of member interfaces of a trunk for leased line users.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Eth-Trunk 1",
            "[~HUAWEI-Eth-Trunk1] qos leased-line-access member-link-scheduler distribute inbound"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, when leased line users access a Eth-Trunk interface and car or user-queue is configured on the trunk interface, if all trunk member interfaces are on the same network processor or traffic management module of the same board, the trunk member interfaces share the bandwidth configured on the trunk interface. Otherwise, the rate limit of each trunk member network processor or traffic management module is the one configured on the trunk interface. In this case, the traffic rate on the trunk interface multiplies, and rate limiting fails. After the qos leased-line-access member-link-scheduler distribute command is configured, the maximum rate of traffic on a trunk interface is equal to the bandwidth configured on the trunk interface, and bandwidth is allocated to the trunk's member interfaces based on the weight, which is specified using the distribute-weight command.\nPrecautions\nWhen the BAS interface is configured as a Layer 3 leased line or a Layer 2 VPN leased line access interface, this command is mutually exclusive with the user-group-queue or sub-port-queue command in the same direction.\nThe bandwidth split function on the user side does not support the split of the flow-queue shaping bandwidth. Therefore, the traffic rate on the Eth-Trunk interface may multiply.\nThe bandwidth split function on the user side does not support the split of the DAA or EDSG service bandwidth. Therefore, the traffic rate on the Eth-Trunk interface may multiply."
}