{
    "PageTitle": "qos phb enable",
    "FuncDef": "The qos phb enable command enables priority mapping on the outbound interface.\nThe undo qos phb enable command disables priority mapping on the outbound interface.\nBy default, an interface does not check the PHB table when forwarding packets downstream.",
    "CLIs": [
        "qos phb enable { <ds-name> | default }",
        "undo qos phb enable"
    ],
    "ParentView": [
        "100GE interface view",
        "10G LAN interface view",
        "10G WAN interface view",
        "40GE interface view",
        "50GE interface view",
        "50|100GE interface view",
        "BAS interface view (FE)",
        "Eth-Trunk interface view",
        "FlexE interface view",
        "GE optical interface view",
        "GMPLS-UNI interface view",
        "Global-VE layer2 subinterface view",
        "Global VE sub-interface view",
        "IP-Trunk interface view",
        "MP-group interface view",
        "POS interface view",
        "PW-VE sub-interface view",
        "PW-VE interface view",
        "Tunnel interface view",
        "VE layer2 subinterface view",
        "VE sub-interface view",
        "Serial interface view",
        "Bridge domain view",
        "Port extension sub-interface view",
        "Port extension interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "ds-name",
            "Info": "Specifies the name of a DS domain.\nThe value is a string of 1 to 48 case-sensitive characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] qos phb enable default"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThis command indicates that a DS domain is bound to the Layer 3 interface to implement priority mappings for IP packets, MPLS packets, and VLAN packets.\nAs defined in simple traffic classification, external priorities of upstream packets are mapped to internal priorities based on the behavior aggregate (BA) table; internal priorities of downstream packets are mapped to external priorities based on the PHB table.\nAfter the qos phb enable command is used on the outbound interface, internal priorities of the outgoing packets on the interface are mapped to external priorities based on the PHB table.\nThe qos phb enable command must be configured on the outbound interface in any of the following scenarios:\nThe diffserv-mode uniform command is configured for packets sent from the private network to the public network to implement MPLS DiffServ.The remark 8021p, remark dscp, remark inner-8021p, or remark ip-precedence command is configured in the traffic policy applied to the inbound interface.\n\nPrecautions\nThe qos phb enable command is mutually exclusive with the trust upstream , qos phb disable , trust 8021p command.\nThe trust 8021p command is not mutually exclusive with the qos phb enable command in terms of configuration. However, the trust 8021p command takes effect only after the trust upstream command is configured. Therefore, the qos phb enable command is mutually exclusive with the trust 8021p command in terms of function implementation.\nThis command takes effect only for untagged packets after being configured on a Layer 2 interface configured with the port vlan-stacking ce-default-vlan stack-vlan command. This command can be delivered but does not take effect after being configured on a Layer 2 interface configured with the port vlan-stacking vlan command. This command is not supported on any other Layer 2 interface."
}