{
    "PageTitle": "qppb-policy qos-local-id both inbound",
    "FuncDef": "The qppb-policy qos-local-id both inbound command enables a traffic policy for incoming traffic on an interface based on the source and destination QoS policy IDs.\nThe undo qppb-policy qos-local-id both inbound command disables a traffic policy for incoming traffic on an interface based on the source and destination QoS policy IDs.\nBy default, no traffic policy for incoming traffic is enabled on an interface based on the source and destination QoS policy IDs.",
    "CLIs": [
        "qppb-policy qos-local-id both inbound",
        "undo qppb-policy qos-local-id both inbound"
    ],
    "ParentView": [
        "100GE interface view",
        "10G LAN interface view",
        "10G WAN interface view",
        "40GE interface view",
        "Eth-Trunk sub-interface view",
        "Eth-Trunk interface view",
        "GE interface view",
        "IP-Trunk interface view",
        "POS interface view",
        "Serial interface view",
        "Sub-interface view",
        "Port extension sub-interface view",
        "Port extension interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] qppb-policy qos-local-id both inbound"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nYou can set different values (QoS policy IDs) for routes based on the BGP route attributes. If traffic classification must be implemented based on the source and destination QoS policy IDs, run the qppb-policy qos-local-id both inbound command. BGP advertises two routing policies. One routing policy matches the source address of packets, and the other routing policy matches the destination address of packets.\nPrerequisites\nThe if-match qos-local-id source command has been configured to define a matching rule to classify traffic based on the source and destination QoS policy IDs.\nPrecautions\nThis command applies only to traffic policies but not to QPPB."
}