{
    "PageTitle": "redirect vsi",
    "FuncDef": "The redirect vsi command redirects packets to a VSI.\nThe undo redirect vsi command cancels the VSI-based redirect configuration.\nBy default, no VSI-based redirection is configured in the traffic behavior view.",
    "CLIs": [
        "redirect vsi <vsi-name>",
        "undo redirect vsi [ <vsi-name> ]"
    ],
    "ParentView": [
        "Traffic behavior view"
    ],
    "ParaDef": [
        {
            "Parameters": "vsi-name",
            "Info": "Name of a VSI.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] vsi vsi1",
            "[*HUAWEI-vsi1] quit",
            "[*HUAWEI] traffic behavior b1",
            "[*HUAWEI-behavior-b1] redirect vsi vsi1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA group of base stations access the Router through an interface. Multiple base stations' traffic passes through this interface and does not carry VLAN tags. Therefore, the traffic cannot be distinguished. To resolve this problem, apply a traffic policy to which a redirection traffic behavior has been bound to this interface to distinguish the traffic by using a quintuple, which consists of the source IP address, destination IP address, source port number, destination port number, and protocol number. Then redirect the traffic to different VSIs.\nPrerequisites\nA VSI for redirection has been created.\nPrecautions\nYou are advised to use the redirection function only in Layer 2 forwarding scenarios.\nA traffic behavior has only one redirect configuration. To perform a new redirection configuration, delete the existing redirection configuration.\nRedirecting traffic to a VSI takes effect only on an upstream interface.\nThe traffic that matches a specified quintuple is redirected to a VSI. If this VSI goes Down, the traffic is interrupted."
}