{
    "PageTitle": "redirect to interface",
    "FuncDef": "The redirect to interface command configures an outbound interface for redirection.\nThe undo redirect to interface command deletes the configuration of redirecting traffic to an outbound interface.\nBy default, no outbound interface is configured for redirection in the traffic behavior view.",
    "CLIs": [
        "redirect to interface { <interface-name> | <interface-type> <interface-number> } [ route-forward ]",
        "undo redirect to interface [ { <interface-name> | <interface-type> <interface-number> } [ route-forward ] ]"
    ],
    "ParentView": [
        "Traffic behavior view"
    ],
    "ParaDef": [
        {
            "Parameters": "interface-type",
            "Info": "Specifies the type of an interface.\n-"
        },
        {
            "Parameters": "interface-number",
            "Info": "Specifies the number of an interface.\n-"
        },
        {
            "Parameters": "route-forward",
            "Info": "Indicates that packets are forwarded based on the normal process if all next hop interfaces configured in a discard PBR policy are Down.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic behavior b1",
            "[*HUAWEI-behavior-b1] redirect to interface GigabitEthernet 1/0/0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nRedirection is deployed in the scenario where users need to forward specific traffic to a desired next hop outbound interface instead of forwarding the traffic through a normal path. The outbound interface can be a GE interface, GE sub-interface, Eth-trunk main interface or sub-interface, POS interface, IP-Trunk interface, Serial interface, MP-group interface, VLANIF interface, BDIF interface. The redirect to interface command applies only to the directly-connected traffic forwarding scenario, that is, the scenario where a direct route is available on the outbound interface for redirection to reach the destination IP address of packets.\nPrecautions\nA traffic behavior can have only one redirect configuration. Before configuring a new redirect configuration, delete the existing redirect configuration.\nRedirecting traffic to an outbound interface takes effect only on an upstream interface."
}