{
    "PageTitle": "redirect lsp public",
    "FuncDef": "The redirect lsp public command redirects the IP data traffic to the destination LSP on the public network and forward the traffic on the MPLS network.\nThe undo redirect command cancels the configuration.\nBy default, the configuration of redirecting the IP data traffic to the destination LSP on the public network is not configured in traffic behavior view.",
    "CLIs": [
        "redirect lsp public <dest-ipv4-address> [ <nexthop-address> | interface { <interface-name> | <interface-type> <interface-number> } | secondary ]",
        "undo redirect [ lsp public ]"
    ],
    "ParentView": [
        "Traffic behavior view"
    ],
    "ParaDef": [
        {
            "Parameters": "dest-ipv4-address",
            "Info": "Specifies the address of the destination LSP.\nThe value is an IPv4 address in dotted decimal notation (X.X.X.X), for example, 10.1.1.1. The mask length of this address must be 32 bits."
        },
        {
            "Parameters": "nexthop-address",
            "Info": "Specifies the next hop address of the redirected destination LSP.\nThe value is an IPv4 address in dotted decimal notation (X.X.X.X), for example, 10.1.1.1."
        },
        {
            "Parameters": "interface-type",
            "Info": "Specifies the type of an interface.\n-"
        },
        {
            "Parameters": "interface-number",
            "Info": "Specifies the number of an interface.\n-"
        },
        {
            "Parameters": "secondary",
            "Info": "Indicates that the redirected destination LSP is a backup LSP.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic behavior b1",
            "[*HUAWEI-behavior-b1] redirect lsp public 2.2.2.2"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic behavior b1",
            "[*HUAWEI-behavior-b1] redirect lsp public 3.3.3.3 interface GigabitEthernet 2/0/0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nYou can run this command to redirect the IP data traffic to the destination LSP on the public network and forward the traffic on the MPLS network.\nPrerequisites\nThe traffic behavior is configured.\nPrecautions\nThe mask length of the IP address of the destination LSP must be 32 bits. This command can be run only on the ingress on the MPLS network. This command is forbidden on other nodes such as the transit and egress nodes. A traffic policy containing redirecting actions can be applied to only the inbound direction of an interface.\nBefore running this command, check whether the corresponding LSP exists."
}