{
    "PageTitle": "redirect ipv6 to interface",
    "FuncDef": "The redirect ipv6 to interface command specifies the outbound interface for IPv6 packet redirection.\nThe undo redirect ipv6 to interface command deletes the configuration of redirecting IPv6 packets to an outbound interface.\nBy default, no outbound interface is configured for redirection in the traffic behavior view.",
    "CLIs": [
        "redirect ipv6 to interface { <interface-name> | <interface-type> <interface-number> } [ route-forward ]",
        "undo redirect ipv6 to interface [ { <interface-name> | <interface-type> <interface-number> } [ route-forward ] ]",
        "undo ipv6 redirect"
    ],
    "ParentView": [
        "Traffic behavior view"
    ],
    "ParaDef": [
        {
            "Parameters": "route-forward",
            "Info": "Indicates that packets are forwarded based on the normal process if all next hop interfaces configured in a discard PBR policy are Down.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic behavior b1",
            "[*HUAWEI-behavior-b1] redirect ipv6 to interface GigabitEthernet 1/0/0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nRedirection is deployed in the scenario where users need to forward specific Ipv6 traffic to a desired next hop outbound interface instead of forwarding the traffic through a normal path.\nPrerequisites\nA traffic behavior profile has been created.\nConfiguration Impact\nAfter redirection to an interface is configured in the traffic behavior in a traffic policy and the traffic policy is applied to an interface, IPv6 traffic matching the traffic classifier in the traffic policy is redirected.\nPrecautions\nThe outbound interface can be a GE interface, GE sub-interface, Eth-Trunk main interface or sub-interface, POS interface, IP-Trunk interface, Serial interface, MP-group interface.\nA traffic behavior has only one IPv6 redirect configuration. To perform a new redirection configuration, delete the existing redirection configuration.\nThe redirect ipv6 to interface command applies only to the directly-connected traffic forwarding scenario, that is, the scenario where a direct route is available on the outbound interface for redirection to reach the destination IP address of packets."
}