{
    "PageTitle": "redirect vpn-group",
    "FuncDef": "The redirect vpn-group command redirects packets to a specific VPN group. In addition, you can also apply the action to a specific interface according to a traffic behavior, and redirect the traffic with a matching class.\nThe undo redirect vpn-group command deletes the configuration.\nBy default, redirecting packets to a specific VPN group is not configured in traffic behavior view.",
    "CLIs": [
        "redirect vpn-group <vpn-group-name>",
        "undo redirect [ vpn-group ]"
    ],
    "ParentView": [
        "Traffic behavior view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-group-name",
            "Info": "Specifies the name of a VPN group that packets are redirected to.\nThe value is a string of 1 to 31 case-sensitive characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] vpn-group vg1",
            "[*HUAWEI] traffic behavior b1",
            "[*HUAWEI-behavior-b1] redirect vpn-group vg1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo redirect the packets involved in the complex traffic classification to a specified VPN group, you can configure a VPN group, and then run the redirect vpn-group command to redirect the packets to the VPN group. Last, you must configure the traffic policy and apply the policy to interfaces.\nPrerequisites\nA traffic behavior is configured and the traffic behavior view is displayed.\nConfiguration Impact\nRun the command vpn-group to add the VPN instance configured in the device to a VPN group. The traffic can be redirected to a specified VPN instance by binding the VPN group into a traffic behavior. Currently, a VPN group can bind eight VPN instance.\nAfter the redirect vpn-group command is run, the device searches for the existing VPN instance that is earliest added to the VPN group:\nIf the device finds the VPN instance, the device redirects subsequent packets to this VPN instance. If the redirected packets match the FIB table, the packets can be forwarded. If the redirected packets do not match the FIB table, the packets fail to be forwarded.A VPN group may not contain any VPN instances. If the device cannot find any VPN instance in a specified VPN group, the packets are discarded.\nA device considers all VPN instances created using the ip vpn-instance command to be existing.\n\nFollow-up Procedure\nConfigure a traffic classifier and traffic policy and apply the traffic policy to interfaces.\nPrecautions\nOne traffic behavior can have only one redirect configuration. To create a redirect configuration, you must delete the existing one."
}