{
    "PageTitle": "redirect ds-domain",
    "FuncDef": "The redirect ds-domain command enables the device to redirect enterprise users in a DS domain to a specified BA classification domain.\nThe undo redirect ds-domain command restores the default configuration.\nBy default, the device is disabled from redirecting enterprise users in a DS domain to a specified BA classification domain.",
    "CLIs": [
        "redirect ds-domain <ds-domain-name>",
        "undo redirect ds-domain [ <ds-domain-name> ]"
    ],
    "ParentView": [
        "AAA domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "ds-domain-name",
            "Info": "Specifies the name of a BA classification domain.\nThe value is a string of 1 to 48 characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] diffserv domain domain2",
            "[*HUAWEI-dsdomain-domain2] quit",
            "[*HUAWEI] aaa",
            "[*HUAWEI-aaa] domain domain1",
            "[*HUAWEI-aaa-domain-domain1] commit",
            "[*HUAWEI-aaa-domain-domain1] redirect ds-domain domain2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nACK packets sent by the DHCP server carry specific Option information. If the device is configured to identify enterprise users and redirect them to a BA classification domain, run the redirect ds-domain command to specify the name of a BA classification domain. After the command is run, enterprise users are redirected to a specified BA classification domain, whereas the originally configured BA classification policy still takes effect for non-enterprise users.\nPrerequisites\nThe specified BA classification domain has been configured in the system view.The dhcp option include redirect ds-domain enable command has been run in the system view.\n\nPrecautions\nIf the command is run for more than once, the latest configuration overwrites the previous one.If the command is run for a DS domain, do not delete the specified BA classification domain in the system view.The configuration takes effect only for new users."
}