{
    "PageTitle": "redirect routing-filter",
    "FuncDef": "The redirect routing-filter command configures packets to be forwarded based on carried destination IP addresses in scenarios in which a forward policy redirects packets to the next hop whose IP address matches a default route or a black-hole route.\nThe undo redirect routing-filter command deletes the redirection configuration.\nBy default, in a scenario in which a forward policy is configured to redirect packets, packets are forwarded along the default route if the next hop IP address matches a default route and are dropped if the next hop IP address matches a black-hole route.",
    "CLIs": [
        "redirect routing-filter { default-routing | blackhole-routing } *",
        "redirect ipv6 routing-filter { default-routing | blackhole-routing } *",
        "undo redirect routing-filter",
        "undo redirect ipv6 routing-filter"
    ],
    "ParentView": [
        "Slot view"
    ],
    "ParaDef": [
        {
            "Parameters": "default-routing",
            "Info": "Indicates a default route.\n-"
        },
        {
            "Parameters": "blackhole-routing",
            "Info": "Indicates a black-hole route.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] slot 1",
            "[*HUAWEI-slot-1] redirect routing-filter default-routing blackhole-routing"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a forward policy is configured to redirect packets but the next hop IP address matches a default or black-hole route which you do not want packets to travel along, run this command to configure packets to be forwarded based on destination IP addresses.\nThis command applies only to scenarios in which a forward policy is configured to redirect packets.\nThis command applies to all packets forwarded through board interfaces.\nIn VS mode, this command applies only to the admin VSand cannot be configured in other VSs. This command takes effect on all VSs."
}