{
    "PageTitle": "remark qos-local-id",
    "FuncDef": "The remark qos-local-id command re-marks a QoS policy ID.\nThe undo remark qos-local-id command cancels the re-marking of a QoS policy ID.\nBy default, no action for re-marking a QoS policy ID is configured in a traffic behavior.",
    "CLIs": [
        "remark qos-local-id <qos-local-id-value>",
        "undo remark qos-local-id <qos-local-id-value>"
    ],
    "ParentView": [
        "Traffic behavior view"
    ],
    "ParaDef": [
        {
            "Parameters": "qos-local-id-value",
            "Info": "Specifies a QoS policy ID.\nThe value is an integer that ranges from 1 to 7."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic behavior b1",
            "[*HUAWEI-behavior-b1] remark qos-local-id 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the QoS policy ID of a VXLAN packet that matches a traffic classifier needs to be changed for a specific application, you can run the remark qos-local-id command to re-mark the QoS policy ID.\nPrecautions\nIf the remark qos-local-id command is run more than once in the same traffic behavior view, the latest configuration overrides the previous one.\nThe remark qos-local-id and remark ttl commands cannot both be configured in the same traffic behavior view.\nAfter the remark qos-local-id command is configured in a traffic behavior, the traffic policy that references the traffic behavior cannot be applied to a global UCL or ACL.\nWhen a traffic policy is applied to the VBDIF interface, VLANIF interface, PWVE interface, system, VSI, L3VPN, EVPN, VXLAN VPN, or BD view, the remark qos-local-id command cannot be configured in the corresponding traffic behavior.\nIn the inbound direction of a VXLAN tunnel, the remark qos-local-id command applies to known unicast traffic, but not to broadcast, multicast, or unknown unicast traffic.\nIn the outbound direction of a VXLAN tunnel, the remark qos-local-id command can be configured only in Layer 3 access mode.\nThe remark qos-local-id command takes effect only in VXLAN forwarding scenarios.\nIf both a QPPB policy and the remark qos-local-id command are configured, only the QPPB policy takes effect."
}