{
    "PageTitle": "remark dscp",
    "FuncDef": "The remark dscp command re-marks the DSCP value of an IPv4 or IPv6 packet.\nThe undo remark dscp command cancels the configuration.\nBy default, re-marking the DSCP value of an IPv4 or IPv6 packet is not configured in traffic behavior view.",
    "CLIs": [
        "remark dscp { <dscp-value> | af11 | af12 | af13 | af21 | af22 | af23 | af31 | af32 | af33 | af41 | af42 | af43 | cs1 | cs2 | cs3 | cs4 | cs5 | cs6 | cs7 | default | ef }",
        "remark ipv6 dscp <dscp-value>",
        "undo remark ipv6 dscp [ <dscp-value> ]",
        "undo remark dscp [ <dscp-value> | af11 | af12 | af13 | af21 | af22 | af23 | af31 | af32 | af33 | af41 | af42 | af43 | cs1 | cs2 | cs3 | cs4 | cs5 | cs6 | cs7 | default | ef ]"
    ],
    "ParentView": [
        "Traffic behavior view"
    ],
    "ParaDef": [
        {
            "Parameters": "dscp-value",
            "Info": "Specifies the DSCP value of IPv4 or IPv6 packets to be matched.\nThe value is an integer ranging from 0 to 63."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic behavior b1",
            "[*HUAWEI-behavior-b1] remark dscp ef"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic behavior b1",
            "[*HUAWEI-behavior-b1] remark ipv6 dscp 20"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe DSCP value of packets needs to be re-marked in certain cases. For example, the DSCP value has already been marked before service traffic passes the ingress (if the packets are sent from a DSCP domain or a user marks the DSCP value). The DSCP value still needs to be re-marked according to the SLA.\nTo modify the priority of IPv4 or IPv6  packets in the traffic classifier, you can run this command to re-mark the DSCP value of the packets and adjust the priority of the packets.\nPrerequisites\nThe traffic behavior is configured.\nFollow-up Procedure\nThe traffic policy is configured and applied to interfaces.\nPrecautions\nIf ipv6 is used, it indicates that the DSCP value of IPv6 packets is re-marked. If ipv6 is not used, it indicates that the DSCP value of IPv4 packets is re-marked. If the remark [ ipv6 ] dscp command is run repeatedly in the same traffic behavior view, the later configuration overrides the previous one.\nThis command re-marks only the outermost label of packets."
}