{
    "PageTitle": "syslog threshold statistics-type",
    "FuncDef": "The syslog threshold statistics-type command configures the log function in a traffic behavior.\nThe undo syslog threshold statistics-type command cancels the configuration.\nBy default, the log function is not configured in a traffic behavior.",
    "CLIs": [
        "syslog threshold <threshold-value> statistics-type { pps | Bps }",
        "undo syslog threshold <threshold-value> statistics-type { pps | Bps }"
    ],
    "ParentView": [
        "Traffic behavior view"
    ],
    "ParaDef": [
        {
            "Parameters": "threshold-value",
            "Info": "Specifies a threshold.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "pps",
            "Info": "Indicates that the packet rate is expressed in pps.\n-"
        },
        {
            "Parameters": "Bps",
            "Info": "Indicates that the packet rate is expressed in bps.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic behavior behavior1",
            "[*HUAWEI-behavior-behavior1] syslog threshold 1000 statistics-type pps"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure the log function in a traffic behavior, run the syslog threshold statistics-type command. After the log function is configured in a traffic behavior, statistics about the TCP/UDP/IP packet rate in pps or bps are collected. If the packet rate exceeds the threshold, a log is generated. You can enable the device to send the log to the log server for analysis.\nThis command takes effect only when the destination address is configured to the matching rules in a traffic behavior.\nPrecautions\nRestrictions on syslog for traffic behaviors are as follows:\nSyslog check can be implemented only when the statistics function is enabled for the traffic classifier.The traffic policy must be in unshared mode.The traffic classifier profile must be in Or mode, and ACLs have been applied to the traffic classifier profile."
}