{
    "PageTitle": "traffic-policy ac-mode",
    "FuncDef": "The traffic-policy ac-mode command applies an AC-side traffic policy to a VSI.\nThe undo traffic-policy ac-mode command deletes an AC-side traffic policy from a VSI.\nBy default, no traffic policy is applied in the VSI view.",
    "CLIs": [
        "traffic-policy <policy-name> ac-mode { inbound | outbound } [ link-layer | all-layer ]",
        "undo traffic-policy [ <policy-name> ] ac-mode { inbound | outbound } [ link-layer | all-layer ]"
    ],
    "ParentView": [
        "VSI view"
    ],
    "ParaDef": [
        {
            "Parameters": "policy-name",
            "Info": "Specifies the name of a traffic policy.\nThe value is a string of 1 to 127 case-sensitive characters."
        },
        {
            "Parameters": "inbound",
            "Info": "Applies a traffic policy to incoming traffic of a VSI.\n-"
        },
        {
            "Parameters": "outbound",
            "Info": "Applies a traffic policy to outgoing traffic of a VSI.\n-"
        },
        {
            "Parameters": "link-layer",
            "Info": "Indicates that an interface matches packets against rules and performs actions based on Layer 2 information about packets.\n-"
        },
        {
            "Parameters": "all-layer",
            "Info": "Indicates that an interface matches packets against rules and performs actions based on Layer 2 information about packets when an AC-side traffic policy is applied to its VSI. If Layer 2 information about packets fails to match rules, the interface matches the packets against rules and performs corresponding actions based on Layer 3 information about the packets.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[~HUAWEI-mpls] quit",
            "[~HUAWEI] mpls l2vpn",
            "[~HUAWEI-l2vpn] quit",
            "[~HUAWEI] vsi vsi1",
            "[*HUAWEI-vis-vsi1] traffic-policy p1 ac-mode inbound link-layer"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen a VSI is bound to multiple AC interfaces, multi-field (MF) classification needs to be configured on multiple AC interfaces if required. To reduce workload, run the traffic-policy ac-mode command in the VSI view to deliver MF classification configuration to all AC interfaces to which a VSI is bound.\nPrerequisites\nA traffic policy has been configured.\nPrecautions\nVSI ACLs support only traffic actions of permit, deny, car, broadcast-suppression , multicast-suppression, and unknown-unicast-suppression. If any other traffic action is configured in a VSI ACL, a message is displayed, indicating that the traffic policy cannot be applied to the VSI.\nWhen a VSI is bound to an AC interface that is a global VE interface, VLANIF interface, or dot1q termination sub-interface of a Layer 2 VE interface, this command cannot be configured."
}