{
    "PageTitle": "traffic classifier",
    "FuncDef": "The traffic classifier command defines a traffic classier and displays the traffic classifier view.\nThe undo traffic classifier command deletes a specified traffic classifier.\nBy default, the system predefined a traffic classifier, namely, default-class, which cannot be used for user-defined traffic classifier name.",
    "CLIs": [
        "traffic classifier <classifier-name> [ operator { and | or } ]",
        "undo traffic classifier <classifier-name>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "classifier-name",
            "Info": "Specifies the name of a traffic classier. The classifier name cannot be predefined by the system.\nThe value is a string of 1 to 127 case-sensitive characters."
        },
        {
            "Parameters": "operator",
            "Info": "Indicates the logical operator between the rules.\nIf operator is not specified, the logical relationship between rules in the traffic classifier is or by default.\n-"
        },
        {
            "Parameters": "and",
            "Info": "Indicates that the logical relationship between matching rules in a specified traffic classifier is AND. This indicates that packets are of the specified classifier only when the packets match all rules.\n-"
        },
        {
            "Parameters": "or",
            "Info": "Indicates that the logical relationship between matching rules in a specified traffic classifier is OR. This indicates that packets are of the specified classifier when the packets match any one of the rules.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic classifier class1",
            "[*HUAWEI-classifier-class1]"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo perform the same traffic policy for the traffic that matches certain rules and is classified into the same category, you can run this command to define a traffic classifier and define traffic rules in the traffic classifier.\nConfiguration Impact\nAfter a traffic classifier is defined, the traffic matching the traffic rule is performed with the traffic behavior according to the mappings between traffic behaviors and traffic classifiers in the traffic policy.\nFollow-up Procedure\nThe matching rules are defined in the traffic classifier.\nPrecautions\nUp to 16 matching rules can be defined in a traffic classifier."
}