{
    "PageTitle": "traffic-policy global-acl",
    "FuncDef": "The traffic-policy global-acl command configures a global traffic policy.\nThe undo traffic-policy global-acl command cancels a global traffic policy.\nBy default, no traffic policy is applied in the system view.",
    "CLIs": [
        "traffic-policy <policy-name> { inbound | outbound } global-acl",
        "undo traffic-policy <policy-name> { inbound | outbound } global-acl"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "policy-name",
            "Info": "Specifies the name of a traffic policy.\nThe value is a string of 1 to 127 case-sensitive characters."
        },
        {
            "Parameters": "inbound",
            "Info": "Indicates that the traffic policy is applied to incoming packets.\n-"
        },
        {
            "Parameters": "outbound",
            "Info": "Indicates that the traffic policy is applied to outgoing packets.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic policy test",
            "[*HUAWEI-trafficpolicy-test] quit",
            "[*HUAWEI] traffic-policy test inbound global-acl",
            "Warning: After this operation is performed, the global acl traffic policy becomes effective. Continue? [Y/N]:Y"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf multiple interfaces on a device receive one type of packets and these packets need to be scheduled using the same traffic policy, run the traffic-policy global-acl command to configure a global traffic policy. The traffic policy takes effect for all interfaces, improving configuration efficiency.\nPrecautions\nBoards using LPUF-50/LPUF-50-L/LPUI-21-L/LPUI-51-L/LPUF-51/LPUF-51-B/LPUI-51/LPUI-51-B/LPUS-51/LPUF-101/LPUF-101-B/LPUI-101/LPUI-101-B/LPUS-101 boards do not support global ACLs. When a board using LPUF-50/LPUF-50-L/LPUI-21-L/LPUI-51-L/LPUF-51/LPUF-51-B/LPUI-51/LPUI-51-B/LPUS-51/LPUF-101/LPUF-101-B/LPUI-101/LPUI-101-B/LPUS-101 boards is used and a command is run to configure a global ACL, a prompt message indicating this function is not supported in slot xx is displayed, and a trap is reported. When a global ACL has been configured and a board using LPUF-50/LPUF-50-L/LPUI-21-L/LPUI-51-L/LPUF-51/LPUF-51-B/LPUI-51/LPUI-51-B/LPUS-51/LPUF-101/LPUF-101-B/LPUI-101/LPUI-101-B/LPUS-101 boards is installed, a trap is reported, recording that the board does not support the global ACL.\nWhen both a global traffic policy and an interface-based traffic policy are configured, packets are preferentially matched against the rules in the global traffic policy and then those in the interface-based traffic policy.\nIf the if-match service-class { ef af1 af2 af3 af4 be cs6 cs7 } command is configured in a traffic policy and the traffic policy is globally applied, the if-match service-class command configuration does not take effect.\nThe traffic policy cannot be globally applied if the sampling mode is configured, or the redirect actions is configured, or the two-level ACLs is configured.\nIn VS mode, this command applies only to the admin VS and cannot be configured in other VSs. This command takes effect on all VSs."
}