{
    "PageTitle": "traffic-policy match-ip-layer",
    "FuncDef": "The traffic-policy match-ip-layer command configures MF traffic classification based only on IP Layer (Layer 3) information for outgoing or incoming traffic on the public network.\nThe undo traffic-policy match-ip-layer command restores the default settings.\nBy default, MF traffic classification is implemented based on Layer 2 and MPLS Layer information for outgoing or incoming traffic on the public network.",
    "CLIs": [
        "traffic-policy match-ip-layer { mpls-pop | mpls-push } *",
        "undo traffic-policy match-ip-layer [ mpls-pop | mpls-push ]"
    ],
    "ParentView": [
        "Slot view"
    ],
    "ParaDef": [
        {
            "Parameters": "mpls-pop",
            "Info": "Indicates the outgoing traffic on the public network.\n-"
        },
        {
            "Parameters": "mpls-push",
            "Info": "Indicates the incoming traffic on the public network.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] slot 1",
            "[~HUAWEI-slot-1] traffic-policy match-ip-layer mpls-pop"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe traffic-policy match-ip-layer mpls-pop command configures MF traffic classification based on IP Layer information for outgoing traffic on the public network.\nThe traffic-policy match-ip-layer mpls-push command configures MF traffic classification based on IP Layer information for incoming traffic on the public network.\nThe undo traffic-policy match-ip-layer mpls-pop command configures MF traffic classification based on Layer 2 and MPLS Layer information for outgoing traffic on the public network.\nThe undo traffic-policy match-ip-layer mpls-push command configures MF traffic classification based on Layer 2 and MPLS Layer information for incoming traffic on the public network.\nPrecautions\nThe traffic-policy match-ip-layer command takes effect for the entire board. Before running the traffic-policy match-ip-layer or undo traffic-policy match-ip-layer command, ensure the configurations on all interfaces are correct.\nThis command can be used only on the PE device"
}