{
    "PageTitle": "traffic-policy match-mpls-layer",
    "FuncDef": "The traffic-policy match-mpls-layer command configures MF classification based on both IP and MPLS information for incoming or outgoing traffic on the public network.\nThe undo traffic-policy match-mpls-layer command cancels MF classification based on MPLS information for incoming or outgoing traffic on the public network.\nBy default, MF classification is implemented based on IP information but not MPLS information for incoming or outgoing traffic on the public network.",
    "CLIs": [
        "traffic-policy match-mpls-layer { mpls-push | mpls-pop } *",
        "undo traffic-policy match-mpls-layer [ mpls-push | mpls-pop ]"
    ],
    "ParentView": [
        "Slot view"
    ],
    "ParaDef": [
        {
            "Parameters": "mpls-push",
            "Info": "Indicates the incoming traffic on the public network.\n-"
        },
        {
            "Parameters": "mpls-pop",
            "Info": "Indicates the outgoing traffic on the public network.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] slot 1",
            "[~HUAWEI-slot-1] traffic-policy match-mpls-layer mpls-push"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn the L3VPN and VPLS scenarios, if both IP traffic and MPLS traffic exist on the same PW interface in the inbound or outbound direction of the public network, to implement MF classification based on IP information for IP packets and MPLS information for MPLS packets, run the traffic-policy match-mpls-layer command.\nPrecautions\nThe traffic-policy match-mpls-layer command takes effect for the entire board. Therefore, before running the traffic-policy match-mpls-layer command, check all interface configurations and ensure that the configuration does not bring unexpected traffic matching.\nWhen both the traffic-policy match-mpls-layer command and traffic-policy policy-name { inbound | outbound } command (no other parameters are specified and ip-layer takes effect by default) are configured, the function of MF classification based on IP and MPLS information takes effect.\nThis command does not support global ACLs. When a global ACL is configured together with this command, the global ACL does not take effect by default.\nThis command is not supported on the LPUF-50/LPUF-50-L/LPUI-21-L/LPUI-51-L/LPUF-51/LPUF-51-B/LPUI-51/LPUI-51-B/LPUS-51/LPUF-101/LPUF-101-B/LPUI-101/LPUI-101-B/LPUS-101."
}