{
    "PageTitle": "traffic behavior",
    "FuncDef": "The traffic behavior command defines a traffic behavior and displays the traffic behavior view.\nThe undo traffic behavior command deletes a specified traffic behavior.\nBy default, the system predefines a traffic behavior named be. The traffic behavior name should not be the name of the traffic behavior predefined by the system.",
    "CLIs": [
        "traffic behavior <behavior-name>",
        "undo traffic behavior <behavior-name>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "behavior-name",
            "Info": "Specifies the name of a traffic behavior. The traffic behavior name should not be the name of the traffic behavior predefined by the system.\nThe value is a string of 1 to 127 case-sensitive characters with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] traffic behavior behavior1",
            "[*HUAWEI-behavior-behavior1]"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo perform the same traffic behavior for a certain traffic classifier in complex traffic classification, you can run this command to create a traffic behavior and configure traffic actions in the traffic behavior.\nFollow-up Procedure\nYou need to configure the traffic action in the traffic behavior, bind the traffic behavior and traffic classifier in the traffic policy, and apply the policy to interfaces.\nFor traffic actions that can be configured, see Traffic Classifiers and Traffic Behaviors, for details about the configuration process and related commands, see Defining a Traffic Behavior and Configuring Actions.\nPrecautions\nA traffic behavior can contain multiple traffic actions, and multiple traffic actions take effect at the same time.\nThe traffic behavior cannot be deleted after being bound to the traffic classifier in the traffic policy."
}