{
    "PageTitle": "trust 8021p remote",
    "FuncDef": "The trust 8021p remote command enables BA classification based on the 802.1p value on an interface.\nThe undo trust 8021p remote command disables BA classification based on the 802.1p value on an interface.\nBy default, 802.1p-based BA classification is not configured on an interface.",
    "CLIs": [
        "trust { 8021p | inner-8021p | outer-8021p } inbound remote",
        "undo trust { 8021p | inner-8021p | outer-8021p } inbound remote"
    ],
    "ParentView": [
        "Port extension sub-interface view",
        "Port extension interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "8021p",
            "Info": "Specifies the 802.1p field of packets which is need to map to the internal priorities.\n-"
        },
        {
            "Parameters": "inner-8021p",
            "Info": "Specifies the inner-8021p field of packets which is need to map to the internal priorities.\n-"
        },
        {
            "Parameters": "outer-8021p",
            "Info": "Specifies the outer-8021p field of packets which is need to map to the internal priorities.\n-"
        },
        {
            "Parameters": "inbound",
            "Info": "Specifies the inbound interface which enables BA classification.\n-"
        },
        {
            "Parameters": "remote",
            "Info": "Delivers BA classification on the interface of the master device to AP devices.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet2000/4/0/0.1",
            "[*HUAWEI-GigabitEthernet2000/4/0/0.1] trust upstream d1 inbound remote",
            "[*HUAWEI-GigabitEthernet2000/4/0/0.1] trust 8021p inbound remote"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter the trust 8021p command is run on an interface, the device maps the 802.1p value of packets into the internal priority when the interface functions as the inbound interface, and maps the internal priority of packets into the 8021.p value when the interface functions as the outbound interface.\nExternal interfaces of APs function as inbound interfaces of traffic. To ensure that different queues are scheduled based on priorities, BA classification for AP devices is enabled on the interface of the master device.\nPrerequisites\nBefore running this command on an interface, you need to run the trust upstream remote command to bind a DS domain to the interface. Otherwise, the configuration cannot take effect."
}