{
    "PageTitle": "trust upstream",
    "FuncDef": "The trust upstream command binds a DS domain to an interface to support BA classification and modify the priorities of IP packets and MPLS packets.\nThe undo trust upstream command unbinds a DS domain from an interface.\nBy default, no DS domain is binded to an interface.",
    "CLIs": [
        "trust upstream { 5p3d | <ds-domain-name> | default } [ inbound | outbound ]",
        "trust upstream { <ds-domain-name> | default }",
        "undo trust upstream [ inbound | outbound ]",
        "undo trust upstream"
    ],
    "ParentView": [
        "100GE interface view",
        "EVC view of a 10GE interface",
        "50GE interface view",
        "50|100GE interface view",
        "EVC view",
        "Eth-Trunk Layer 2 sub-interface view",
        "Eth-Trunk sub-interface view",
        "FlexE interface view",
        "GE electrical interface view",
        "GMPLS-UNI interface view",
        "Global MP-group interface view",
        "Global-VE layer2 subinterface view",
        "Global VE sub-interface view",
        "IP-Trunk interface view",
        "MP-group interface view",
        "POS-Trunk interface view",
        "Trunk serial interface view",
        "Tunnel interface view",
        "VE layer2 subinterface view",
        "VE sub-interface view",
        "Serial interface view",
        "Layer 2 sub-interface view",
        "EVC view of an Ethernet interface",
        "EVC view of a GE interface",
        "Bridge domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "5p3d",
            "Info": "Specifies the 5p3d DS domain, which is predefined in the system.\n-"
        },
        {
            "Parameters": "ds-domain-name",
            "Info": "Specifies the name of a DS domain. A DS domain consists of a group of connected DS nodes that provide the same service policy and implement the same PHB set.\nThe value is a string of 1 to 48 case-sensitive characters."
        },
        {
            "Parameters": "default",
            "Info": "Specifies the default DS domain, which is predefined in the system.\n-"
        },
        {
            "Parameters": "inbound",
            "Info": "Specifies the inbound direction of a interface which the DS domain is bound.\n-"
        },
        {
            "Parameters": "outbound",
            "Info": "Specifies the outbound direction of a interface which the DS domain is bound.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] diffserv domain 1",
            "[*HUAWEI-dsdomain-1] quit",
            "[*HUAWEI] interface GigabitEthernet3/0/0",
            "[*HUAWEI-GigabitEthernet3/0/0] trust upstream 1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] diffserv domain t1",
            "[*HUAWEI-dsdomain-t1] quit",
            "[*HUAWEI] interface eth-trunk 10",
            "[*HUAWEI-Eth-Trunk10] trust upstream t1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure the traffic policy based on BA classification on an interface (such as the priorities of IP packets and MPLS packets), you can configure a DS domain on the interface and configure the mappings between priorities and DS domains.\nYou can specify inbound or outbound to have the command take effect for only incoming or outgoing packets. If neither inbound nor outbound is specified, the command takes effect for both incoming and outgoing packets. If the inbound parameter is specified, the priority fields, dscp, exp, 8021p, configured in the DS domain is mapped to the internal priorities (queue, color) for the inbound interface traffic. If the outbound parameter is specified, the internal priorities (queue, color) configured in the DS domain is mapped to the priority fields, dscp, exp, 8021p, for the outbound interface traffic.\nPrerequisites\nThe DS domain specified by ds-domain-name has been created.\nPrecautions\nAfter a physical interface is added to a trunk interface, BA classification is not supported on the physical interface.\nThe command cannot be configured on VLANIF interface."
}