{
    "PageTitle": "vpn-group",
    "FuncDef": "The vpn-group command creates a VPN group and add VPN instances to the VPN group in sequence.\nThe undo vpn-group command deletes a VPN group or delete the association between a VPN group and VPN instances.\nBy default, no VPN group is configured, and VPN instances are not configured to be added to the VPN group in sequence.",
    "CLIs": [
        "vpn-group <vpn-group-name> [ vpn-instance { <vpn-name> } &<1-8> ]",
        "undo vpn-group <vpn-group-name> [ vpn-instance { <vpn-name> } &<1-8> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-group-name",
            "Info": "Specifies the name of a VPN group.\nThe name is a string of 1 to 31 characters and case sensitive. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "vpn-instance vpn-name",
            "Info": "Specifies the name of the VPN instance added to a VPN group. Up to 8 VPN instances can be added to a VPN group.\nThe name is a string of 1 to 31 characters and case sensitive. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[*HUAWEI-vpn-instance-vpna] quit",
            "[*HUAWEI] vpn-group vg1 vpn-instance vpna"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAs defined in a traffic policy, packets that match rules in complex traffic classification are redirected to specific VPN groups. You can run the vpn-group command to configure VPN groups and then configure redirection in the traffic behavior view.\nPrecautions\nThe VPN instances added to a VPN group must exist. One VPN instance can be added to different VPN groups.\nThe VPN instances in a VPN group are arranged in the configuration sequence. If a VPN group exists, when you use the vpn-group command to re-add the existing VPN instances to the VPN group, the VPN instances remain in the previous sequence.\nTo change the sequence of VPN instances in a VPN group, you need to delete the VPN instances from the VPN group and then re-add VPN instances.\nYou cannot delete a VPN group if the VPN group is in use."
}