{
    "PageTitle": "pbb binding b-evpn (I-EVPN instance view)",
    "FuncDef": "The pbb binding b-evpn command binds an I-EVPN instance to a B-EVPN instance.\nThe undo pbb binding b-evpn command restores the default configuration.\nBy default, an I-EVPN instance is not bound to any B-EVPN instance.",
    "CLIs": [
        "pbb binding b-evpn <vpn-instance-name>",
        "undo pbb binding b-evpn [ <vpn-instance-name> ]"
    ],
    "ParentView": [
        "I-EVPN instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance-name",
            "Info": "Specifies the name of a B-EVPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] evpn vpn-instance bvrf1 b-evpn",
            "[*HUAWEI-b-evpn-evpn-instance-bvrf1] route-distinguisher 100:1",
            "[*HUAWEI-b-evpn-evpn-instance-bvrf1] quit",
            "[*HUAWEI] evpn vpn-instance vrf1 i-evpn",
            "[*HUAWEI-i-evpn-evpn-instance-vrf1] pbb i-tag 100",
            "[*HUAWEI-i-evpn-evpn-instance-vrf1] pbb binding b-evpn bvrf1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo bind an I-EVPN instance to a B-EVPN instance in PBB-EVPN networking, run the pbb binding b-evpn command.\nPrecautions\nOnly an I-EVPN instance with an I-SID configured can be bound to a B-EVPN instance.\nRunning the undo pbb i-tag command unbinds an I-EVPN instance from a B-EVPN instance and deletes the B-MAC address configured for the I-EVPN instance.\nTo bind an I-EVPN instance to a new B-EVPN instance, you must run the undo pbb binding b-evpn command to unbind the I-EVPN instance from the current B-EVPN instance and then run the pbb binding b-evpn command to bind the I-EVPN instance to the new B-EVPN instance."
}