{
    "PageTitle": "rmon history",
    "FuncDef": "The rmon history command configures the RMON historical sampling function.\nThe undo rmon history command disables the RMON historical sampling function.\nBy default, no object is configured with the RMON historical sampling function.",
    "CLIs": [
        "rmon history <entry-number> buckets <number> interval <sampling-interval> [ owner <owner-name> ]",
        "undo rmon history <entry-number>"
    ],
    "ParentView": [
        "50GE interface view",
        "40GE interface view",
        "50|100GE interface view",
        "10GE interface view",
        "400GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "100GE interface view",
        "GE electrical interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "entry-number",
            "Info": "Specifies the index number of a history control table MIB entry mapped to a historical sampling object.\nThe value is an integer ranging from 1 to 65535."
        },
        {
            "Parameters": "buckets number",
            "Info": "Specifies the capacity of the history table mapped to the historical control table entry, specifically, the maximum number of records in the history table.\nThe value is an integer ranging from 1 to 10."
        },
        {
            "Parameters": "interval sampling-interval",
            "Info": "Specifies the sampling interval.\nThe value is an integer ranging from 5 to 3600, in seconds."
        },
        {
            "Parameters": "owner owner-name",
            "Info": "Specifies an owner that creates the historical sampling function.\nThe value is a string of 1 to 127 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 10GE 1/0/0",
            "[~HUAWEI-10GE1/0/0] rmon history 1 buckets 10 interval 5 owner user1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf you want the system regularly collects data about a specified interface and stores these data for future use, the rmon history command can be used to configure the RMON historical sampling function.\nPrecautions\nThe number of collected data that can be stored is determined by buckets number. When the capacity of the history table reaches the maximum, the system will delete the earliest records and store new statistics at the same time. Statistics includes the total number of packets, broadcast packets, and multicast packets received by an interface in a sampling period. You can view the historical sampling result using the display rmon history command."
}