{
    "PageTitle": "rmon alarm",
    "FuncDef": "The rmon alarm command configures RMON threshold alarm function.\nThe undo rmon alarm command disables RMON threshold alarm function.\nBy default, the RMON threshold alarm function is disabled.",
    "CLIs": [
        "rmon alarm <entry-number> <alarm-OID> <sampling-time> { delta | absolute | changeratio } rising-threshold <threshold-value1> <event-entry1> falling-threshold <threshold-value2> <event-entry2> [ startup-alarm { falling | rising | risingorfalling } ] [ owner <owner-name> ]",
        "undo rmon alarm <entry-number>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "entry-number",
            "Info": "Specifies the index number of an alarm MIB entry.\nThe value is an integer ranging from 1 to 65535."
        },
        {
            "Parameters": "alarm-OID",
            "Info": "Specifies the OID of a monitored object.\nThe name is a string of 1 to 256 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "sampling-time",
            "Info": "Specifies the sampling interval.\nThe value is an integer ranging from 5 to 65535, in seconds."
        },
        {
            "Parameters": "delta",
            "Info": "Sets the sampling type to the delta value. Specifically, the delta value of the variable in the sampling interval is extracted when the sampling time expires.\n-"
        },
        {
            "Parameters": "absolute",
            "Info": "Specifies the sampling type as absolute. Specifically, the variable value is directly extracted once when the sampling time expires.\n-"
        },
        {
            "Parameters": "changeratio",
            "Info": "Sets the sampling type to the changing ratio. Specifically, the ratio of the delta value to the sampling interval is extracted when the sampling time expires.\n-"
        },
        {
            "Parameters": "rising-threshold threshold-value1",
            "Info": "Specifies an upper threshold for the sampled value.\nThe value is an integer ranging from -2147483648 to 2147483647."
        },
        {
            "Parameters": "event-entry1",
            "Info": "Specifies the event index number mapped to the upper threshold.\nThe value is an integer ranging from 1 to 65535."
        },
        {
            "Parameters": "falling-threshold threshold-value2",
            "Info": "Specifies a lower threshold for the sampled value.\nThe value is an integer ranging from -2147483648 to 2147483647."
        },
        {
            "Parameters": "event-entry2",
            "Info": "Specifies the event index number mapped to the lower threshold.\nThe value is an integer ranging from 1 to 65535."
        },
        {
            "Parameters": "startup-alarm",
            "Info": "Indicates the type of alarm generated when a valid alarm table was sampled for the first time.\n-"
        },
        {
            "Parameters": "falling",
            "Info": "Indicates the lower-threshold-related alarm.\n-"
        },
        {
            "Parameters": "rising",
            "Info": "Indicates the upper-threshold-related alarm.\n-"
        },
        {
            "Parameters": "risingorfalling",
            "Info": "Indicates the upper- or lower-threshold-related alarm.\n-"
        },
        {
            "Parameters": "owner owner-name",
            "Info": "Specifies the owner creating the alarm function.\nThe name is a string of 1 to 127 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] rmon event 1 trap public",
            "[~HUAWEI] rmon alarm 1 1.3.6.1.6.3.1.1.5.3 30 absolute rising-threshold 500 1 falling-threshold 100 2 owner creator"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure the RMON threshold alarm function to monitor key states during system operating, run the rmon alarm command. After the RMON threshold alarm function is configured, the system will obtain the value of a monitored alarm object based on the defined interval and trigger corresponding events after performing comparison between this value and the specified threshold. A log is recorded or trap messages are sent to the NMS."
}