{
    "PageTitle": "rmon event",
    "FuncDef": "The rmon event command configures a way to process an event: to record a log or send trap messages.\nThe undo rmon event cancels the configuration.\nBy default, no event is triggered. Therefore, no log is recorded, and no trap message is sent.",
    "CLIs": [
        "rmon event <entry-number> [ description <string> ] { log | trap <object> | log-trap <object> | none } [ owner <owner-name> ]",
        "undo rmon event <entry-number>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "entry-number",
            "Info": "Specifies the index number of an event MIB entry.\nThe value is an integer ranging from 1 to 65535."
        },
        {
            "Parameters": "description string",
            "Info": "Specifies event descriptions.\nThe value is a string of 1 to 127 characters.\nWhen quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "log",
            "Info": "Logs an event.\n-"
        },
        {
            "Parameters": "trap",
            "Info": "Sends a trap message about an event to an NMS.\n-"
        },
        {
            "Parameters": "object",
            "Info": "Specifies the community name of the NMS receiving trap messages.\nThe name is a string of 1 to 127 characters."
        },
        {
            "Parameters": "log-trap",
            "Info": "Logs an even and sends a trap message to an NMS.\n-"
        },
        {
            "Parameters": "none",
            "Info": "Specifies no behaviors. If the event is triggered, the system will not handle it.\n-"
        },
        {
            "Parameters": "owner owner-name",
            "Info": "Specifies an event owner that creates the event.\nThe name is a string of 1 to 127 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] rmon event 10 trap public"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe RMON threshold alarm function triggers events. The rmon event command can be used to set a way to process the events, to record a log or send trap messages to the NMS.\nPrerequisites\nAn alarm object has been configured using the rmon alarm command after you configure the way to process a specified event."
}