{
    "PageTitle": "accounting start-fail",
    "FuncDef": "The accounting start-fail command configures a policy for an accounting start failure.\nThe undo accounting start-fail command restores the default policy for an accounting start failure.\nBy default, if the accounting server fails to start accounting, users cannot go online, value-added services will be deleted, and the offline mode is used.",
    "CLIs": [
        "accounting start-fail { online [ keep-accounting ] | offline }",
        "undo accounting start-fail"
    ],
    "ParentView": [
        "Accounting scheme view"
    ],
    "ParaDef": [
        {
            "Parameters": "online",
            "Info": "If the accounting server fails to start accounting, users keep online.\n-"
        },
        {
            "Parameters": "keep-accounting",
            "Info": "Indicates that a device stays in the accounting state and does not immediately send accounting stop packets. The device sends accounting stop packets only when users go offline or value-added services are deleted. This parameter takes effect for device and BRAS users.\nBy default, if the online parameter is specified, a device immediately sends accounting stop packets when accounting start fails.\n-"
        },
        {
            "Parameters": "offline",
            "Info": "If the accounting server fails to start accounting, users cannot go online or delete value-added services.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] accounting-scheme scheme1",
            "[*HUAWEI-aaa-accounting-scheme1] commit",
            "[~HUAWEI-aaa-accounting-scheme1] accounting start-fail online"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure a policy for an accounting start failure, run the accounting start-fail command.\nBefore running the command, enable AAA and create an accounting scheme.\nPrecautions\nThis command applies also to the accounting packet copy function."
}