{
    "PageTitle": "accounting interim-fail",
    "FuncDef": "The accounting interim-fail command configures a policy for real-time accounting failures.\nThe undo accounting interim-fail command restores the default configuration.\nBy default, if real-time accounting fails, the online policy is used.",
    "CLIs": [
        "accounting interim-fail [ max-times <times> ] { online | offline }",
        "undo accounting interim-fail"
    ],
    "ParentView": [
        "Accounting scheme view"
    ],
    "ParaDef": [
        {
            "Parameters": "max-times times",
            "Info": "Specifies the maximum number of real-time accounting failures.\nThe value is an integer ranging from 1 to 255. The default value is 3."
        },
        {
            "Parameters": "online",
            "Info": "Enables a device not to perform any processing if real-time accounting fails.\n-"
        },
        {
            "Parameters": "offline",
            "Info": "Disables a device from continuing to provide online services for users if real-time accounting fails.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] accounting-scheme scheme1",
            "[*HUAWEI-aaa-accounting-scheme1] commit",
            "[~HUAWEI-aaa-accounting-scheme1] accounting interim-fail max-times 5 offline"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen a user goes online, a device performs the corresponding operation for the user based on the accounting interim-fail command configuration if real-time accounting fails.\nPrerequisites\nAAA has been enabled, and an accounting scheme has been created.\nPrecautions\nIf the accounting interim-fail max-times online command has been run and the number of times that the device fails to send real-time accounting packets exceeds the value specified by the parameter times, the device still continues to send real-time accounting packets.\nIf the accounting interim-fail max-times offline command has been run and the number of times that the device fails to send real-time accounting packets exceeds the value specified by the parameter times, the device does not continue to provide online services for the user.\nIf RADIUS accounting is used, it is recommended that you configure the number of times that real-time accounting packets are retransmitted to be greater than the number of times that RADIUS packets fail to be retransmitted."
}