{
    "PageTitle": "acct-session-id-version",
    "FuncDef": "The acct-session-id-version command sets the version for generating the accounting session ID.\nThe undo acct-session-id-version command restores the default version for generating the accounting session ID.\nBy default, the version for generating the accounting session ID is version 1.",
    "CLIs": [
        "acct-session-id-version { version1 | version2 | version3 | version4 | version5 | version6 }",
        "acct-session-id-version { version1 | version4 | version5 } nas-logic-sysname <host-name>",
        "undo acct-session-id-version [ version6 ]"
    ],
    "ParentView": [
        "AAA view"
    ],
    "ParaDef": [
        {
            "Parameters": "version1",
            "Info": "Indicates that the accounting session ID of the user is generated by version 1.\n-"
        },
        {
            "Parameters": "version2",
            "Info": "Indicates that the accounting session ID of the user is generated by version 2.\n-"
        },
        {
            "Parameters": "version3",
            "Info": "Indicates that the accounting session ID of the user is generated by version 3.\n-"
        },
        {
            "Parameters": "version4",
            "Info": "Indicates that the accounting session ID of the user is generated by version 4.\n-"
        },
        {
            "Parameters": "version5",
            "Info": "Indicates that the accounting session ID of the user is generated by version 5.\n-"
        },
        {
            "Parameters": "version6",
            "Info": "Indicates that the accounting session ID of the user is generated by version 6.\n-"
        },
        {
            "Parameters": "nas-logic-sysname host-name",
            "Info": "Indicates that the accounting session ID of the user is generated by the host name.\nThe value is a string of 1 to 7characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] acct-session-id-version version2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe device supports six versions:\nversion1\nThis is the default version. The accounting session ID is a string of 27 to 37 bytes. On the Ethernet interface, the format of the accounting session ID is: Host name (1 to 7) + slot ID (2) + card ID (1 to 2) + port number (2 to 5) + outer VLAN ID (4) + inner VLAN ID (5) + CPUTICK (6) + user index (6). The CPUTICK value is a hex numeral, whereas the user index is Base62 encoding, and the other values are decimal numerals.The card ID is 1 or 2 bytes. If the port number has only 1 byte, a zero is added ahead to supplement the length; otherwise, the actual port number is used in the accounting session ID. If the host name has more than 7 bytes, only the leftmost 7 bytes are used in the accounting session ID; otherwise, the actual host name is used.\nversion2\nThe accounting session ID of this version consists of 16 bytes. On the Ethernet interface, the format of the accounting session ID is: Outer VLAN ID (4) + CPUTICK (6) + user index (6). The CPUTICK value is a hex numeral, whereas the user index is Base62 encoding, and the other values are decimal numerals.\nversion3\nThe accounting session ID of this version consists of 8 bytes. On the Ethernet interface, the format of the accounting session ID is: CPUTICK (2) + user index (6). The CPUTICK value is a hex numeral, whereas the user index is Base62 encoding.\nversion4\nThe accounting session ID is 15 bytes long, the format of the accounting session ID is: host name(7)+sequence number(2)+user index(6). The user index is Base62 encoding.\n7-byte host name: If the length of the host name is less than 7 bytes, 0s are added to supplement the length; if the length of the host name is more than 7 bytes, only the first 7 bytes are used. When nas logic-sysname is configured on the BAS interface, the name of the BAS interface is used.\n2-byte sequence number: The value is an accumulative value and is a string of two visible ASCII characters {'!'-'~'} except '?'. The last two bytes of the random number is used as the original value.\nversion5\nThe accounting session ID of this version consists of a maximum of 44 bytes. The format of the accounting session ID is: Host name (7 bytes) + space + interface information (separated by a slash) + a period (.) + CPUTICK (4 bytes) + VLAN/PVC IDs (separated by a period) + a colon (:) + CID.\nFor example, the format of the accounting session ID of an Ethernet interface is:\nR7 eth0/4/0/4.72F1:4094.4093:123456\nFor example, the format of the accounting session ID of a tunnel interface is:\nR7 tunnel1/15/16383.2d3b:0.0:152576\nversion6\nThe accounting session ID of this version consists of a maximum of 44 bytes. The format of the accounting session ID is: Host name (7 bytes) +> + slot number (2 bytes) +> + card number (1 to 2 bytes) + port number (2 to 5 bytes) +> + outer VLAN ID (4 bytes) +> + inner VLAN ID (5 bytes) +> + CPUTICK (6 bytes) +> + user index (6 bytes).\nThe CPUTICK value is a hex numeral, whereas the user index is Base62 encoding.\nIf a logical host name has been configured in the interface view or the remote backup profile view, this logical host name takes precedence over the one specified in this command.\nThe accounting session ID format configured by this command does not take effect for EDSG services. The EDSG services use the accounting session ID in the following format: Host name(7)+ slot ID (2)+ card ID (1)+ port number (2)+ SSG(3)+ Service ID(6)+CPUTICK(6)+user index(6).\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}