{
    "PageTitle": "accounting-mode",
    "FuncDef": "The accounting-mode command configures an accounting mode used by the current accounting scheme.\nBy default, the non-accounting mode is used for default0, and the RADIUS accounting mode is used for default1 and a user-defined accounting scheme.",
    "CLIs": [
        "accounting-mode { hwtacacs | radius | none }"
    ],
    "ParentView": [
        "Accounting scheme view"
    ],
    "ParaDef": [
        {
            "Parameters": "hwtacacs",
            "Info": "Indicates Huawei Terminal Access Controller Access Control System (HWTACACS) accounting.\nHWTACACS uses TCP as the transport protocol. TCP provides high reliability for accounting information exchange but requires greater cost.\n-"
        },
        {
            "Parameters": "radius",
            "Info": "Indicates Remote Authentication Dial in User Service (RADIUS) accounting.\nRADIUS uses UDP as the transport protocol. UDP requires less cost but provides low reliability for accounting information exchange.\nIn VS mode, this parameter is supported only by the admin VS.\n-"
        },
        {
            "Parameters": "none",
            "Info": "Indicates that accounting is not performed.\nThis mode is intended for administrators, or to daily-fee, monthly-fee, and yearly-fee users. Accounting packets are not needed for these users.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] accounting-scheme scheme1",
            "[*HUAWEI-aaa-accounting-scheme1] accounting-mode hwtacacs"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo ensure operating income, accounting on online users must be performed.\nWhen a user gets online and passes authentication and authorization, accounting on the user is started. When the user gets offline, accounting will stop. A client sends accounting packets that record the online period of users to an accounting server.\nAt present, accounting is performed on only administrators, such as Telnet and FTP users.\nPrerequisites\nWhen the accounting-mode command is used to configure an accounting mode used by a RADIUS or an HWTACACS accounting scheme, you must configure the RADIUS or HWTACACS server template in the system view in advance, specify accounting servers, and apply the template in the user domain view.\nFollow-up Procedure\nAn accounting mode configured in the accounting scheme can be used to perform accounting on users of a domain only after the accounting scheme is bound to the domain."
}