{
    "PageTitle": "login-failed threshold-alarm",
    "FuncDef": "The login-failed threshold-alarm command configures the alarm and clear alarm thresholds for unsuccessful login attempts within a specified period.\nThe undo login-failed threshold-alarm command restores the default setting.\nBy default, an alarm is generated when 30 or more unsuccessful login attempts occur within 5 minutes; a clear alarm is generated when less than 20 unsuccessful login attempts occur within 5 minutes.",
    "CLIs": [
        "login-failed threshold-alarm upper-limit <report-times> lower-limit <resume-times> period <period>",
        "undo login-failed threshold-alarm"
    ],
    "ParentView": [
        "AAA view"
    ],
    "ParaDef": [
        {
            "Parameters": "lower-limit resume-times",
            "Info": "Specifies the clear alarm threshold for unsuccessful login attempts.\nThe value is an integer ranging from 0 to report-times. For example, if report-times is 50, resume-times ranges from 0 to 50. If report-times is 0, the configuration is the same as that when resume-times is 1. In this case, a clear alarm is generated when no login failure occurs."
        },
        {
            "Parameters": "period period",
            "Info": "Specifies the period.\nThe value is an integer ranging from 1 to 120, in minutes. If upper-limit report-times is 0, the period configuration does not take effect."
        },
        {
            "Parameters": "upper-limit report-times",
            "Info": "Specifies the alarm threshold for unsuccessful login attempts.\nThe value is an integer ranging from 0 to 100. If the value 0 is specified, no alarm is generated for unsuccessful login attempts."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] login-failed threshold-alarm upper-limit 20 lower-limit 10 period 3"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo trigger alarms when unsuccessful login attempts of management users frequently occur, run the login-failed threshold-alarm command. Within the parameter , when the number of a management user's unsuccessful login attempts is greater than or equal to the parameter , the alarm AAA_1.3.6.1.4.1.2011.5.2.2.2.0.31 hwAdminLoginFailed is generated; when the number of a management user's unsuccessful login attempts is less than the parameter , the clear alarm AAA_1.3.6.1.4.1.2011.5.2.2.2.0.32 hwAdminLoginFailedClear is generated.\nPrecautions\nThe  value must be greater than or equal to the  value."
}