{
    "PageTitle": "authening authen-fail",
    "FuncDef": "The authening authen-fail command configures a policy to be adopted after user authentication fails.\nThe undo authening authen-fail command restores the default setting.\nBy default, a user goes offline after an authentication failure.",
    "CLIs": [
        "authening authen-fail { offline | online authen-domain <domain-name> }",
        "undo authening authen-fail"
    ],
    "ParentView": [
        "Authentication scheme view"
    ],
    "ParaDef": [
        {
            "Parameters": "offline",
            "Info": "Forces the users failing authentication to go offline.\n-"
        },
        {
            "Parameters": "online",
            "Info": "Allows users failing authentication to remain online.\n-"
        },
        {
            "Parameters": "authen-domain domain-name",
            "Info": "Specifies a domain that is used for controlling the access right of a user who fails authentication but remains online. This domain is created through the domain domain-name command. This domain must exist. Commonly, a UCL is configured in this domain to control the access right of a user.\nThe name of this domain is a string of 1 to 64 characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] authentication-scheme a1",
            "[*HUAWEI-aaa-authen-a1] commit",
            "[~HUAWEI-aaa-authen-a1] authening authen-fail online authen-domain default0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe authening authen-fail command, you can make a user to go offline or redirect a user to a domain with limited rights, such as a domain which can access only the intranet and cannot access the Internet, when this user fails authentication. The authening authen-redirect online authen-domain command, you can redirect a user to a domain with limited rights when the user quota is used up.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}