{
    "PageTitle": "authorization-cmd no-response-policy",
    "FuncDef": "The authorization-cmd no-response-policy command configures a policy used when the command line-based authorization mode.\nThe undo authorization-cmd no-response-policy command restores the default setting.\nBy default, the policy is used to keep the user online though the authorization fails.",
    "CLIs": [
        "authorization-cmd no-response-policy online",
        "authorization-cmd no-response-policy offline",
        "authorization-cmd no-response-policy offline max-times <max-times-value>",
        "undo authorization-cmd no-response-policy"
    ],
    "ParentView": [
        "Authorization scheme view"
    ],
    "ParaDef": [
        {
            "Parameters": "offline",
            "Info": "Indicates that the user is offline when the authorization fails.\n-"
        },
        {
            "Parameters": "max-times max-times-value",
            "Info": "Specifies the number of times of failed authorization.\nThe number should be an integer within 1 to 10. The default value of times of failed authorization is 5."
        },
        {
            "Parameters": "online",
            "Info": "Indicates that the user is online when the authorization fails.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] authorization-scheme scheme1",
            "[*HUAWEI-aaa-author-scheme1] authorization-cmd no-response-policy offline max-times 3"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThis command is used only when the authorization fails because the TACACS server fails or the local user is not configured. The following cases cannot trigger using the policy:\nWhen the TACACS server works normally, the input command fails to pass the authorization.When the TACACS server fails, the command-line based authorization mode is changed to the local authorization mode. The authorization remains failed because the input command level is higher than that configured on the local end."
}