{
    "PageTitle": "authentication-scheme (AAA view)",
    "FuncDef": "The authentication-scheme command creates an authentication scheme and enters the authentication scheme view.\nThe undo authentication-scheme command cancels an authentication scheme.\nBy default, there are three authentication schemes named default (local radius authentication), default0 (local authentication) and default1 (radius authentication). Default authentication schemes can be modified but cannot be deleted.",
    "CLIs": [
        "authentication-scheme <scheme-name>",
        "undo authentication-scheme <scheme-name>"
    ],
    "ParentView": [
        "AAA view"
    ],
    "ParaDef": [
        {
            "Parameters": "scheme-name",
            "Info": "Specifies the name of an authentication scheme.\nThe value is a string of 1 to 32 case-insensitive characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] authentication-scheme newscheme"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] authentication-scheme default"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nYou can configure up to 32 authentication schemes for the system.\nPrecautions\nIf the HWTACACS server is Down, unreachable, or does not respond in time, the command authorization fails, and no user can execute such command.\nCommand-line-based authorization is not associated with any authorization mode.\nTo configure command-line-based authorization for users at levels 3 to 15, set the parameter privilege-level to 3 in the authorization-cmd command for all such users if the command-privilege level rearrange command is not run in the system view, but set the parameter privilege-level to the specific level at which target users reside if the command-privilege level rearrange command is run in the system view. For example, to configure hwtacacs authorization for users at level 4, run the authorization-cmd 3 hwtacacs command if the command-privilege level rearrange command is not run, but run the authorization-cmd 4 hwtacacs command if the command-privilege level rearrange command is run."
}