{
    "PageTitle": "display aaa statistics",
    "FuncDef": "The display aaa statistics accounting command displays statistics on accounting packets.\nThe display aaa statistics authentication command displays statistics on authentication packets.",
    "CLIs": [
        "display aaa statistics { authentication | accounting } [ domain <domain-name> ]",
        "display aaa statistics { authentication | accounting } [ domain <domain-name> ] slave",
        "display aaa statistics"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "authentication",
            "Info": "Displays the statistics on authentication packets.\n-"
        },
        {
            "Parameters": "accounting",
            "Info": "Displays the statistics on accounting packets (only accounting start and accounting stop packets are included, and real-time accounting packets are excluded).\n-"
        },
        {
            "Parameters": "domain domain-name",
            "Info": "Displays the authentication or accounting packets in a specified domain. domain-name specifies a domain name.\nThe asterisk (*), question mark (?), or quotation marks (\"\") cannot be used in a domain name. The value is a string of 1 to 64 case-insensitive characters."
        },
        {
            "Parameters": "slave",
            "Info": "Displays the authentication or accounting packets on slave board.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display aaa statistics authentication domain default1",
            "Domain-name                     : default1                                    ",
            "  authentication request          : 15                                           ",
            "  authentication response accepts : 0                                            ",
            "  authentication response rejects : 15",
            "------------------------------------------------------------------------------"
        ],
        [
            "<HUAWEI> display aaa statistics accounting domain default1",
            "Domain-name                     : default1                                    ",
            "  accounting request              : 9                                            ",
            "  accounting response success     : 9                                            ",
            "  accounting response failures    : 0",
            "------------------------------------------------------------------------------"
        ]
    ],
    "ExtraInfo": "The display aaa statistics command can be used to display the number of PPPoE, IPoE, FTP, SSH, and Telnet users that are on line and the number of all online users.\nThe AAA module statistics are periodically backed up. After a master/slave switchover is performed, the AAA module statistics before the switchover differ from that after the switchover because the periodical backup time is not reached.\nThe display aaa statistics command can be used to display the statistics on all authentication or accounting packets in a specified domain. The statistics include those on authentication request packets, authentication success response packets, and authentication failure response packets or accounting request packets, accounting success response packets, and accounting failure response packets..\nTo collect statistics on authentication or accounting packets for a specific period of time, run the reset aaa statistics command to clear the existing statistics."
}