{
    "PageTitle": "accounting-scheme (AAA domain view)",
    "FuncDef": "The accounting-scheme command specifies an accounting scheme for the current domain.\nThe undo accounting-scheme command restores the default accounting scheme.\nBy default, the default0 accounting scheme is used for the default0 domain, the default1 accounting scheme is used for the default1 domain, the default0 accounting scheme is used for the Default_admin domain, and the default1 accounting scheme is used for a user-defined domain.",
    "CLIs": [
        "accounting-scheme <accounting-scheme-name>",
        "undo accounting-scheme"
    ],
    "ParentView": [
        "AAA domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "accounting-scheme-name",
            "Info": "Specifies the name of the accounting scheme.\nThe value is a string of 1 to 32 case-insensitive characters. It cannot contain slash (\\), anti-slash (/), colon (:), asterisk (*), question mark (?), quotation mark (\"), angle brackets (< >), (|) and spaces."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] accounting-scheme newscheme",
            "[*HUAWEI-aaa-accounting-newscheme] quit",
            "[*HUAWEI-aaa] domain huawei",
            "[*HUAWEI-aaa-domain-huawei] accounting-scheme newscheme"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo ensure operating income, accounting on online users must be performed. After an accounting scheme and an accounting mode are configured, the accounting mode can be used to perform accounting on users in a domain only after the accounting scheme is bound to the domain using the accounting-scheme command.\nPrerequisites\nBefore using the accounting-scheme command, you must create an accounting scheme and specify an accounting mode.\nFollow-up Procedure\nAfter an accounting scheme is specified for a domain by using the accounting-scheme command, the domain can use the accounting scheme to perform accounting on the domain users."
}