{
    "PageTitle": "authentication-scheme",
    "FuncDef": "The authentication-scheme command sets an authentication scheme for the current domain.\nThe undo authentication-scheme command restores the default setting.\nBy default, if the default1 accounting scheme is used for a domain, the default1 authentication mode is used; if the default0 accounting scheme is used for a domain, the default0 authentication mode is used; if the default_admin accounting scheme is used for a domain, the default authentication mode is used; if a user-defined accounting scheme is used for a domain, the default1 authentication mode is used.",
    "CLIs": [
        "authentication-scheme <scheme-name>",
        "undo authentication-scheme"
    ],
    "ParentView": [
        "AAA domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "scheme-name",
            "Info": "Specifies the name of an authentication scheme.\nThe value is a string of 1 to 32 case-insensitive characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] authentication-scheme test",
            "[*HUAWEI-aaa-authen-test] quit",
            "[*HUAWEI-aaa] domain Huawei",
            "[*HUAWEI-aaa-domain-huawei] authentication-scheme test"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter you use the authentication-scheme command to associate a domain with a certain authentication scheme, the system can use this authentication scheme for user authentication.\nBefore using the authentication-scheme command, ensure that an authentication scheme has been created.\nPrecautions\nIf the HWTACACS server is Down, unreachable, or does not respond in time, the command authorization fails, and no user can execute such command.\nCommand-line-based authorization is not associated with any authorization mode.\nTo configure command-line-based authorization for users at levels 3 to 15, set privilege-level to 3 in the authorization-cmd command for all such users if the command-privilege level rearrange command is not run in the system view, but set privilege-level to the specific level at which target users reside if the command-privilege level rearrange command is run in the system view. For example, to configure hwtacacs authorization for users at level 4, run the authorization-cmd 3 hwtacacs command if the command-privilege level rearrange command is not run, but run the authorization-cmd 4 hwtacacs command if the command-privilege level rearrange command is run."
}