{
    "PageTitle": "domainname-parse-direction",
    "FuncDef": "The domainname-parse-direction command configures the direction in which the domain name is parsed so that the system can correctly parse the user name and domain name.\nThe undo domainname-parse-direction command restores the default setting.\nBy default, the domain name is parsed from left to right.",
    "CLIs": [
        "domainname-parse-direction <domainParseDir>",
        "undo domainname-parse-direction"
    ],
    "ParentView": [
        "AAA view"
    ],
    "ParaDef": [
        {
            "Parameters": "domainParseDir",
            "Info": "Specifies the direction of parsing the domain name.\nThe value is an enumerated type and can be:\nleft-to-right:Indicates that the domain name is parsed from left to right.right-to-left:Indicates that the domain name is parsed from right to left."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] domainname-parse-direction left-to-right"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen a user name contains multiple domain name delimiters, such as user1@abcd@domain1, run the domainname-parse-direction command to configure the direction in which the domain name is parsed. Use user1@abcd@domain1 as an example. When the domain name is parsed from left to right, the first delimiter @ from the left is considered the domain name delimiter. When the domain name is parsed from right to left, the first delimiter @ from the right is considered the domain name delimiter. The other delimiters are considered part of the user name or domain name.\nPrecautions\nThe domainname-parse-direction command configuration applies to the currently online users. After the domainname-parse-direction command is run, the accounting and recording functions for online users will comply with the new parsing direction, causing a parsing failure. Therefore, running the domainname-parse-direction command when no user is online is recommended."
}