{
    "PageTitle": "user-password expire prompt (Local AAA server view)",
    "FuncDef": "The user-password expire prompt command sets the password validity period and the period for advance warning before the password expires.\nThe undo user-password expire command cancels the configuration.\nBy default, the configured password does not expire.",
    "CLIs": [
        "user-password expire <expire-days> prompt <prompt-days>",
        "undo user-password expire"
    ],
    "ParentView": [
        "Local AAA server view"
    ],
    "ParaDef": [
        {
            "Parameters": "expire-days",
            "Info": "Specifies the password validity period.\nThe value is an integer in the ranging from 0 to 365.\nIf the value is 0, it means that the password never expires."
        },
        {
            "Parameters": "prompt prompt-days",
            "Info": "Specifies the period for advance warning before the password expires.\nThe value is an integer in the ranging from 0 to 180."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] local-aaa-server",
            "[~HUAWEI-local-aaa-server] user-password expire 90 prompt 7"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo prevent account stealing due to unchanged passwords, run the\nuser-password expire command to set the password validity period and the period for advance warning before the password expires.\nExpiration time is calculated from when the account was created.\nPrerequisites\nA local user has logged in to the device as an administrator.\nConfiguration Impact\nThe user-password expire command applies only to administrators. The system prompts the administrator to change the password N days before the password expires.If the administrator does not change the password till the password expires, the administrator is denied access to the device.\n\nPrecautions\nThe parameter expire-days must be greater than or equal to the parameter prompt-days.The user-password expire command that is configured in the AAA view or local AAA server view takes effect only for users in the specific view and does not affect another in the other view."
}