{
    "PageTitle": "hwtacacs-server authentication",
    "FuncDef": "The hwtacacs-server authentication command configures the primary and secondary HWTACACS authentication server for the template.\nThe undo hwtacacs-server authentication command deletes the primary HWTACACS authentication server from the template.\nBy default, no HWTACACS authentication server is configured.",
    "CLIs": [
        "hwtacacs-server authentication <ip-address>",
        "hwtacacs-server authentication <ip-address> secondary",
        "hwtacacs-server authentication <ip-address> <port>",
        "hwtacacs-server authentication <ip-address> { shared-key { <key-string> | cipher <key-string> } | mux-mode | { vpn-instance <vpn-name-val> | public-net } } *",
        "hwtacacs-server authentication <ip-address> <port> { shared-key { <key-string> | cipher <key-string> } | mux-mode | { vpn-instance <vpn-name-val> | public-net } } *",
        "hwtacacs-server authentication <ip-address> <port> secondary",
        "hwtacacs-server authentication <ip-address> { shared-key { <key-string> | cipher <key-string> } | mux-mode | { vpn-instance <vpn-name-val> | public-net } } * secondary",
        "hwtacacs-server authentication <ip-address> <port> { shared-key { <key-string> | cipher <key-string> } | mux-mode | { vpn-instance <vpn-name-val> | public-net } } * secondary",
        "undo hwtacacs-server authentication",
        "undo hwtacacs-server authentication <ip-address>",
        "undo hwtacacs-server authentication <ip-address> secondary",
        "undo hwtacacs-server authentication <ip-address> <port>",
        "undo hwtacacs-server authentication <ip-address> [ <port> ] { mux-mode | { vpn-instance <vpn-name-val> | public-net } } *",
        "undo hwtacacs-server authentication <ip-address> <port> secondary",
        "undo hwtacacs-server authentication <ip-address> [ <port> ] { mux-mode | { vpn-instance <vpn-name-val> | public-net } } * secondary"
    ],
    "ParentView": [
        "HWTACACS server template view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address",
            "Info": "Specifies the IP address of a server.\nThe value is in dotted decimal notation and must be a valid unicast address."
        },
        {
            "Parameters": "secondary",
            "Info": "Sets the secondary HWTACACS server for the template.\n-"
        },
        {
            "Parameters": "port",
            "Info": "Specifies the port number of a server.\nIt is an integer data type. The value range is from 1 to 65535. By default, the value is 49."
        },
        {
            "Parameters": "shared-key",
            "Info": "Specifies the shared-key.\n-"
        },
        {
            "Parameters": "key-string",
            "Info": "Specifies the shared key in encrypted or plain text.\nThe value is a string of case-sensitive characters that can be letters or digits. Spaces are not supported. The password can be a string of 1 to 255 characters in plain text or a string of 20 to 432 characters in encrypted text.\nThe new password is at least eight characters long and contains at least two of the following types: upper-case letters, lower-case letters, digits, and special characters."
        },
        {
            "Parameters": "cipher key-string",
            "Info": "Specifies the shared-key in encrypted or plain text, and the configured text will be displayed as encrypted text.\nCipher-string is a string of case-sensitive characters that can be letters or digits. Spaces are not supported. The password can be a string of 1 to 255 characters in plain text or a string of 20 to 432 characters in encrypted text.\nThe new password is at least eight characters long and contains at least two of the following types: upper-case letters, lower-case letters, digits, and special characters, except the question mark (?) and space."
        },
        {
            "Parameters": "mux-mode",
            "Info": "Sets the multiplexing mode for HWTACACS server.\n-"
        },
        {
            "Parameters": "vpn-instance vpn-name-val",
            "Info": "Specifies the VPN instance name.\nIf the parameter vpn-instance is specified, the server is mapped to a VPN instance.\nIf vpn-instance-name does not exist, the configuration is invalid.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "public-net",
            "Info": "Indicates that the HWTACACS authentication server on the public network is connected.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] hwtacacs-server template htipl",
            "[*HUAWEI-hwtacacs-htipl] hwtacacs-server authentication 10.164.155.13 1010"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe IP addresses of the primary and the secondary authentication servers must be different; otherwise, the server configuration fails.\nIf the command is used repeatedly, the new configuration supersedes the previous one.\nThis server can be deleted only when it is not used in any active TCP connection for sending the authentication packets.\nThe IP address and port number of the authentication servers must be unique within the template for successful configuration.\nWhen HWTACACS authentication is used for management users, you are advised to configure the user locking mechanism on the HWTACACS server. If the user locking mechanism is not configured, brute force cracking may occur."
}