{
    "PageTitle": "hwtacacs-server shared-key (HWTACACS server template view)",
    "FuncDef": "The hwtacacs-server shared-key command configures the shared key for HWTACACS server.\nThe undo hwtacacs-server shared-key command removes the configured shared key of the HWTACACS server. Configuring a private key improves the security of intercommunication between the device and HWTACACS server.\nBy default, the shared key is not configured.",
    "CLIs": [
        "hwtacacs-server shared-key <key-string>",
        "hwtacacs-server shared-key cipher <cipher-string>",
        "undo hwtacacs-server shared-key"
    ],
    "ParentView": [
        "HWTACACS server template view"
    ],
    "ParaDef": [
        {
            "Parameters": "key-string",
            "Info": "Specifies the shared key in encrypted or simple text.\nThe shared key configured in simple text is displayed in ciphertext.\nThe value is a string of case-sensitive characters that can be letters or digits. The password can be a string of 1 to 255 characters in simple text or a string of 20 to 432 characters in encrypted text.The value cannot contain question marks (?) or spaces. However, when double quotation marks are used around a password, spaces are allowed in the password."
        },
        {
            "Parameters": "cipher cipher-string",
            "Info": "Specifies the shared-key in ciphertext.\nThe value is a string of case-sensitive characters that can be letters or digits. The password can be a string of 1 to 255 characters in simple text or a string of 20 to 432 characters in encrypted text.The value cannot contain question marks (?) or spaces. However, when double quotation marks are used around a password, spaces are allowed in the password."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] hwtacacs-server template htipl",
            "[*HUAWEI-hwtacacs-htipl] hwtacacs-server shared-key cipher Hello-huawei13579"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe shared key encrypts the HWTACACS packets. While sending the authentication packets to the clients, the HWTACACS server encrypts the important information. The shared key on the device must be identical for successful authentication.\nThe shared key set on the Router and the HWTACACS server must be the same.\nYou can change the shared key and the new shared key can be used for new requests."
}