{
    "PageTitle": "hwtacacs-server accounting",
    "FuncDef": "The hwtacacs-server accounting command configures the primary and secondary HWTACACS accounting server for the template.\nThe undo hwtacacs-server accounting command deletes the primary HWTACACS accounting server from the template.\nBy default, if secondary parameter is not specified, the primary server is configured.",
    "CLIs": [
        "hwtacacs-server accounting <ip-address>",
        "hwtacacs-server accounting <ip-address> secondary",
        "hwtacacs-server accounting <ip-address> <port>",
        "hwtacacs-server accounting <ip-address> { shared-key { <key-string> | cipher <key-string> } | mux-mode | { vpn-instance <vpn-name-val> | public-net } } *",
        "hwtacacs-server accounting <ip-address> <port> { shared-key { <key-string> | cipher <key-string> } | mux-mode | { vpn-instance <vpn-name-val> | public-net } } *",
        "hwtacacs-server accounting <ip-address> <port> secondary",
        "hwtacacs-server accounting <ip-address> { shared-key { <key-string> | cipher <key-string> } | mux-mode | { vpn-instance <vpn-name-val> | public-net } } * secondary",
        "hwtacacs-server accounting <ip-address> <port> { shared-key { <key-string> | cipher <key-string> } | mux-mode | { vpn-instance <vpn-name-val> | public-net } } * secondary",
        "undo hwtacacs-server accounting",
        "undo hwtacacs-server accounting <ip-address>",
        "undo hwtacacs-server accounting <ip-address> secondary",
        "undo hwtacacs-server accounting <ip-address> <port>",
        "undo hwtacacs-server accounting <ip-address> [ <port> ] { mux-mode | { vpn-instance <vpn-name-val> | public-net } } *",
        "undo hwtacacs-server accounting <ip-address> <port> secondary",
        "undo hwtacacs-server accounting <ip-address> [ <port> ] { mux-mode | { vpn-instance <vpn-name-val> | public-net } } * secondary"
    ],
    "ParentView": [
        "HWTACACS server template view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address",
            "Info": "Specifies the IP addresses of the HWTACACS server.\nThe value is in dotted decimal notation. It must be a valid unicast address."
        },
        {
            "Parameters": "secondary",
            "Info": "Indicates the secondary HWTACACS server.\nIf the parameter secondary is not specified, the IP address is assigned to the primary HWTACACS accounting server.If the parameter secondary is specified, the IP address is assigned to the secondary HWTACACS accounting server.\n-"
        },
        {
            "Parameters": "port",
            "Info": "Specifies the port number of the HWTACACS server.\nThe value is an integer ranging from 1 to 65535. The default value is 49."
        },
        {
            "Parameters": "shared-key",
            "Info": "Specifies the shared key.\n-"
        },
        {
            "Parameters": "key-string",
            "Info": "Specifies the shared key in encrypted or plain text.\nThe value is a string of case-sensitive characters that can be letters or digits. Spaces are not supported. The password can be a string of 1 to 255 characters in plain text or a string of 20 to 432 characters in encrypted text.\nThe new password is at least eight characters long and contains at least two of the following types: upper-case letters, lower-case letters, digits, and special characters."
        },
        {
            "Parameters": "cipher key-string",
            "Info": "Specifies the shared-key in encrypted or plain text, and the configured text will be displayed as encrypted text.\nCipher-string is a string of case-sensitive characters that can be letters or digits. Spaces are not supported. The password can be a string of 1 to 255 characters in plain text or a string of 20 to 432 characters in encrypted text.\nThe new password is at least eight characters long and contains at least two of the following types: upper-case letters, lower-case letters, digits, and special characters, except the question mark (?) and space."
        },
        {
            "Parameters": "mux-mode",
            "Info": "Indicates that the HWTACACS server works in multiplex mode.\n-"
        },
        {
            "Parameters": "vpn-instance vpn-name-val",
            "Info": "Specifies the VPN instance name.\nIf the parameter vpn-instance is specified, the server is mapped to a VPN instance.\nIf vpn-instance-name does not exist, the configuration is invalid.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "public-net",
            "Info": "Indicates that the HWTACACS accounting server on the public network is connected.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] hwtacacs-server template test1",
            "[*HUAWEI-hwtacacs-test1] hwtacacs-server accounting 10.163.155.12 49"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen user accounting needs to be performed, you can run the hwtacacs-server accounting command to assign an IP address to the primary or secondary HWTACACS accounting server.\nPrerequisites\nThe HWTACACS server template is correctly configured.\nConfiguration Impact\nIf the hwtacacs-server accounting command runs for multiple times, the latest configuration overrides the previous ones.\nPrecautions\nThe IP address of the primary HWTACACS accounting server must be different from that of the secondary HWTACACS accounting server. Otherwise, the system prompts that the configuration fails.The HWTACACS accounting server can be deleted only when it is not used in any active TCP connection for sending accounting packets."
}