{
    "PageTitle": "local-user service-type(AAA view)",
    "FuncDef": "The local-user service-type command sets an access type for a local user.\nThe undo local-user service-type command restores the default setting.\nBy default, a local user cannot use any access type.",
    "CLIs": [
        "local-user <user-name> service-type { { terminal | telnet | ftp | ssh | qx | snmp | mml | http } * | ppp }",
        "local-user <user-name> service-type none",
        "local-user <user-name> service-type { terminal | telnet | ftp | ppp | ssh | qx | snmp | mml | http } *",
        "local-user <user-name> service-type all",
        "undo local-user <user-name> service-type"
    ],
    "ParentView": [
        "AAA view"
    ],
    "ParaDef": [
        {
            "Parameters": "user-name",
            "Info": "Specifies the user name.\nThe value is a string of 1 to 253 case-insensitive characters without spaces. If the value includes @, the characters before @ are the user name and the characters after @ are the domain name. If the value excludes @ or the domain name does not exist, the entire string is the user name and the user belongs to the default domain. A user name cannot contain two or more @s.\nWhen the user security policy is configured, the value is a string of 6 to 253 characters. When the user security policy is not configured, the value is a string of 1 to 253 characters.\nThe user name cannot contain spaces or the following special characters: /, \\, :, *, ?, \", <, >, |, @, ', %."
        },
        {
            "Parameters": "terminal",
            "Info": "Sets the access type of the local user to Terminal.\nIn VS mode, this parameter is supported only by the admin VS.\n-"
        },
        {
            "Parameters": "telnet",
            "Info": "Sets the access type of the local user to Telnet. Commonly, the network administrator' s access type is Telnet.\nIf telnet is configured, please enable the telnet server function.\n-"
        },
        {
            "Parameters": "ftp",
            "Info": "Sets FTP as an access type for the local user.\n-"
        },
        {
            "Parameters": "ssh",
            "Info": "Sets the access type of the local user to SSH.\n-"
        },
        {
            "Parameters": "snmp",
            "Info": "Sets the access type of the local user to SNMP.\n-"
        },
        {
            "Parameters": "qx",
            "Info": "Sets the access type of the local user to QX.\nIn VS mode, this parameter is supported only by the admin VS.\n-"
        },
        {
            "Parameters": "http",
            "Info": "Sets the access type of the local user to HTTP.\n-"
        },
        {
            "Parameters": "mml",
            "Info": "Sets the access type of the local user to MML.\nIn VS mode, this parameter is supported only by the admin VS.\n-"
        },
        {
            "Parameters": "ppp",
            "Info": "Sets the access type of the local user to PPP.\nThis parameter is mutually exclusive with other user types.\n-"
        },
        {
            "Parameters": "none",
            "Info": "Sets the access type of the local user to none.\n-"
        },
        {
            "Parameters": "all",
            "Info": "Sets the access type of the local user to all.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] local-user Hello123@huawei.net password irreversible-cipher Hello-13579",
            "[~HUAWEI-aaa] local-user Hello123@huawei.net service-type ssh"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter passing the authentication of a certain mode, a local user may access the device through Telnet and modify the device configuration. To exclude this possibility, you need to run the local-user service-type command to limit the access type of the local user. The system provides management of user access types. After the access type of a local user is set, the user can access the device only when the actual user access type is the same as the preset one.\nPrecautions\nA local user attribute change does not apply to online users. The change takes effect after the online users relog in.\nThe Terminal, Telnet and FTP access types pose a security risk, and therefore the SSH access type is recommended."
}