{
    "PageTitle": "user-password change(AAA view)",
    "FuncDef": "The user-password change command enables the system to prompt the local administrator to change the initial password when the local administrator logs in to the device. The configuration takes effect when the local administrator logs in to the device next time.\nThe undo user-password change command disables the system from prompting the local administrator to change the initial password when the local administrator logs in to the device. The configuration takes effect when the local administrator logs in to the device next time.\nBy default, the system does not prompt the local administrator to change the initial password when the local administrator logs in to the device.",
    "CLIs": [
        "user-password change",
        "undo user-password change"
    ],
    "ParentView": [
        "AAA view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] user-password change"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo enable the system to prompt the local administrator to change the initial password upon the next login, run the user-password change command.In the AAA view, the administrator with the highest level of permissions can run the local-user password [ cipher irreversible-cipher ] command to configure an initial password.\nPrerequisites\nA local user has logged in to the device as an administrator.\nConfiguration Impact\nThe user-password change command applies only to administrators. If an administrator does not change the initial password, the system prompts the administrator to change it upon each login. A local administrator can run the local-user change-password command to change the password.\nPrecautions\nThe user-password change command that is configured in the AAA view or local AAA server view takes effect only for users in the specific view and does not affect another in the other view."
}