{
    "PageTitle": "local-user aging",
    "FuncDef": "The local-user aging command sets the aging period of a local user account.\nThe undo local-user aging command restores the default setting.\nBy default, a local user account does not age.",
    "CLIs": [
        "local-user <user-name> aging <aging-period>",
        "undo local-user <user-name> aging"
    ],
    "ParentView": [
        "AAA view"
    ],
    "ParaDef": [
        {
            "Parameters": "user-name",
            "Info": "Specifies a user name.\nThe value is a string of 1 to 253 case-insensitive characters without spaces. If the value includes @, the characters before @ are the user name and the characters after @ are the domain name. If the value excludes @ or the domain name does not exist, the entire string is the user name and the user belongs to the default domain. A user name cannot contain two or more @s."
        },
        {
            "Parameters": "aging-period",
            "Info": "Specifies the aging period.\nThe value is an integer ranging from 0 to 365, in days."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] local-user username aging 90"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo age a local user account that has been idle for a long time, run the local-user aging command. If a user account keeps being idle for a configured aging period, the user account automatically ages.\nWhen the user-aging command is used to configure the aging period for all users,\nIf the local-user aging command is not run, the aging time configured using the user-aging command takes effect.If the local-user aging command is run, the aging time configured using the local-user aging command takes effect.\nYou can run the display local-user command to view the start aging time of the local user.\n\nConfiguration Impact\nAfter the configured aging period elapses, users using the local user account fail to log in.\nA local user attribute change does not apply to online users. The change takes effect after the online users relog in."
}