{
    "PageTitle": "local-user access-limit",
    "FuncDef": "The local-user access-limit command sets the maximum number of connections that a local user can establish. After the upper limit is reached, subsequent connections that the user established will be rejected.\nThe undo local-user access-limit command deletes the maximum number of connections that a user can establish.\nBy default, no maximum number of connections that a local user can establish is set.",
    "CLIs": [
        "local-user <user-name> access-limit <max-number>",
        "undo local-user <user-name> access-limit"
    ],
    "ParentView": [
        "AAA view"
    ],
    "ParaDef": [
        {
            "Parameters": "user-name",
            "Info": "Specifies the name of a user.\nThe value is a string of 1 to 253 case-insensitive characters without spaces. If the value includes @, the characters before @ are the user name and the characters after @ are the domain name. If the value excludes @ or the domain name does not exist, the entire string is the user name and the user belongs to the default domain. A user name cannot contain two or more @s."
        },
        {
            "Parameters": "max-number",
            "Info": "Specifies the maximum number of connections that a local user can establish.\nThe value is an integer ranging from 1 to 262144."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] local-user user13579 password irreversible-cipher Hello-13579",
            "[~HUAWEI-aaa] local-user user13579 access-limit 10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo facilitate the user access management, run the local-user access-limit command to set the maximum number of connections that a local user can establish. After the maximum number of connections that a local user can establish is reached, the login attempts of additional users that use the user name will be denied.\nPrerequisites\nThe user name must have been created using the local-user password command before the local-user access-limit command is run.\nConfiguration Impact\nf the maximum number of connections is set for a nonexistent local user, the system informs that the user name does not exist.A local user attribute change does not apply to online users. The change takes effect after the online users relog in."
}