{
    "PageTitle": "local-user login-period",
    "FuncDef": "The local-user login-period command configures the period during which a local user is allowed to log in.\nThe undo local-user login-period command restores the default setting.\nBy default, the period during which a local user is allowed to log in is not configured.",
    "CLIs": [
        "local-user <user-name> login-period <begin-time> to <end-time> <begin-day> to <end-day>",
        "undo local-user <user-name> login-period"
    ],
    "ParentView": [
        "AAA view"
    ],
    "ParaDef": [
        {
            "Parameters": "user-name",
            "Info": "Specifies the user name.\nThe value is a string of 1 to 253 case-insensitive characters without spaces. If the value includes @, the characters before @ are the user name and the characters after @ are the domain name. If the value excludes @ or the domain name does not exist, the entire string is the user name and the user belongs to the default domain. A user name cannot contain two or more @s."
        },
        {
            "Parameters": "begin-time",
            "Info": "Specifies the start time.\nThe value is expressed in the format of HH:MM:SS. HH:MM:SS specifies the hour, minute, and second. The value ranges from 00:00:00 to 23:59:59."
        },
        {
            "Parameters": "end-time",
            "Info": "Specifies the end time.\nThe value is expressed in the format of HH:MM:SS. HH:MM:SS specifies the hour, minute, and second. The value ranges from 00:00:00 to 23:59:59. End time must be later than start time."
        },
        {
            "Parameters": "begin-day",
            "Info": "Specifies the start day.\nThe value can be Mon, Tue, Wed, Thu, Fri, Sat, and Sun. Note that the week runs from Sunday to Saturday."
        },
        {
            "Parameters": "end-day",
            "Info": "Specifies the end day.\nThe value can be Mon, Tue, Wed, Thu, Fri, Sat, and Sun. Note that the week runs from Sunday to Saturday. End day must be later than start day."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] local-user hellouser1 password irreversible-cipher Hello-13579",
            "[~HUAWEI-aaa] local-user hellouser1 login-period 8:00:00 to 18:00:00 Mon to Sat"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo allow a local user to log in during a specified period, run the local-user login-period command.\nPrecautions\nThe local-user login-period command configures the Coordinated Universal Time (UTC) time.\nAfter the configured period elapses, the online user is logged out.\nIf the local-user login-period command is run more than once, the latest configuration overrides the previous one.\nA local user attribute change does not apply to online users. The change takes effect after the online users relog in."
}