{
    "PageTitle": "local-user password expire",
    "FuncDef": "The local-user password expire command configures the period after which a password expires.\nThe undo local-user password expire command restores the default setting.\nBy default, a password never expires.",
    "CLIs": [
        "local-user <user-name> password expire <days>",
        "undo local-user <user-name> password expire"
    ],
    "ParentView": [
        "AAA view"
    ],
    "ParaDef": [
        {
            "Parameters": "user-name",
            "Info": "Specifies the user name.\nThe value is a string of 1 to 253 case-insensitive characters without spaces. If the value includes @, the characters before @ are the user name and the characters after @ are the domain name. If the value excludes @ or the domain name does not exist, the entire string is the user name and the user belongs to the default domain. A user name cannot contain two or more @s.\nWhen the user security policy is configured, the value is a string of 6 to 253 characters. When the user security policy is not configured, the value is a string of 1 to 253 characters.\nThe user name cannot contain spaces or the following special characters: /, \\, :, *, ?, \", <, >, |, @, ', %."
        },
        {
            "Parameters": "days",
            "Info": "Specifies the remaining days.\nThe value is an integer ranging from 0 to 999.\nIf the value is 0, it means that the password never expires."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] local-user user13579 password irreversible-cipher Hello-13579",
            "[~HUAWEI-aaa] local-user user13579 password expire 90"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo harden network security, administrators can run the local-user password expire command to configure the period after which a password expires.\nWhen the password is changed, the system resets the period.\nAfter a password expires, reconfigure a new password for users. Otherwise, users fail to log in.\nYou can run the user-password expire prompt command to configure the password expiration time and the number of days before the password expires for the system to prompt users to change their passwords. When the password is not expired, you can run the local-user change-password command to change the password. After the password is changed, the system re-calculates the password expiration time. After a password is expired, a new password needs to be configured for the account by another administrator.\nPrerequisites\nA local user has been created.\nPrecautions\nA local user attribute change does not apply to online users. The change takes effect after the online users relog in."
}