{
    "PageTitle": "parse-priority",
    "FuncDef": "The parse-priority command configures the sequence of parsing the user account.\nThe undo parse-priority command restores the default configuration.\nBy default, the system parses the domain name first.",
    "CLIs": [
        "parse-priority <parse-type>",
        "undo parse-priority"
    ],
    "ParentView": [
        "AAA view"
    ],
    "ParaDef": [
        {
            "Parameters": "parse-type",
            "Info": "Specifies the type of parsing the user name and domain name.\nThe value is an enumerated type and can be:\ndomain-first:Indicates to parse the domain name first.realm-first:Indicates to parse the realm name first."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] parse-priority realm-first"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe device can parse the user name and domain name according to the domain name delimiter and realm delimiter. The parsed user name and domain name are determined by the domain name delimiter, domain name position, domain name parsing direction, realm name delimiter, realm name position, realm name parsing direction, and parsing sequence. The rules for parsing the account are as follows:\nIf the realm name delimiter is configured, and the domain-first keyword is specified, the system parses the realm name according to the realm name delimiter, realm name parsing direction, and position of the realm domain name. The system parses the string excluding the realm name and realm name delimiter.If the realm name delimiter is not configured, the router parses the domain name and the user name according to the domain name delimiter, domain name position, and the parsing direction.If the realm-first keyword is specified and the user account contains the realm name delimiter that is configured in the system, the router parses the account according to the realm name delimiter, realm name position, and parsing direction of the realm name. In this case, the router does not consider the domain name delimiter, domain name position, and the parsing direction of the domain name.If the realm-first keyword is specified but the user account does not contain the realm name delimiter configured in the system, the router parses the account according to the domain name delimiter, domain name position, and the parsing direction of the domain name."
}