{
    "PageTitle": "radius-server domain-annex",
    "FuncDef": "The radius-server domain-annex command adds string information to the left/right side of a domain name when the device sends authentication and accounting request packets to the RADIUS server.\nThe command undo radius-server domain-annex restores to the default setting.\nBy default, no information is added to the left/right side of a domain name when the device sends authentication and accounting request packets to the RADIUS server.",
    "CLIs": [
        "radius-server domain-annex { left | right } <annex-string>",
        "undo radius-server domain-annex"
    ],
    "ParentView": [
        "AAA domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "left",
            "Info": "Annex string in the domain name left.\n-"
        },
        {
            "Parameters": "right",
            "Info": "Annex string in the domain name right.\n-"
        },
        {
            "Parameters": "annex-string",
            "Info": "Specifies the string added to the DHCP option 125 attribute.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. The characters can be a combination of letters (including A to Z and a to z), digits (0 to 9), dot (.), hyphen (-), and underscore (_)."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] domain huawei",
            "[*HUAWEI-aaa-domain-huawei] radius-server domain-annex left zj."
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe radius-server domain-annex command can be used to add string information to the left/right side of a domain name when the device sends authentication and accounting request packets to the RADIUS server.\nConfiguration Impact\nAfter the radius-server domain-annex is run, the domain name carried in the user name will be changed by adding a configured string to the left/right side of the domain name. So the configuration of this command cannot be deleted or modified when there are online users.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}