{
    "PageTitle": "radius-server nas-port-id include",
    "FuncDef": "The radius-server nas-port-id include command configures the format of the NAS-Port-Id attribute sent by a non-LNS device to the RADIUS server.\nThe undo radius-server nas-port-id command deletes the configured format of the NAS-Port-Id attribute sent by a non-LNS device to the RADIUS server.\nBy default, the device retains the format of the NAS-Port-Id attribute to be sent to the RADIUS server.",
    "CLIs": [
        "radius-server nas-port-id include [ delimiter <delimiter-val> ] { interface-description [ delimiter <int-delimiter-val> ] | pe-vlan [ delimiter <pevlan-delimiter-val> ] | ce-vlan [ delimiter <cevlan-delimiter-val> ] } *",
        "undo radius-server nas-port-id"
    ],
    "ParentView": [
        "RADIUS server group view"
    ],
    "ParaDef": [
        {
            "Parameters": "delimiter-val",
            "Info": "Specifies a delimiter.\nThe value is b, *, -, \\, #, $, @, &, :."
        },
        {
            "Parameters": "interface-description",
            "Info": "Indicates the description of an interface.\n-"
        },
        {
            "Parameters": "ce-vlan",
            "Info": "Indicates the inner VLAN ID of a user.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] radius-server group test2",
            "[*HUAWEI-radius-test2] commit",
            "[~HUAWEI-radius-test2] radius-server nas-port-id include interface-description delimiter - pe-vlan delimiter - ce-vlan delimiter -"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the RADIUS server has special requirements on the format of the NAS-Port-Id attribute, run the radius-server nas-port-id lns or radius-server nas-port-id command to configure the format of the NAS-Port-Id attribute as required.\nConfiguration Impact\nIf the radius-server nas-port-id lns or radius-server nas-port-id command is run more than once in the same view, the latest configuration overrides the previous one. After the radius-server nas-port-id lns or radius-server nas-port-id command is run, the NAS-Port-Id attribute is sent to the RADIUS server in the configured format."
}