{
    "PageTitle": "radius-server packet statistics algorithm",
    "FuncDef": "The radius-server packet statistics algorithm command configures a mode for collecting statistics about RADIUS authentication request and response packets.\nThe undo radius-server packet statistics algorithm command restores the default mode for collecting statistics about RADIUS authentication request and response packets.\nBy default, the radiusAccClientRequests object of the MIB collects statistics about authentication request packets, and the radiusAccClientResponses object of the MIB collects statistics about authentication success packets. In the display radius-server packet ip-address ip-address authentication command output, the Access Requests field indicates the number of authentication request packets, and the Access Accepts field indicates the number of authentication success packets.",
    "CLIs": [
        "radius-server packet statistics algorithm { version1 | version2 }",
        "undo radius-server packet statistics algorithm [ version1 | version2 ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "version1",
            "Info": "Collects statistics about RADIUS authentication request and response packets in the version1 collection mode.\n-"
        },
        {
            "Parameters": "version2",
            "Info": "Collects statistics about RADIUS authentication request and response packets in the version2 collection mode.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] radius-server packet statistics algorithm version1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen a RADIUS server is connected to a non-Huawei device that functions as an NMS, run the radius-server packet statistics algorithm command to configure a mode for collecting statistics about RADIUS authentication request and response packets.\nConfiguration Impact\nIf version1 is specified in the radius-server packet statistics algorithm command, the radiusAccClientRequests object of the MIB collects statistics about authentication request packets and retransmitted authentication request packets, and the radiusAccClientResponses object of the MIB collects all authentication response packets, including authentication success, failure, and challenge packets and incorrect response packets. In the display radius-server packet ip-address authentication command output, the Access Requests field indicates the number of authentication request packets, and the Access Accepts field indicates the number of authentication success packets.\nIf version2 is specified in the radius-server packet statistics algorithm command, the radiusAccClientRequests object of the MIB collects statistics about authentication request packets and retransmitted authentication request packets, and the radiusAccClientResponses object of the MIB collects all authentication response packets, including authentication success, failure, and challenge packets and incorrect response packets. In the display radius-server packet ip-address authentication command output, the Access Requests field indicates the sum number of authentication request packets and retransmitted authentication request packets, and the Access Accepts field indicates the sum number of all authentication response packets, including authentication success, failure, and challenge packets and incorrect response packets.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}