{
    "PageTitle": "redirect-domain effect-attribute",
    "FuncDef": "The redirect-domain effect-attribute command enables specified fields to take effect in a domain that CoA delivers or a domain to which users are directed after they use up quotas.\nThe undo redirect-domain effect-attribute command disables configured fields from taking effect in the domain that CoA delivers or a domain to which users are directed after they use up quotas.\nBy default, when a user's domain is switched using CoA messages, the system updates the user's domain information instead of the domain name in the user name. The system still uses the configurations in the original domain for other parameters. When a user is redirected after quota exhaustion, the system updates the user's user group information instead of the user's domain information. The system still uses the configurations in the original domain for other parameters.",
    "CLIs": [
        "redirect-domain effect-attribute { user-group | web-url | qos-profile | ip-unr-tag }",
        "redirect-domain effect-attribute accounting-scheme",
        "undo redirect-domain effect-attribute { user-group | web-url | qos-profile | ip-unr-tag }",
        "undo redirect-domain effect-attribute accounting-scheme"
    ],
    "ParentView": [
        "AAA domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "user-group",
            "Info": "Enables the user group to take effect.\n-"
        },
        {
            "Parameters": "web-url",
            "Info": "Enables the redirection URL to take effect.\n-"
        },
        {
            "Parameters": "qos-profile",
            "Info": "Enables the QoS profile to take effect.\n-"
        },
        {
            "Parameters": "ip-unr-tag",
            "Info": "Enables the UNR tag to take effect.\n-"
        },
        {
            "Parameters": "accounting-scheme",
            "Info": "Enables the accounting scheme to take effect.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] domain domain1",
            "[*HUAWEI-aaa-domain1] commit",
            "[~HUAWEI-aaa-domain1] redirect-domain effect-attribute accounting-scheme"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo enable specified fields to take effect in a domain delivered in CoA messages or a domain to which users are directed after they use up quotas, run the\nredirect-domain effect-attribute command in either of the following scenarios:\nDuring user service domain switching, a RADIUS server uses CoA to deliver a domain for users so that the domain attributes are applied to users to change user behaviors such as access permission, accounting status, and access rate.After user quotas are used up, the NE40E directs users to another domain to change user behaviors such as access permission, accounting status, and access rate, and determines whether to direct users to a Web page for adding their funds.\n\nConfiguration Impact\nAfter the redirect-domain effect-attribute command is used, and at least one field is specified, users can be directed to another domain if they use up quotas.\nAfter the redirect-domain effect-attribute accounting-scheme command is used and takes effect, the user accounting scheme will switch to another scheme and, the user accounting ID will change in the domain that CoA delivers or in a redirection domain.\nIf the redirect-domain effect-attribute command is not used and, only the user group ID changes, users will not be directed to another domain after they use up quotas.\nIf the redirect-domain effect-attribute command is run more than once, the latest configuration does not override previous one.\nIf user-group, web-url, qos-profile, accounting-scheme, or ip-unr-tag is specified in the redirect-domain effect-attribute command but is not configured in the domain delivered in CoA messages or the redirection domain, the field will not take effect.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}