{
    "PageTitle": "user-security-policy enable",
    "FuncDef": "The user-security-policy enable command configures a user security policy.\nThe undo user-security-policy enable command cancels the configuration.\nBy default, a user security policy is configured.",
    "CLIs": [
        "user-security-policy enable",
        "undo user-security-policy enable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] user-security-policy enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo prevent account stealing due to simple passwords, run the user-security-policy enable command to configure a user security policy.\nPrerequisites\nA level-3 or higher-level local user has logged in to the device.\nConfiguration Impact\nAfter the user-security-policy enable command is run, the user name and password in the AAA view or local AAA server view must comply with the following rules:\nA local user name must be longer than five characters.For passwordsA password must contain at least eight characters.A password must consist of digits, upper- and lower-case letters, and special characters (not including spaces or question marks. However, when quotation marks (\") are used around the password, spaces are allowed in the password).A password cannot contain the user name nor the reverse of the user name.A password cannot be the same as any of the most recent passwords including the current password.\n\n\nPrecautions\nAfter the password is reset, the user is required to change the password upon the first login.\nIf the login password does not satisfy the user security policy, the system prompts you to change your password. Change your password based on the prompted message.\nThe undo user-security-policy enable command deletes a security policy for local user names and passwords, which reduces local user account security. Therefore, configuring a local user account security policy is recommended.The user-security-policy enable command takes effect for new users and does not affect existing users.\nAfter you configure the user-security-policy enable command, the restrictions on local user names and passwords are as follows:\nThe restrictions on local user names take effect when a new user account is created and do not affect existing users in the system.The restrictions on local user passwords take effect when a new user account is created or a user password is modified. Existing users can use their passwords to log in to the device even if their passwords do not meet the restrictions, but the system prompts the users to modify their passwords.\nA changed local account irreversible password will be saved as a ciphertext password that cannot be used for CHAP authentication users, such as PPP users. But a changed local account of reversible password will be saved as a ciphertext password that can be used for CHAP authentication users when a user password is modified, the old password should be input."
}