{
    "PageTitle": "task",
    "FuncDef": "The task command adds a task to a task group.\nThe undo task command deletes a task from a task group.\nBy default, tasks in a task group can be added only by users in the administrator user group on a PS, or a VS. Users in other user groups cannot add tasks.",
    "CLIs": [
        "task <task-name> { read | write | execute | debug } *",
        "undo task <task-name>"
    ],
    "ParentView": [
        "Task group view"
    ],
    "ParaDef": [
        {
            "Parameters": "task-name",
            "Info": "Indicates the name of a task.\nIt is a string of 1 to 32 characters. You can enter the command followed by a space and a question mark (?) to view command help information and obtain the value range."
        },
        {
            "Parameters": "read",
            "Info": "Indicates that users in a user group have the right to read commands in the task. The task command with the parameter read does not change configurations.\n-"
        },
        {
            "Parameters": "write",
            "Info": "Indicates that users in a user group have the right to write commands in the task. The task command with the parameter write does not change configurations.\n-"
        },
        {
            "Parameters": "execute",
            "Info": "Indicates that users in a user group have the right to execute commands in the task. execute is applicable to location and diagnosis commands excluding the display and debugging commands. The task command with the parameter execute does not change configurations.\n-"
        },
        {
            "Parameters": "debug",
            "Info": "Indicates that users in a user group have the right to run debugging commands.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] task-group ospf_tg",
            "[*HUAWEI-aaa-task-group-ospf_tg] task ospf execute read write"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo ensure security, different users are granted with different permissions. You can run the task command to configure the access authority for certain task group. Therefore, the relevant users in the task group can have the access authority specified for the task.\nBy default, users have permission for specific tasks after a task group is created.\ninterface-mgr: Users with this permission are allowed to read, write, and execute interface-specific configurations.config: Users with this permission are allowed to read, write, and execute system-based configurations.vlan: Users with this permission are allowed to read, write, and execute VLAN-specific configurations.shell: Users with this permission are allowed to read, write, and execute device access configurations, for example, Telnet-based access configurations.cli: Users with this permission are allowed to read and execute basic configurations, for example, using display commands to query information.\n\nPrerequisites\nYou have created a task group and accessed the task group view.\nPrecautions\nBy default, tasks in a task group can be added only by users in the administrator user group on a PS, or a VS. Users in other user groups cannot add tasks.\nThe task-name is system-defined and cannot be created or deleted. You can run the display task to view information about all tasks in the system."
}