{
    "PageTitle": "batch-task task-name-list",
    "FuncDef": "The batch-task task-name-list command sets permissions for tasks in batches.",
    "CLIs": [
        "batch-task { read | write | execute | debug } * task-name-list { <task-name> } &<1-20>"
    ],
    "ParentView": [
        "Task group view"
    ],
    "ParaDef": [
        {
            "Parameters": "read",
            "Info": "Indicates that users in a user group associated with a task have a permission to use commands of the read type in the task. Executing the commands of the read type does not change configurations.\n-"
        },
        {
            "Parameters": "write",
            "Info": "Indicates that users in a user group associated with a task have a permission to use commands of the write type in the task. Executing the commands of the write type changes configurations.\n-"
        },
        {
            "Parameters": "execute",
            "Info": "Indicates that users in a user group associated with a task have a permission to use commands of the execute type in the task. Troubleshooting and maintenance commands, excluding display and debugging commands, are of the execute type. Executing the commands of the execute type does not change configurations.\n-"
        },
        {
            "Parameters": "debug",
            "Info": "Indicates that users in a user group associated with a task have a permission to use commands of the debug type in the task. Only debugging and undo debugging commands are of the debug type.\n-"
        },
        {
            "Parameters": "task-name-list task-name",
            "Info": "Specifies the name of a task.\nThe value is a string of 1 to 32 characters. You can enter the command followed by a space and a question mark (?) to view command help information and obtain the value range."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] task-group 1",
            "[*HUAWEI-aaa-task-group-1] batch-task read task-name-list interface-mgr aaa config"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo ensure security, different users are granted with different permissions. You can run the task (task group view) command to set permissions for a task group so that users associated with this task group are granted with the set permissions. The batch-task command sets permissions for tasks in batches to reduce configuration workload.\nPrerequisites\nA task group has been created, and the task group view is displayed."
}