{
    "PageTitle": "task-group",
    "FuncDef": "The task-group command creates a task group or accesses the task group view.\nThe undo task-group command deletes a task group.\nBy default, the following task groups are available: manage-tg, system-tg, monitor-tg, and visit-tg.",
    "CLIs": [
        "task-group <task-group-name>",
        "undo task-group <task-group-name>"
    ],
    "ParentView": [
        "AAA view"
    ],
    "ParaDef": [
        {
            "Parameters": "task-group-name",
            "Info": "Indicates the name of a task group.\nThe value is a string of 1 to 32 characters containing letters, digits, and underscores (_). The value can not contain the following characters or symbols: \\, /, :, *, | , ?, \", <, >"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] task-group ospf_tg"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen the rights of the system default task group fail to meet your demand, you can create a new task group and allocate required rights (tasks) to the new task group. In this manner, user rights can be controlled in a more flexible way.\nPrerequisites\nThe task group to be deleted exists.\nImplementation Procedure\nCreating a task group: If the task group to be created exists, the task group view is displayed; if the task group to be created does not exist, a new task group view is created.Deleting a task group: If the task group to be deleted exists, it is deleted; if the task group to be deleted does not exist, the system prompts an error.\n\nFollow-up Procedure\nAllocate required rights (tasks) to the new task group.\nPrecautions\nAfter configuring task-group command to create a task group, the following configurations are automatically created under the task group.\n#\ntask interface-mgr read write execute\ntask config read write execute\ntask vlan read write execute\ntask shell read write execute\ntask cli read execute\n#\nThe default task group cannot be deleted. When the number of task groups reaches the system threshold, no more task groups can be created."
}