{
    "PageTitle": "include task-group",
    "FuncDef": "The include task-group command configures the authority of the current task group to contain the authority of a specific task group.\nThe undo include task-group command cancels the configuration.\nBy default, the authority of a task group does not contain the authority of another task group.",
    "CLIs": [
        "include task-group <task-group-name>",
        "undo include task-group <task-group-name>"
    ],
    "ParentView": [
        "Task group view"
    ],
    "ParaDef": [
        {
            "Parameters": "task-group-name",
            "Info": "Specifies the name of a task group.\nThe value is a string of 1 to 32 characters containing letters, digits, and underscores (_). The value can not contain the following characters or symbols: \\, /, :, *, | , ?, \", <, >"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] task-group tg1",
            "[*HUAWEI-aaa-task-group-tg1] quit",
            "[*HUAWEI-aaa] task-group group1",
            "[*HUAWEI-aaa-task-group-group1] include task-group tg1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo allow the authority of the current task group to contain the authority of another task group or the current task group to inherit the authority of an existing task group, run the include task-group command.\nIf the authority of the contained task group changes, the authority of the current task group will change.\nPrerequisites\nThe contained task group must have existed. To be specific, the contained task group must have been configured or is the default task group.\nPrecautions\nEach task group is allowed to contain only one task group. Before changing the contained task group, run the undo include task-group command to remove the contained task group from the current task group.The default task group cannot contain other task groups.A maximum of four-layer include relationships are supported. To be specific, a maximum of A(B(C(D))) is supported. Task group A contains task group B, task group B contains task group C, and task group C contains task group D.A task group cannot contain another task group that has directly or indirectly contained it. For example, A(B(A)) is not supported. When task group B contains task group A, task group A cannot contain task group B. A(B(C(A))) is not supported neither. When task group B contains task group C and task group C contains task group A, task group A cannot contain task group B."
}