{
    "PageTitle": "include user-group",
    "FuncDef": "The include user-group command configures the authority of the current user group to contain the authority of a specific user group.\nThe undo include user-group command cancels the configuration.\nBy default, the authority of a user group does not contain the authority of another user group.",
    "CLIs": [
        "include user-group <user-group-name>",
        "undo include user-group <user-group-name>"
    ],
    "ParentView": [
        "User group view"
    ],
    "ParaDef": [
        {
            "Parameters": "user-group-name",
            "Info": "Specifies the name of a user group.\nTo configure a user group, run the user-group command. By default, four user groups (manage-ug, system-ug, monitor-ug, and visit-ug) are available.\nThe value is a string of 1 to 32 characters containing letters, digits, and underscores (_). The value cannot contain the following characters or symbols: \\, /, :, *, | , ?, \", <, >"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] user-group ug1",
            "[*HUAWEI-aaa-user-group-ug1] quit",
            "[*HUAWEI-aaa] user-group group1",
            "[*HUAWEI-aaa-user-group-group1] include user-group ug1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo allow the authority of the current user group to contain the authority of another user group or the current user group to inherit the authority of an existing user group, run the include user-group command.\nThe authority of a user group is determined by that of the user group it contains. If the authority of the contained user group changes, the authority of the current user group will change.\nPrerequisites\nThe contained user group must have existed. To be specific, the contained user group must have been configured or is the default user group.\nPrecautions\nEach user group is allowed to contain only one user group. Before changing the contained user group, run the undo include user-group command to remove the contained user group from the current user group.The default user group cannot contain other user groups.A maximum of four-layer include relationships are supported. To be specific, a maximum of A(B(C(D))) is supported. User group A contains user group B, user group B contains user group C, and user group C contains user group D.A user group cannot contain another user group that has directly or indirectly contained it. For example, A(B(A)) is not supported. When user group B contains user group A, user group A cannot contain user group B. A(B(C(A))) is not supported neither. When user group B contains user group C and user group C contains user group A, user group A cannot contain user group B."
}