{
    "PageTitle": "user",
    "FuncDef": "The user command adds or modifies a local user account.\nThe undo user command cancels the configuration.\nThe default attributes of a user account are as follows: access type: - (no access type allowed), status: blocked (a blocking of 5 minutes for local administrative users in case of three login failures), idle-cut: disabled; intercommunication group number: 0; maximum number of connections: 24; MAC restrict: disabled; UCL group number: 0; traffic control: disabled; user priority: 0.",
    "CLIs": [
        "user <username> { password { cipher <cipher-password> | irreversible-cipher <irreversible-password> } | authentication-type <type-mask> | { active | block [ fail-times <fail-times-value> interval <interval-value> ] } | ftp-directory <ftp-directory> | level <level> | callback-nocheck | callback-number <callback-number> | idle-cut | qos-profile <qos-profile-name> | ip-address <ip-address> [ vpn-instance <vpn-instance> ] | user-group <user-group-name> } *",
        "user <username> password",
        "user <username> expire <expiretime>",
        "undo user <username> [ authentication-type | ftp-directory | level | callback-nocheck | callback-number | idle-cut | qos-profile | ip-address | user-group ]",
        "undo user <username> expire [ <expiretime> ]"
    ],
    "ParentView": [
        "Local AAA server view"
    ],
    "ParaDef": [
        {
            "Parameters": "username",
            "Info": "Specifies the user name.\nThe value is a string of 1 to 253 case-insensitive characters without spaces."
        },
        {
            "Parameters": "password",
            "Info": "Specifies the password for the user.\n-"
        },
        {
            "Parameters": "cipher cipher-password",
            "Info": "Specifies the password in cipher text. The password is input in simple or encrypt text but stored in cipher text in the configuration file.\nThe new password is at least eight characters long and contains at least two of the following types: upper-case letters, lower-case letters, digits, and special characters.\nWhen cipher is entered, the password is displayed in either simple text or ciphertext during input.When being input in simple text, the password is a string of 8 to 128 case-sensitive characters when the user security policy is configured the password is a string of 1 to 128 case-sensitive characters when the user security policy is not configured. When you input a password in simple text, the system displays the password in simple text mode, which brings risks.\nWhen being input in ciphertext, the password must be a string of 32 to 268 consecutive characters. When the user security policy is configured, the password cannot be the same as the user name, or in reverse order with the user name. The password must contain the following characters: upper-case character, lower-case character, digit, and special character.\nExcept the question mark (?) and space. However, when quotation marks are used around the password, spaces are allowed in the password."
        },
        {
            "Parameters": "cipher-password",
            "Info": "Specifies the password in ciphertext.\nIt is a string of 1 to 128 unencrypted characters or 32 to 268 encrypted characters. It is case sensitive, excluding special characters of command lines such as space and question mark."
        },
        {
            "Parameters": "irreversible-cipher irreversible-password",
            "Info": "Specifies the password in irreversible-cipher text. The password is input in simple or irreversible-cipher text but stored in cipher text in the configuration file.\nWhen irreversible-cipher is entered, the password is displayed in either simple text or ciphertext during input.When being input in simple text, the password is a string of 8 to 128 case-sensitive characters when the user security policy is configured the password is a string of 1 to 128 case-sensitive characters when the user security policy is not configured\nWhen being input in ciphertext, the password must be a string of 48 to 128 consecutive characters.When the user security policy is configured, the password cannot be the same as the user name, or in reverse order with the user name. The password must contain the following characters: upper-case character, lower-case character, digit, and special character.\nExcept the question mark (?) and space. However, when quotation marks are used around the password, spaces are allowed in the password."
        },
        {
            "Parameters": "authentication-type",
            "Info": "Sets the access restriction of a user.\n-"
        },
        {
            "Parameters": "type-mask",
            "Info": "Specifies the mask of the access type for the authentication user.\nThe value is a string of 1 to 10 characters, which is case insensitive. A combination of the following letters applies: P (PPP access), W (VLAN + Web access), B (VLAN access), X (802.1X access), F (FTP access), T (Telnet access), M (terminal access), S (SSH access), D (X.25-PAD access), U (tunnel access), N (SNMP access), Q (QX access), L (MML access), H (HTTP access), and - (no access type allowed). Note that \"-\" cannot be used together with other letters."
        },
        {
            "Parameters": "block",
            "Info": "Sets the user status to Blocked.\nThis parameter takes effect for both management users and non-management users.\n-"
        },
        {
            "Parameters": "fail-times fail-times-value",
            "Info": "Specifies the number of allowable user authentication failures.\nThis parameter takes effect only for management users.\nThe value is an integer ranging from 1 to 10."
        },
        {
            "Parameters": "interval interval-value",
            "Info": "Specifies the interval at which user authentication is performed.This parameter takes effect only for management users.\nThe value is an integer ranging from 1 to 65535, in minutes."
        },
        {
            "Parameters": "ftp-directory",
            "Info": "Specifies the FTP directory.\nThe value is a string of 1 to 255 characters."
        },
        {
            "Parameters": "level",
            "Info": "Specifies the user priority.\nThe value ranges from 0 to 15."
        },
        {
            "Parameters": "callback-nocheck",
            "Info": "Indicates that the callback signal of the modem is not authenticated.\n-"
        },
        {
            "Parameters": "callback-number",
            "Info": "Specifies the string for the callback user to dial.\nThe value is a string of 1 to 64 characters."
        },
        {
            "Parameters": "idle-cut",
            "Info": "Sets the idle-cut function of the user.\n-"
        },
        {
            "Parameters": "qos-profile",
            "Info": "Indicates the QoS profile referenced by the user.\n-"
        },
        {
            "Parameters": "qos-profile-name",
            "Info": "Specifies the name of the QoS profile.\nThe value is a string of 1 to 63 characters."
        },
        {
            "Parameters": "ip-address",
            "Info": "Specifies the IP address of the local user. The value is in dotted decimal format.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "ip-address",
            "Info": "Indicates the IP address of the local user. This keyword is valid only for local authentication of PPP users. The specified IP address must be in the local address pool and you must exclude this address by using the excluded-ip-address command.\n-"
        },
        {
            "Parameters": "vpn-instance",
            "Info": "Indicates the VPN instance that the local user belongs to.\n-"
        },
        {
            "Parameters": "user-group user-group-name",
            "Info": "Specifies the name of the user group.\nThe value is a string of 1 to 32 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "expire expiretime",
            "Info": "The expiration time.\nThe value is in the format of YYYY-MM-DD. YYYY specifies the year, which is an integer ranging from 2000 to 2099. MM specifies the month, which is an integer ranging from 1 to 12. DD specifies the day, which is an integer ranging from 1 to 31. The date cannot be earlier than the current date."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] local-aaa-server",
            "[~HUAWEI-local-aaa-server] user hello@domain password cipher 1qaz@WSX"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] local-aaa-server",
            "[~HUAWEI-local-aaa-server] user hello1@domain password cipher 1qaz@WSX"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] local-aaa-server",
            "[~HUAWEI-local-aaa-server] user hello2@domain password cipher 1qaz@WSX",
            "Please enter old password:"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] local-aaa-server",
            "[~HUAWEI-local-aaa-server] user hello@domain password cipher Please-pass12345"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] local-aaa-server",
            "[~HUAWEI-local-aaa-server] user hello1@domain password cipher 1qaz@WSX12345678"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] local-aaa-server",
            "[~HUAWEI-local-aaa-server] user hello2@domain password cipher 1qaz@WSX12345678",
            "Please enter old password:"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] local-aaa-server",
            "[~HUAWEI-local-aaa-server] user hello@domain password cipher 1qaz@WSX"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] local-aaa-server",
            "[~HUAWEI-local-aaa-server] user hello1@domain password cipher 1qaz@WSX"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] local-aaa-server",
            "[~HUAWEI-local-aaa-server] user hello2@domain password cipher 1qaz@WSX",
            "Please enter old password:"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] local-aaa-server",
            "[~HUAWEI-local-aaa-server] user hello@domain password",
            "Please configure the password (1-128)",
            "Enter Password:",
            "Confirm Password:",
            "Info: A new user is added."
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] local-aaa-server",
            "[~HUAWEI-local-aaa-server] user hello1@domain expire 2050-12-12"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter you run the user-password min-len command, you cannot configure a password with a length less than the minimum length configured using this command.\nAfter you run the user-password complexity-check command, when you create a local user or modify a local user's password, the password must contain an upper-case letter, a digit, and a special character. If the password to be configured does not contain all of them, the configuration fails.\nIf the user name does not exist, a user account is created. If you do not specify any attribute, the default settings are adopted. If the user name exists, you can modify the attributes of the user account. When you do this, you can type in the wildcard (*) to set multiple user accounts at the same time.\nBefore configuring the QoS profile to be referenced by a user, ensure that the user account exists. If the user account does not exist, you need to run the user command to create a user account and then configure the QoS profile to be referenced by the user.\nWhen you try to remove a user account, there must not be any online user under the account. You cannot use the wildcard (*) in this case.\nThe system can support a maximum of 1024 local user accounts.\nThe access type of local users can be a combination of several access types. For example, TF indicates the Telnet and FTP access. Users whose accounts for local authentication do not correspond to an access type, such as leased line users, use B (VLAN access).\nPasswords for the administrative FTP, Telnet, SSH, or terminal users can only be in irreversible-cipher. Even if you specify the password in cipher, the device automatically changes it to irreversible-cipher, and the keyword cipher is changed to irreversible-cipher in the command.\nPPP users cannot specify the passwords in the irreversible ciphertext when the users use the local CHAP authentication. If they specify the passwords in the irreversible ciphertext, the authentication fails.\nAn activated user account can receive authentication requests and perform subsequent processing. A blocked user account does not process authentication requests, but the existing online connections are not affected. If the fail-times parameter value exceeds the threshold, no authentication requests from the administrative user are received within the specified interval.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nThe command cannot be configured while the qos-profile is in time-range mode.\nThe command cannot be configured while the qos-profile is in 8cos-enhance mode."
}