{
    "PageTitle": "user-password complexity-check",
    "FuncDef": "The user-password complexity-check command enables the password strength check for local users.\nThe undo user-password complexity-check command disables the password strength check for local users.\nBy default, the password complexity check is disabled for local users.",
    "CLIs": [
        "user-password complexity-check",
        "undo user-password complexity-check"
    ],
    "ParentView": [
        "Local AAA server view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] local-aaa-server",
            "[~HUAWEI-local-aaa-server] user-password complexity-check"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo prevent security risks such as account stealing, run the user-password complexity-check command to raise password strength requirements. After the user-password complexity-check command is configured, local users must configure a password containing uppercase and lowercase letters, numerals, and special characters. The newly configured password cannot be the same as any of the most recent 10 passwords.\nPrerequisites\nA local user has logged in to the device as an administrator.\nConfiguration Impact\nAfter the user-password complexity-check command is run, the password newly configured in the AAA or local AAA server view must comply with the following rules:\nThe password must contain numerals, upper- and lower-case letters, and special characters, spaces or question marks not supported.The password cannot be the same as any of the most recent 10 passwords.\n\nPrecautions\nThe user-password complexity-check command that is configured in the AAA view or local AAA view takes effect only for users in the specific view and does not affect another in the other view.\nIf the login password does not satisfy the password strength requirements, the system prompts you to change your password. Change your password based on the prompted message.\nAfter the undo user-password complexity-check is run, the user password complexity is controlled by the user-security-policy enable command."
}