{
    "PageTitle": "clock board-freq-switch enable",
    "FuncDef": "The clock board-freq-switch enable command enables board-level frequency deviation-triggered clock source switching.\nThe undo clock board-freq-switch enable command disables board-level frequency deviation-triggered clock source switching.\nBy default, board-level frequency deviation-triggered clock source switching is disabled.",
    "CLIs": [
        "clock board-freq-switch enable",
        "undo clock board-freq-switch enable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] clock board-freq-switch enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen frequency deviation detection is enabled, the main control board checks the frequency deviation status of the clock source corresponding to the interface board. If an abnormality is detected, the clock source on the interface board is not available for clock source selection.\nTo enable board-level frequency deviation-triggered clock source switching, run the clock board-freq-switch enable command. After this function is enabled, a frequency deviation abnormality of the clock source triggers the interface board to re-select the optimal source. The main control board then re-selects a clock source based on the optimal source sent by the interface board. When the clock source configuration is on a fixed interface board and frequency deviation-triggered clock source switching is enabled, services are rapidly switched to a normal clock source in case of a frequency deviation abnormality of the clock source.\nPrerequisites\nFrequency deviation detection needs to be enabled.\nConfiguration Impact\nIf frequency deviation detection is enabled, the main control board detects whether the frequency deviation of the clock source on the interface board is abnormal. If frequency deviation-triggered clock source switching is enabled, the interface board on which the clock source with abnormal frequency deviation resides re-selects the optimal source. If frequency deviation detection is enabled but frequency deviation-triggered clock source switching is disabled, the clock source with abnormal frequency deviation participates in clock source selection again."
}