{
    "PageTitle": "clock bundle",
    "FuncDef": "The clock bundle command configures a bundle group for the clock source.\nThe undo clock bundle command deletes the configuration of a bundle group for the clock source.\nBy default, no bundle group is configured for the clock source.",
    "CLIs": [
        "clock bundle <bundle-value>",
        "undo clock bundle [ <bundle-value> ]"
    ],
    "ParentView": [
        "100GE interface view",
        "10G LAN interface view",
        "10G WAN interface view",
        "25GE interface view",
        "400GE interface view",
        "40GE interface view",
        "50GE interface view",
        "50|100GE interface view",
        "CE1 interface view",
        "CPOS interface view",
        "E1/CE1 interface view",
        "E1 interface view",
        "GE optical interface view",
        "GE electrical interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "bundle-value",
            "Info": "Specifies the value of a bundle group.\nThe value is an integer ranging from 1 to 64."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] clock bundle 10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nFor example, there are two or more clock links between DeviceA and DeviceB. If interface if2-1 of DeviceB receives clock source signals from interface if1-1 of DeviceA (for example, SSM as PRC), the clock of DeviceB is locked. Then, DeviceB sends DNU signals back to if1-1 according to the G.781 standard. Then, DeviceB sends clock source signals with the same quality level as if2-1 to other clock interfaces on DeviceA. Upon receipt of the clock source signals, if1-n on DeviceA may trace the clock source. This causes a clock loop between DeviceA and DeviceB.\nA bundle group is configured for all the clock interfaces between DeviceA and DeviceB. When DeviceB traces clock source signals from if1-1 in the bundle group, DeviceB needs to send back DNU signals to other clock interfaces on the bundle group in addition to clock link 1. The quality levels of the clock source signals sent from DeviceA and Device are both DNU signals. This prevents Device from tracing DeviceB.\nPrecautions\nThe clock bundling group can be configured only on the clock link interfaces connecting two devices, and only one bundling group ID can be configured for the devices.\nIf one of the links bound to the same bundle group is selected as the synchronization source, all the clock interfaces in the bundle group reversely output DNU signals.\nIn VS mode, this command is supported only by the admin VS."
}