{
    "PageTitle": "clock bits-type",
    "FuncDef": "The clock bits-type command configures a BITS clock source and its signal type.\nBy default, the default signal type of the bits0 interface is 2mbps, and the default signal type of the bits1 interface is 1pps input.\nBy default, the default signal type of the bits0, bits1 and bites2 interface is 2mbps. The default signal type of the bits0 interface is 2mbps, and the default signal type of the bits1 interface is 1pps input when the MPU type is /CR57MPUB8/ or /CR56MPUB6/.",
    "CLIs": [
        "clock bits-type bits0 { 2mhz | 2mbps } [ slot <slotid> ]",
        "clock bits-type bits1 { 1pps { input | output } | dcls } [ slot <slotid> ]",
        "clock bits-type [ chassis <chassis-id> ] { bits0 | bits1 | bits2 } { 2mhz | 2mbps }",
        "clock bits-type [ chassis <chassis-id> ] { bits0 | bits1 } dcls",
        "clock bits-type [ chassis <chassis-id> ] { bits0 | bits1 | bits2 } 1pps { input | output }",
        "clock bits-type [ chassis <chassis-id> ] bits0 { 2mhz | 2mbps } [ slot <slotid> ]",
        "clock bits-type [ chassis <chassis-id> ] bits1 dcls [ slot <slotid> ]",
        "clock bits-type [ chassis <chassis-id> ] bits1 1pps { input | output } [ slot <slotid> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "2mhz",
            "Info": "Specifies 2mhz as the type of signals sent or received by the BITS interface.\n-"
        },
        {
            "Parameters": "2mbps",
            "Info": "Specifies 2mbps as the type of signals sent or received by the BITS interface.\n-"
        },
        {
            "Parameters": "slot slotid",
            "Info": "Specifies the slot ID of the main control board.\nOnly the master and slave main control boards that can exchange BITS signals support the configurations of the slot slot-id keyword and parameter.\nThe value is a string of 1 to 16 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "bits1",
            "Info": "Specifies the BITS1 interface as a BITS clock source. This interface receives or sends time signals.\nBy default, 2mbps as the type of signals sent or received by the BITS1."
        },
        {
            "Parameters": "1pps",
            "Info": "Specifies 1pps as the type of signals sent or received by the BITS interface.\n-"
        },
        {
            "Parameters": "input",
            "Info": "Specifies the type of input signals of the BITS interface.\n-"
        },
        {
            "Parameters": "output",
            "Info": "Specifies the type of output signals of the BITS interface.\n-"
        },
        {
            "Parameters": "dcls",
            "Info": "Specifies dcls as the type of signals sent or received by the BITS interface.\n-"
        },
        {
            "Parameters": "bits0",
            "Info": "Specifies the BITS0 interface as a BITS clock source. This interface receives or sends frequency signals.\nBy default, 2mbps as the type of signals sent or received by the BITS0."
        },
        {
            "Parameters": "chassis chassis-id",
            "Info": "Specifies a chassis ID.\nThe value is a string of 1 to 20 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "bits2",
            "Info": "Specifies the BITS2 interface as a BITS clock source. This interface receives or sends time signals.\nBy default, 2mbps as the type of signals sent or received by the BITS2."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] clock bits-type bits0 2mbps"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the device is connected to an external BITS clock through a BITS interface to transmit clock signals, configure a signal type for the BITS clock source. This signal type must be the same as the signal type of this external BITS clock.\nPrecautions\nIf the signal type is set to 1pps, separately specify the signal input and output directions. If the signal type is set to a value other than 1pps, this value takes effect for both the signal input and output directions.\nIn VS mode, this command is supported only by the admin VS."
}