{
    "PageTitle": "clock binding flexe",
    "FuncDef": "The clock binding flexe command associates the FlexE logical interface carrying the clock service with the FlexE physical interface.\nThe undo clock binding flexe command disables the association between a FlexE logical interface and a FlexE physical interface.\nBy default, the FlexE logical interface is not associated with any FlexE physical interface.",
    "CLIs": [
        "clock binding flexe interface { <ifname> | <iftype> <ifnum> }",
        "undo clock binding flexe [ interface { <ifname> | <iftype> <ifnum> } ]"
    ],
    "ParentView": [
        "FlexE-100G interface view",
        "FlexE-50G interface view",
        "FlexE-50|100G interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "interface ifname",
            "Info": "Interface name.\nThe value is a string of 1 to 49 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "interface iftype",
            "Info": "Interface type.\nThe value is a string of 1 to 49 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "interface ifnum",
            "Info": "Interface number.\nThe value is a string of 1 to 49 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface FlexE-50G 1/1/1",
            "[~HUAWEI-FlexE-50G 1/1/1] clock binding flexe interface FlexE1/1/129"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn FlexE mode, if the clock service needs to be deployed on FlexE physical interfaces, the FlexE logical interface for carrying clock services need to be configured and the group ID and client ID of the FlexE logical interfaces bound to the upstream and downstream devices must be consistent. Otherwise, the clock service fails. If a bound logical interface does not work properly, the clock service is affected. In this case, you can manually switch services to another logical interface and ensure that the group ID and client ID of the FlexE logical interfaces bound to the upstream and downstream devices are consistent. The clock service is unavailable during service switching.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nThe group ID and client ID of the FlexE logical interfaces bound to the upstream and downstream devices must be consistent.\nThe command can only be configured in the flexe group with one port."
}