{
    "PageTitle": "clock source",
    "FuncDef": "The clock source command configures the clock source selection mode as manual or forcible clock source selection and specifies a clock source to be traced.\nThe default clock source selection mode is automatic clock source selection.",
    "CLIs": [
        "clock { manual | force } { 2msync-1 | 2msync-2 } source interface { <interface-name> | <interface-type> <interface-number> }",
        "clock { manual | force } source bits0 slot <slotid>",
        "clock { manual | force } source [ chassis <chassis-id> ] { bits0 | bits1 | bits2 }",
        "clock { manual | force } source ptp",
        "clock { manual | force } source interface { <interface-name> | <interface-type> <interface-number> }",
        "clock { manual | force } source [ chassis <chassis-id> ] bits0 [ slot <slotid> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "2msync-1",
            "Info": "2M sync clock1.\n-"
        },
        {
            "Parameters": "2msync-2",
            "Info": "2M sync clock2.\n-"
        },
        {
            "Parameters": "interface interface-type",
            "Info": "Specifies an interface clock source as the master clock source.\nThe value is a string case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "interface interface-number",
            "Info": "Specifies an interface clock source as the master clock source.\nThe value is a string case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "interface interface-name",
            "Info": "Specifies an interface clock source as the master clock source.\nThe value is a string case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "bits0",
            "Info": "Specifies an external clock source as the master clock source.\n-"
        },
        {
            "Parameters": "slot slotid",
            "Info": "Specifies the slot ID of the main control board.\nThe value is a string of 1 to 16 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "chassis chassis-id",
            "Info": "Chassis ID.\nThe value is a string of 1 to 20 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "bits1",
            "Info": "Specifies an external clock source as the master clock source.\n-"
        },
        {
            "Parameters": "bits2",
            "Info": "Specifies an external clock source as the master clock source.\n-"
        },
        {
            "Parameters": "ptp",
            "Info": "Specifies a PTP clock source as the master clock source.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] clock bits-type bits0 2mhz",
            "[~HUAWEI] clock manual source bits0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nYou can run this command to manually or forcibly specify a clock source to be traced.\nConfiguration Impact\nAfter the clock manual source command is run, this command is not saved in the configuration file. To view the configuration results, run the display clock config command. If the reference clock source fails, the clock selection mode is automatically switched to automatic clock source selection. After a device is restarted, the clock manual source command is not restored, and the default automatic clock source selection mode takes effect.\nAfter a device is upgraded to the target version, the configured clock manual source command fails, and the default automatic clock source selection mode takes effect.\nPrecautions\nYou cannot manually or forcibly specify an external or PTP clock source for 2msync-1 clocks.When you forcibly specify a clock source, ensure that clock synchronization has been enabled on the specified clock source. If clock synchronization has not been enabled, the clock force source command does not take effect.If the status of a specified clock source is not normal or its SSM level is dnu, the system clock works in the hold state or free state.If the status of a manually specified clock source is neither normal nor holdoff, or its SSM level is not the highest, the clock manual source command does not take effect."
}