{
    "PageTitle": "clock priority",
    "FuncDef": "The clock priority command configures a priority for a line clock source.\nThe undo clock priority command deletes the priority for a line clock source.\nThe default priority of a line clock source is 0. That is, this line clock source does not participate in clock source selection.",
    "CLIs": [
        "clock priority <priority-value>",
        "undo clock priority"
    ],
    "ParentView": [
        "100GE interface view",
        "10G LAN interface view",
        "10G WAN interface view",
        "25GE interface view",
        "400GE interface view",
        "40GE interface view",
        "50GE interface view",
        "50|100GE interface view",
        "CE1 interface view",
        "CPOS interface view",
        "E1/CE1 interface view",
        "E1 interface view",
        "GE optical interface view",
        "GE electrical interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "priority-value",
            "Info": "Priority of a line clock source.\nThe value is an integer ranging from 1 to 255. A smaller value indicates a higher priority."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] clock priority 10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen the system selects clock sources from different ports, users need to set the priority for the clock sources to participate in the system clock source selection.\nIn actual situations, the QL of a clock source is higher than the priority of the clock source.\nIf clock source selection based on SSM levels is enabled, the system selects a clock reference source by the QL of a clock source.If clock source selection based on SSM levels is disabled or clock source selection based SSM levels is enabled but the QLs are the same, the system selects the clock reference source by the priority of a clock source.\n\nPrecautions\nIf external input clock signals or a 1588 clock source needs to be configured to participate in clock source selection, the level of the external clock source must be specified. Otherwise, the clock signals cannot participate in clock source selection.\nThis priority takes effect only when the device selects a clock source based on the port inside the device."
}