{
    "PageTitle": "clock source priority",
    "FuncDef": "The clock source priority command configures a priority for a BITS clock source.\nThe undo clock source priority command deletes a priority for a BITS clock source.\nBy default, the clock source has the priority 0. That is, this clock source does not participate in clock source selection.",
    "CLIs": [
        "clock source bits0 priority <priority-value> [ slot <slotid> ]",
        "clock source [ chassis <chassis-id> ] { bits0 | bits1 | bits2 } priority <priority-value>",
        "clock source ptp priority <priority-value>",
        "clock source [ chassis <chassis-id> ] bits0 priority <priority-value> [ slot <slotid> ]",
        "undo clock source bits0 priority [ slot <slotid> ]",
        "undo clock source [ chassis <chassis-id> ] { bits0 | bits1 | bits2 } priority",
        "undo clock source ptp priority",
        "undo clock source [ chassis <chassis-id> ] bits0 priority [ slot <slotid> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "slot slotid",
            "Info": "Indicates the available slot.\nThe value is a string of 1 to 16 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "chassis chassis-id",
            "Info": "chassis ID.\nThe value is a string of 1 to 20 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "bits0",
            "Info": "Indicates that the external BITS clock source is a BITS0 interface.\n-"
        },
        {
            "Parameters": "bits1",
            "Info": "Indicates that the external BITS clock source is a BITS1 interface.\n-"
        },
        {
            "Parameters": "bits2",
            "Info": "Indicates that the external BITS clock source is a BITS2 interface.\n-"
        },
        {
            "Parameters": "priority priority-value",
            "Info": "Priority of a clock source.\nThe value is an integer ranging from 1 to 255. A smaller value indicates a higher priority."
        },
        {
            "Parameters": "ptp",
            "Info": "Precisinon time protocol.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] clock source bits0 priority 15"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo enable this clock source to participate in clock source selection, configure a priority for this clock source.\nPrecautions\nIf SSM levels are not configured to participate in clock source selection, the device selects a clock source based on the priorities of clock sources.\nIf SSM levels are configured to participate in clock source selection, the device preferentially selects a clock source based on the SSM levels. If multiple clock sources have the same highest SSM level, the device selects a clock source based on the priorities of these clock sources."
}