{
    "PageTitle": "clock sa-bit (system view)",
    "FuncDef": "The clock sa-bit command configures a timeslot of 2 Mbps signals of a BITS clock source from which the device extracts SSM levels of clock signals.\nBy default, the device extracts SSM levels of clock signals from the sa4 timeslot of 2 Mbps signals of a BITS clock source.",
    "CLIs": [
        "clock sa-bit { sa4 | sa5 | sa6 | sa7 | sa8 } source bits0 [ slot <slotid> ]",
        "clock sa-bit { sa4 | sa5 | sa6 | sa7 | sa8 } source [ chassis <chassis-id> ] { bits0 | bits1 | bits2 }",
        "clock sa-bit { sa4 | sa5 | sa6 | sa7 | sa8 } source [ chassis <chassis-id> ] bits0 [ slot <slotid> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "sa4",
            "Info": "sa4 timeslot.\n-"
        },
        {
            "Parameters": "sa5",
            "Info": "sa5 timeslot.\n-"
        },
        {
            "Parameters": "sa6",
            "Info": "sa6 timeslot.\n-"
        },
        {
            "Parameters": "sa7",
            "Info": "sa7 timeslot.\n-"
        },
        {
            "Parameters": "sa8",
            "Info": "sa8 timeslot.\n-"
        },
        {
            "Parameters": "source",
            "Info": "Specifies the clock reference source.\nThe value is an integer ranging from 0 to 19."
        },
        {
            "Parameters": "bits0",
            "Info": "Indicates that the external BITS clock source is a BITS0 interface.\n-"
        },
        {
            "Parameters": "chassis chassis-id",
            "Info": "Specifies a chassis ID.\nThe value is a string of 1 to 20 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "bits1",
            "Info": "Indicates that the external BITS clock source is a BITS1 interface.\n-"
        },
        {
            "Parameters": "bits2",
            "Info": "Indicates that the external BITS clock source is a BITS2 interface.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] clock sa-bit sa5 source bits0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the signal type of an external clock source connected to the NE40E's BITS interface is 2 Mbps, the external clock signal has carried SSM levels in an Sa timeslot. To enable the NE40E to automatically extract SSM levels from clock signals, configure the Sa timeslot from which the NE40E extracts SSM levels to be the same as the Sa timeslot of the external clock signal. If the two Sa timeslots are different, the NE40E cannot extract SSM levels of clock signals received on the BITS interface. In this situation, the SSM levels of the clock signals are unk.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}