{
    "PageTitle": "set negotiation-mode slave",
    "FuncDef": "The set negotiation-mode slave command specifies or changes the working mode for a port.\nThe undo set negotiation-mode slave command restores the default working mode for a port.\nBy default, a port works in auto-negotiation mode.",
    "CLIs": [
        "set negotiation-mode slave",
        "undo set negotiation-mode slave"
    ],
    "ParentView": [
        "GE electrical interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet2/0/0",
            "[~HUAWEI] set negotiation-mode master"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA GE electrical port works in either master or slave mode. Two GE ports can be interconnected only when one of them works in master mode and the other works in slave mode. Usually, ports auto-negotiate their working modes. If a GE electrical port works in master mode, it uses the local system clock when sending data. Then the interconnected GE electrical port works in slave mode and it uses the clock received from the master port when sending data. However, the local system clock may be asynchronous with the received clock. The inherent master and slave relationships between GE electrical ports conflict with the relationships established on a clock synchronization network, and a clock tracing loop results.\nThe service carried over a GE port involved in Ethernet synchronization may be interrupted in case of a clock source switchover. Specifying the working mode for the GE port helps avoid this risk.\nPrerequisites\nWhen planning a network, ensure that the working modes of GE electrical ports agree with the clock tracing relationships between them.\nPrecautions\nThis command is applicable only to ports on the EG4T sub-board and the ports may not work in the specified working modes. For example, when users specify the working mode to master for both interconnected ports, the ports have to negotiate their working modes so that one of them works in master mode and the other works in slave mode. Users can view the negotiation result using the display negotiation command, or view the specified working mode using the display this command .\nWhen Huawei-supplied devices are interconnected, users only need to specify the working mode to slave for the downstream clock port. This setting ensures that the working mode agrees with the clock tracing relationships. When a Huawei-supplied device and a third-party device are interconnected, specify the working mode to master for the port on the Huawei-supplied device if it is upstream to the third-party device."
}