{
    "PageTitle": "display mld-snooping",
    "FuncDef": "The display mld-snooping command displays MLD snooping parameter settings, including default and non-default parameter settings.",
    "CLIs": [
        "display mld-snooping { vlan <vlan-id> | vsi <vsi-name> } [ configuration ]",
        "display mld-snooping vlan [ configuration ]",
        "display mld-snooping vsi [ configuration ]",
        "display mld-snooping [ configuration ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "vlan vlan-id",
            "Info": "Displays MLD snooping parameter settings of a specified VLAN.\nThe value is an integer ranging from 1 to 4094."
        },
        {
            "Parameters": "vsi vsi-name",
            "Info": "Displays MLD snooping parameter settings of a specified VSI.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "configuration",
            "Info": "Displays non-default MLD snooping parameter settings.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display mld-snooping",
            "  MLD Snooping Information for VSI 1",
            "     MLD Snooping is Enabled",
            "     MLD Version is Set to default 2     ",
            "     MLD Query Interval is Set to default 60     ",
            "     MLD Max Response Interval is Set to default 10     ",
            "     MLD Robustness is Set to default 2     ",
            "     MLD Last Member Query Interval is Set to default 1     ",
            "     MLD Router Port Aging Interval is Set to 180s or holdtime in hello     ",
            "     MLD Filter Group-Policy is Set to default: Permit All ",
            "     MLD Filter IP-Policy is Set to default: Permit All",
            "     MLD Filter Query-IP-Policy is Set to default: Permit All    ",
            "     MLD Prompt Leave Disable     ",
            "     MLD Router Alert is Not Required     ",
            "     MLD Send Router Alert Enable     ",
            "     MLD Router Port Learning Enable     ",
            "     MLD Proxy Disable",
            "     MLD Proxy Router Protocol Action is Set to default: Terminate All   ",
            "     MLD Report Suppress Disable     ",
            "     MLD Querier Disable",
            "     MLD Snooping querier-election Disable",
            "     MLD ASM-SSM",
            "     MLD SSM-Mapping Disable     ",
            "     MLD Suppress-dynamic-join Disable"
        ],
        [
            "<HUAWEI> display mld-snooping configuration",
            "  MLD Snooping Configuration for VLAN 1",
            "     mld-snooping enable",
            "  MLD Snooping Configuration for VSI 1",
            "     mld-snooping enable",
            "     mld-snooping version 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo check MLD snooping parameter settings, run the display mld-snooping command. The command output helps you locate multicast service faults.\nThe command can display MLD snooping parameter settings of a VLAN/VSI only if the VLAN/VSI/BD is in the Up state.\nWhen using the display mld-snooping command, note the following points:\nThe display mld-snooping command can display MLD snooping parameter settings of all VLANs and VSIs.If vlan-id is not set, the command displays MLD snooping parameter settings of all VLANs.If vsi-name is not set, the command displays MLD snooping parameter settings of all VSIs.If bdidis is not set, the command displays MLD snooping parameter settings of all BDs.\n\nPrerequisites\nMLD snooping has been enabled globally and for the specified VLAN/VSI/BD."
}