{
    "PageTitle": "display mld-snooping port-info",
    "FuncDef": "The display mld-snooping port-info command displays information about multicast interfaces, including static and dynamic member interfaces and router interfaces, on the Router.",
    "CLIs": [
        "display mld-snooping port-info [ { vlan <vlanid> | vsi <vsiName> } [ group-address <group-ipv6> ] ] [ slot <slotNum> ] [ verbose ]",
        "display mld-snooping port-info [ vsi <vsiName> [ vlan <vlanid> ] ] [ group-address <group-ipv6> ] [ verbose ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "vlan vlanid",
            "Info": "Displays information about multicast interfaces in a specified VLAN.\nThe value is an integer ranging from 1 to 4094."
        },
        {
            "Parameters": "vsi vsiName",
            "Info": "Displays information about multicast interfaces in a specified VSI.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "group-address group-ipv6",
            "Info": "Displays information about multicast interfaces of specified multicast group in a specified VLAN/VSI.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X. The value ranges from FF00::0 to FFFF:FFFF:FFFF:FFFF:FFFF:FFFF:FFFF:FFFF."
        },
        {
            "Parameters": "slot slotNum",
            "Info": "Displays information about multicast interfaces on a specified interface board.\n-"
        },
        {
            "Parameters": "verbose",
            "Info": "Displays detailed information about multicast interfaces.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display mld-snooping port-info",
            "  --------------------------------------------------------------------------------------",
            "  Flag: S:Static     D:Dynamic     M:Ssm-mapping",
            "        A:Active     P:Protocol    F:Fast-channel",
            "  (Source, Group)                       Port                                         Flag",
            "  --------------------------------------------------------------------------------------",
            "  VLAN 1, 1 Entry(s)",
            "  (*, FF17::1)                                                                       P--",
            "                                      PW(2.2.2.2/1)                                S--",
            "                                                        1 port(s) include",
            "  --------------------------------------------------------------------------------------"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe command displays information only after MLD snooping is enabled globally and in a specified VLAN/VSI view.\nWhen using the command to view information about multicast interfaces in a VSI, you can view only the PW interfaces and sub-interfaces of multicast groups. If a VLANIF interface is bound to a VSI, information about this VLANIF interface cannot be displayed. If you need to view the information, view the multicast interface information in the VLAN.\nInformation about multicast member interfaces is displayed only when these member interfaces are in the Up state. When using the command, note the following points:\nThe display mld-snooping port info command displays information about all multicast interfaces.The display mld-snooping port info vlan command displays information about all multicast interfaces in a specified VLAN.The display mld-snooping port info vsi command displays information about all multicast interfaces in a specified VSI.The display mld-snooping port info vlan group-address command displays information about interfaces of a specified multicast group in a specified VLAN.The display mld-snooping port info vsi group-address command displays information about interfaces of a specified multicast group in a specified VSI."
}