{
    "PageTitle": "display igmp-snooping invalid-packet verbose",
    "FuncDef": "The display igmp-snooping invalid-packet verbose command displays detailed information about invalid IGMP Snooping packets.",
    "CLIs": [
        "display igmp-snooping invalid-packet [ <packet-number> ] verbose"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "packet-number",
            "Info": "Displays information about the specified number of invalid IGMP Snooping packets latest received.\nThe value is an integer ranging from 1 to 100. By default, information about all the stored invalid IGMP Snooping packets is displayed."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display igmp-snooping invalid-packet 2 verbose",
            "       Detailed information of invalid packets",
            "-----------------------------------------------------",
            "Packet information (Index 1):",
            "-----------------------------------------------------",
            "Interface           :  GigabitEthernet1/0/1",
            "Vlanid              :  10",
            "Time                :  2010-6-1 20:04:35 UTC-08:00",
            "Message Length      :  26",
            "Invalid Type        :  Invalid Multicast Source",
            "Source Address      :  10.0.3.11",
            "0000: 25 00 96 77 01 00 00 20 e1 01 01 01 01 00 e0 00",
            "0010: 00 00 80 00 00 64 00 00 00 00",
            "-----------------------------------------------------"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe display igmp-snooping invalid-packet command displays statistics and information about invalid IGMP snooping packets, helping to locate and rectify faults.\nIf IGMP Snooping entries cannot be created on a multicast network, you can run the display igmp-snooping invalid-packet command to check whether this fault is caused by invalid IGMP Snooping packets received. If the command output shows that the number of invalid IGMP Snooping packets is not 0, run the display igmp-snooping invalid-packet verbose command to check detailed information about the invalid IGMP Snooping packets for fault location.If the l2-multicast invalid-packet igmp-snooping max-count has been configured and the max-number value differs from the packet-number value in the display igmp-snooping invalid-packet verbose command, detailed information about invalid IGMP Snooping packets is displayed based on the smaller one of the two values."
}