{
    "PageTitle": "display l2-multicast all-vsi listened-user-number",
    "FuncDef": "The display l2-multicast all-vsi listened-user-number command displays statistics about all users on a listened interface.",
    "CLIs": [
        "display l2-multicast all-vsi listened-user-number [ slot <slot-id> ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "slot slot-id",
            "Info": "Specifies a slot ID.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display l2-multicast all-vsi listened-user-number slot 1",
            "User statistics on the listened interface for each slot:",
            "    Statistic start time: 00:02:45",
            "    Limit number: 32000",
            "    Slot-Id: 1",
            "      Current number: 400",
            "      Sample once every 10 seconds:",
            "        Maximum number in last 5 minutes: 400",
            "        Minimum number in last 5 minutes: 400",
            "        Average number in last 5 minutes: 400",
            "        Maximum number in last 15 minutes: 400",
            "        Minimum number in last 15 minutes: 400",
            "        Average number in last 15 minutes: 400",
            "        Maximum number in last 24 hours: 400",
            "        Minimum number in last 24 hours: 400",
            "        Average number in last 24 hours: 400"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo check statistics about all users on a listened interface, run the display l2-multicast all-vsi listened-user-number command. The statistics about the same users in different multicast groups are separately collected by board.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nThe command has a delay in displaying data because of sampling. The maximum delay is 10 seconds for statistics in the last 5 minutes, 5 minutes for statistics in the last 15 minutes, and 1 hour for statistics in the last 24 hours. After a master/slave board switchover, the data changes on the master and slave boards are different. As a result, the displayed content is different.The command counts only the number of users who are in the valid join state. The statistics include users who sent IGMPv2 Join messages and IGMPv3 Exclude Join messages, users who sent IGMPv3 Include (S, G) Join messages, and users for whom the collision domain source information is generated in an IGMPv3 group in Include mode instead of the block source user information in an IGMPv3 group in Exclude mode or the user information in an IGMPv3 group in Include mode."
}