{
    "PageTitle": "display igmp-snooping querier",
    "FuncDef": "The display igmp-snooping querier command displays querier configurations.",
    "CLIs": [
        "display igmp-snooping querier vlan [ <vlan-id> ]",
        "display igmp-snooping querier vsi [ <vsi-name> ]",
        "display igmp-snooping querier bridge-domain [ <bd-id> ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "vsi vsi-name",
            "Info": "Displays querier configurations in a specified VSI. If vsi-name is not specified, IGMP querier configurations in all VSIs will be displayed.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "bridge-domain bd-id",
            "Info": "Displays querier configurations in a specified BD. If bd-id is not specified, IGMP querier configurations in all BDs will be displayed.\nThe bd-id value is an integer ranging from 1 to 16777215."
        },
        {
            "Parameters": "vlan vlan-id",
            "Info": "Displays querier configurations in a specified VLAN. If vlan-id is not specified, IGMP querier configurations in all VLANs will be displayed.\nThe vlan-id value ranges from 1 to 4094."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display igmp-snooping querier vlan",
            "VLAN                            Querier-state     Querier",
            "------------------------------------------------------------",
            "1                                Enable           192.168.0.1",
            "2                                Disable          --",
            "3                                Disable          --",
            "-----------------------------------------------------------",
            "total entry 3"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf IGMP messages sent from an upstream router may not reach a downstream Layer 2 device due to specific causes (for example, IGMP is not enabled on the upstream router) or the upstream router does not need to learn multicast forwarding entries dynamically because static entries are configured, the Layer 2 device can be configured as a querier to replace the upstream router to send IGMP Query messages. This reduces the burden of the upstream device. The display igmp-snooping querier command can be used to view querier configurations."
}