{
    "PageTitle": "igmp-snooping qinq-stacking report-listening enable",
    "FuncDef": "The igmp-snooping qinq-stacking report-listening enable command enables the function to listen to Report and Leave messages on QinQ stacking sub-interfaces.\nThe undo igmp-snooping qinq-stacking report-listening enable command restores the default configurations.\nBy default, IGMP snooping does not support QinQ stacking sub-interfaces, the function to listen to Report and messages on QinQ stacking sub-interfaces is disabled.",
    "CLIs": [
        "igmp-snooping qinq-stacking report-listening enable",
        "undo igmp-snooping qinq-stacking report-listening enable"
    ],
    "ParentView": [
        "VSI-AUTO view",
        "VSI-DEFAULT view",
        "VSI-STATIC view"
    ],
    "ParaDef": [
        {
            "Parameters": "report-listening",
            "Info": "Listen-to-Report-and-messages-on-QinQ-stacking-sub-interfaces.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] vsi vsi1",
            "[*HUAWEI-vsi-vsi1] pwsignal ldp",
            "[*HUAWEI-vsi-vsi1-ldp] vsi-id 200",
            "[*HUAWEI-vsi-vsi1-ldp] quit",
            "[*HUAWEI-vsi-vsi1] igmp-snooping qinq-stacking report-listening enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn VPLS scenarios, QinQ stacking sub-interfaces remove VLAN tags from received multicast messages. To enable the function to listen to Report and Leave messages on QinQ stacking sub-interfaces, run the igmp-snooping qinq-stacking report-listening enable command.\nPrerequisites\nQinQ stacking sub-interfaces have been configured in a VSI for which the command is to be run.\nPrecautions\nThe command configuration in a sub-interface view does not take effect if QinQ stacking or mapping is not configured for the sub-interface.\nThe command configuration in a VSI view does not take effect if the igmp-snooping qinq-stacking report-listening enable or igmp-snooping qinq-mapping report-listening enable command has not been run for the VSI.\nIf QinQ stacking or mapping sub-interfaces are configured for the VSI, the igmp-snooping qinq-stacking report-listening enable or igmp-snooping qinq-mapping report-listening enable command must be run earlier than the igmp-snooping enable command.\nIf QinQ stacking or mapping sub-interfaces are configured for the VSI and the VSI is bound to a user instance, the igmp-snooping qinq-stacking report-listening enable or igmp-snooping qinq-mapping report-listening enable command must be run for the multicast instance of the user instance earlier than the igmp-snooping enable command.\nIf multicast message replication modes are configured in both the VSI and QinQ sub-interface views, the configuration in the QinQ sub-interface view has a higher priority. The configuration in the VSI view takes effect for a QinQ sub-interface only if a replication mode is not configured in the QinQ sub-interface view.\nIf the\nigmp-snooping report-listening command has been run for a QinQ sub-interface of a VSI, the following operations are not allowed:\nIf the sub-interface type is QinQ stacking, running the undo igmp-snooping qinq-stacking report-listening enable command in the VSI view is not allowed.If the sub-interface type is QinQ mapping, running the undo igmp-snooping qinq-mapping report-listening enable command in the VSI view is not allowed.If the VSI of the QinQ stacking or mapping sub-interface is bound to a user VSI, running the undo igmp-snooping qinq-stacking report-listening enable or undo igmp-snooping qinq-mapping report-listening enable command for the multicast VSI of the user VSI is not allowed.Disabling the function to listen to Report and Leave messages in the user VSI of the QinQ sub-interface is not allowed.\nThe igmp-snooping report-listening command supports QinQ stacking interfaces without a policy not the interfaces that are configured with the parameters in the qinq stacking vid 8021p command. These interfaces do not support Layer 2 multicast services.\nAfter the function to listen to Report and Leave messages on sub-interfaces is configured, the sub-interfaces do not proactively send Query messages if they receive no IGMP Report messages. Therefore, ensure that users connected to the sub-interfaces can send IGMP Report messages to the device before receiving IGMP Query messages from the device."
}