{
    "PageTitle": "igmp-snooping report-suppress (VSI E-Tree view)",
    "FuncDef": "The igmp-snooping report-suppress command enables the suppression of IGMP Report messages.\nThe undo igmp-snooping report-suppress command disables the suppression of IGMP Report messages.\nBy default, the suppression for IGMP Report messages is disabled.",
    "CLIs": [
        "igmp-snooping report-suppress",
        "undo igmp-snooping report-suppress"
    ],
    "ParentView": [
        "VSI-AUTO view",
        "VSI-BD view",
        "VSI-DEFAULT view",
        "VSI-STATIC view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] vsi vsi0",
            "[*HUAWEI-vsi-vsi0] pwsignal ldp",
            "[*HUAWEI-vsi-vsi0-ldp] vsi-id 200",
            "[*HUAWEI-vsi-vsi0-ldp] quit",
            "[*HUAWEI] vsi vsi0",
            "[*HUAWEI-vsi-vsi0] undo igmp-snooping report-suppress"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bridge-domain 10",
            "[*HUAWEI-bd10] undo igmp-snooping report-suppress"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] igmp-snooping enable",
            "[*HUAWEI] vlan 10",
            "[*HUAWEI-vlan10] igmp-snooping report-suppress"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter the igmp-snooping report-suppress command is run, the device is configured to work in host mode. Assume that the robustness variable is N, the device sends N Report messages and N Leave messages to an upstream router for the first time. When the device periodically responds to IGMP Query messages sent by the upstream router, the device needs to send only one IGMP Report message to the upstream router to reduce traffic on the network side, regardless of the number of interfaces in the multicast group. The default robustness variable is 2. You can run the igmp snooping robust command to change a robustness variable.\nPrecautions\nThe configuration in the VLAN view cannot succeed in the following cases:\nThe VLAN is bound to a VSI.The pim sm command is used to configure PIM-SM on a VLANIF interface in a VLAN.The igmp-snooping proxy command is used to configure IGMP snooping proxy."
}