{
    "PageTitle": "igmp-snooping send-query enable",
    "FuncDef": "The igmp-snooping send-query enable command configures a device to send IGMP Query messages that are used to respond to network topology changes to non-router ports.\nThe undo igmp-snooping send-query enable command restores the default configuration.\nBy default, a device is disabled from sending IGMP Query messages that are used to respond to network topology changes to non-router ports.",
    "CLIs": [
        "igmp-snooping send-query enable",
        "undo igmp-snooping send-query enable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "send-query",
            "Info": "Send IGMP Query messages.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] igmp-snooping enable",
            "[*HUAWEI] igmp-snooping send-query enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a link topology changes, devices will receive a link change event. Normally, these devices do not send IGMP general query messages. The link topology change, however, causes a ring network protocol to recalculate paths. As a result, multicast data cannot be switched to the new path in time. The igmp-snooping send-query enable command can be used to address this problem. This command enables a device to resend IGMP general Query messages after receiving a link change, update port information, and rapidly switch multicast data to the new forwarding path. This ensures uninterrupted multicast services. Updating port information involves the following operations:\nUpdating router ports: In MSTP networking, IGMP general query messages are sent to all non-router ports.Updating member ports: After receiving IGMP General Query messages, hosts that remain as multicast members reply with IGMP Report messages and update information about member ports.\n\nPrerequisites\nIGMP snooping has been enabled globally and a ring network protocol has been configured.\nFollow-up Procedure\nThe igmp-snooping send-query enable command is used on ring networks. After this command is run on a device on a ring network, the device will send IGMP Query messages with the source IP address of 192.168.0.1 when the topology changes. The source address can be changed using the igmp-snooping send-query source-address command."
}