{
    "PageTitle": "igmp-snooping enable (VSI view)",
    "FuncDef": "The igmp-snooping enable command enables IGMP snooping.\nThe undo igmp-snooping enable command disables IGMP snooping.\nBy default, IGMP snooping is disabled.",
    "CLIs": [
        "igmp-snooping enable",
        "undo igmp-snooping enable"
    ],
    "ParentView": [
        "VSI-STATIC view",
        "VSI-BD view",
        "VSI-AUTO view",
        "VSI-DEFAULT view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] igmp-snooping enable",
            "[*HUAWEI] vsi v1",
            "[*HUAWEI-vsi-v1] pwsignal ldp",
            "[*HUAWEI-vsi-v1-ldp] vsi-id 123",
            "[*HUAWEI-vsi-v1-ldp] quit",
            "[*HUAWEI-vsi-v1] igmp-snooping enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIGMP snooping runs on a Layer 2 device that is deployed between a Layer 3 device and user hosts. It maintains multicast forwarding entries by listening to multicast protocol packets transmitted between the upstream device and hosts, thereby controlling multicast data packet forwarding. Enabling IGMP snooping is the prerequisite for implementing Layer 2 multicast. The igmp-snooping enable command can be used to enable IGMP snooping.\nThe differences between the command configuration in the system view and that in the VLAN/VSI/BD view are listed as follows:\nAfter the igmp-snooping enable or undo igmp-snooping enable command is run in the system view, IGMP snooping will be enabled or disabled globally. Running the undo igmp snooping enable command deletes all Layer 2 multicast commands on a device. The running Layer 2 multicast services are then terminated. To restore Layer 2 multicast services on the device, you must reconfigure the deleted multicast commands.After the igmp-snooping enable or undo igmp-snooping enable command is run in the VLAN/VSI/BD view, IGMP snooping will be enabled or disabled in a specified VLAN/VSI/BD. IGMP snooping can be enabled in a VLAN/VSI/BD only after IGMP snooping is enabled globally. By default, IGMP snooping is still disabled in a VLAN/VSI/BD though IGMP snooping is enabled in the system view.\n\nPrecautions\nIf a VSI is bound to a BD, the igmp-snooping enable command fails to be run in theVSI.\nIf the command is run for a VSI associated with a main interface, only untagged packets can be transmitted on the interface, and tagged packets are discarded.\nIf a VSI is bound to a sub-interface configured with the pw-tag command, the igmp-snooping enable command fails to be run in theVSI.\nIf a VSI is bound to a L2VE interface configured with QinQ stacking, the igmp-snooping enable command fails to be run in theVSI. If the igmp-snooping enable command is run in a VSI, the VSI cannot be bound to a L2VE interface configured with QinQ stacking.\nIf a VSI is bound to a L2VE sub-interface configured with QinQ mapping, the igmp-snooping enable command fails to be run in theVSI. If the igmp-snooping enable command is run in a VSI, the VSI cannot be bound to a L2VE sub-interface configured with QinQ mapping."
}