{
    "PageTitle": "igmp-snooping ssm-mapping (Bridge domain view)",
    "FuncDef": "The igmp-snooping ssm-mapping command configures a mapping between a multicast group address within the Source Specific Multicast Mapping (SSM) group address range and a multicast source address.\nThe undo igmp-snooping ssm-mapping command cancels the configuration.\nBy default, there is no mapping between a group address within the SSM group address range and a multicast source address.",
    "CLIs": [
        "igmp-snooping ssm-mapping <ip-group-address> { <ip-group-mask> | <mask-length> } <ip-source-address>",
        "undo igmp-snooping ssm-mapping <ip-group-address> { <ip-group-mask> | <mask-length> } <ip-source-address>"
    ],
    "ParentView": [
        "Bridge domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-group-address",
            "Info": "Specifies a multicast group address.\nThe address is in dotted decimal notation and ranges from 240.0.0.0 to 255.255.255.255."
        },
        {
            "Parameters": "ip-group-mask",
            "Info": "Specifies the mask of a multicast group address.\nThe value is in dotted decimal notation, ranging from 240.0.0.0 to 255.255.255.255."
        },
        {
            "Parameters": "mask-length",
            "Info": "Specifies the mask length of a multicast group address.\nThe value is an integer ranging from 4 to 32."
        },
        {
            "Parameters": "ip-source-address",
            "Info": "Specifies a multicast source address to be mapped to a multicast group.\nThe address is in dotted decimal notation and ranges from 1.0.0.0 to 223.255.255.255."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bridge-domain 10",
            "[*HUAWEI-bd10] igmp-snooping ssm-mapping 237.0.0.1 30 10.1.1.1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe SSM mapping mechanism is used to convert IGMPv1 and IGMPv2 Report messages into (S, G) Report messages. This mechanism enables hosts that do not support IGMPv3 to enjoy SSM services. After a mapping between a multicast group G and multicast source addresses such as S1 and S2 is configured on a device, the device checks the group addresses of received IGMPv1 and IGMPv2 messages. If the group addresses are in the SSM group address range, the device converts the messages into an IGMPv3 IS_IN (S1, S2......) messages with the group address being G.\nPrerequisites\nThe igmp-snooping ssm-mapping enable command has been run to enable SSM mapping.\nPrecautions\nAfter an SSM mapping policy is configured using the igmp-snooping ssm-mapping enable policy command, the command cannot be run to configure SSM source/group address mapping entries."
}