{
    "PageTitle": "igmp-snooping ssm-mapping enable (Bridge domain view)",
    "FuncDef": "The igmp-snooping ssm-mapping enable command enables source-specific multicast (SSM) mapping and specifies an SSM mapping policy.\nThe undo igmp-snooping ssm-mapping enable command disables SSM mapping.\nBy default, SSM mapping is disabled.",
    "CLIs": [
        "igmp-snooping ssm-mapping enable",
        "igmp-snooping ssm-mapping enable policy <policy-name>",
        "undo igmp-snooping ssm-mapping enable"
    ],
    "ParentView": [
        "Bridge domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "policy policy-name",
            "Info": "Specifies the name of an SSM mapping policy.\nThe value is a string of 1 to 31 case-insensitive characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] igmp-snooping enable",
            "[*HUAWEI] bridge-domain 10",
            "[*HUAWEI-bd10] igmp-snooping ssm-mapping 237.0.0.1 30 10.1.1.1",
            "[*HUAWEI-bd10] igmp-snooping ssm-mapping enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo provide SSM services for old-fashioned multicast terminals that support only IGMPv1 or IGMPv2, configure SSM mapping on the terminals. The SSM mapping mechanism is used to convert IGMPv1 and IGMPv2 Report messages into messages with (S, G) information. It allows hosts which do not support IGMPv3 to work with SSM-enabled devices.\nThe igmp-snooping ssm-mapping enable command enables SSM mapping in a BD. If policy is configured in the command, an SSM mapping policy can be specified for the BD.\nPrerequisites\nThe SSM mapping policy specified by policy has been configured using the ssm-mapping policy command.\nPrecautions\nIf policy is not configured in the command: The igmp-snooping ssm-mapping enable command enables SSM mapping. An SSM mapping policy can be configured in the BD using the igmp-snooping ssm-mapping command only after SSM mapping is enabled.If policy is configured in the command: The igmp-snooping ssm-mapping enable policy command enables SSM mapping in a BD and specifies an SSM mapping policy for the VLAN.\nThe igmp-snooping ssm-mapping enable policy and igmp-snooping ssm-mapping commands are mutually exclusive."
}