{
    "PageTitle": "igmp-snooping static-router-port vlan",
    "FuncDef": "The igmp-snooping static-router-port vlan command configures a static router port.\nThe undo igmp-snooping static-router-port vlan command cancels the configuration.\nBy default, a dynamic router port is used.",
    "CLIs": [
        "igmp-snooping static-router-port vlan { <vid1> [ to <vid2> ] } &<1-10>",
        "undo igmp-snooping static-router-port vlan { { <vid1> [ to <vid2> ] } &<1-10> | all }"
    ],
    "ParentView": [
        "Layer 2 40GE interface view",
        "Layer 2 50GE interface view",
        "Port extension Layer 2 interface view",
        "Layer 2 10GE interface view",
        "Layer 2 GE interface view",
        "Layer 2 100GE interface view",
        "Layer 2 50|100GE interface view",
        "Eth-Trunk interface view",
        "25GE-L2 view",
        "400GE-L2 view"
    ],
    "ParaDef": [
        {
            "Parameters": "vid1",
            "Info": "Specifies a VLAN.\nThe vlan-id value ranges from 1 to 4094."
        },
        {
            "Parameters": "to vid2",
            "Info": "Specifies a VLAN.\nThe vlan-id value ranges from 1 to 4094."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] portswitch",
            "[*HUAWEI-GigabitEthernet1/0/1] igmp-snooping static-router-port vlan 2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf user hosts need to receive multicast data packets from a port for a long period of time, the igmp-snooping static-router-port vlan command can be used to configure the port as a static router port.\nStatic router ports can be configured on different positions on a network to enable user hosts to regularly receive data for specific multicast groups or source-specific multicast groups. The commands listed in the following table can be run in any order. Run one or more commands as required to configure static router ports. For details, see Table Description of the igmp-snooping static-router-port vlan command in different scenarios.\nPrerequisites\nIGMP snooping has been configured globally and in a VLAN.\nConfiguration Impact\nA static router port does not age. To delete a static router port, you must run the undo igmp-snooping static-router-port vlan command.\nIf the igmp-snooping static-router-port vlan command is run more than once, all configurations take effect."
}