{
    "PageTitle": "igmp-snooping static-router-port vsi remote-peer",
    "FuncDef": "The igmp-snooping static-router-port vsi remote-peer command configures a static router port.\nThe undo igmp-snooping static-router-port vsi remote-peer command cancels the configuration.\nBy default, a dynamic router port is used.",
    "CLIs": [
        "igmp-snooping static-router-port vsi <vsi-name> remote-peer <ip-address> [ negotiation-vc-id <vc-id> ]",
        "undo igmp-snooping static-router-port vsi <vsi-name> remote-peer <ip-address> [ negotiation-vc-id <vc-id> ]"
    ],
    "ParentView": [
        "Bridge domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "vsi-name",
            "Info": "Specifies a VSI.\nThe vsi-name value is a string of 1 to 31 case-sensitive characters, spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "ip-address",
            "Info": "Specifies the IP address of a remote peer.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "negotiation-vc-id vc-id",
            "Info": "Specifies the unique identifier of a VC.\nnegotiation-vc-id and remote-peer work together to identify a PW. By default, vc-id is the VSI ID.\nThe value is an integer ranging from 1 to 4294967295."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] vsi vsi0",
            "[*HUAWEI-vsi-vsi0] pwsignal ldp",
            "[*HUAWEI-vsi-vsi0-ldp] vsi-id 1",
            "[*HUAWEI-vsi-vsi0-ldp] quit",
            "[*HUAWEI-vsi-vsi0] igmp-snooping static-router-port remote-peer 3.3.3.3"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] vsi vsi0",
            "[*HUAWEI-vsi-vsi0] pwsignal ldp",
            "[*HUAWEI-vsi-vsi0-ldp] vsi-id 1",
            "[*HUAWEI-vsi-vsi0-ldp] quit",
            "[~HUAWEI] vsi vsi0",
            "[*HUAWEI-vsi-vsi0] igmp-snooping static-router-port remote-peer 3.3.3.3 bgp-ad"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf user hosts need to receive multicast data packets from a port for a long period of time, the igmp-snooping static-router-port vsi remote-peer command can be used to configure the port as a static router port.\nStatic router ports can be configured on different positions on a network to enable user hosts to regularly receive data for specific multicast groups or source-specific multicast groups. The commands listed in the following table can be run in any order. Run one or more commands as required to configure static router ports. For details, see Table Description of the igmp-snooping static-router-port vsi remote-peer command in different scenarios.\nPrerequisites\nIGMP snooping has been configured globally and in a VSI.\nConfiguration Impact\nA static router port does not age. To delete a static router port, you must run the undo igmp-snooping static-router-port vsi remote-peer command.\nIf the igmp-snooping static-router-port vsi remote-peer command is run more than once, all configurations take effect."
}