{
    "PageTitle": "igmp-snooping proxy router-protocol-pass",
    "FuncDef": "The igmp-snooping proxy router-protocol-pass command configures an IGMP Snooping Proxy-enabled device to transparently transmit IGMP Report messages.\nThe undo igmp-snooping proxy router-protocol-pass command cancels the configuration.\nBy default, an IGMP Snooping Proxy-enabled device does not transparently transmit received IGMP Report messages.",
    "CLIs": [
        "igmp-snooping proxy router-protocol-pass",
        "undo igmp-snooping proxy router-protocol-pass"
    ],
    "ParentView": [
        "VLAN view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] igmp-snooping enable",
            "[*HUAWEI] vlan 10",
            "[*HUAWEI-vlan10] igmp-snooping proxy router-protocol-pass"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf IGMP Snooping Proxy is enabled on a Layer 2 device and its upstream device, these devices will learn same multicast forwarding entries. As a result, the upstream device constantly sends Query messages, and the downstream device constantly responds to the Query messages, causing multicast entries not to age. Consequently, multicast protocol and data packets are forwarded meaninglessly. After the igmp-snooping proxy router-protocol-pass command is run on a device, the device does not terminate received IGMP Report messages, but transparently transmits IGMP Report messages received from one of its router ports to the other router ports.\nThe igmp-snooping proxy router-protocol-pass command is recommended on a network where an IGMP Snooping Proxy-enabled device is dual-homed to upstream devices.\nPrerequisites\nThe igmp-snooping proxy command has been run to enable IGMP Snooping Proxy in a VLAN.\nConfiguration Impact\nRunning the igmp-snooping proxy router-protocol-pass command changes the action taken by an IGMP Snooping Proxy-enabled device on IGMP Report messages received from a router port. The device does not terminate IGMP Report messages received from this router port but forwards these messages upstream."
}