{
    "PageTitle": "igmp-snooping router-aging-time (VSI E-Tree view)",
    "FuncDef": "The igmp-snooping router-aging-time command sets the aging time for a dynamic router port.\nThe undo igmp-snooping router-aging-time command restores the default configuration.\nBy default, the aging time of a dynamic router port is s.",
    "CLIs": [
        "igmp-snooping router-aging-time <routerAgingTimeValue>",
        "undo igmp-snooping router-aging-time"
    ],
    "ParentView": [
        "VSI-STATIC view",
        "VSI-BD view",
        "VSI-AUTO view",
        "VSI-DEFAULT view"
    ],
    "ParaDef": [
        {
            "Parameters": "routerAgingTimeValue",
            "Info": "Specifies the aging time of a dynamic router port.\nThe value is an integer ranging from 1 to 1000, expressed in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] vsi vsi1",
            "[*HUAWEI-vsi-vsi1] pwsignal ldp",
            "[*HUAWEI-vsi-vsi1-ldp] vsi-id 200",
            "[*HUAWEI-vsi-vsi1-ldp] quit",
            "[*HUAWEI-vsi-vsi1] igmp-snooping router-aging-time 500"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nNetwork congestion may delay the transmission of a Query message from an IGMP Querier to a device. If a router port does not receive any IGMP Query message with source IP addresses other than 0.0.0.0 or PIM Hello packet within the aging time, it becomes a non-router port. If a dynamic router port ages before the Query message reaches a device, the device no longer sends Report or Leave messages upstream from this interface. This may lead to interruption of multicast data transmission. Therefore, if a network is instable, a larger aging time value is recommended for a dynamic router port. The device resets the aging time of a dynamic router port when the port receives an IGMP Query or PIM Hello message.\nConfiguration Impact\nThe aging time of the router port is set to the value configured using the igmp-snooping router-aging-time command, if the current remaining aging time of the router port is smaller than the configured value."
}