{
    "PageTitle": "igmp-snooping querier enable (VSI E-Tree view)",
    "FuncDef": "The igmp-snooping querier enable command enables a querier in a VLAN/VSI/BD.\nThe undo igmp-snooping querier enable command disables a querier in a VLAN/VSI/BD.\nBy default, queriers are disabled in all VLANs/VSIs/BDs.",
    "CLIs": [
        "igmp-snooping querier enable",
        "undo igmp-snooping querier enable"
    ],
    "ParentView": [
        "VSI-STATIC view",
        "VSI-BD view",
        "VSI-AUTO view",
        "VSI-DEFAULT view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] igmp-snooping enable",
            "[*HUAWEI] vlan 10",
            "[*HUAWEI-vlan10] igmp-snooping querier enable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] igmp-snooping enable",
            "[*HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] vsi vsi0",
            "[*HUAWEI-vsi-vsi0] pwsignal ldp",
            "[*HUAWEI-vsi-vsi0-ldp] vsi-id 200",
            "[*HUAWEI-vsi-vsi0-ldp] quit",
            "[*HUAWEI-vsi-vsi0] igmp-snooping querier enable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] igmp-snooping enable",
            "[~HUAWEI] bridge-domain 10",
            "[*HUAWEI-bd10] igmp-snooping querier enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter the querier function is enabled on a Layer 2 device, this device will replace its upstream device to send IGMP Query messages, and will be able to create and maintain multicast forwarding entries at the data link layer, implementing multicast data forwarding.\nThe following conditions must be met before the\nigmp-snooping querier enable command is run:\nThe querier function is configured on a device only after a static multicast group is configured on the connected upstream device. Otherwise, Report messages sent by user hosts cannot be sent to the upstream device. As a result, these user hosts cannot receive required multicast data.If the paths from a multicast source to user hosts are in the same Layer 2 network, the querier function can be enabled on a Layer 2 device. This does not affect the normal receiving of multicast data packets.\n\nPrecautions\nThe querier function fails to be run in a VLAN/VSI/BD in any of the following situations:\nA Dot1q termination sub-interface has been added to the VLAN.The pim sm command is used to configure PIM-SM on a VLANIF interface in a VLAN.The igmp-snooping proxy command is used to configure IGMP snooping proxy."
}