{
    "PageTitle": "import-channel",
    "FuncDef": "The import-channel command specifies a multicast channel for a Layer 2 multicast instance.\nThe undo import-channel command deletes a multicast channel specified for a Layer 2 multicast instance.\nBy default, no multicast channels are specified for a Layer 2 multicast instance.",
    "CLIs": [
        "import-channel <group-address> { <mask> | <mask-length> }",
        "undo import-channel <group-address> { <mask> | <mask-length> }"
    ],
    "ParentView": [
        "Layer 2 multicast instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "group-address",
            "Info": "Specifies a multicast channel IP address.\nThe value ranges from 224.0.1.0 to 239.255.255.255, in dotted decimal notation."
        },
        {
            "Parameters": "mask",
            "Info": "Specifies the mask of a multicast group address.\nThe address is in dotted decimal notation and ranges from 240.0.0.0 to 255.255.255.255."
        },
        {
            "Parameters": "mask-length",
            "Info": "Specifies the mask length of a multicast group address.\nThe value is an integer ranging from 5 to 32."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] igmp-snooping enable",
            "[*HUAWEI] l2-multicast instance 1",
            "[*HUAWEI-l2-minst1] import-channel 225.0.0.0 24"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo facilitate service management, multicast content providers generally operate different types of channels in different Layer 2 multicast instances. Therefore, multicast channels need to be configured for Layer 2 multicast instances. To specify a multicast channel (multicast group address segment) for a Layer 2 multicast instance, run the import-channel command. After a multicast channel is specified, the Layer 2 multicast instance forwards only multicast flows within the specified address segment range.\nPrerequisites\nIGMP snooping has been enabled globally using the igmp-snooping enable command, and a Layer 2 multicast instance has been created using the l2-multicast instance command."
}