{
    "PageTitle": "l2-multicast egress statistics enable",
    "FuncDef": "The l2-multicast instance enable command enables a device to collect statistics about downstream Layer 2 IPv4 multicast packets based on a slot.\nThe undo l2-multicast egress statistics enable command disables a device from collecting statistics about downstream Layer 2 IPv4 multicast packets based on a slot.\nBy default, a device is disabled from collecting statistics about downstream Layer 2 IPv4 multicast packets based on a slot.",
    "CLIs": [
        "l2-multicast egress statistics enable slot <slot-id>",
        "undo l2-multicast egress statistics enable slot <slot-id>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "slot slot-id",
            "Info": "Specifies a slot ID. The value range varies with the hardware of the router.\nThe value is a string of 1 to 15 characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system",
            "[~HUAWEI] l2-multicast egress statistics enable slot 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo enable a device to collect statistics about downstream Layer 2 IPv4 multicast packets based on a slot, run the l2-multicast egress statistics enable command. After the function is enabled, you can run the display l2-multicast egress statistics command to check statistics about downstream Layer 2 IPv4 multicast packets.\nFollow-up Procedure\nRun the display l2-multicast egress statistics command to check statistics about downstream Layer 2 IPv4 multicast packets.\nPrecautions\nThe l2-multicast egress statistics enable command is not supported on the following boards: LPUF-50/LPUF-50-L/LPUI-21-L/LPUI-51-L/LPUF-51/LPUF-51-B/LPUI-51/LPUI-51-B/LPUS-51/LPUF-101/LPUF-101-B/LPUI-101/LPUI-101-B/LPUS-101,LPUF-51-E/LPUI-51-E/LPUI-51-S/LPUI-51-CM/LPUF-120/LPUF-120-B/LPUF-120-E/LPUI-102-E/LPUI-120/LPUI-120-B/LPUI-120-L/LPUI-52-E/LPUI-120-E/LPUI-120-CM/LPUF-240/LPUF-240-B/LPUF-240-E/LPUI-240/LPUI-240-B/LPUI-240-CM/LPUI-240-L/LPUF-480/LPUF-480-B/LPUI-480/LPUI-480-B/LPUI-480-L/LPUF-480-E/LPUI-480-CM/LPUF-400-E."
}