{
    "PageTitle": "l2-multicast all-vsi limit threshold-alarm upper-limit lower-limit",
    "FuncDef": "The l2-multicast all-vsi limit threshold-alarm command configures alarm thresholds for all VSIs of Layer 2 multicast.\nThe undo l2-multicast all-vsi limit threshold-alarm command restores the default configuration.\nThe default alarm trigger and clear thresholds are 75% and 70% for all VSIs of Layer 2 multicast, respectively.",
    "CLIs": [
        "l2-multicast all-vsi { global-entry | listened-user-per-slot | listened-user-per-group } limit threshold-alarm upper-limit <upper-limit-value> lower-limit <lower-limit-value>",
        "undo l2-multicast all-vsi { global-entry | listened-user-per-slot | listened-user-per-group } limit threshold-alarm [ upper-limit <upper-limit-value> lower-limit <lower-limit-value> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "global-entry",
            "Info": "Indicates the total number of global entries.\n-"
        },
        {
            "Parameters": "listened-user-per-slot",
            "Info": "Indicates the total number of listened users on each board.\nIn VS mode, this parameter is supported only by the admin VS.\n-"
        },
        {
            "Parameters": "listened-user-per-group",
            "Info": "Indicates the total number of listened users in each multicast group.\nIn VS mode, this parameter is supported only by the admin VS.\n-"
        },
        {
            "Parameters": "upper-limit upper-limit-value",
            "Info": "Sets an alarm trigger threshold, in percentage. An alarm is generated when the percentage ratio of created PIM-SM entries to the limit on the number of PIM-SM entries reaches upper-limit-value.\nThe value is an integer ranging from 1 to 100."
        },
        {
            "Parameters": "lower-limit lower-limit-value",
            "Info": "Sets an alarm clear threshold, in percentage. An alarm is cleared when the percentage ratio of created PIM-SM entries to the limit on the number of PIM-SM entries falls below lower-limit-value.lower-limit-value must be less than.\nupper-limit-value..\nThe value is an integer ranging from 1 to 100."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] l2-multicast all-vsi global-entry limit threshold-alarm upper-limit 80 lower-limit 75"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] l2-multicast all-vsi listened-user-per-group limit threshold-alarm upper-limit 80 lower-limit 60"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] l2-multicast all-vsi listened-user-per-slot limit threshold-alarm upper-limit 78 lower-limit 65"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure alarm thresholds for the total number of global entries in all VSIs of Layer 2 multicast, the total number of listened users on each board, and the total number of users in each multicast group, run the l2-multicast all-vsi limit threshold-alarm command.\nConfiguration Impact\nWhen the number of global entries in all VSIs of Layer 2 multicast reaches a configured alarm trigger threshold, the alarm L2-MULTICAST_1.3.6.1.4.1.2011.5.25.181.1.34.5 hwL2mcGlobalEntryThresholdExceed is generated.When the number of listened users on each board of Layer 2 multicast reaches a configured alarm trigger threshold, the alarm L2-MULTICAST_1.3.6.1.4.1.2011.5.25.181.1.34.3 hwL2mcReportListeningThresholdExceed is generated.When the number of listened users in each multicast group of Layer 2 multicast reaches a configured alarm trigger threshold, the alarm L2-MULTICAST_1.3.6.1.4.1.2011.5.25.181.1.34.7 hwL2mcUserPerGroupThresholdExceed is generated."
}