{
    "PageTitle": "l2-multicast fast-channel group-address",
    "FuncDef": "The l2-multicast fast-channel group-address command enables prompt join.\nThe undo l2-multicast fast-channel group-address command disables prompt join.\nBy default, prompt join is disabled.",
    "CLIs": [
        "l2-multicast fast-channel [ source-address <source-address> { <SrcAddrMask> | <SrcAddrMaskLen> } ] group-address <group-address> { <GrpAddrMask> | <GrpAddrMaskLen> }",
        "undo l2-multicast fast-channel [ source-address <source-address> { <SrcAddrMask> | <SrcAddrMaskLen> } ] group-address <group-address> { <GrpAddrMask> | <GrpAddrMaskLen> }"
    ],
    "ParentView": [
        "Bridge domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "source-address source-address",
            "Info": "Specifies a source address.\nThe IP address can be a class A, B, or C address, in dotted decimal notation."
        },
        {
            "Parameters": "SrcAddrMask",
            "Info": "Specifies the mask of a source address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "SrcAddrMaskLen",
            "Info": "Specifies the mask length of a source address.\nThe value is an integer ranging from 16 to 32."
        },
        {
            "Parameters": "group-address",
            "Info": "Specifies the IP address of a multicast group.\nThe value ranges from 224.0.1.0 to 239.255.255.255, in dotted decimal notation."
        },
        {
            "Parameters": "GrpAddrMask",
            "Info": "Specifies the mask of a multicast group address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "GrpAddrMaskLen",
            "Info": "Specifies the mask length of a multicast group address.\nThe value is an integer ranging from 16 to 32."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] igmp-snooping enable",
            "[*HUAWEI] bridge-domain 10",
            "[*HUAWEI-bd10] l2-multicast fast-channel source-address 10.2.2.2 32 group-address 232.0.0.1 32"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter receiving the first IGMP Report for a multicast group, a device needs to apply for resources for this group and then generates a forwarding entry. This decreases the speed at which hosts join the multicast group. After the prompt join function is enabled on a device, the device applies for resources for multicast groups in advance. When the device receives an IGMP Report message for a multicast group, it can immediately forward multicast data for the multicast group, increasing the speed at which hosts join the multicast group and shortening the delay for the device to respond to the Report message.\nConfiguration Impact\nIf a device has reserved resources for a multicast group but does not receive an IGMP Report message for this multicast group for a long period of time, resources will be wasted and device performance will be degraded."
}