{
    "PageTitle": "multicast-vlan enable",
    "FuncDef": "The multicast-vlan enable command configures the current VLAN as a multicast VLAN.\nThe undo multicast-vlan enable command restores the current VLAN to be a common VLAN.\nBy default, a VLAN is a common VLAN.",
    "CLIs": [
        "multicast-vlan enable",
        "undo multicast-vlan enable"
    ],
    "ParentView": [
        "VLAN view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] igmp-snooping enable",
            "[*HUAWEI] vlan 10",
            "[*HUAWEI-vlan10] igmp-snooping enable",
            "[*HUAWEI-vlan10] multicast-vlan enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn general, when users in different VLANs need to receive multicast data from the same multicast source, a device needs to replicate multicast packets for each VLAN. If a multicast VLAN is configured and VLANs to which users belong are configured as the user VLANs of the multicast VLAN, a device is only required to send multicast data to the multicast VLAN. The multicast data is then replicated to the user VLANs by the multicast VLAN. This reduces the burden of the upstream device and isolates multicast sources and users.\nThe multicast-vlan enable command is required when the multicast VLAN function is configured. This command takes effect only for common VLANs. After a common VLAN is configured as a multicast VLAN, users VLANs can be configured for the multicast VLAN, and multicast data traffic received by the multicast VLAN can be replicated to the user VLANs. This implements inter-VLAN multicast data replication.\nPrerequisites\nVLANs have been created and IGMP snooping has been enabled globally and in the VLANs.\nFollow-up Procedure\nThe multicast-vlan user-vlan command can be used to configure a mapping between a multicast VLAN and user VLANs.\nPrecautions\nThe following conditions must be met to restore a multicast VLAN to a common VLAN:\nThe multicast VLAN has no user VLAN.The multicast VLAN does not belong to any multicast protection group.The multicast VLAN is not bound to OAM."
}