{
    "PageTitle": "mld-snooping proxy router-protocol-pass (VSI view)",
    "FuncDef": "The mld-snooping proxy router-protocol-pass command configures an MLD snooping proxy-enabled device to transparently transmit MLD Report messages.\nThe undo mld-snooping proxy router-protocol-pass command restores the default configuration.\nBy default, an MLD snooping proxy-enabled device does not transparently transmit MLD Report messages.",
    "CLIs": [
        "mld-snooping proxy router-protocol-pass",
        "undo mld-snooping proxy router-protocol-pass"
    ],
    "ParentView": [
        "VSI-STATIC view",
        "VSI-BD view",
        "VSI-AUTO view",
        "VSI-DEFAULT view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mld-snooping enable",
            "[*HUAWEI] vlan 10",
            "[*HUAWEI-vlan10] mld-snooping proxy router-protocol-pass"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] vsi a",
            "[*HUAWEI-vsi-a] pwsignal ldp",
            "[*HUAWEI-vsi-a-ldp] vsi-id 1",
            "[*HUAWEI-vsi-a-ldp] quit",
            "[*HUAWEI-vsi-a] undo mld-snooping proxy router-protocol-pass"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf MLD snooping proxy is enabled on a Layer 2 device and its upstream device, the devices will learn the same multicast forwarding entries and constantly exchange MLD Query and Report messages, causing multicast entries not to age. Such multicast protocol and data message forwarding is meaninglessly. To address this issue, run the mld-snooping proxy router-protocol-pass command to enable the Layer 2 device to transparently transmit MLD Report messages from a router interface to other router interfaces.\nRunning the mld-snooping proxy router-protocol-pass command is recommended on a network where an MLD snooping proxy-enabled device is dual-homed to upstream devices.\nPrerequisites\nMLD snooping proxy has been enabled for the VLAN/VSI using the mld-snooping proxy command.\nConfiguration Impact\nAfter the mld-snooping proxy router-protocol-pass command is run, the processing action for MLD Report messages changes on router interfaces of the MLD snooping proxy-enabled device. The device does not terminate the protocol messages received from router interfaces but forwards them to upstream devices."
}