{
    "PageTitle": "mld-snooping router-learning",
    "FuncDef": "The mld-snooping router-learning command disables router interfaces from dynamically learning forwarding entries.\nThe undo mld-snooping router-learning command enables router interfaces to dynamically learn forwarding entries.\nBy default, router interfaces are enabled to dynamically learn forwarding entries.",
    "CLIs": [
        "mld-snooping router-learning",
        "undo mld-snooping router-learning"
    ],
    "ParentView": [
        "VLAN view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mld-snooping enable",
            "[*HUAWEI] vlan 10",
            "[*HUAWEI-vlan10] undo mld-snooping router-learning"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] vsi vsi0",
            "[*HUAWEI-vsi-vsi0] pwsignal ldp",
            "[*HUAWEI-vsi-vsi0-ldp] vsi-id 1",
            "[*HUAWEI-vsi-vsi0-ldp] quit",
            "[*HUAWEI-vsi-vsi0] undo mld-snooping router-learning"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn a device enabled with MLD snooping, interfaces that receive MLD general Query messages with source IP addresses other than 0::0 or Protocol Independent Multicast (PIM) Hello packets are considered as dynamic router interfaces. The device records all router interfaces in a list. Using this mechanism, the device is incapable of controlling data forwarding to users. To resolve this issue, run the undo mld-snooping router-learning command to disable router interfaces in a VLAN/VSI from dynamically learning forwarding entries.\nPrerequisites\nMLD snooping has been enabled using the mld-snooping enable command.\nConfiguration Impact\nAfter the undo mld-snooping router-learning command is run, interfaces in the specified VLAN/VSI do not listen to MLD Query messages and static router interfaces must be configured.\nFollow-up Procedure\nRun the mld-snooping static-router-port command to configure static router interfaces.\nPrecautions\nIf multicast VLAN is enabled for a VLAN, do not run the undo mld-snooping router-learning command. Otherwise, the multicast VLAN function fails.\nIf a VLAN is bound to a VSI, enable MLD snooping in the VSI view.\nThe\nundo mld-snooping router-learning command fails to be run in a VLAN in any of the following conditions:\nThe VLAN is bound to a VSI.\nThe\nundo mld-snooping router-learning command fails to be run in a VSI in the following condition:\nThe VSI is bound to a BD."
}