{
    "PageTitle": "mld-snooping querier enable (VSI view)",
    "FuncDef": "The mld-snooping querier enable command enables the querier function for a VLAN/VSI.\nThe undo mld-snooping querier enable disables the querier function for a VLAN/VSI.\nBy default, the querier is disabled for a VLAN/VSI.",
    "CLIs": [
        "mld-snooping querier enable",
        "undo mld-snooping querier enable"
    ],
    "ParentView": [
        "VSI-STATIC view",
        "VSI-BD view",
        "VSI-AUTO view",
        "VSI-DEFAULT view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mld-snooping enable",
            "[*HUAWEI] vlan 10",
            "[*HUAWEI-vlan10] mld-snooping querier enable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mld-snooping enable",
            "[*HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] vsi vsi0",
            "[*HUAWEI-vsi-vsi0] pwsignal ldp",
            "[*HUAWEI-vsi-vsi0-ldp] vsi-id 1",
            "[*HUAWEI-vsi-vsi0-ldp] quit",
            "[*HUAWEI-vsi-vsi0] mld-snooping querier enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter the querier function is enabled using the mld-snooping querier enable command on a Layer 2 device, this device will send MLD Query messages, freeing its interworking upstream device from doing this. The Layer 2 device will then also create and maintain multicast forwarding entries to forward data at the link layer.\nBefore running the\nmld-snooping querier enable command, note the following points:\nStatic multicast groups have been configured on the upstream device. Otherwise, user join messages cannot be sent to the upstream device, and multicast data flows cannot be sent to receivers.If the links from a multicast source to user hosts are on the same Layer 2 network, the querier function can be enabled on a Layer 2 device. This does not affect the normal receiving of multicast data packets.\n\nPrecautions\nThe mld-snooping querier enable command fails to be run in a VLAN view in any of the following conditions:\nThe VLAN is bound to a VSI.IPv6 PIM is enabled for Layer 3 VLANIF interfaces of the VLAN.The proxy function is enabled for the VLAN using the mld-snooping proxy command.\nThe\nmld-snooping querier enable command fails to be run in a VSI view in any of the following conditions:\nThe VSI is bound to a BD.The proxy function is enabled for the VSI using the mld snooping proxy command."
}