{
    "PageTitle": "mld-snooping proxy-uplink-port",
    "FuncDef": "The mld-snooping proxy-uplink-port command configures an interface as an MLD snooping proxy uplink interface, so that MLD Query messages are not sent to this interface.\nThe undo mld-snooping proxy-uplink-port command cancels an interface as an MLD snooping proxy uplink interface.\nBy default, no MLD snooping proxy uplink interface is configured in a VLAN.",
    "CLIs": [
        "mld-snooping proxy-uplink-port vlan <vlan-id>",
        "undo mld-snooping proxy-uplink-port vlan <vlan-id>"
    ],
    "ParentView": [
        "Layer 2 40GE interface view",
        "Layer 2 50GE interface view",
        "Port extension Layer 2 interface view",
        "Layer 2 10GE interface view",
        "Layer 2 GE interface view",
        "Layer 2 100GE interface view",
        "Layer 2 50|100GE interface view",
        "Eth-Trunk interface view",
        "25GE-L2 view",
        "400GE-L2 view"
    ],
    "ParaDef": [
        {
            "Parameters": "vlan vlan-id",
            "Info": "Specifies a VLAN ID.\nThe value is an integer ranging from 1 to 4094."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mld-snooping enable",
            "[*HUAWEI] interface GigabitEthernet1/0/1",
            "[*HUAWEI-GigabitEthernet1/0/1] portswitch",
            "[*HUAWEI-GigabitEthernet1/0/1] mld-snooping proxy-uplink-port vlan 10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter the MLD snooping proxy or querier function is enabled on a Layer 2 device, the Layer 2 device broadcasts MLD Query messages to all interfaces (including router interfaces) in a VLAN periodically, which may trigger MLD querier reelection. To prevent MLD querier reelection, run the mld-snooping proxy-uplink-port command to configure an interface as an MLD snooping proxy uplink interface, so that MLD Query messages are not sent to this interface.\nPrerequisites\nMLD snooping proxy has been enabled for the VLAN using the mld-snooping proxy command, or the MLD snooping querier function has been enabled using the mld-snooping querier enable command.\nPrecautions\nOnly one MLD snooping proxy unlink interface can be configured in a VLAN.\nThe mld-snooping proxy-uplink-port command is only used on an uplink interface; therefore, the specified VLAN cannot be a user VLAN of a multicast VLAN."
}