{
    "PageTitle": "mld-snooping send-query enable",
    "FuncDef": "The mld-snooping send-query enable command enables the device to send MLD Query messages to non-router interfaces when the network topology changes.\nThe undo mld-snooping send-query enable command disables the device from sending MLD Query messages to non-router interfaces when the network topology changes.\nBy default, the device is disabled from sending MLD Query messages to non-router interfaces when the network topology changes.",
    "CLIs": [
        "mld-snooping send-query enable",
        "undo mld-snooping send-query enable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "send-query",
            "Info": "Send MLD Query messages.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mld-snooping enable",
            "[*HUAWEI] mld-snooping send-query enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen the network topology changes, the device receives a topology change event. By default, the device does not send MLD general Query messages in this case. The network topology change triggers ring network protocol recalculation, but multicast data messages cannot be switched to the new path immediately. To enable multicast data flows to be switched to the new forwarding path immediately after the network topology changes, run the mld-snooping send-query enable command to enable the device to send MLD general Query messages to non-router interfaces upon topology changes to learn updated router interface information. This function therefore ensures non-stop forwarding of multicast data flows. Updated interface information includes:\nRouter interfaces: In the MSTP protocol networking, MLD general Query messages are sent to all non-router interfaces.Member interfaces: After receiving MLD general Query messages, hosts that still require multicast services reply with MLD Report messages. The device then updates information about multicast member interfaces.\n\nPrerequisites\nMLD snooping has been enabled globally. Ring network protocols have been enabled on the device.\nFollow-up Procedure\nThe mld-snooping send-query enable command is mainly used for ring networks. When a ring network topology changes, the device sends an MLD Query message with the source IP address FE80::. To change the source IP address, run the mld-snooping send-query source-address command."
}