{
    "PageTitle": "mld-snooping enable (VSI view)",
    "FuncDef": "The mld-snooping enable vlan command enables MLD snooping for VLANs.\nThe undo mld-snooping enable vlan command disables MLD snooping for VLANs.\nBy default, MLD snooping is disabled.",
    "CLIs": [
        "mld-snooping enable",
        "undo mld-snooping enable"
    ],
    "ParentView": [
        "VSI-STATIC view",
        "VSI-BD view",
        "VSI-AUTO view",
        "VSI-DEFAULT view"
    ],
    "ParaDef": [
        {
            "Parameters": "enable",
            "Info": "Enable-function-of-MLD-snooping.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mld-snooping enable",
            "[*HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] vsi vsi1",
            "[*HUAWEI-vsi-vsi1] pwsignal ldp",
            "[*HUAWEI-vsi-vsi1-ldp] vsi-id 1",
            "[*HUAWEI-vsi-vsi1-ldp] quit",
            "[*HUAWEI-vsi-vsi1] mld-snooping enable"
        ],
        [
            "<HUAWEI> system-view",
            "[*HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] vsi vsi1",
            "[*HUAWEI-vsi-vsi1] pwsignal ldp",
            "[*HUAWEI-vsi-vsi1-ldp] vsi-id 1",
            "[*HUAWEI-vsi-vsi1-ldp] quit",
            "[*HUAWEI-vsi-vsi1] undo mld-snooping enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nMLD snooping runs on a Layer 2 device that is deployed between a Layer 3 device and user hosts. The Layer 2 device can then maintain multicast forwarding entries by listening to multicast protocol messages transmitted between the upstream device and hosts, controlling multicast data packet forwarding. Enabling MLD snooping is the prerequisite for implementing Layer 2 multicast. To enable MLD snooping for specific VLANs, run the mld-snooping enable vlan command.\nMLD snooping runs on a Layer 2 device that is deployed between a Layer 3 device and user hosts. The Layer 2 device can then maintain multicast forwarding entries by listening to multicast protocol messages transmitted between the upstream device and hosts, controlling multicast data packet forwarding. Enabling MLD snooping is the prerequisite for implementing Layer 2 multicast. To enable MLD snooping for a specific VLAN/VSI, run the mld-snooping enable command.\n<\nRunning the mld-snooping enable command or its undo form in the system view enables or disables MLD snooping globally.Running the mld-snooping enable command or its undo form in the VLAN/VSI view enables or disables MLD snooping only for this VLAN/VSI. MLD snooping can be enabled for a VLAN/VSI only if MLD snooping is enabled globally. After MLD snooping is enabled in the system view, MLD snooping is still disabled for a VLAN/VSI by default.\n\nPrecautions\nThe command fails to be run in a VSI view in the following condition:\nThe VSI is bound to a BD."
}