{
    "PageTitle": "mld-snooping router-aging-time",
    "FuncDef": "The mld-snooping router-aging-time command sets the aging time of dynamic router interfaces.\nThe undo mld-snooping router-aging-time command restores the default value.\nBy default, the aging time of dynamic router interfaces is 180s or equals the Holdtime value contained in a Protocol Independent Multicast (PIM) Hello message.",
    "CLIs": [
        "mld-snooping router-aging-time <router-aging-time>",
        "undo mld-snooping router-aging-time"
    ],
    "ParentView": [
        "VLAN view"
    ],
    "ParaDef": [
        {
            "Parameters": "router-aging-time router-aging-time",
            "Info": "Specifies the aging time of dynamic router interfaces.\nThe value is an integer ranging from 1 to 1000, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mld-snooping enable",
            "[*HUAWEI] vlan 10",
            "[*HUAWEI-vlan100] mld-snooping router-aging-time 500"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nNetwork congestion may delay the transmission of a Query message from an MLD Querier. If a dynamic router interface does not receive any MLD Query message with source IP addresses other than 0::0 or PIM hello message within the aging time, it becomes a non-router interface. The device will then not send Report or Done messages to the interface. This may lead to multicast data transmission interruption. Therefore, if a network is unstable, run the mld-snooping router-aging-time command to set larger aging time for dynamic router interfaces. The device resets the aging time of a dynamic router interface when the interface receives an MLD Query or PIM Hello message from the interface.\nConfiguration Impact\nIf the remaining aging time of a dynamic router interface is less than router-aging-time, the device sets the aging time of the dynamic router port to router-aging-time, irrespective of whether the device receives a PIM Hello messages or MLD Query message from the interface.\nPrecautions\nThe\nmld-snooping router-aging-time command fails to be run in a VLAN view in any of the following conditions:\nThe VLAN is bound to a VSI."
}