{
    "PageTitle": "mld-snooping version (VSI view)",
    "FuncDef": "The mld-snooping version command sets the version of MLD messages that can be processed in MLD snooping.\nThe undo mld-snooping version command restores the default value.\nBy default, the device can process MLDv1 and MLDv2 messages.",
    "CLIs": [
        "mld-snooping version <number>",
        "undo mld-snooping version"
    ],
    "ParentView": [
        "VSI-STATIC view",
        "VSI-BD view",
        "VSI-AUTO view",
        "VSI-DEFAULT view"
    ],
    "ParaDef": [
        {
            "Parameters": "number",
            "Info": "Indicates the version number of MLD.\nThe value can be 1 or 2."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mld-snooping enable",
            "[*HUAWEI] vlan 10",
            "[*HUAWEI-vlan100] mld-snooping enable",
            "[*HUAWEI-vlan100] mld-snooping version 2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf hosts connected to a Layer 2 device support different MLD versions, run the mld-snooping version command to set the version of MLD messages that can be processed.\nIf is set to 1, only MLDv1 messages can be processed. If is set to 2, both MLDv1 and MLDv2 messages can be processed.\nConfiguration Impact\nWhen the MLD version is changed from 2 to 1,\nThe system immediately deletes all dynamically generated Layer 2 multicast forwarding entries.The system processes statically configured Layer 2 multicast forwarding entries as follows:If interfaces are configured to statically join multicast groups with no multicast source specified, the system does not delete the static MLD forwarding entries.If interfaces are configured to statically join source-specific multicast groups, the system deletes the static forwarding entries. When the MLD version is changed to 2, the system re-generates the forwarding entries.\n\nPrecautions\nIf MAC address-based forwarding is enabled, MLDv2 is not supported.\nThe mld-snooping version command fails to be run in a VLAN view in any of the following conditions:\nThe VLAN is bound to a VSI.\nThe mld-snooping version command fails to be run in a VSI view in the following condition:\nThe VSI is bound to a BD."
}