{
    "PageTitle": "mld-snooping (VSI view)",
    "FuncDef": "The mld-snooping command sets a multicast group model in a VLAN/VSI.\nThe undo mld-snooping command restores the default multicast group model.\nBy default, the multicast group model is ASM-SSM, allowing the device to support both any-source multicast (ASM) and source-specific multicast (SSM) messages in a VLAN/VSI.",
    "CLIs": [
        "mld-snooping { ssm-only | asm-only | asm-ssm }",
        "undo mld-snooping { ssm-only | asm-only }"
    ],
    "ParentView": [
        "VSI-AUTO view",
        "VSI-BD view",
        "VSI-DEFAULT view",
        "VSI-STATIC view"
    ],
    "ParaDef": [
        {
            "Parameters": "ssm-only",
            "Info": "Enables the device to learn multicast group entries in the SSM range.\n-"
        },
        {
            "Parameters": "asm-only",
            "Info": "Enables the device to learn multicast group entries in the ASM range.\n-"
        },
        {
            "Parameters": "asm-ssm",
            "Info": "Enables the device to learn multicast group entries in both the ASM and SSM ranges.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mld-snooping enable",
            "[*HUAWEI] vlan 2",
            "[*HUAWEI-vlan2] mld-snooping enable",
            "[*HUAWEI-vlan2] mld-snooping asm-only"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBased on whether multicast messages carry source addresses, multicast messages are categorized as ASM and SSM messages. To configure the type of multicast message that the device can process in a VLAN/VSI, run the mld-snooping command.\nPrerequisites\nMLD snooping has been enabled both globally and in the VLAN/VSI view using the mld-snooping enable command.\nConfiguration Impact\nIf asm-only is specified, only (*, G) messages are processed, and other messages are discarded.\nIf ssm-only is specified, only (S, G) messages are processed, and other packets are discarded.\nPrecautions\nThe mld-snooping command applies only to MLDv2."
}