{
    "PageTitle": "reset igmp-snooping group",
    "FuncDef": "The reset igmp-snooping group command clears the dynamic forwarding entries from a multicast forwarding table.",
    "CLIs": [
        "reset igmp-snooping group { vlan { <vlan-id> | all } | vsi { name <vsi-name> | all } | all }"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "vlan vlan-id",
            "Info": "Clears the dynamic forwarding entries of a specified VLAN.\nThe value ranges from 1 to 4094."
        },
        {
            "Parameters": "vlan all",
            "Info": "Clears the dynamic forwarding entries from the multicast forwarding tables in all VLANs.\n-"
        },
        {
            "Parameters": "all",
            "Info": "Clears the dynamic forwarding entries from the multicast forwarding tables in all VLANs and VSIs.\n-"
        },
        {
            "Parameters": "vsi all",
            "Info": "Clears the dynamic forwarding entries from the multicast forwarding tables in all VSIs.\n-"
        },
        {
            "Parameters": "name vsi-name",
            "Info": "Clears the dynamic forwarding entries of a specified VSI.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset igmp-snooping group all"
        ],
        [
            "<HUAWEI> reset igmp-snooping group vlan 2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen the command is used to clear the dynamic forwarding entries in a certain VLAN/VSI, the multicast traffic received by hosts in the VLAN/VSI is interrupted until the hosts send IGMP Report messages again. After receiving the IGMP Report messages, the Router regenerates the forwarding entries and the hosts start to receive the multicast traffic again.\nIf the VLAN is bound to a VSI, the system does not prompt error information when the reset igmp-snooping group vlan all command is run."
}