{
    "PageTitle": "authentication-mode (AP view)",
    "FuncDef": "The authentication-mode command configures authentication modes that can be used in an authentication scheme.\nThe undo authentication-mode command deletes authentication modes that can be used in an authentication scheme.\nBy default, only local authentication is used.",
    "CLIs": [
        "authentication-mode { hwtacacs | local } *",
        "undo authentication-mode"
    ],
    "ParentView": [
        "AP view"
    ],
    "ParaDef": [
        {
            "Parameters": "hwtacacs",
            "Info": "Enables HWTACACS authentication.\n-"
        },
        {
            "Parameters": "local",
            "Info": "Enables local authentication.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ap-id 1024",
            "[*HUAWEI-ap1024] authentication-mode hwtacacs local"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf several authentication modes are used in an authentication scheme, these authentication modes take effect in the sequence of their configurations.\nWhen remote authentication is performed only after local authentication fails:If the login account has not been created locally, remote authentication is performed.\nIf the login account has been created on both the local and remote servers and an incorrect password causes the local authentication to fail, remote authentication is not performed.\nWhen local authentication is performed only after remote authentication fails:If the login account has been created on the local device but not been created on the remote server, remote authentication fails, and local authentication is not performed.\nLocal authentication is performed only after the remote authentication server goes Down.\n\nLocal authentication takes effect only if the remote RADIUS server does not respond (for example, the remote server is Down).\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}