{
    "PageTitle": "hwtacacs-server shared-key",
    "FuncDef": "The hwtacacs-server shared-key command configures the shared key for HWTACACS server.\nThe undo hwtacacs-server shared-key command removes the configured shared key of the HWTACACS server.\nBy default, the shared key is not configured.",
    "CLIs": [
        "hwtacacs-server shared-key <key-string>",
        "hwtacacs-server shared-key cipher <cipher-string>",
        "undo hwtacacs-server shared-key"
    ],
    "ParentView": [
        "Virtual access HWTACACS view"
    ],
    "ParaDef": [
        {
            "Parameters": "key-string",
            "Info": "Specifies the shared key in encrypted or simple text.\nThe shared key configured in simple text is displayed in ciphertext.\nThe value is a string of 1 to 256 case-sensitive characters in plain text or a string of 20 to 432 case-sensitive characters in ciphertext, question marks (?) or spaces not supported.\nThe string can contain spaces if it is enclosed in double quotation marks (\")."
        },
        {
            "Parameters": "cipher cipher-string",
            "Info": "Specifies the shared-key in ciphertext.\nThe new password is at least eight characters long and contains at least two of the following types: upper-case letters, lower-case letters, digits, and special characters.\nThe value is a string of 1 to 256 case-sensitive characters in plain text or a string of 20 to 432 case-sensitive characters in ciphertext, question marks (?) or spaces not supported.\nThe string can contain spaces if it is enclosed in double quotation marks (\")."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ap-id 1024",
            "[*HUAWEI-ap1024] hwtacacs",
            "[*HUAWEI-ap1024-hwtacacs] hwtacacs-server shared-key cipher Hello-huawei13579"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe shared key encrypts the HWTACACS packets. While sending the authentication packets to the clients, the HWTACACS server encrypts the important information. The HWTACACS server uses the Message Digest 5 (MD5) algorithm for encryption to ensure the security.\nThe shared key set on the AP and the HWTACACS server must be the same.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nYou can change the shared key and the new shared key can be used for new requests. The encryption algorithm used for MD5 authentication poses security risks."
}