{
    "PageTitle": "hwtacacs-server",
    "FuncDef": "The hwtacacs-server command configures an HWTACACS server in the virtual access HWTACACS view.\nThe undo hwtacacs-server command deletes an HWTACACS server from the virtual access HWTACACS view.\nBy default, HWTACACS server is not configured.",
    "CLIs": [
        "hwtacacs-server <ip-address> [ <port> ] [ shared-key { <key-string> | cipher <cipher-string> } ] [ secondary ]",
        "undo hwtacacs-server <ip-address> [ <port> ]"
    ],
    "ParentView": [
        "Virtual access HWTACACS view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address",
            "Info": "Specifies the IP address of a server.\nThe value is in dotted decimal notation and must be a valid unicast address."
        },
        {
            "Parameters": "port",
            "Info": "Specifies the port number of a server.\nThe value is an integer ranging from 1 to 65535. The default value is 49."
        },
        {
            "Parameters": "shared-key",
            "Info": "Specifies the shared-key.\n-"
        },
        {
            "Parameters": "key-string",
            "Info": "Specifies the shared key in encrypted or plain text.\nThe value is a string of 1 to 256 case-sensitive characters in plain text or a string of 20 to 432 case-sensitive characters in ciphertext, question marks (?) or spaces not supported.\nThe string can contain spaces if it is enclosed in double quotation marks (\")."
        },
        {
            "Parameters": "cipher cipher-string",
            "Info": "Specifies the shared-key in encrypted or plain text, and the configured text will be displayed as encrypted text.\nThe new password is at least eight characters long and contains at least two of the following types: upper-case letters, lower-case letters, digits, and special characters.\nThe value is a string of 1 to 256 case-sensitive characters in plain text or a string of 20 to 432 case-sensitive characters in ciphertext, question marks (?) or spaces not supported.\nThe string can contain spaces if it is enclosed in double quotation marks (\")."
        },
        {
            "Parameters": "secondary",
            "Info": "Sets the secondary HWTACACS server. If this parameter is not specified, the server is the primary server.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ap-id 1024",
            "[*HUAWEI-ap1024] hwtacacs",
            "[*HUAWEI-ap1024-hwtacacs] hwtacacs-server 192.168.0.1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen the authentication mode is set to HWTACACS in the port extension system, an HWTACACS server needs to be configured. To configure an HWTACACS server in the virtual access HWTACACS view, run the hwtacacs-server command.\nPrecautions\nThis command is supported only on the admin VS.\nThe master and slave servers must be allocated different IP addresses; otherwise, the configuration fails."
}