{
    "PageTitle": "login-user login-password",
    "FuncDef": "The login-user login-password command configures the user name and password on the master for the user to log in to a specified AP using the master.\nThe undo login-user command deletes the user name and password on the master for the user to log in to a specified AP using the master.\nBy default, no user name or password for the user to log in to a specified AP using the master is configured on the master.",
    "CLIs": [
        "login-user <user-name> login-password [ <password> ]",
        "undo login-user <user-name>"
    ],
    "ParentView": [
        "AP view"
    ],
    "ParaDef": [
        {
            "Parameters": "user-name",
            "Info": "Specifies the user name for the user to log in to a specified AP using the master.\nThe value is a string of 1 to 253 case-insensitive characters, spaces not supported."
        },
        {
            "Parameters": "password",
            "Info": "Specifies the user password for the user to log in to a specified AP using the master.\nThe new password is at least eight characters long and contains at least two of the following types: upper-case letters, lower-case letters, digits, and special characters.\nThe password can be entered in either unencrypted or encrypted.\nIf a password is entered in unencrypted, the value is a string of 1 to 128 case-sensitive characters. When you input a password in simple text, the system displays the password in simple text mode, which brings risks.If a password is entered in ciphertext, the value is a string of 32 to 268 case-sensitive characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ap-id 1025",
            "[*HUAWEI-ap1025] login-user root123 login-password Root@123"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure the user name and password on the master for the user to log in to a specified AP using the master, run the login-user login-password command.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}