{
    "PageTitle": "set flow-stat interval (virtual access AP-ID view)",
    "FuncDef": "The set flow-stat interval command sets a global interval for collecting traffic statistics on an AP.\nThe undo set flow-stat interval command restores the default setting.\nBy default, the global interval for collecting traffic statistics on an AP is 300 seconds.",
    "CLIs": [
        "set flow-stat interval <interval>",
        "undo set flow-stat interval"
    ],
    "ParentView": [
        "Virtual access AP-ID view"
    ],
    "ParaDef": [
        {
            "Parameters": "interval",
            "Info": "Specifies the interval at which traffic statistics are collected on an interface.\nThe value is an integer ranging from 10 to 600 and must be a multiple of 10, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] virtual-access port-extend",
            "[*HUAWEI-virtual-access-portextend] role master",
            "[*HUAWEI-virtual-access-portextend] commit",
            "[~HUAWEI-virtual-access-portextend] quit",
            "[~HUAWEI] ap-id 2000",
            "[*HUAWEI-ap2000] set flow-stat interval 200"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn port extension scenarios, traffic statistics collection is enabled on all interfaces of an AP by default to monitor the running status of interfaces and services. To adjust the interval for collecting traffic statistics on all interfaces of an AP, run the set flow-stat interval command. To closely monitor traffic changes, set the interval to a smaller value. If AP resources are limited, set the interval to a larger value to prevent frequent traffic statistics collection from occupying resources. After the set flow-stat interval command is run on the master, the configuration is delivered to the corresponding AP and takes effect on the AP's external communication interfaces mapped to the port extension interfaces with no traffic statistics collection interval configured.\nPrerequisites\nThe role master command has been run to configure the device as a master.\nPrecautions\nIf an interval for collecting traffic statistics is set in the virtual access AP-ID interface view, the interval preferentially takes effect on the AP's external communication interface mapped to the virtual access AP-ID interface."
}