{
    "PageTitle": "control-tunnel authentication keychain",
    "FuncDef": "The control-tunnel authentication keychain command configures keychain authentication for a control channel.\nThe undo control-tunnel authentication keychain command restores the default configuration.\nBy default, no keychain authentication is configured for a control channel.",
    "CLIs": [
        "control-tunnel authentication keychain <keychain-name>",
        "undo control-tunnel authentication keychain"
    ],
    "ParentView": [
        "Virtual access port-extension view"
    ],
    "ParaDef": [
        {
            "Parameters": "keychain-name",
            "Info": "Specifies a keychain name, which is configured using the keychain command.\nThe value is a string of 1 to 47 case-insensitive characters. The string does not contain question marks or spaces. The string can contain spaces if it is enclosed in double quotation marks (\")."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] virtual-access port-extend",
            "[*HUAWEI-virtual-access-portextend] role master",
            "[*HUAWEI-virtual-access-portextend] control-tunnel authentication keychain kc1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn the virtual access system, an AP and master establish a control channel to exchange control information. To improve control channel security, run the control-tunnel authentication keychain command on a master to configure keychain authentication for the control channel. After the AP and master establish a NETCONF channel, the master delivers the command configuration to the AP.\nPrerequisites\nA node has been configured as a master using the role master command.A keychain has been created using the keychain command.\n\nConfiguration Impact\nAfter the control-tunnel authentication keychain command is run, the master uses a specified keychain to authenticate the AP. If the authentication fails, a control channel cannot be established.\nPrecautions\nThis command is supported only on the admin VS.\nWhen you directly log in to an AP:\nIf the AP has established a NETCONF channel to a master, the control-tunnel authentication keychain command cannot be run.If the AP has not established a NETCONF channel to a master, the control-tunnel authentication keychain command can be run.\nThis command supports the reference of an undefined keychain. However, if the number of keychains that has been defined on a device reaches the upper limit, this command does not support the reference of an undefined keychain."
}