{
    "PageTitle": "virtual-access enable (interface view)",
    "FuncDef": "The virtual-access enable command enables port extension on an interface and configures the interface as an internal communication interface.\nThe undo virtual-access enable command disables port extension on an interface.\nBy default, port extension is disabled on an interface.",
    "CLIs": [
        "virtual-access enable",
        "undo virtual-access enable"
    ],
    "ParentView": [
        "100GE interface view",
        "10GE interface view",
        "25GE interface view",
        "40GE interface view",
        "50GE interface view",
        "Eth-Trunk interface view",
        "GE optical interface view",
        "GE electrical interface view",
        "IP-Trunk interface view",
        "POS interface view",
        "XGE interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] virtual-access port-extend",
            "[*HUAWEI-virtual-access-portextend] role master",
            "[*HUAWEI-virtual-access-portextend] commit",
            "[~HUAWEI-virtual-access-portextend] quit",
            "[~HUAWEI] interface GigabitEthernet 1/1/0/0",
            "[~HUAWEI-GigabitEthernet1/1/0/0] virtual-access enable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] virtual-access port-extend",
            "[*HUAWEI-virtual-access-portextend] role master",
            "[*HUAWEI-virtual-access-portextend] commit",
            "[~HUAWEI-virtual-access-portextend] quit",
            "[~HUAWEI] interface Eth-Trunk 10",
            "[~HUAWEI-Eth-Trunk10] virtual-access enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo establish a port extension system, run the virtual-access enable command on an interface connecting a master to an AP to enable the port extension on the interface and configure the interface as an internal communication interface. To increase the bandwidth or improve reliability, you can also run the command in the Eth-Trunk interface view to enable the port extension and configure the Eth-Trunk interface as an internal trunk interface.\nAfter an AP automatically goes online, port extension is automatically enabled on the AP's all Ethernet interfaces. In addition, the AP automatically saves the virtual-access enable configuration on the corresponding interface. However, the AP's internal communication interface must be specified using the inner-connect binding command.\nPrerequisites\nA node has been configured as a master using the role master command.\nConfiguration Impact\nAfter the virtual-access enable command is run, a port extension IS-IS process is automatically enabled on the interface and the isis circuit-type p2p command is automatically run to simulate the interface as a P2P interface.After an Eth-Trunk interface is configured as an internal trunk interface, the Eth-Trunk interface's member interfaces automatically inherit the attributes of the internal trunk interface.Physical internal communication interfaces and internal trunk interfaces do not support service configuration or sub-interface creation.\n\nPrecautions\nThis command is supported only on the admin VS.\nInternal trunk interfaces support only manual load balancing.\nIn the same interface view, the virtual-access enable command is mutually exclusive with the following commands:\nip binding vpn-instanceportswitcheth-trunkmpls l2vpn arp-dual-sendingmpls l2vcl2 bindingmpls l2vpn pw traffic-statistics enablebinding tunnel gremplsipv6 enableip addres"
}