{
    "PageTitle": "admin (virtual access AP-ID view)",
    "FuncDef": "The admin command configures a management IP address for an AP on a master.\nBy default, no management IP address is configured for an AP on a master.",
    "CLIs": [
        "admin <ip-address>"
    ],
    "ParentView": [
        "Virtual access AP-ID view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address",
            "Info": "Specifies a management IP address for an AP.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ap-id 1025",
            "[*HUAWEI-ap1025] admin 10.3.3.9"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn the port extension system, a master uses an internal management channel to deliver configurations and forwarding entries to an AP and exchange control information with an AP. To establish an internal management channel, run the admin command to configure a management IP address for the AP on the master. After the command is run, the admin configuration in the port extension view is generated in the AP's PnP process. The master delivers the configuration to the AP, and the AP automatically performs and saves the configuration.\nPrerequisites\nThe admin command must be run independently and takes effect immediately after being run. Therefore, ensure that all the configurations have been committed before running this command.\nConfiguration Impact\nAfter the configuration is complete, the remote AP generates an loopback interface corresponding to the IP address.\nThe admin ip can only be modified and cannot be deleted. Otherwise, the AP will be disconnected permanently.\nPrecautions\nAn AP's management IP address must be unique on a master.After an internal management channel is established, the master uses this channel to deliver the management IP address configuration to the AP. The management IP address configuration takes effect on the master after the AP automatically performs the configuration.\nThis command is supported only on the admin VS."
}