{
    "PageTitle": "inner-connect binding",
    "FuncDef": "The inner-connect binding command binds internal communication interfaces on an AP and master.\nThe undo inner-connect binding command restores the default configuration.\nBy default, no internal communication interfaces on an AP and master are bound.",
    "CLIs": [
        "inner-connect { <ap-interface-name> | <ap-interface-type> <ap-interface-number> } binding { <master-interface-name> | <master-interface-type> <master-interface-number> }",
        "undo inner-connect { <ap-interface-name> | <ap-interface-type> <ap-interface-number> } binding { <master-interface-name> | <master-interface-type> <master-interface-number> }"
    ],
    "ParentView": [
        "Virtual access AP-ID view"
    ],
    "ParaDef": [
        {
            "Parameters": "ap-interface-name ap-interface-type ap-interface-number",
            "Info": "Specifies the type and number of an internal communication interface on an AP.\nThe value is a three-dimensional Ethernet interface."
        },
        {
            "Parameters": "master-interface-name master-interface-type master-interface-number",
            "Info": "Specifies the type and number of an internal communication interface on a master.\nThe value is a four-dimensional Ethernet interface, and the first dimension is 1."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ap-id 1025",
            "[*HUAWEI-ap1025] inner-connect GigabitEthernet 1/0/1 binding GigabitEthernet 1/1/0/1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn a port extension system, data traffic is transmitted through the internal forwarding channel between internal communication interfaces on an AP and master. To set up the channel, you must run the inner-connect binding command on the master to bind the internal communication interfaces.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nYou must ensure that the binding configured using the command matches the actual physical connection. Otherwise, traffic between the master and AP cannot be forwarded.\nThe value of master-interface-type master-interface-number must be a local physical internal communication interface or an internal trunk interface's member interface. If an internal trunk interface's member interface is specified, you must ensure that the same internal trunk interface's member interface can only be bound to the same AP's internal communication interface."
}