{
    "PageTitle": "upgrade delete-package type",
    "FuncDef": "The upgrade delete-package type command deletes AP software packages through the Master in port extension scenarios.",
    "CLIs": [
        "upgrade delete-package type { software | patch | mod } [ <pattern> ] { { ap-id { <startap-id> [ to <endap-id> ] } &<1-10> } | all-ap }"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "software",
            "Info": "Indicates that the software package is the system software package with the file name extension .cc.\n-"
        },
        {
            "Parameters": "patch",
            "Info": "Indicates that the software package is the patch package with the file name extension .pat.\n-"
        },
        {
            "Parameters": "mod",
            "Info": "Indicates that the software package is the MOD patch package with the file name extension .mod.\n-"
        },
        {
            "Parameters": "pattern",
            "Info": "Specifies the pattern of a software package name.\nThe value is a string of 1 to 127 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "ap-id",
            "Info": "Deletes a software package with a specified AP ID.\n-"
        },
        {
            "Parameters": "startap-id",
            "Info": "Specifies a start AP ID for AP software packages to be deleted in batches.\nThe value is an integer ranging from 1024 to 8191."
        },
        {
            "Parameters": "endap-id",
            "Info": "Specifies an end AP ID for AP software packages to be deleted in batches.\nThe endap-id value must be larger than the <startap-id> value.\nThe value is an integer ranging from 1024 to 8191."
        },
        {
            "Parameters": "all-ap",
            "Info": "Deletes all AP software packages.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> upgrade delete-package type mod ap-id 2001",
            "Warning: The mod to be deleted cannot be recycled. Continue? [Y/N]:y ",
            "Info: Operating, please wait for a moment...done. ",
            "Info: Succeeded in deleting the package on AP 2001."
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo free up the system storage space, run the upgrade delete-package type command to delete AP software packages through the Master. This command can delete the following types of software packages:\nSystem software package with the file name extension .ccFormal patch package with the file name extension .patMOD patch package with the file name extension .mod\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}