{
    "PageTitle": "display virtual-access ap",
    "FuncDef": "The display virtual-access ap command displays basic information about an AP on a master.",
    "CLIs": [
        "display virtual-access ap [ <ap-id> ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "ap-id",
            "Info": "Displays basic information about a specified AP.\nThe value is an integer ranging from 1024 to 8191."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display virtual-access ap",
            "                                 AP Information",
            "-----------------------------------------------------------------------------------------------",
            " AP Esn               : 391092333866236",
            " AP ID                : 2000               Admin IP           : 2.2.2.2",
            " Master               : 1.1.1.1           ",
            " State                : Online            ",
            " Online Time          : 2017-09-30 01:03:56"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter establishing a port extension system, you can run the display virtual-access ap command on a master to view basic information about an AP on the master. The information includes the AP's ESN, AP's management IP address, and management IP addresses of the master.\nIf no parameter is specified, basic information about all APs is displayed.\nPrecautions\nThe online status of an AP is related to the status of the control channel between the master and AP. If the control channel is Up, the online status of the AP is displayed as Online. If the master is disconnected from the AP, the control channel goes Down only after the timeout time elapses. If the control channel is Down, the online status of the AP is displayed as Offline.The information about the master for an AP is related to the IS-IS topology node. When a master is disconnected from an AP, the information about the master for an AP is updated only after the IS-IS topology node is aged and deleted.\nThis command is supported only on the admin VS."
}