{
    "PageTitle": "display virtual-access bindinfo",
    "FuncDef": "The display virtual-access bindinfo command displays the bindings between internal communication interfaces and port extension interfaces on a master.",
    "CLIs": [
        "display virtual-access bindinfo [ interface { <interface-name> | <interface-type> <interface-number> } | ap <ap-id> ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "interface-name",
            "Info": "Displays the bindings between a specified internal communication interface and port extension interfaces on a master.\n-"
        },
        {
            "Parameters": "interface-type interface-number",
            "Info": "Displays the bindings between a specified internal communication interface and port extension interfaces on a master.\nThe value can be a four-dimensional Ethernet physical interface, and the first dimension is 1. The value can also be an internal trunk interface."
        },
        {
            "Parameters": "ap ap-id",
            "Info": "Displays the bindings between internal communication interfaces and the port extension interface for a specified AP on a master.\nThe value is an integer ranging from 1024 to 8191."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display virtual-access bindinfo",
            "--------------------------------------------------------------------------------------",
            "AP-ID           Inner-interface                     Out-interface                      ",
            "--------------------------------------------------------------------------------------",
            "2000            Eth-Trunk10                         GigabitEthernet2000/1/0/1                 ",
            "2000            GigabitEthernet1/1/0/2             GigabitEthernet2000/1/0/2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter a port extension system is established, you can run the display virtual-access bindinfo command to check the bindings between internal communication interfaces and port extension interfaces on a master.\nIf no optional parameter is specified, the system displays the bindings between all internal communication interfaces and port extension interfaces on a master by default.\nPrecautions\nThis command is supported only on the admin VS.\nTo run this command to display bindings, you must bind internal communication interfaces on an AP and master and bind an AP's external communication interface to a master's internal communication interface."
}