{
    "PageTitle": "virtual-access port-extend",
    "FuncDef": "The virtual-access port-extend command enables port extension and displays the virtual access port extension view.\nThe undo virtual-access port-extend command disables port extension.\nBy default, port extension is disabled.",
    "CLIs": [
        "virtual-access port-extend",
        "undo virtual-access port-extend"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] virtual-access port-extend",
            "[*HUAWEI-virtual-access-portextend]"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn an IP core network, to meet more and more service deployment requirements on the access and network sides, PE or P devices need to provide high-density Ethernet interfaces. To meet this need, deploy a port extension system. In this system, configure a device with higher performance as a master and a large number of low-end devices that support Ethernet interfaces as APs, and map the APs' Ethernet interfaces to the master's port extension interfaces, so that the master provides high-density Ethernet interfaces. This ensures that the existing devices that support Ethernet interfaces are fully used and prevents a large number of devices that support Ethernet interfaces from being purchased, significantly reducing network construction costs. The port extension system can implement AP plug-and-play (PnP). You can configure and manage all APs on a master, which simplifies network and service deployment and reduces O&M difficulties.\nTo establish a port extension system, run the virtual-access port-extend command on a master to enable port extension.\nConfiguration Impact\nAfter the undo virtual-access port-extend command is run, all configurations in the virtual access port extension view are deleted, and the port extension enabling configurations on all APs and internal communication interfaces and the configurations on port extension interfaces are also deleted.\nFollow-up Procedure\nRun the role master command to configure the node as a master.\nPrecautions\nAfter the undo virtual-access port-extend command is executed under the system view, all configurations under the virtual-access-portextend view and all virtual-access enable configurations under the interface view are also removed.This command is mutually exclusive to the sdn agent command, cannot be configured at the same time this command is mutually exclusive with the virtual-cluster-access command, and cannot be configured at the same time.\nIn VS mode, this command is supported only by the admin VS."
}