{
    "PageTitle": "flag (Port extension interface view)",
    "FuncDef": "The flag command configures overhead bytes to be added to the packet on a port extension interface.\nThe undo flag command restores the default setting.\nBy default, the value of flag c2 is hexadecimal 0x1a, and the default values of flag j1 and flag j0 are empty and have no display.",
    "CLIs": [
        "flag j0 { 1byte-mode <1byte-value> | 16byte-mode <16byte-value> | 64byte-or-null-mode [ <64byte-value> ] }",
        "flag c2 <c2-value>",
        "flag j1 { 1byte-mode <1byte-value> | 16byte-mode <16byte-value> | 64byte-or-null-mode [ <64byte-value> ] }",
        "undo flag",
        "undo flag j0",
        "undo flag j1",
        "undo flag c2"
    ],
    "ParentView": [
        "Port extension interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "1byte-mode 1byte-value",
            "Info": "Specifies the value of the j0 or j1 byte when the 1byte-mode mode is used.\nThe value is an integer that ranges from 0 to 255."
        },
        {
            "Parameters": "16byte-mode 16byte-value",
            "Info": "Specifies the value of the j0 or j1 byte when the 16 byte-mode mode is used.\nThe value is a string of 1 to 15 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "64byte-or-null-mode 64byte-value",
            "Info": "Specifies the value of the j0 or j1 byte when the 64 byte-or-null-mode mode is used.\nThe value is a string of 1 to 62 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "c2 c2-value",
            "Info": "Specifies the path signal label byte. It is a higher-order path overhead byte for identifying the multiplexing structure and payload attribute in a VC frame.\nThe value of c2 is configured as an integer, and displayed in both decimal and hexadecimal formats in a configuration file.\nThe value is an integer that ranges from 0 to 255 ."
        },
        {
            "Parameters": "j1",
            "Info": "Indicates the higher-order VC-N path trace byte. It is a higher-order path overhead byte for identifying a higher-order path access point. Like sending the J0 byte, a sender sends this byte periodically to keep the connection with a receiver.\n-"
        },
        {
            "Parameters": "j0",
            "Info": "Indicates the regenerator section trace byte. It is a section overhead byte for identifying a section access point. A sender sends this byte periodically to keep the connection with a receiver.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1025/1/0/0",
            "[*HUAWEI-GigabitEthernet1025/1/0/0] flag j1 16byte-mode HUAWEI"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nSDH frames contain various overhead bytes that are used to implement operation and maintenance functions such as hierarchical management of SDH transport networks. J0 and J1 are used for interoperability between devices of different countries, regions, or manufacturers.\nConfiguration Impact\nOn a carrier's network, the J0 byte can be any character; at the border between networks managed by different carriers, the J0 bytes on the sender and receiver must be identical. J0 helps locate and rectify faults in advance and reduces the network recovery time.\nPrecautions\nC2 and J1 bytes on the sender and receiver must be identical."
}