{
    "PageTitle": "laser autoshutdown enable (Port extension interface view)",
    "FuncDef": "The laser autoshutdown enable command configures the optical module to disable the laser automatically.\nThe undo laser autoshutdown enable command disables the function.\nBy default, the optical module is not configured to disable the laser automatically.",
    "CLIs": [
        "laser autoshutdown enable",
        "undo laser autoshutdown enable"
    ],
    "ParentView": [
        "Port extension interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1025/1/0/0",
            "[~HUAWEI-GigabitEthernet1025/1/0/0] laser autoshutdown enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBefore locating or troubleshooting a link failure, maintenance engineers can run the laser turn-off command to disable the optical module laser manually to protect themselves from the laser. In addition, in case they forget to disable the optical module laser in time, they can run the laser autoshutdown enable command to configure the optical module to disable the laser automatically if it detects a link failure. After the maintenance engineers rectify the link failure, the optical module enables the laser automatically and goes back to the normal working state.\nPrerequisites\nThe optical module has been installed, and the interface has been Up.\nConfiguration Impact\nAfter the laser autoshutdown enable command is run and a links failure occurs, the optical module disables the laser, and the system checks whether the link failure is cleared at two intervals (closetime-interval and opentime-interval). The two intervals can be configured using the laser atuo-shutdown-interval command. In addition, you can configure an interval during which the optical module laser is enabled after the link failure is cleared. closetime-interval and opentime-interval are described as follows:\nclosetime-interval:If an LOS alarm is generated on the interface, the optical module disables the laser automatically, and an alarm is generated, indicating that the optical module laser has been disabled. During closetime-interval, the system checks whether the LOS alarm persists.If the LOS alarm is cleared, the optical module enables the laser automatically, and the opentime-interval timer starts.If the LOS alarm persists, the optical module laser remains disabled.\nopentime-interval:When the closetime-interval timer expires or the LOS alarm is cleared during closetime-interval, the optical module enables the laser automatically, and the opentime-interval timer starts. During opentime-interval, the system keeps checking whether new LOS alarms are generated.If no new LOS alarms are generated, the optical module considers that the link failure has been cleared and goes back to the normal working state, and a clear alarm is generated, indicating that the optical module has recovered.If new LOS alarms are generated, the optical module disables the laser automatically, and the closetime-interval timer starts over.\n\n\nFollow-up Procedure\nRun the laser auto-shutdown-interval command to configure closetime-interval and opentime-interval."
}