{
    "PageTitle": "patch load",
    "FuncDef": "The patch load command installs matching patches in a patch package for APs.",
    "CLIs": [
        "patch load <file-name> all run { { ap-id { <startapid> [ to <endapid> ] } &<1-10> } | all-ap }"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "file-name",
            "Info": "Specifies the storage path and file name of a patch package. This path can be an absolute or relative path.\nThe value is a string of 5 to 127 case-sensitive characters without spaces. The value of the patch name is a string of 5 to 63 characters."
        },
        {
            "Parameters": "all",
            "Info": "Installs patches on all boards.\n-"
        },
        {
            "Parameters": "run",
            "Info": "Runs the patch after a patch is installed.\n-"
        },
        {
            "Parameters": "startapid",
            "Info": "Specifies a start AP ID.\nThe value is an integer ranging from 1024 to 8191."
        },
        {
            "Parameters": "to endapid",
            "Info": "Specifies an end AP ID. An end AP ID cannot be less than a start AP ID.\nThe value is an integer ranging from 1024 to 8192."
        },
        {
            "Parameters": "all-ap",
            "Info": "Installs patches on all APs.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> patch load V800R012C00SPH001.PAT all run ap-id 2000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBefore installing a patch for APs, the system parses a patch package, checks the validity of patch files in the patch package, and obtains the attributes of the patch files, such as the patch type, board type, and version information.\nWhen you install a patch on a board of AP, the system searches the patch package for a matching patch file based on the attributes of the patch files.\nIf a matching patch file is found in the patch package, the system installs the patch.If no matching patch file is found in the patch package, the system does not install any patch.\n\nPrerequisites\nYou have uploaded a patch package to the root directory of an AP's main control board.\nConfiguration Impact\nAfter the patch load command is run, the system installs all types of patches in the patch package.\nIf you specify run, the system runs the installed patches directly.\n\nPrecautions\nThis command is supported only on the admin VS.\nIf you run the patch load command when the slave main control board is being registered, the system prompts you whether to install patches."
}