{
    "PageTitle": "upgrade download-package",
    "FuncDef": "The upgrade download-package command downloads a specified file to an AP.",
    "CLIs": [
        "upgrade download-package <packagename> [ server-ip <ip-address> server-port <port-number> ] { { ap-id { <startapid> [ to <endapid> ] } &<1-10> } | all-ap }"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "packagename",
            "Info": "Specifies the name of a file to be downloaded.\nThe value is a string of 5 to 127 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "server-ip ip-address",
            "Info": "Specifies the IP address of a server.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "server-port port-number",
            "Info": "Specifies the port number of a server.\nThe value is an integer ranging from 1 to 65535."
        },
        {
            "Parameters": "startapid",
            "Info": "Specifies a start AP ID.\nThe value is an integer ranging from 1024 to 8191."
        },
        {
            "Parameters": "to endapid",
            "Info": "Specifies an end AP ID. An end AP ID cannot be less than a start AP ID.\nThe value is an integer ranging from 1024 to 8191."
        },
        {
            "Parameters": "all-ap",
            "Info": "Downloads a file to all APs.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> upgrade download-package V800R012C00SPH001.PAT ap-id 1032",
            "SFTP username:huawei",
            "Password:"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo switch a software version for an AP, run the upgrade download-package command to download a system file to the AP. To run a patch file for an AP, run the upgrade download-package command to download the patch file to the AP.\nTo download a file from a master to a specified AP, run the upgrade download-package ap-id command.\nTo download a file from a master to all APs, run the upgrade download-package all-ap command.\nTo download a file from a specified server to a specified AP, run the upgrade download-package server-ip server-port  ap-id command.\nTo download a file from a specified server to all APs, run the upgrade download-package server-ip server-port all-ap command.\nPrecautions\nAfter this command is run, a user must enter an SFTP user name and password as prompted.\nThis command is supported only on the admin VS."
}