{
    "PageTitle": "negotiation (port-extend)",
    "FuncDef": "The negotiation auto command enables auto-negotiation on an optical Ethernet interface.\nThe negotiation default command restores the default configuration.\nThe undo negotiation auto command disables auto-negotiation on an optical Ethernet interface.\nBy default, Auto-negotiation is enabled on electrical Ethernet interfaces.Auto-negotiation is disabled on optical Ethernet interfaces.",
    "CLIs": [
        "negotiation auto",
        "negotiation default",
        "undo negotiation auto"
    ],
    "ParentView": [
        "Port extension interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "default",
            "Info": "negotiation default.\n-"
        },
        {
            "Parameters": "undo",
            "Info": "undo negotiation auto.\n-"
        },
        {
            "Parameters": "auto",
            "Info": "negotiation auto.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1025/1/0/0",
            "[~HUAWEI-GigabitEthernet1025/1/0/0] undo negotiation"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn a large-scale Ethernet network, manually setting the interface rate and duplex mode, verifying the configurations of devices, and checking statistics about Ethernet interfaces require a great deal of time and human input. Therefore, it is recommended that manually setting the interface rate and duplex mode be adopted only when auto-negotiation of an Ethernet link fails or a problem occurs with auto-negotiation.\nConfiguration Impact\nIf both ends support auto-negotiation, the duplex mode with a weaker capability is adopted. Interconnected devices working in auto-negotiation mode is the prerequisite to the auto-negotiation mechanism. If one end works in auto-negotiation mode while the other end works in fixed mode, the auto-negotiation mechanism does not take effect.\nPrecautions\nWhen the undo negotiation auto command is run to cancel the autonegotiation configurations, a message is added to prompt users to ensure consistent configuration on the two ends. If a GE electrical interface works at 1000 Mbit/s, it can work only in full-duplex mode."
}