{
    "PageTitle": "port-alarm disable optical-module (Port extension interface view)",
    "FuncDef": "The port-alarm disable optical-module command disables alarm functions for the optical module.\nThe undo port-alarm disable optical-module command enables alarm functions for the optical module.\nBy default, warnings are reported when the receive power exceeds the upper threshold, the receive power falls behind the lower threshold, the send power exceeds the upper threshold, the send power falls behind the lower threshold,the voltage exceeds the upper threshold and the voltage falls behind the lower threshold.",
    "CLIs": [
        "port-alarm disable optical-module { rx-power-high-warning | rx-power-low-warning | tx-power-high-warning | tx-power-low-warning | voltage-high-warning | voltage-low-warning } *",
        "undo port-alarm disable optical-module { rx-power-high-warning | rx-power-low-warning | tx-power-high-warning | tx-power-low-warning | voltage-high-warning | voltage-low-warning } *"
    ],
    "ParentView": [
        "Port extension interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "rx-power-high-warning",
            "Info": "Indicates that a warning is reported when the receive power exceeds the upper threshold.\n-"
        },
        {
            "Parameters": "rx-power-low-warning",
            "Info": "Indicates that a warning is reported when the receive power falls behind the lower threshold.\n-"
        },
        {
            "Parameters": "tx-power-high-warning",
            "Info": "Indicates that a warning is reported when the send power exceeds the upper threshold.\n-"
        },
        {
            "Parameters": "tx-power-low-warning",
            "Info": "Indicates that a warning is reported when the send power falls behind the lower threshold.\n-"
        },
        {
            "Parameters": "voltage-high-warning",
            "Info": "Indicates that a warning is reported when the voltage exceeds the upper threshold.\n-"
        },
        {
            "Parameters": "voltage-low-warning",
            "Info": "Indicates that a warning is reported when the voltage falls behind the lower threshold.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1025/1/0/0",
            "[*HUAWEI-GigabitEthernet1025/1/0/0] port-alarm disable optical-module rx-power-high-warning rx-power-low-warning tx-power-high-warning tx-power-low-warning"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1025/1/0/0",
            "[*HUAWEI-GigabitEthernet1025/1/0/0] undo port-alarm disable optical-module rx-power-high-warning rx-power-low-warning tx-power-high-warning tx-power-low-warning voltage-high-warning voltage-low-warning"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe system automatically obtains the vendor-defined power threshold of an optical module and compares it with the actual power. If the actual power exceeds the vendor-defined threshold, an alarm will be generated. Generally, the actual power is greater than the vendor-defined threshold, which means frequent alarm reporting. It is unfeasible to install an attenuator on each optical module to prevent frequent reporting of such power alarms. You can disable the alarm function for the optical module by executing the following command.\nThe device has two types of optical module power alarms: warning and alarm. A warning is reported when the difference between the actual power and vendor-defined threshold is not great. It can also be considered as a precaution. Some optical modules can continue working properly when the actual optical power is at the warning level. You can disable the alarm function for these optical modules to prevent these optical modules from frequently reporting warnings by executing the following command."
}