{
    "PageTitle": "reset counters interface (user view)",
    "FuncDef": "The reset counters interface remote command clears traffic of an AP's external communication interface corresponding to a specified port extension interface.\nThe reset counters if-mib interface remote command clears MIB statistics of an AP's external communication interface corresponding to a specified port extension interface.",
    "CLIs": [
        "reset counters [ if-mib ] interface { <interface-name> | <interface-type> <interface-number> } <remote>"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "interface-name",
            "Info": "Specifies the type and number of an AP's external communication interface.\n-"
        },
        {
            "Parameters": "interface-type interface-number",
            "Info": "Specifies the type of an interface. If the interface type and number are not specified, traffic statistics on all interfaces are deleted.\n-"
        },
        {
            "Parameters": "remote",
            "Info": "Indicates a port extension interface whose statistics is to be cleared in a port extension scenario.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset counters interface GigabitEthernet 1025/1/0/0 remote",
            "Info: Reset successfully."
        ],
        [
            "<HUAWEI> reset counters if-mib interface GigabitEthernet 1025/1/0/0 remote",
            "Info: Reset successfully."
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn a port extension scenario, to clear traffic or MIB statistics of the external communication interface corresponding to a specified port extension interface or port extension trunk interface on a master, run the reset counters interface remote command on the master.\nPrecautions\nThis command is supported only on the admin VS.\nThe remote traffic or MIB statistics cannot be restored after they are cleared. Therefore, exercise caution when running the reset counters interface remote command."
}