{
    "PageTitle": "trap-threshold crc-error percent (Port extension interface view)",
    "FuncDef": "The trap-threshold crc-error percent command enables CRC error threshold crossing detection and sets an alarm threshold for the CRC error percentage.\nThe undo trap-threshold crc-error command disables CRC error threshold crossing detection.\nBy default, CRC error detection is disabled, and no alarm threshold is set for the CRC error percentage.",
    "CLIs": [
        "trap-threshold crc-error percent <percent-value>",
        "undo trap-threshold crc-error"
    ],
    "ParentView": [
        "Port extension interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "percent-value",
            "Info": "Specifies an alarm threshold in percentage.\nThe value is an integer ranging from 1 to 100."
        },
        {
            "Parameters": "crc-error",
            "Info": "Specifies an exceed alarm threshold for CRC errors.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1025/1/0/0",
            "[*HUAWEI-GigabitEthernet1025/1/0/0] trap-threshold crc-error percent 10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo enable CRC error threshold crossing detection and set an alarm threshold for the CRC error percentage, run the trap-threshold crc-error percent command. When the percentage of CRC error frames to the total number of packets reaches the specified threshold, the device generates an alarm and sends it to an NMS. When the percentage of CRC error frames to the total number of packets falls below the specified threshold, the device generates a clear alarm and sends it to the NMS.\nAlarm threshold in percentages = Number of CRC error frames received by an interface within 1 second/Total number of packets received by an interface within 1 second\nConfiguration Impact\nIf shutdown is specified in the command and the interface is deactivated because the number of CRC error frames received within the specified interval reaches the configured alarm threshold, the interface remains Down even if a clear alarm is generated. To prevent services from being affected, activate the interface manually after a clear alarm is generated.\nPrecautions\nThe configured alarm threshold takes effect only when the alarm function is enabled for CRC errors. You can run the snmp-agent trap enable port crcexc-error command to enable the alarm function for CRC errors on an interface.\nThe following commands cannot coexist. The most recently run command overwrites the previous one.\ntrap-threshold crc-errortrap-threshold crc-error bit-error-ratiotrap-threshold crc-error high-thresholdtrap-threshold crc-error { mac-fcs-exc | mac-fcs-sd }trap-threshold crc-error percenttrap-threshold crc-error packet-error-ratio"
}