{
    "PageTitle": "trap-threshold crc-error high-threshold low-threshold (Port extension interface view)",
    "FuncDef": "The trap-threshold crc-error high-threshold low-threshold command sets an upper threshold, lower threshold, and detection interval for the CRC error alarm.\nThe undo trap-threshold crc-error high-threshold low-threshold command restores the upper threshold, lower threshold, and detection interval of the CRC error alarm to the default values.\nBy default, the upper threshold of the CRC error alarm is 1000, the lower alarm threshold is 100, and the detection interval is 10 seconds.",
    "CLIs": [
        "trap-threshold crc-error high-threshold <high-threshold> low-threshold <low-threshold> interval-second <interval> [ shutdown ]",
        "undo trap-threshold crc-error"
    ],
    "ParentView": [
        "Port extension interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "high-threshold high-threshold",
            "Info": "Specifies an upper alarm threshold.\nThe value is an integer ranging from 1 to 4294967295. The default value is 1000."
        },
        {
            "Parameters": "low-threshold low-threshold",
            "Info": "Specifies a lower alarm threshold.\nThe value is an integer ranging from 1 to 4294967295. The default value is 100."
        },
        {
            "Parameters": "interval-second interval",
            "Info": "Specifies a detection interval for CRC error frames.\nThe value is an integer ranging from 1 to 65535, in seconds. The default value is 10."
        },
        {
            "Parameters": "shutdown",
            "Info": "Shuts down an interface at the physical layer if the number of CRC error frames received by the interface reaches the alarm threshold for three consecutive detection intervals.\nBy default, an interface is not shut down at the physical layer if the number of CRC error frames received by the interface reaches the alarm threshold for three consecutive detection intervals."
        },
        {
            "Parameters": "crc-error",
            "Info": "Specifies an exceed alarm threshold  for CRC errors.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] trap-threshold crc-error high-threshold 1500 low-threshold 150 interval-second 15"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo set an upper threshold, lower threshold, detection interval for the CRC error alarm, run the trap-threshold crc-error high-threshold low-threshold command. After this configuration is performed, a device generates an alarm and sends it to an NMS only when the number of CRC error frames sent or received by the device reaches the upper threshold for three consecutive detection intervals. The device sends a clear alarm to the NMS only when the number of CRC error frames sent or received by the device falls below the lower threshold for three consecutive detection intervals.\nIf an interface receives a large number of CRC error frames, the interface is prone to flapping. Such interface flapping may easily be left unnoticed. To address this issue, specify shutdown in the command so that the interface is shut down at the physical level if the number of CRC error frames received within the specified interval reaches the configured alarm threshold.\nConfiguration Impact\nIf shutdown is specified in the command and the interface is deactivated because the number of CRC error frames received within the specified interval reaches the configured alarm threshold, the interface remains Down even if a clear alarm is generated. To prevent services from being affected, activate the interface manually after a clear alarm is generated.\nPrecautions\nThe configured thresholds take effect only when the CRC alarm function is enabled. You can run the snmp-agent trap enable port crcexc-error command to enable the CRC alarm function on an interface.\nThe value of high-threshold must be greater than or equal to that of low-threshold.\nThe following commands cannot coexist. The most recently run command overwrites the previous one.\ntrap-threshold crc-errortrap-threshold crc-error bit-error-ratiotrap-threshold crc-error high-thresholdtrap-threshold crc-error { mac-fcs-exc | mac-fcs-sd }trap-threshold crc-error percenttrap-threshold crc-error packet-error-ratio"
}