{
    "PageTitle": "adjacency-strict-check",
    "FuncDef": "The adjacency-strict-check enable command enables IS-IS neighbor strict-check.\nThe undo adjacency-strict-check enable command disables IS-IS neighbor strict-check.\nThe adjacency-strict-check disable command disables IS-IS neighbor strict-check.\nBy default, IS-IS neighbor strict-check is disabled when IS-IS is establishing neighbor relationships.",
    "CLIs": [
        "adjacency-strict-check enable",
        "adjacency-strict-check disable",
        "undo adjacency-strict-check [ enable ]"
    ],
    "ParentView": [
        "IS-IS view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis",
            "[*HUAWEI-isis-1] adjacency-strict-check enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nDuring the establishment of IS-IS neighbor relationships, if both IPv4 and IPv6 are configured at both ends, both IPv4 and IPv6 neighbors are established. By default, IPv4 and IPv6 share the standard topology. When a link recovers from a failure, IPv4 goes Up faster than IPv6. After the IS-IS device receives a message indicating that IPv4 goes Up, it considers that both IPv4 and IPv6 neighbor relationships are established. If IPv6 packets are transmitted, they are discarded.\nTo resolve this problem, run the adjacency-strict-check enable command to enable IS-IS neighbor strict-check to ensure that an IS-IS neighbor is established only when both IPv4 and IPv6 are Up.\nPrerequisites\nAn IS-IS process has been created and the IS-IS view has been displayed using the isis command.\nConfiguration Impact\nAfter you run the adjacency-strict-check enable command on a broadcast network, the base topology becomes Down by not publishing the neighbor information, if the IP protocol enabled on the local router is different from that on its neighbors.\nAfter you run the adjacency-strict-check enable command on a P2P network, neighbor relationships cannot be established if the IP protocol enabled on the local router is different from that on its neighbors and only the base topology is available on the local router.\nPrecautions\nThe undo adjacency-strict-check [ enable ] and undo adjacency-strict-check commands have the same function."
}