{
    "PageTitle": "attached-bit (IS-IS topology view)",
    "FuncDef": "The attached-bit avoid-learning command prevents an IS-IS Level-1 router from generating a default route after it receives LSPs carrying Attached (ATT) bit 1.\nThe undo attached-bit avoid-learning command restores the default configuration.\nThe attached-bit advertise command configures a rule for setting the Attached (ATT) bit in LSPs.\nThe undo attached-bit advertise command restores the default configuration.\n\nBy default, an IS-IS Level-1 router generates a default route only after it receives LSPs carrying ATT bit 1.\n\n\nBy default, the Level-1-2 router sets the ATT bit in LSPs using the default rule.",
    "CLIs": [
        "attached-bit { { advertise { always | never } } | avoid-learning }",
        "undo attached-bit advertise",
        "undo attached-bit avoid-learning"
    ],
    "ParentView": [
        "IS-IS topology view"
    ],
    "ParaDef": [
        {
            "Parameters": "always",
            "Info": "Indicates that the ATT bit is set to 1.\n-"
        },
        {
            "Parameters": "never",
            "Info": "Indicates that the ATT bit remains at 0.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis 1",
            "[*HUAWEI-isis-1] cost-style wide",
            "[*HUAWEI-isis-1] topology red topology-id 10",
            "[*HUAWEI-isis-1-topology-red] attached-bit advertise always"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis 1",
            "[*HUAWEI-isis-1] cost-style wide",
            "[*HUAWEI-isis-1] topology red topology-id 10",
            "[*HUAWEI-isis-1-topology-red] attached-bit avoid-learning"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAn ATT bit is a field in LSPs. An ATT bit identifies whether a Level-1 area is attached to other areas. A Level-1-2 router sets the ATT bit to 1 to notify the routers in the Level-1 area of its attachment to a Level-2 backbone area. After a Level-1 router receives the LSPs carrying the ATT bit 1 from the Level-1-2 router, the Level-1 router generates a route with the same destination address as the default route of the Level-1-2 router. Traffic can be forwarded along this route.\nTo prevent the Level-1 router from advertising the default route when the ATT bit is set to 1, run the attached-bit avoid-learning command.\nTo prevent the Level-1 router from advertising default routes to the routing table, use either of the following methods:\nRun the attached-bit advertise never command on the Level-1-2 router to disable the router from sending LSPs with the ATT bit 1.Run the attached-bit avoid-learning command on the Level-1 router that is connected to the Level-1-2 router.\nThe difference between the preceding commands lies in that the attached-bit avoid-learning command applies to a specified router.\n\nPrerequisites\nAn IS-IS process has been created and the IS-IS view has been displayed using the isis command.\nPrecautions\nThe ATT bit is defined in both Level-1 and Level-2 LSPs, but it can be set to 1 only in Level-1 LSPs. Additionally, only the Level-1-2 router can set the ATT bit. Therefore, the attached-bit avoid-learning command takes effect only on the Level-1-2 router."
}