{
    "PageTitle": "auto-cost enable (IS-IS topology view)",
    "FuncDef": "The auto-cost enable command enables IS-IS to automatically calculate the link cost of interfaces according to the interface bandwidth.\nThe auto-cost enable compatible command enables IS-IS to automatically calculate the link cost of interfaces according to the interface bandwidth in compatible.\nThe undo auto-cost enable command disables the function.\nBy default, automatic interface cost calculation is disabled.",
    "CLIs": [
        "auto-cost enable [ compatible ]",
        "undo auto-cost enable"
    ],
    "ParentView": [
        "IS-IS topology view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip topology multicast",
            "[*HUAWEI] isis 1",
            "[*HUAWEI-isis-1] cost-style wide",
            "[*HUAWEI-isis-1] topology multicast topology-id multicast",
            "[*HUAWEI-isis-1-topology-multicast] auto-cost enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nYou can configure a link cost for interfaces or run the auto-cost enable command to enable automatic interface cost calculation.\nPrerequisites\nNo interface cost has been set in the interface view, and no global cost has been configured in the IS-IS view.\nConfiguration Impact\nAfter automatic interface cost calculation is enabled, the system automatically calculates the interface cost.\nIf the cost style of the system is wide or wide-compatible:\nWhen auto-cost enable command is configured, Interface cost = (Bandwidth-reference/Interface bandwidth) * 10.\nWhen auto-cost enable compatible command is configured, Interface cost = (Bandwidth-reference/Interface bandwidth).\nWhen the cost type is narrow, narrow-compatible, or compatible, the cost of each interface is determined as follows:\nInterface bandwidth <= 10 Mbit/s, cost = 6010 Mbit/s < interface bandwidth <= 100 Mbit/s, cost = 5010 Mbit/s < interface bandwidth <= 155 Mbit/s, cost = 40155 Mbit/s < interface bandwidth <= 622 Mbit/s, Cost = 30622 Mbit/s < Interface bandwidth <= 2.5 Gbit/s, cost = 202.5 Gbit/s < interface bandwidth, Cost = 10\n\nPrecautions\nThe auto-cost enable command cannot change the cost of a loopback interface.\nThe auto-cost enable command can be run on Eth-Trunk interfaces as well as on physical interfaces. If the command is run on an Eth-Trunk interface, the bandwidth of the Eth-Trunk interface is equal to the total bandwidth of all its member interfaces.\nIf the command is run in the IS-IS view, it takes effect only in the base topology. If the command is run in the IS-IS topology view, it takes effect only in the current topology."
}