{
    "PageTitle": "avoid-microloop te-tunnel rib-update-delay",
    "FuncDef": "The avoid-microloop te-tunnel rib-update-delay command configures a delay in delivering the IS-IS routes whose outbound interface is a TE tunnel interface.\nThe undo avoid-microloop te-tunnel rib-update-delay command deletes a configured delay in delivering the IS-IS routes whose outbound interface is a TE tunnel interface.\nBy default, the delay in delivering the IS-IS routes whose outbound interface is a TE tunnel interface is 1000 ms.",
    "CLIs": [
        "avoid-microloop te-tunnel rib-update-delay <rib-update-delay>",
        "undo avoid-microloop te-tunnel rib-update-delay"
    ],
    "ParentView": [
        "IS-IS view"
    ],
    "ParaDef": [
        {
            "Parameters": "rib-update-delay",
            "Info": "Specifies a delay in delivering the IS-IS routes whose outbound interface is a TE tunnel interface.\nThe value is an integer ranging from 100 to 30000, in milliseconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis 1",
            "[*HUAWEI-isis-1] avoid-microloop te-tunnel",
            "[*HUAWEI-isis-1] avoid-microloop te-tunnel rib-update-delay 6000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a network fault occurs, IGP convergence is triggered. In this case, a transient forwarding status inconsistency may occur among nodes because of their different convergence rates, which poses the risk of microloops. If the outbound interface of a route before IGP convergence is a shortcut TE tunnel interface and the IS-IS TE tunnel anti-microloop function is enabled, the outbound interface of the route remains unchanged during the IGP convergence. In this case, traffic is forwarded through a hot standby TE tunnel, and the forwarding process does not depend on IGP convergence on each device, preventing microloops. To configure a switchback delay (delay in delivering the IS-IS routes whose outbound interface is a TE tunnel interface), run the avoid-microloop te-tunnel rib-update-delay command."
}