{
    "PageTitle": "bandwidth-reference (IS-IS view)",
    "FuncDef": "The bandwidth-reference command sets a bandwidth reference value that is used when the system automatically calculates the interface cost.\nThe undo bandwidth-reference command cancels the configuration.\nThe ipv6 bandwidth-reference command sets reference bandwidth used in interface cost calculation.\nThe undo ipv6 bandwidth-reference command restores the default value.\nBy default, the bandwidth reference value is 100 Mbit/s.",
    "CLIs": [
        "bandwidth-reference <value>",
        "ipv6 bandwidth-reference <value>",
        "undo bandwidth-reference",
        "undo ipv6 bandwidth-reference"
    ],
    "ParentView": [
        "IS-IS view"
    ],
    "ParaDef": [
        {
            "Parameters": "value",
            "Info": "Specifies a bandwidth reference value.\nThe value is an integer ranging from 1 to 2147483648, in Mbit/s."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis 1",
            "[*HUAWEI-isis-1] ipv6 enable",
            "[*HUAWEI-isis-1] ipv6 bandwidth-reference 200"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis 1",
            "[*HUAWEI-isis-1] bandwidth-reference 1000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nYou can configure a link cost for all interfaces or enable automatic interface cost calculation. To enable automatic interface cost calculation, you need to set a proper bandwidth reference value.\nPrerequisites\nAn IS-IS process has been created.\nConfiguration Impact\nYou can run the bandwidth-reference command to set a proper bandwidth reference value. After automatic interface cost calculation is enabled, and the cost type is wide or wide-compatible, the system calculates the cost of each interface with the following formula: Interface cost = (Bandwidth-reference/Interface bandwidth) * 10. If the interface cost calculated through this formula is greater than 16777214, 16777214 is used as the interface cost for route calculation. That is, the interface cost will never be greater than 16777214.\nThe automatic interface cost calculation is enabled by the auto-cost enable command, and the cost style is set by the cost-style command.\nAfter automatic interface cost calculation is enabled, the system automatically calculates the interface cost according to the bandwidth reference value set using the ipv6 bandwidth-reference command.\nPrecautions\nSet a proper bandwidth reference value.\nIf the command is run in the IS-IS view, it takes effect only in the base topology. If the command is run in the IS-IS topology view, it takes effect only in the current topology.\nYou are advised to set a proper bandwidth reference value."
}