{
    "PageTitle": "bfd all-interfaces enable",
    "FuncDef": "The bfd all-interfaces enable command enables BFD in an IS-IS process.\nThe undo bfd all-interfaces enable command disables BFD from an IS-IS process.\nBy default, BFD is disabled in an IS-IS process.",
    "CLIs": [
        "bfd all-interfaces enable",
        "undo bfd all-interfaces enable"
    ],
    "ParentView": [
        "IS-IS view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis",
            "[*HUAWEI-isis-1] bfd all-interfaces enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBFD can provide millisecond-level fault detection, help IS-IS to detect the faults that occur on neighboring devices or links more quickly, and instruct IS-IS to recalculate routes for correct packet forwarding. The bfd all-interfaces enable command enables BFD in an IS-IS process.\nPrerequisites\nBFD has been enabled globally, An IS-IS process has been created, and the IS-IS process has been started on a specified interface.\nConfiguration Impact\nAfter the bfd all-interfaces enable command is run, the local end can establish a BFD session with its neighbor through a specified interface and periodically send BFD packets on this session.\nPrecautions\nIf BFD is not enabled globally, you can configure IS-IS BFD, but a BFD session cannot be established.\nWhen BFD is enabled in the IS-IS process using the bfd all-interfaces enable command, no BFD session is established on the interface in the following cases:\nThe isis bfd block command is run on the interface to block BFD from the interface. To establish a BFD session on the interface, run the undo isis bfd block command.When the isis bfd static command is run on the interface, no BFD session is established on the interface. To establish a BFD session on the interface, run the undo isis bfd static command.\nThe priority of BFD configured on an interface is higher than that of BFD configured in a process. If BFD is enabled on an interface, a BFD session is established according to the BFD parameters set on the interface.\nThis command conflicts with multi-instance enable iid command."
}