{
    "PageTitle": "bfd all-interfaces",
    "FuncDef": "The bfd all-interfaces command sets values for BFD session parameters.\nThe undo bfd all-interfaces command restores the default values.\nBy default, the BFD session will setup with default values of parameters.",
    "CLIs": [
        "bfd all-interfaces { min-rx-interval <receive-interval> | min-tx-interval <transmit-interval> | detect-multiplier <multiplier-value> | frr-binding | tos-exp <tosexp-value> } *",
        "undo bfd all-interfaces { min-rx-interval [ <receive-interval> ] | min-tx-interval [ <transmit-interval> ] | detect-multiplier [ <multiplier-value> ] | frr-binding | tos-exp [ <tosexp-value> ] } *"
    ],
    "ParentView": [
        "IS-IS view"
    ],
    "ParaDef": [
        {
            "Parameters": "min-rx-interval receive-interval",
            "Info": "Specifies the expected minimum interval at which BFD packets are received from a neighbor.\nThe value is an integer ranging from 3 to 20000, in milliseconds. The default value is 10."
        },
        {
            "Parameters": "min-tx-interval transmit-interval",
            "Info": "Specifies the minimum interval at which BFD packets are sent to a neighbor.\nThe value is an integer ranging from 3 to 20000, in milliseconds. The default value is 10."
        },
        {
            "Parameters": "detect-multiplier multiplier-value",
            "Info": "Specifies a local detection multiplier.\nThe value ranges from 3 to 50. The default value is 3."
        },
        {
            "Parameters": "frr-binding",
            "Info": "Associates BFD session status with IS-IS auto FRR. If BFD detects a link fault on an interface, the BFD session goes Down, triggering FRR. Traffic is then quickly switched to the backup link, minimizing service loss.\n-"
        },
        {
            "Parameters": "tos-exp tosexp-value",
            "Info": "Sets a priority for all IS-IS BFD packets of the current process.\nThe value is an integer ranging from 0 to 7."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis",
            "[*HUAWEI-isis-1] bfd all-interfaces enable",
            "[*HUAWEI-isis-1] bfd all-interfaces min-tx-interval 300"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBFD can provide millisecond-level fault detection, help IS-IS to detect the faults that occur on neighboring devices or links more quickly, and instruct IS-IS to recalculate routes for correct packet forwarding. The bfd all-interfaces command can be used to set values for BFD session parameters.\nPrerequisites\nBFD has been enabled globally, An IS-IS process has been created, the IS-IS process has been enabled on a specified interface, and BFD has been enabled in the IS-IS process.\nPrecautions\nIf only BFD session parameters are set and the bfd all-interfaces enable command is not run, no BFD session can be established.\nThe priority of BFD configured on an interface is higher than that of BFD configured in a process. If BFD is enabled on an interface, a BFD session is established according to the BFD parameters set on the interface."
}