{
    "PageTitle": "bfd bit-error all-interfaces enable",
    "FuncDef": "The bfd bit-error all-interfaces enable command enables BFD-based bit error detection in an IS-IS process.\nThe undo bfd bit-error all-interfaces enable command disables BFD-based bit error detection in an IS-IS process.\nBy default, BFD-based bit error detection is disabled in an IS-IS process.",
    "CLIs": [
        "bfd bit-error all-interfaces enable",
        "undo bfd bit-error all-interfaces enable"
    ],
    "ParentView": [
        "IS-IS view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis",
            "[*HUAWEI-isis-1] bfd bit-error all-interfaces enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn an NG MVPN scenario, multicast data flows must be transmitted on a link that has no or few bit errors because even low bit error rates may cause black screen, erratic display, or frame interruption. If multiple links exist between the upstream and downstream nodes of an mLDP tunnel and some links are logical instead of physical direct links, the upstream node randomly selects an outbound interface by default, and sends packets over the link of the selected interface to the downstream node. If you expect the mLDP upstream node to detect bit error rates of the links and switch to an outbound interface that is connected to a downstream link with few or no bit errors, run the bfd bit-error all-interfaces enable command to enable BFD-based bit error detection.\nThe command configuration applies to all interfaces in the specified IS-IS process. After the command is run on a local device, a BFD session detects bit errors on the device and transmits the bit error information to its IS-IS neighbor. The neighbor learns the bit error information and adjusts the interface cost accordingly, so that IS-IS can select a forwarding path with no or few bit errors to minimize multicast traffic loss.\nPrecautions\nBFD must be enabled using the bfd command in the system view. Otherwise, BFD-based bit error detection does not take effect in an IS-IS process.\nDo not run the isis bfd bit-error block command on an interface if BFD-based bit error detection has been enabled in a process of the interface. Otherwise, BFD-based bit error detection becomes ineffective in the process."
}