{
    "PageTitle": "ipv6 bfd all-interfaces enable",
    "FuncDef": "The ipv6 bfd all-interfaces enable command enables IPv6 BFD in an IS-IS process.\nThe undo ipv6 bfd all-interfaces enable command disables IPv6 BFD from an IS-IS process.\nBy default, IPv6 BFD is disabled in an IS-IS process.",
    "CLIs": [
        "ipv6 bfd all-interfaces enable",
        "undo ipv6 bfd all-interfaces enable"
    ],
    "ParentView": [
        "IS-IS view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis",
            "[*HUAWEI-isis-1] ipv6 enable",
            "[*HUAWEI-isis-1] ipv6 bfd all-interfaces enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBFD can provide millisecond-level fault detection, help IS-IS to detect the faults that occur on neighboring devices or links more quickly, and instruct IS-IS to recalculate routes for correct packet forwarding. You can run the ipv6 bfd all-interfaces enable command to enable IPv6 BFD in an IS-IS process.\nPrerequisites\nBFD has been enabled globally, An IS-IS process has been created, and the IS-IS process has been started on a specified interface.\nConfiguration Impact\nAfter the ipv6 bfd all-interfaces enable command is run, the local end can establish an IPv6 BFD session with its neighbor through a specified interface and periodically send BFD packets on this session.\nPrecautions\nIf BFD is not enabled globally, you can configure IPv6 BFD for IS-IS but cannot establish an IPv6 BFD session.\nWhen BFD is enabled in the IS-IS process using the\nipv6 bfd all-interfaces enable command, no BFD session is established on the interface in any of the following situations:\nThe isis ipv6 bfd block command is run on an interface to block the BFD capability of the interface. To establish a BFD session on the interface, run the undo isis ipv6 bfd block command.When the isis ipv6 bfd static command is run on an interface, no BFD session can be established on the interface. To establish a BFD session on the interface, run the undo isis ipv6 bfd static command.\nThis command conflicts with multi-instance enable iid command."
}