{
    "PageTitle": "bgp-ls enable",
    "FuncDef": "The bgp-ls enable command enables IS-IS topology advertisement to BGP.\nThe undo bgp-ls enable command disables IS-IS topology advertisement to BGP.\nBy default, IS-IS topology advertisement to BGP is disabled.",
    "CLIs": [
        "bgp-ls enable [ level-1 | level-2 | level-1-2 ]",
        "bgp-ls enable level-1 level-2-leaking-route-ignore",
        "undo bgp-ls enable [ level-1 | level-2 | level-1-2 ]",
        "undo bgp-ls enable level-1 level-2-leaking-route-ignore"
    ],
    "ParentView": [
        "IS-IS view"
    ],
    "ParaDef": [
        {
            "Parameters": "level-1",
            "Info": "Enables IS-IS Level-1 topology advertisement to BGP.\n-"
        },
        {
            "Parameters": "level-2",
            "Info": "Enables IS-IS Level-2 topology advertisement to BGP.\n-"
        },
        {
            "Parameters": "level-1-2",
            "Info": "Enables IS-IS Level-1 and Level-2 topology advertisement to BGP.If no level is specified in the command, both Level-1 and Level-2 topologies are advertised to BGP.\n-"
        },
        {
            "Parameters": "level-2-leaking-route-ignore",
            "Info": "Ignore the routes that are leaked from Level 2 to Level 1.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis",
            "[*HUAWEI-isis-1] bgp-ls enable level-1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis",
            "[*HUAWEI-isis-1] bgp-ls enable level-1 level-2-leaking-route-ignore"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn current SDN RR+ solutions, forwarders use an IGP (OSPF or IS-IS) to collect topology information, and the IGP reports the information to the controller. This topology information collection method has the following disadvantages:\nWhen topology information is collected within an area using an IGP, the controller must have high computing capabilities and support complicated policy control and IGP algorithms.When topology information is collected between areas using an IGP, the controller cannot gain the complete inter-AS topology information and therefore is unable to calculate optimal E2E paths.When inter-area topology information is collected using BGP and intra-area topology information is collected using an IGP, external interfaces will be complicated.\nBGP-LS overcomes the preceding disadvantages. With BGP-LS, BGP functions as a northbound interface protocol and reports the topology information collected by an IGP to the controller. Only one device in each IGP area needs to have BGP-LS deployed, which facilitates solution deployment and improves service processing.\nIf IS-IS is used as the IGP and BGP-LS is required, IS-IS topology advertisement to BGP needs to be enabled using the bgp-ls enable command.\nTopology information includes IPv4 node information, link information and prefix information."
}