{
    "PageTitle": "circuit default-tag (IS-IS view)",
    "FuncDef": "The circuit default-tag command sets an administrative tag value for an interface on which IS-IS process is enabled.\nThe undo circuit default-tag command restores the default value.\nThe ipv6 circuit default-tag command sets an administrative tag for an IS-IS IPv6 interface.\nThe undo ipv6 circuit default-tag command restores the default value.\n\nBy default, the administrative tag value of all interfaces is 0.\n\n\nBy default, the administrative tag for an IS-IS IPv6 interface is 0.",
    "CLIs": [
        "[ ipv6 ] circuit default-tag <tag> [ level-1 | level-2 ]",
        "undo [ ipv6 ] circuit default-tag [ <tag> ] [ level-1 | level-2 ]"
    ],
    "ParentView": [
        "IS-IS view"
    ],
    "ParaDef": [
        {
            "Parameters": "tag",
            "Info": "Specifies the administrative tag carried in a route imported from an IPv6 interface.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "level-1",
            "Info": "Indicates the administrative tag for a Level-1 IPv6 interface.\n-"
        },
        {
            "Parameters": "level-2",
            "Info": "Indicates the administrative tag for a Level-2 IPv6 interface.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis 1",
            "[*HUAWEI-isis-1] circuit default-tag 30 level-1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe administrative tag carries the administrative information about an IP address prefix. It is used to control the routes of different levels and routes imported from multiple areas. Administrative tags can advertise IP address prefixes in the IS-IS domain to control routes, simplifying management.\nAfter the circuit default-tag command is run, all routes of a specified IS-IS process carry an administrative tag value. The administrative tag value can be used to filter routes as needed.\nIf level-1 and level-2 are not specified in the ipv6 circuit default-tag command, the ipv6 circuit default-tag command sets an administrative tag for all Level-1 and Level-2 IPv6 interfaces.\nThe administrative tag for an interface is advertised along with routes.\nIf the IS-IS cost type is narrow or narrow-compatible, the administrative tag of an interface is not advertised through an LSP.If the IS-IS cost type is wide, wide-compatible, or compatible, the administrative tag of an interface is advertised through an LSP.\nBefore using the ipv6 circuit default-tag command in an IS-IS process, enable IPv6 in the IS-IS process. For details, see the isis ipv6 enable command.\n\nPrerequisites\nAn IS-IS process has been started using the isis command.\nPrecautions\nWhen the cost type of IS-IS is wide, wide-compatible, or compatible, the administrative tag value is advertised through an LSP. The cost type can be configured using the cost-style command.\nThe administrative tag value configured using the circuit default-tag command is the global administrative tag value. The interface administrative tag configured using the isis tag-value command takes precedence over the global administrative tag."
}