{
    "PageTitle": "default-route-advertise (IS-IS topology view)",
    "FuncDef": "The default-route-advertise command configures an IS-IS device to generate a default route.\nThe undo default-route-advertise command cancels the default route generated by an IS-IS device.\nBy?default,?an?IS-IS?device?does?not?generate?a?default?route.",
    "CLIs": [
        "default-route-advertise [ always | match default | route-policy <route-policy-name> | route-filter <route-filter-name> ] [ [ cost <cost> ] | [ tag <tag> ] | [ level-1 | level-2 | level-1-2 ] ] * [ avoid-learning ]",
        "undo default-route-advertise"
    ],
    "ParentView": [
        "IS-IS topology view"
    ],
    "ParaDef": [
        {
            "Parameters": "always",
            "Info": "Indicates that default routes are advertised unconditionally.This parameter is the command default.\n-"
        },
        {
            "Parameters": "match",
            "Info": "If a default route generated by other routing protocols or other IS-IS processes exists in the routing table, the default route is advertised through an LSP.\n-"
        },
        {
            "Parameters": "default",
            "Info": "If a default route generated by other routing protocols or other IS-IS processes exists in the routing table, the default route is advertised through an LSP.\n-"
        },
        {
            "Parameters": "route-policy route-policy-name",
            "Info": "Specifies the name of a route-policy. If external routes match the route-policy, the default route is advertised through an LSP. The route-policy specified in the command does not affect the import of external routes by IS-IS.\nThe name is a string of 1 to 200 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "route-filter route-filter-name",
            "Info": "Specifies the name of route filter policy. The policy is used to filter the imported routes so that only some of the routes of other routing domains can be imported.\nThe value is a string of 1 to 200 case-sensitive characters, spaces not supported. If parameters are included in the referenced route-filter, specify values for them in the format of (var1, var2, ...var8) behind the route-filter name. A maximum of eight parameters can be specified, and each value ranges from 1 to 200 characters."
        },
        {
            "Parameters": "cost cost",
            "Info": "Specifies a cost for the default route.\nThe value is an integer and its range varies with the cost type.\nWhen the cost type is narrow, narrow-compatible, or compatible, the value ranges from 0 to 63.When the cost type is wide or wide-compatible, the value ranges from 0 to 4261412864.\nThe default value is 0.\nThe cost type can be configured using the cost-style command."
        },
        {
            "Parameters": "tag tag",
            "Info": "Specifies the tag value of the default route to be advertised. The advertised LSPs contain the administrative tag value only when the IS-IS cost type is wide, wide-compatible, or compatible.\nThe value is an integer ranging from 1 to 4294967295. The default value is 0."
        },
        {
            "Parameters": "level-1",
            "Info": "Sets the level as Level-1.\n-"
        },
        {
            "Parameters": "level-2",
            "Info": "Sets the level as Level-2.\nIf no level is specified, the level of the default route is Level-2.\n-"
        },
        {
            "Parameters": "level-1-2",
            "Info": "Sets the level as Level-1-2.\n-"
        },
        {
            "Parameters": "avoid-learning",
            "Info": "Prevents the device from adding the learned default route to the routing table. If there are active default routes in the routing table, they are set to the inactive state.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] route-policy policy1 permit node 10",
            "[*HUAWEI] quit",
            "[*HUAWEI] ip topology red",
            "[*HUAWEI] isis 1",
            "[*HUAWEI-isis-1] cost-style wide",
            "[*HUAWEI-isis-1] topology red topology-id 10",
            "[*HUAWEI-isis-1-topology-red] default-route-advertise route-policy policy1 cost 15"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe default-route-advertise command run in the IS-IS topology view takes effect only for the IS-IS topology.\nWhen IS-IS and other routing protocols are running on a network, use either of the following methods to allow the traffic within the IS-IS domain to be transmitted to other routing domains:\nConfigure a boundary router in the IS-IS domain to advertise default routes to the IS-IS domain using the default-route-advertise command.Configure a boundary router in the IS-IS domain to import routes from the other routing domains to the IS-IS domain using the import-route command.\nThe first method is simpler, because the routers in the IS-IS domain do not need to learn routes imported from the other routing protocols. This method is applicable when there are few boundary routers and routes do not need to be selected.\nThe default-route-advertise command is used to configure an IS-IS device to advertise default routes to the routers within an IS-IS domain.\nYou can specify always to allow default routes to be advertised unconditionally; in this case, the device still calculates default routes from other devices.\nIf always is configured on multiple devices within the same area, a routing loop may occur.\nYou can specify route-policy route-policy-name in the command. After this parameter is specified, a boundary router in the IS-IS domain will advertise default routes to the domain only when the routing table on the boundary router has external routes matching the route-policy. If the routing table on the boundary router does not have specific external routes due to link failures, the boundary router will not advertise default routes to the IS-IS domain, preventing unreachable routes.\n\nPrerequisites\nIS-IS processes have been enabled using the isis command.\nConfiguration Impact\nAfter this command is run on an IS-IS device, all traffic in an IS-IS domain will be forwarded by this IS-IS device to a destination outside the domain, which may overburden the device. Therefore, run the command on a device with high performance.\nPrecautions\nIf this command is run on a Level-1 router, the router advertises default routes only to a Level-1 area."
}