{
    "PageTitle": "default-route-advertise (IS-IS view)",
    "FuncDef": "The default-route-advertise command configures an IS-IS device to generate a default route.\nThe undo default-route-advertise command cancels the default route generated by an IS-IS device.\nBy default, an IS-IS device does not generate a default route.",
    "CLIs": [
        "default-route-advertise [ always | match default | route-policy <route-policy-name> | route-filter <route-filter-name> ] [ [ cost <cost> ] | [ tag <tag> ] | [ level-1 | level-2 | level-1-2 ] ] * [ avoid-learning ]",
        "undo default-route-advertise"
    ],
    "ParentView": [
        "IS-IS view"
    ],
    "ParaDef": [
        {
            "Parameters": "always",
            "Info": "Enables an IS-IS device to advertise the default IPv4 route unconditionally. This parameter is specified by default when the default-route-advertise command is run. In this case, if the avoid-learning parameter is not specified, the device is allowed to calculate the IS-IS default routes advertised by other devices, which may cause routing loops.\n-"
        },
        {
            "Parameters": "match",
            "Info": "When a device has an active default IPv6 route, which belongs to a process of another routing protocol or belongs to another IS-IS process, this parameter enables the device to advertise the default route through a local LSP. However, if the avoid-learning parameter is not specified, the device is allowed to calculate the IS-IS default routes advertised by other neighbors. As a result, the default route that belongs to the process of another routing protocol or belongs to another IS-IS process on the local device may become inactive. If this problem occurs, the device no longer advertises the default route through a local LSP.\n-"
        },
        {
            "Parameters": "default",
            "Info": "When a device has an active default IPv4 route, which belongs to a process of another routing protocol or belongs to another IS-IS process, this parameter enables the device to advertise the default route through a local LSP. However, if the avoid-learning parameter is not specified, the device is allowed to calculate the IS-IS default routes advertised by other neighbors. As a result, the default route that belongs to the process of another routing protocol or belongs to another IS-IS process on the local device may become inactive. If this problem occurs, the device no longer advertises the default route through a local LSP.\n-"
        },
        {
            "Parameters": "route-policy route-policy-name",
            "Info": "Specifies the name of a route-policy.\nIf the routes that match the route-policy include non-default routes, a default IPv4 route that belongs to a process of another routing protocol, or a default IPv4 route that belongs to another IS-IS process, the device advertises a default route through a local LSP. In this case, if the avoid-learning parameter is not specified, the device is allowed to calculate the IS-IS default routes advertised by other devices, which may cause routing loops.If only the default IPv4 route in the current local IS-IS process matches the route-policy, the device does not advertise a default route through a local LSP.\nThe name is a string of 1 to 200 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "route-filter route-filter-name",
            "Info": "Specifies the name of a route-filter.\nIf the routes that match the route-filter include non-default routes, a default IPv4 route that belongs to a process of another routing protocol, or a default IPv4 route that belongs to another IS-IS process, the device advertises a default IPv4 route through a local LSP. In this case, if the avoid-learning parameter is not specified, the device is allowed to calculate the IS-IS default routes advertised by other devices, which may cause routing loops.If only the default IPv4 route in the current local IS-IS process matches the route-filter, the device does not advertise a default IPv4 route through a local LSP.\nThe value is a string of 1 to 200 case-sensitive characters, spaces not supported. If parameters are included in the referenced route-filter, specify values for them in the format of (var1, var2, ...var8) behind the route-filter name. A maximum of eight parameters can be specified, and each value ranges from 1 to 200 characters."
        },
        {
            "Parameters": "cost cost",
            "Info": "Specifies a cost for the default route.\nThe value is an integer and its range varies with the cost type.\nWhen the cost type is narrow, narrow-compatible, or compatible, the value ranges from 0 to 63.When the cost type is wide or wide-compatible, the value ranges from 0 to 4261412864.\nThe default value is 0.\nThe cost type can be configured using the cost-style command."
        },
        {
            "Parameters": "tag tag",
            "Info": "Specifies the tag value of the default route to be advertised. The advertised LSPs contain the administrative tag value only when the IS-IS cost type is wide, wide-compatible, or compatible.\nThe value is an integer ranging from 1 to 4294967295. The default value is 0."
        },
        {
            "Parameters": "level-1",
            "Info": "Sets the level as Level-1.\n-"
        },
        {
            "Parameters": "level-2",
            "Info": "Sets the level as Level-2.\nIf no level is specified, the level of the default route is Level-2.\n-"
        },
        {
            "Parameters": "level-1-2",
            "Info": "Sets the level as Level-1-2.\n-"
        },
        {
            "Parameters": "avoid-learning",
            "Info": "Prevents the specified IS-IS process from adding a learned default IPv4 route to the routing table.\nIf the local device has advertised a default route in the specified IS-IS process, the device no longer adds a learned IS-IS default route to the routing table.If the device has not advertised a default route in the specified IS-IS process, the device can still add a learned IS-IS default route to the routing table even if avoid-learning is specified.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] route-policy policy1 permit node 10",
            "[*HUAWEI-route-policy] quit",
            "[*HUAWEI] isis 1",
            "[*HUAWEI-isis-1] default-route-advertise route-policy policy1 cost 15"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe default-route-advertise command run in the IS-IS view takes effect only for the base topology.\nWhen IS-IS and other routing protocols are running on a network, use either of the following methods to allow the traffic within the IS-IS domain to be transmitted to other routing domains:\nConfigure a boundary router in the IS-IS domain to advertise default routes to the IS-IS domain using the default-route-advertise command.Configure a boundary router in the IS-IS domain to import routes from the other routing domains to the IS-IS domain using the import-route command.\nThe first method is simpler, because the routers in the IS-IS domain do not need to learn routes imported from the other routing protocols. This method is applicable when there are few boundary routers and routes do not need to be selected.\nThe default-route-advertise command is used to configure an IS-IS device to advertise default routes to the routers within an IS-IS domain.\nYou can specify always to allow default routes to be advertised unconditionally; in this case, the device still calculates default routes from other devices.\nIf always is specified on multiple devices in the same area and avoid-learning is not specified, each of these devices advertises a default route in its IS-IS process with the always configuration and is allowed to calculate the IS-IS default routes advertised by other devices. As a result, routing loops may occur.\nYou can specify route-policy route-policy-name in the command. After this parameter is specified, a boundary router in the IS-IS domain will advertise default routes to the domain only when the routing table on the boundary router has external routes matching the route-policy. If the routing table on the boundary router does not have specific external routes due to link failures, the boundary router will not advertise default routes to the IS-IS domain, preventing unreachable routes.\n\nPrerequisites\nIS-IS processes have been enabled using the isis command.\nConfiguration Impact\nAs all traffic to a destination outside an IS-IS area must be forwarded through a device with the default-route-advertise command configuration, the forwarding device may be overloaded. To prevent this issue, you are advised to run the default-route-advertise command on an edge device with high forwarding capacity.If avoid-learning is not specified, routing loops may occur, or traffic may all be forwarded to a specific device. Therefore, you are advised to specify this parameter.Before specifying avoid-learning, you are advised to increase the preference of routes that belong to a process of another routing protocol or belong to another IS-IS process on the local device. Otherwise, the avoid-learning configuration may not take effect in the following scenario:The local device learns an IS-IS default route advertised by another device first, and this route has a high preference. As a result, the route that belongs to a process of another routing protocol or belongs to another IS-IS process is inactive. In this case, if the default-route-advertise match default avoid-learning command is run, the device fails to advertise a default route because it does not have an active route from the process of another routing protocol or from another IS-IS process. As a result, the device still adds the learned IS-IS default route to the routing table.\n\nPrecautions\nIf this command is run on a Level-1 router, the router advertises default routes only to a Level-1 area."
}