{
    "PageTitle": "display isis mesh-group",
    "FuncDef": "The display isis mesh-group command displays the configuration of the IS-IS mesh-group.",
    "CLIs": [
        "display isis <process-id> mesh-group",
        "display isis mesh-group [ <process-id> | vpn-instance <vpn-instance-name> ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "process-id",
            "Info": "Specifies an IS-IS process ID.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Displays mesh-group information about a specified VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display isis mesh-group",
            "Mesh Group information for ISIS(1)",
            "--------------------------------------",
            "Interface                       Status",
            "GE1/0/0                         100",
            "GE2/0/0                         100"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen an interface that does not belong to an IS-IS mesh-group receives an LSP, the interface sends the LSP to all the other interfaces. On an NBMA network with multiple connections and P2P links, the same LSP will flood the network and consume bandwidth.\nAfter an interface joins a mesh-group, the interface sends the received LSP only to interfaces that do not belong to the mesh-group and the interface does not send the same LSP back. Therefore, LSP flooding is avoided, link pressure is reduced, and network resources are saved.\nThe display isis mesh-group command is used to check the mesh-group to which an interface belongs so that the LSP-flooding area can be identified."
}