{
    "PageTitle": "ecmp-prefer",
    "FuncDef": "The ecmp-prefer command configures whether the routes with a TE tunnel interface or an IPv4 interface as the outbound interface are preferentially selected to load-balance IS-IS traffic.\nThe undo ecmp-prefer command restores the default configuration.\nBy default, routes are equally selected to load-balance IS-IS traffic, regardless of whether the outbound interface is a TE tunnel interface or an IPv4 interface.",
    "CLIs": [
        "ecmp-prefer { te-tunnel | intact }",
        "undo ecmp-prefer"
    ],
    "ParentView": [
        "IS-IS view"
    ],
    "ParaDef": [
        {
            "Parameters": "te-tunnel",
            "Info": "Indicates that the routes with a TE tunnel interface as the outbound interface are preferentially selected to load-balance IS-IS traffic.\n-"
        },
        {
            "Parameters": "intact",
            "Info": "Indicates that the routes with a TE tunnel interface as the outbound interface and at least one route with an IPv4 interface as the outbound interface are selected to load-balance IS-IS traffic.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis 1",
            "[*HUAWEI-isis-1] ecmp-prefer te-tunnel"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen an IGP Shortcut-enabled TE tunnel is configured on an IS-IS network, you can specify one of the following parameters in the ecmp-prefer command based on the network type to configure whether the routes with a TE tunnel interface or an IPv4 interface as the outbound interface are preferentially selected to load-balance IS-IS traffic.\nte-tunnel: Specify this parameter when devices between the two routers connected by the TE tunnel do not support MPLS. If you specify this parameter, routes with a TE tunnel interface as the outbound interface are preferentially selected to load-balance IS-IS traffic, which prevents MPLS traffic loss.intact: Specify this parameter so that at least one route with an IPv4 interface as the outbound interface is selected along with the routes with a TE tunnel interface as the outbound interface to load-balance IS-IS traffic. If the TE tunnel fails, traffic can be forwarded along the route with an IPv4 interface as the outbound interface, which prevents traffic loss.\n\nPrerequisites\nAn IS-IS process has been created and the IS-IS view has been displayed using the isis command."
}