{
    "PageTitle": "ipv6 filter-policy import",
    "FuncDef": "The ipv6 filter-policy import command configures IS-IS to filter received IPv6 routes so that only given routes are added to the IPv6 routing table.\nThe undo ipv6 filter-policy import command removes the configuration.\nBy default, IS-IS does not filter received IPv6 routes.",
    "CLIs": [
        "ipv6 filter-policy { <acl6-number> | acl6-name <acl6-name-string> | ipv6-prefix <ipv6-prefix-name> | route-policy <route-policy-name> | route-filter <route-filter-name> } import",
        "undo ipv6 filter-policy [ <acl6-number> | acl6-name <acl6-name-string> | ipv6-prefix <ipv6-prefix-name> | route-policy <route-policy-name> | route-filter <route-filter-name> ] import"
    ],
    "ParentView": [
        "IS-IS view"
    ],
    "ParaDef": [
        {
            "Parameters": "acl6-number",
            "Info": "Specifies the number of a basic IPv6 ACL.\nThe value is an integer ranging from 2000 to 2999."
        },
        {
            "Parameters": "acl6-name acl6-name-string",
            "Info": "Specifies the name of a named basic ACL6.\nThe value is a string of 1 to 64 case-sensitive characters without spaces. The value must start with a letter (a to z or A to Z, case sensitive)."
        },
        {
            "Parameters": "ipv6-prefix ipv6-prefix-name",
            "Info": "Specifies the name of an IPv6 prefix list.\nThe name is a string of 1 to 169 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "route-policy route-policy-name",
            "Info": "Specifies the name of a route-policy to filter routes based on tags and other protocol parameters.\nThe name is a string of 1 to 200 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "route-filter route-filter-name",
            "Info": "Specifies the name of a filter policy to filter routes based on tags and other protocol parameters.\nThe value is a string of 1 to 200 case-sensitive characters, spaces not supported. If parameters are included in the referenced route-filter, specify values for them in the format of (var1, var2, ...var8) behind the route-filter name. A maximum of eight parameters can be specified, and each value ranges from 1 to 200 characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl ipv6 2003",
            "[*HUAWEI-acl6-basic-2003] quit",
            "[*HUAWEI] isis",
            "[*HUAWEI-isis-1] ipv6 enable",
            "[*HUAWEI-isis-1] ipv6 filter-policy 2003 import"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure IS-IS to filter received IPv6 routes so that only given routes are added to the IPv6 routing table, run the ipv6 filter-policy import command. The ipv6 filter-policy import command takes effect only after IPv6 is enabled for the IS-IS process. For details, see isis ipv6 enable."
}