{
    "PageTitle": "ipv6 filter-policy export",
    "FuncDef": "The ipv6 filter-policy export command configures IS-IS to filter imported IPv6 routes before route advertisement.\nThe undo ipv6 filter-policy export command disables such filtering.\nBy default, IS-IS does not filter imported IPv6 routes before route advertisement.",
    "CLIs": [
        "ipv6 filter-policy { <acl6-number> | acl6-name <acl6-name-string> | ipv6-prefix <ipv6-prefix-name> | route-policy <route-policy-name> | route-filter <route-filter-name> } { export [ direct | static | ripng <process-id> | bgp | ospfv3 <process-id> | isis <process-id> | unr ] }",
        "undo ipv6 filter-policy [ <acl6-number> | acl6-name <acl6-name-string> | ipv6-prefix <ipv6-prefix-name> | route-policy <route-policy-name> | route-filter <route-filter-name> ] { export [ direct | static | ripng <process-id> | bgp | ospfv3 <process-id> | isis <process-id> | unr ] }"
    ],
    "ParentView": [
        "IS-IS view"
    ],
    "ParaDef": [
        {
            "Parameters": "acl6-number",
            "Info": "Specifies a basic ACL6 number.\nThe value is an integer ranging from 2000 to 2999."
        },
        {
            "Parameters": "acl6-name acl6-name-string",
            "Info": "Specifies the name of a named basic ACL6.\nThe value is a string of 1 to 64 case-sensitive characters without spaces. The value must start with a letter (a to z or A to Z, case sensitive)."
        },
        {
            "Parameters": "ipv6-prefix ipv6-prefix-name",
            "Info": "Specifies the name of an IPv6 prefix list.\nThe name is a string of 1 to 169 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "route-policy route-policy-name",
            "Info": "Specifies the name of a route-policy to filter routes based on tags and other protocol parameters.\nThe name is a string of 1 to 200 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "route-filter route-filter-name",
            "Info": "Specifies the name of route filter policy to filter routes based on tags and other protocol parameters.\nThe value is a string of 1 to 200 case-sensitive characters, spaces not supported. If parameters are included in the referenced route-filter, specify values for them in the format of (var1, var2, ...var8) behind the route-filter name. A maximum of eight parameters can be specified, and each value ranges from 1 to 200 characters."
        },
        {
            "Parameters": "direct",
            "Info": "Specifies to filter the imported direct routes before route advertisement.\n-"
        },
        {
            "Parameters": "static",
            "Info": "Specifies to filter the imported static routes before route advertisement.\n-"
        },
        {
            "Parameters": "ripng process-id",
            "Info": "Specifies the ID of an RIPng process.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "bgp",
            "Info": "Specifies to filter the imported BGP routes before route advertisement.\n-"
        },
        {
            "Parameters": "ospfv3 process-id",
            "Info": "Specifies the ID of an OSPFv3 process.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "isis process-id",
            "Info": "Specifies the ID of an IS-IS process.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "unr",
            "Info": "Specifies to filter the imported UNR routes before route advertisement.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl ipv6 2002",
            "[*HUAWEI-acl6-basic-2002] quit",
            "[*HUAWEI] isis",
            "[*HUAWEI-isis-1] ipv6 enable",
            "[*HUAWEI-isis-1] ipv6 filter-policy 2002 export"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe ipv6 filter-policy export command is usually used with the ipv6 import-route command. The ipv6 filter-policy export command is used to filter imported routes so that only given routes are advertised to other devices. If protocol is not specified, the routes imported from all protocols are filtered; if protocol is specified, the routes imported from the specified protocol are filtered.\nEnable the IPv6 capability for the IS-IS process first before you run this command. For details, refer to isis ipv6 enable."
}