{
    "PageTitle": "frr (IS-IS view)",
    "FuncDef": "The frr command enables fast reroute (FRR) for IS-IS or displays the IS-IS FRR view if FRR has been enabled.\nThe undo frr command disables FRR.\nThe ipv6 frr command enables IPv6 FRR and displays an IPv6 FRR view.\nThe undo ipv6 frr command enables the system to exit from an IPv6 FRR view.\nBy default, FRR and IPv6 FRR are disabled.",
    "CLIs": [
        "frr",
        "ipv6 frr",
        "undo frr",
        "undo ipv6 frr"
    ],
    "ParentView": [
        "IS-IS view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis 1",
            "[*HUAWEI-isis-1] ipv6 enable",
            "[*HUAWEI-isis-1] ipv6 frr"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis 1",
            "[*HUAWEI-isis-1] frr"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo enable FRR for IS-IS or display the IS-IS FRR view if FRR has been enabled, run the frr command. Before using the frr command, you need to enable an IS-IS process. Running the undo frr command will also delete all configurations from the FRR view. Therefore, exercise caution when running this command.\nOn a network with redundant links, a backup link can be pre-computed through IP FRR, and then the backup link is added to the forwarding table. In this manner, if the primary link fails, traffic can be protected in time and the traffic interruption time is reduced to within 50 ms. This meets the requirement for real-time services.\nThe ipv6 frr command is applicable to IPv6 base topologies.\nThe ipv6 frr command is used to enable IPv6 FRR and enter the IPv6 FRR view.\nAfter configuring the ipv6 frr command, run the loop-free-alternate command to compute a loop-free backup route.\nPrerequisites\nBefore configuring the frr command, enable an IS-IS process.\nBefore configuring the ipv6 frr command, enable IPv6 IS-IS.\nPrecautions\nRunning the undo frr command will also delete all configurations from the FRR view. Therefore, exercise caution when running this command."
}