{
    "PageTitle": "frr-policy route (IS-IS FRR view)",
    "FuncDef": "The frr-policy route command filters IS-IS backup routes before the routes are added to the IP routing table.\nThe undo frr-policy route command cancels the filtering function.\nBy default, the filtering function is disabled.",
    "CLIs": [
        "frr-policy route { route-policy <route-policy-name> | route-filter <route-filter-name> }",
        "undo frr-policy route"
    ],
    "ParentView": [
        "IS-IS FRR view"
    ],
    "ParaDef": [
        {
            "Parameters": "route-policy route-policy-name",
            "Info": "Specifies the name of a route policy to filter IS-IS backup routes.\nThe name is a string of 1 to 200 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "route-filter route-filter-name",
            "Info": "Specifies the name of route filter policy to filter IS-IS backup routes.\nThe value is a string of 1 to 200 case-sensitive characters, spaces not supported. If parameters are included in the referenced route-filter, specify values for them in the format of (var1, var2, ...var8) behind the route-filter name. A maximum of eight parameters can be specified, and each value ranges from 1 to 200 characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] route-policy abc permit node 10",
            "[*HUAWEI-route-policy] quit",
            "[*HUAWEI] isis",
            "[*HUAWEI-isis-1] frr",
            "[*HUAWEI-isis-1-frr] frr-policy route route-policy abc"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWith the development of networks, Voice over Internet Protocol (VoIP) and on-line video services require high-quality real-time transmission. Nevertheless, if an IS-IS fault occurs, multiple processes, including fault detection, LSP update, LSP flooding, route calculation, and FIB entry delivery, must be performed to switch the traffic to a new link. As a result, it takes much more than 50 ms to rectify the fault, unable to meet the requirement for real-time services.\nThe frr-policy route command can be configured as required. In this case, the IS-IS backup route matching specified rules can be added to the IP routing table and delivered to the forwarding table. When a fault occurs on the route, the system can fast switch the forwarded traffic to the IS-IS backup route to protect the traffic.\nYou can use IP prefix lists or ACLs to filter the IS-IS backup routes.\nPrerequisites\nAn IS-IS instance has been created, and fast reroute has been enabled."
}