{
    "PageTitle": "import-route isis level-2 into level-1 (IS-IS AF topology view)",
    "FuncDef": "The import-route isis level-2 into level-1 command enables IS-IS routes to leak from a Level-2 area to a Level-1 area.\nThe undo import-route isis level-2 into level-1 command disables IS-IS route leaking from a Level-2 area to a Level-1 area.\nBy default, IS-IS route leaking is disabled from a Level-2 area to a Level-1 area.",
    "CLIs": [
        "import-route isis level-2 into level-1 [ tag <tag> | filter-policy { <acl-number> | acl6-name <acl6-name> | ipv6-prefix <ipv6-prefix-name> | route-policy <route-policy-name> | route-filter <route-filter-name> } | direct { allow-filter-policy | allow-up-down-bit } * ] *",
        "undo import-route isis level-2 into level-1"
    ],
    "ParentView": [
        "IS-IS AF topology view"
    ],
    "ParaDef": [
        {
            "Parameters": "tag tag",
            "Info": "Specifies the administrative tag assigned to the imported routes.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "filter-policy",
            "Info": "Indicates a filtering policy to filter imported routes. Only the IS-IS Level-2 area routes that match the filtering policy can leak to a Level-1 area.\n-"
        },
        {
            "Parameters": "acl-number",
            "Info": "Specifies the number of a basic ACL. Only the IS-IS Level-2 area routes that match the ACL rule can leak to a Level-1 area.\nThe value is an integer ranging from 2000 to 2999."
        },
        {
            "Parameters": "acl6-name acl6-name",
            "Info": "Specifies the name of a named basic ACL6. Only the IS-IS Level-2 area IPv6 routes that match the ACL rule can leak to a Level-1 area.\nThe value is a string of 1 to 64 case-sensitive characters without spaces. The value must start with a letter (a to z or A to Z, case sensitive)."
        },
        {
            "Parameters": "ipv6-prefix ipv6-prefix-name",
            "Info": "Specifies the name of an IPv6 prefix list. Only the IS-IS Level-2 area IPv6 routes that match the prefix list can leak to a Level-1 area.\nThe name is a string of 1 to 169 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "route-policy route-policy-name",
            "Info": "Specifies the name of a route-policy. Only the IS-IS Level-2 area routes that match the route-policy can leak to a Level-1 area.\nThe name is a string of 1 to 200 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "route-filter route-filter-name",
            "Info": "Specifies the name of route filter policy. The policy is used to filter the imported routes so that only some of the routes of other routing domains can be imported.\nThe value is a string of 1 to 200 case-sensitive characters, spaces not supported. If parameters are included in the referenced route-filter, specify values for them in the format of (var1, var2, ...var8) behind the route-filter name. A maximum of eight parameters can be specified, and each value ranges from 1 to 200 characters."
        },
        {
            "Parameters": "direct",
            "Info": "Imports direct routes.\n-"
        },
        {
            "Parameters": "allow-filter-policy",
            "Info": "Indicates a filtering policy to filter the direct routes.\nIf the parameter is configured, only the IS-IS Level-2 area direct routes that match the filtering policy can leak to a Level-1 area. If the parameter is not configured, all Level-2 area direct routes will leak to a Level-1 area.\n-"
        },
        {
            "Parameters": "allow-up-down-bit",
            "Info": "Sets the Up/Down bit to 1 for the leaked direct routes.\nIf direct allow-up-down-bit is specified, the direct routes that have already leaked to a Level-1 area cannot leak back.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl 2000",
            "[*HUAWEI-acl4-basic-2000] quit",
            "[*HUAWEI] ip topology red",
            "[*HUAWEI] isis 1",
            "[*HUAWEI-isis-1] cost-style wide",
            "[*HUAWEI-isis-1] topology red topology-id 10",
            "[*HUAWEI-isis-1-topology-red] import-route isis level-2 into level-1 filter-policy 2000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen multiple Level-1-2 routers in an Level-1 area are connected to a Level-2 area, Level-1 routers are unable to know the network topology of the Level-2 area because they cannot learn the Level-2 routes. As a result, Routers in the Level-1 area forward traffic to the nearest Level-1-2 router, and sub-optimal routes may be generated.\nTo address this problem, you can run the import-route isis level-2 into level-1 command to enable IS-IS route leaking from a Level-2 area to a Level-1 area to help Level-1 routers select the optimal route for traffic forwarding.\nThe import-route isis level-2 into level-1 command can be run only on Level-1-2 routers to enable IS-IS route leaking of all or some of the Level-2 routes to the Level-1 area.\nPrerequisites\nAn IS-IS process has been created using the isis command.\nConfiguration Impact\nThe imported Level-2 routes will increase the number of entries in Level-1 routing tables.\nPrecautions\nIn the route-policy specified in this command, if-match clauses can be configured to set matching rules, but apply clauses cannot be configured to set route attributes."
}