{
    "PageTitle": "is-name map",
    "FuncDef": "The is-name map command enables a local Router to identify the hostname carried in each LSP and configures a static hostname for the remote IS-IS system.\nThe undo is-name map command disables a local Router from identifying the hostname carried in each LSP and deletes the configured hostname for the remote IS-IS system.\nBy default, no static hostname is configured locally for the remote IS-IS system.",
    "CLIs": [
        "is-name map <system-id> <symbolic-name>",
        "undo is-name map <system-id>"
    ],
    "ParentView": [
        "IS-IS view"
    ],
    "ParaDef": [
        {
            "Parameters": "system-id",
            "Info": "Specifies the ID of the remote IS-IS system or pseudonode ID.\n-"
        },
        {
            "Parameters": "symbolic-name",
            "Info": "Specifies a static hostname of the remote IS-IS system.\nThe value is a string of 1 to 64 characters. When quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis",
            "[*HUAWEI-isis-1] is-name map 0000.0000.0041 RUTB"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn most cases, to check information about IS-IS neighbors and LSDBs on an IS-IS router, you need to use a system ID of a 12-digit hexadecimal number, for example, aaaa.eeee.1234. This representation, however, is complicated and not easy to use. The dynamic hostname exchange mechanism is introduced to facilitate maintenance and management of IS-IS networks. The is-name map command is used to configure a simple hostname for the remote Router. The configured hostname is not advertised in an LSP.\nAfter the remote router is mapped to a hostname, the system ID of the remote router is replaced with the configured hostname when you run the display isis name-table command.\nPrerequisites\nAn IS-IS process has been created using the isis command in the system view.\nPrecautions\nIf the local Router configures a dynamic hostname and the remote Router configures a static hostname for the local Router, the dynamic hostname overwrites the static one."
}