{
    "PageTitle": "isis topology link-quality low incr-cost",
    "FuncDef": "The isis topology link-quality low incr-cost command enables the function to adjust the link cost of an interface when its link quality is low.\nThe undo isis topology link-quality low incr-cost command disables the function.\nBy default, an IS-IS interface cannot adjust the link cost based on link quality.",
    "CLIs": [
        "isis topology <topology-name> link-quality low incr-cost { <cost-value> | max-reachable }",
        "undo isis topology <topology-name> link-quality low incr-cost [ { <cost-value> | max-reachable } ]"
    ],
    "ParentView": [
        "FlexE interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "100GE interface view",
        "GE electrical interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "VE interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Eth-Trunk interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "low",
            "Info": "Indicates that the link cost of an interface is adjusted when its link quality is low.\n-"
        },
        {
            "Parameters": "cost-value",
            "Info": "Specifies a link cost adjustment value.After this parameter is specified:\nWhen the link quality becomes low, the actual link cost of the interface equals the original link cost plus the specified adjustment value.When the link quality reverts, the actual link cost of the interface equals the original link cost.\nThe value is an integer ranging from 1 to 16777213."
        },
        {
            "Parameters": "max-reachable",
            "Info": "Adjusts the link cost to the maximum link cost.\nThe maximum link cost is 63 if the cost type is narrow, narrow-compatible, or compatible.The maximum link cost is 16777214 if the cost type is wide or wide-compatible.\n-"
        },
        {
            "Parameters": "topology topology-name",
            "Info": "Specifies the name of an IPv4 topology instance. If this parameter is not specified, the command configuration applies to the interface in the IPv4 base topology.\nThe value is a string of 1 to 31 case-sensitive characters without spaces. The value must start with a letter (a to z or A to Z, case sensitive) and can contain numbers, hyphens (-), or underlines (_). When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip topology red",
            "[*HUAWEI] isis 1",
            "[*HUAWEI-isis-1] cost-style wide",
            "[*HUAWEI-isis-1] topology red topology-id 10",
            "[*HUAWEI-isis-1-topology-red] quit",
            "[*HUAWEI-isis-1] quit",
            "[*HUAWEI] interface GigabitEthernet1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] isis enable",
            "[*HUAWEI-GigabitEthernet1/0/0] ip topology red enable",
            "[*HUAWEI-GigabitEthernet1/0/0] isis topology red link-quality low incr-cost max-reachable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA bit error indicates the deviation between a bit that is sent and the bit that is received. Bit errors caused by optical fiber aging or optical signal jitter are inevitable on carrier networks. During data transmission, a high bit error rate will degrade or even interrupt services in extreme cases.\nTo ensure network reliability, run the isis link-quality low incr-cost command to enable the device to adjust the link cost of an IS-IS interface when its link quality is low. If the IS-IS interface detects that its link quality is low, the device increases the link cost of the interface, so that this link, which has a higher bit error rate, is not selected as the optimal link. After the link quality reverts, the device automatically restores the link cost of the IS-IS interface.\nPrerequisites\nIS-IS has been enabled on the interface using the isis enable command.\nConfiguration Impact\nIf the isis link-quality low incr-cost command is run more than once in the same view, the latest configuration overrides the previous one.\nPrecautions\nFor an IS-IS interface that adjusts the cost based on the link quality, the configuration priority in the specified IPv4 topology is higher. If you have configured the isis link-quality low incr-cost { cost-value | max-reachable } command and the isis topology topology-name link-quality low incr-cost { cost-value | max-reachable } command, The IPv4 topology uses the behavior of the latter command configuration. The other topologies use the behavior configured by the previous command."
}