{
    "PageTitle": "isis authentication-mode",
    "FuncDef": "The isis authentication-mode command configures an IS-IS interface to authenticate Hello packets based on a specified mode and password.\nThe undo isis authentication-mode command cancels the authentication and deletes the password.\n\nBy default, no password is set and no authentication is performed. Configuring authentication is recommended to ensure system security.\n\n\nIt is recommended that you enable authentication and use the HMAC-SHA256 algorithm to improve security, preventing route information from being modified by unauthorized users.",
    "CLIs": [
        "isis authentication-mode { simple { [ cipher ] <simple-cipher> | plain <simple-plain> } | md5 { [ cipher ] <md5-cipher> | plain <md5-plain> } } [ ip | osi ] [ send-only ]",
        "isis authentication-mode keychain <keychain-name> [ send-only ]",
        "isis authentication-mode hmac-sha256 key-id <key-id> { [ cipher ] <md5-cipher> | plain <md5-plain> } [ send-only ]",
        "undo isis authentication-mode",
        "undo isis authentication-mode { simple { cipher <simple-cipher> | plain <simple-plain> } | md5 { cipher <md5-cipher> | plain <md5-plain> } } [ ip | osi ] [ send-only ]",
        "undo isis authentication-mode keychain <keychain-name> [ send-only ]",
        "undo isis authentication-mode hmac-sha256 key-id <key-id> { cipher <md5-cipher> | plain <md5-plain> } [ send-only ]"
    ],
    "ParentView": [
        "Tunnel interface view",
        "VBDIF interface view",
        "Cellular channel interface view",
        "IP-Trunk interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "GE electrical interface view",
        "Loopback interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "VE interface view",
        "50GE sub-interface view",
        "GE optical interface view",
        "25GE interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "simple",
            "Info": "Indicates simple authentication.\n-"
        },
        {
            "Parameters": "cipher",
            "Info": "Indicates the ciphertext mode. The simple text or ciphertext can be entered. The password in the configuration file is displayed as a ciphertext. MD5 authentication uses the ciphertext mode by default.\n-"
        },
        {
            "Parameters": "cipher simple-cipher",
            "Info": "Indicates the ciphertext mode. The simple text or ciphertext can be entered. The password in the configuration file is displayed as a ciphertext. MD5 authentication uses the ciphertext mode by default.\nA ciphertext password is a character string that is encrypted using a special algorithm. A ciphertext is used for configuration restoration. The parameter value must be the same as the ciphertext in the configuration file.\nThe value is a string of case-sensitive characters that can be letters or digits.\nIn simple authentication, the value is a string of 1 to 16 characters in the simple text mode or a string of 24 to 128 characters in the ciphertext mode. In MD5 authentication, the value is a string of 1 to 255 characters in the simple text mode or a string of 20 to 432 characters in the ciphertext mode.\nA 24-character ciphertext password configured in an earlier version is also supported in this version.A password cannot contain a question mark (?), but can contain spaces if surrounded by double quotation marks (\"\"). In this case, the double quotation marks are part of the password."
        },
        {
            "Parameters": "simple-cipher",
            "Info": "Specifies a simple text or ciphertext.\nA ciphertext password is a character string that is encrypted using a special algorithm. A ciphertext is used for configuration restoration. The parameter value must be the same as the ciphertext in the configuration file.\nThe value is a string of case-sensitive characters that can be letters or digits.\nIn simple authentication, the value is a string of 1 to 16 characters in a simple text, or a string of 24 to 128 characters in a ciphertext.In md5 or hmac-sha256 authentication, the value is a string of 1 to 255 characters in a simple text, or a string of 20 to 432 characters in a ciphertext.A 24-character ciphertext password configured in an earlier version is also supported in this version.A password cannot contain a question mark (?), but can contain spaces if surrounded by double quotation marks (\"\"). In this case, the double quotation marks are part of the password."
        },
        {
            "Parameters": "plain",
            "Info": "Indicates the simple text mode. Only the simple text can be entered. The password in the configuration file is displayed as a simple text. Simple authentication uses the simple text mode by default.\nWhen configuring an authentication password, select the ciphertext mode because the password is saved in the configuration file as a simple text if you select the simple text mode, which has a high risk. To ensure device security, change the password periodically.\n-"
        },
        {
            "Parameters": "simple-plain",
            "Info": "Specifies a simple-text password.\nThe value is a string of case-sensitive characters that can be letters or digits.\nIn simple authentication, the value is a string of 1 to 16 characters. In MD5 authentication, the value is a string of 1 to 255 characters.\nA password cannot contain a question mark (?), but can contain spaces if surrounded by double quotation marks (\"\"). In this case, the double quotation marks are part of the password."
        },
        {
            "Parameters": "md5",
            "Info": "Indicates that the password is transmitted after being encrypted using HMAC-MD5.\nFor the sake of security, using the HMAC-SHA256 algorithm rather than the MD5 algorithm is recommended.\n-"
        },
        {
            "Parameters": "md5-cipher",
            "Info": "Specifies a ciphertext password.\nA ciphertext password is a character string that is encrypted using a special algorithm. A ciphertext is used for configuration restoration. The parameter value must be the same as the ciphertext in the configuration file.\nThe value is a string of case-sensitive characters that can be letters or digits. When quotation marks are used around the string, spaces are allowed in the string.\nIn simple authentication, the value is a string of 1 to 16 characters in a simple text, or a string of 24 to 128 characters in a ciphertext.In md5 or hmac-sha256 authentication, the value is a string of 1 to 255 characters in a simple text, or a string of 20 to 432 characters in a ciphertext.A 24-character ciphertext password configured in an earlier version is also supported in this version.A password cannot contain a question mark (?), but can contain spaces if surrounded by double quotation marks (\"\"). In this case, the double quotation marks are part of the password."
        },
        {
            "Parameters": "md5-plain",
            "Info": "Specifies a plaintext password.\nThe value is a string of case-sensitive characters that can be letters or digits.\nIn simple authentication, the value is a string of 1 to 16 characters. In MD5 authentication, the value is a string of 1 to 255 characters.\nA password cannot contain a question mark (?), but can contain spaces if surrounded by double quotation marks (\"\"). In this case, the double quotation marks are part of the password."
        },
        {
            "Parameters": "ip",
            "Info": "Indicates the IP authentication password. This parameter cannot be configured when keychain authentication is used.\n-"
        },
        {
            "Parameters": "osi",
            "Info": "Indicates the OSI authentication password. This parameter cannot be configured when keychain authentication is used.\n-"
        },
        {
            "Parameters": "send-only",
            "Info": "Encapsulates the Hello packets to be sent with authentication information and ignores checking authentication information carried in received Hello packets.\n-"
        },
        {
            "Parameters": "keychain keychain-name",
            "Info": "Specifies the keychain that changes with time.\nBefore configuring this parameter, run the keychain command to create a keychain. Then, run the key-id, key-string, and algorithm commands to configure a key ID, a password, and an authentication algorithm for this keychain. Otherwise, the authentication will fail.\nKeychain authentication supports only HMAC-MD5 and HMAC-SHA256 algorithms. Using any other algorithm may lead to an authentication failure.\nIf the dependent keychain is deleted, the neighbor relationship may be interrupted. Therefore, exercise caution when deleting the keychain.\nThe value is a string of 1 to 47 case-insensitive characters.\nA password cannot contain a question mark (?), but can contain spaces if surrounded by double quotation marks (\"\"). In this case, the double quotation marks are part of the password."
        },
        {
            "Parameters": "hmac-sha256",
            "Info": "Encapsulates generated packets with the HMAC-SHA256 authentication and a password encrypted using the HMAC-SHA256 algorithm and authenticates received packets.\n-"
        },
        {
            "Parameters": "key-id key-id",
            "Info": "Specifies a key ID for authentication, which must be the same as the one configured at the other end.\nThe value is an integer ranging from 0 to 65535."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis 1",
            "[*HUAWEI-isis-1] quit",
            "[*HUAWEI] interface GigabitEthernet1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] isis enable",
            "[*HUAWEI-GigabitEthernet1/0/0] isis authentication-mode hmac-sha256 key-id 1 cipher Huawei-123"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo ensure network security, you can enable a router to authenticate received packets based on the pre-defined authentication mode or add authentication information to the packets to be sent. Only the packets that are authenticated can be forwarded on the network.\nThe isis authentication-mode command enables the local node to discard all the Hello packets with authentication passwords that are different from the one set using this command. You can also enable the device to add the set authentication password to all the Hello packets to be sent.\nPrerequisites\nIS-IS has been enabled using the isis enable command in the interface view.\nPrecautions\nIf a password is set, but neither ip nor osi is specified, osi is defaulted.\nIf a broadcast interface is emulated as a P2P interface using the isis circuit-type command or then restored to the broadcast interface through the undo isis circuit-type command, the authentication configuration on the interface is restored to the default setting.\nFor a P2P interface, only Level-1 authentication is specified by default."
}