{
    "PageTitle": "isis bfd bit-error enable",
    "FuncDef": "The isis bfd bit-error enable command enables BFD-based bit error detection on an interface.\nThe undo isis bfd bit-error enable command disables BFD-based bit error detection on an interface.\nBy default, BFD-based bit error detection is disabled on an interface.",
    "CLIs": [
        "isis bfd bit-error enable",
        "undo isis bfd bit-error enable"
    ],
    "ParentView": [
        "FlexE interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "100GE interface view",
        "GE electrical interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "VE interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Eth-Trunk interface view",
        "POS interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis 1",
            "[*HUAWEI-isis-1] network-entity 10.0001.1010.1020.1030.00",
            "[*HUAWEI-isis-1] quit",
            "[*HUAWEI] interface GigabitEthernet1/0/1",
            "[*HUAWEI-GigabitEthernet1/0/1] isis enable 1",
            "[*HUAWEI-GigabitEthernet1/0/1] isis bfd bit-error enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn an NG MVPN scenario, multicast data flows must be transmitted on a link that has no or few bit errors because even low bit error rates may cause black screen, erratic display, or frame interruption. If multiple links exist between the upstream and downstream nodes of an mLDP tunnel and some links are logical instead of physical direct links, the upstream node randomly selects an outbound interface by default, and sends packets over the link of the selected interface to the downstream node. If you expect the mLDP upstream node to detect bit error rates of the links and switch to an outbound interface that is connected to a downstream link with few or no bit errors, run the bfd bit-error all-interfaces enable command to enable BFD-based bit error detection.\nTo enable BFD-based bit error detection on an interface, run the isis bfd bit-error enable command. This function enables BFD to detect bit errors and send bit error information to an IS-IS neighbor. The neighbor can then adjust link costs based on the bit error rates of the links, allowing IS-IS to select a link with no or few bit errors to minimize multicast traffic loss.\nPrerequisites\nIS-IS has been enabled on the interface using the isis enable command.\nPrecautions\nBFD must be enabled globally using the bfd command in the system view. Otherwise, BFD-based bit error detection does not take effect on the interface.\nThe isis bfd bit-error enable and isis bfd bit-error block commands are mutually exclusive and cannot be run in the same interface view."
}