{
    "PageTitle": "isis ipv6 bfd",
    "FuncDef": "The isis ipv6 bfd command configures IPv6 BFD parameters on an interface.\nThe undo isis ipv6 bfd command restores default IPv6 BFD parameters on an interface.\nBy default, the minimum interval at which IPv6 BFD packets are sent or received is 10, in milliseconds; the IPv6 BFD local detection multiplier is 3.",
    "CLIs": [
        "isis ipv6 bfd { min-tx-interval <transmit-interval> | min-rx-interval <receive-interval> | detect-multiplier <multiplier-value> | frr-binding } *",
        "undo isis ipv6 bfd { min-tx-interval [ <transmit-interval> ] | min-rx-interval [ <receive-interval> ] | detect-multiplier [ <multiplier-value> ] | frr-binding } *"
    ],
    "ParentView": [
        "Tunnel interface view",
        "FlexE interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "GE electrical interface view",
        "VE interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "VBDIF interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Eth-Trunk interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "min-tx-interval transmit-interval",
            "Info": "Specifies the minimum interval at which IPv6 BFD packets are sent to the peer end.\nThe value is an integer ranging from 3 to 20000, in milliseconds. The default value is 10."
        },
        {
            "Parameters": "min-rx-interval receive-interval",
            "Info": "Specifies the minimum interval at which IPv6 BFD packets are received from the peer end.\nThe value is an integer ranging from 3 to 20000, in milliseconds. The default value is 10."
        },
        {
            "Parameters": "detect-multiplier multiplier-value",
            "Info": "Specifies the IPv6 BFD local detection multiplier.\nThe value ranges from 3 to 50. The default value is 3."
        },
        {
            "Parameters": "frr-binding",
            "Info": "Binds the status of the IPv6 BFD session to IPv6 IS-IS Auto FRR. If IPv6 BFD detects a link fault on the interface, the IPv6 BFD session goes Down, triggering FRR on the interface. Then, traffic is switched from the faulty link to the backup link.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis 1",
            "[*HUAWEI-isis-1] ipv6 enable",
            "[*HUAWEI-isis-1] quit",
            "[*HUAWEI] interface GigabitEthernet1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] ipv6 enable",
            "[*HUAWEI-GigabitEthernet1/0/0] isis ipv6 enable 1",
            "[*HUAWEI-GigabitEthernet1/0/0] isis ipv6 bfd enable",
            "[*HUAWEI-GigabitEthernet1/0/0] isis ipv6 bfd min-rx-interval 400 detect-multiplier 4"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBFD can provide millisecond-level fault detection, help IS-IS to detect the faults that occur on neighboring devices or links more quickly, and instruct IS-IS to recalculate routes for correct packet forwarding. The isis ipv6 bfd command can be used to set values for BFD session parameters on a specified interface.\nPrerequisites\nBFD has been enabled globally, and run the isis ipv6 bfd enable command has been run on a specified interface.\nConfiguration Impact\nThe minimum interval at which IPv6 BFD packets are received is obtained after the receive-interval value and the remote transmit-interval value are compared. If the local end does not receive any BFD packet from its neighbor within the period (minimum interval at which IPv6 BFD packets are received x multiplier-value), the local end declares the neighbor Down.\nPrecautions\nThe priority of BFD configured on an interface is higher than that of BFD configured in a process. If BFD is enabled on an interface, BFD sessions are established with the BFD parameters set on the interface.\nThe set IPv6 BFD session parameters take effect only when IPv6 BFD is enabled on the interface."
}