{
    "PageTitle": "isis ipv6 bfd enable",
    "FuncDef": "The isis ipv6 bfd enable command enables IPv6 BFD on an IS-IS interface to establish IPv6 BFD sessions using default parameters.\nThe undo isis ipv6 bfd enable command cancels the configuration.\nBy default, IPv6 BFD is not enabled.",
    "CLIs": [
        "isis ipv6 bfd enable",
        "undo isis ipv6 bfd enable"
    ],
    "ParentView": [
        "Tunnel interface view",
        "FlexE interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "GE electrical interface view",
        "VE interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "VBDIF interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Eth-Trunk interface view",
        "POS interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis 1",
            "[*HUAWEI-isis-1] ipv6 enable",
            "[*HUAWEI-isis-1] quit",
            "[*HUAWEI] interface GigabitEthernet1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] ipv6 enable",
            "[*HUAWEI-GigabitEthernet1/0/0] isis ipv6 enable 1",
            "[*HUAWEI-GigabitEthernet1/0/0] isis ipv6 bfd enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBFD can provide millisecond-level fault detection, help IS-IS to detect the faults that occur on neighboring devices or links more quickly, and instruct IS-IS to recalculate routes for correct packet forwarding. The isis ipv6 bfd enable command can be used to enable IPv6 BFD on an IS-IS interface to establish IPv6 BFD sessions using default parameters.\nPrerequisites\nBFD has been enabled globally, and the IS-IS process has been started on a specified interface.\nConfiguration Impact\nAfter the isis ipv6 bfd enable command is run on an interface, the interface is enabled to establish BFD sessions using default parameter values for fast link fault detection.\nPrecautions\nIf BFD is not enabled globally, you can set IPv6 BFD parameters on an interface, but the interface cannot establish an IPv6 BFD session.\nThe priority of IPv6 BFD configured on an interface is higher than that of IPv6 BFD configured in a process. If IPv6 BFD is enabled on an interface, IPv6 BFD sessions are established with the BFD parameters set on the interface.\nIf the isis ipv6 bfd block, isis ipv6 bfd enable, and isis ipv6 bfd static commands are run, only the last command takes effect."
}