{
    "PageTitle": "isis timer hello (interface view)",
    "FuncDef": "The isis timer hello command sets an interval for a broadcast interface to send Hello packets of a corresponding level.\nThe undo isis timer hello command restores the default value.\nBy default, the interval at which Hello packets are sent is 10 seconds.",
    "CLIs": [
        "isis timer hello <hello-interval> [ level-1 | level-2 ] [ conservative ]",
        "undo isis timer hello [ <hello-interval> ] [ level-1 | level-2 ]",
        "undo isis timer hello <hello-interval> [ level-1 | level-2 ] conservative"
    ],
    "ParentView": [
        "VBDIF interface view",
        "FlexE interface view",
        "Cellular channel interface view",
        "40GE interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "100GE interface view",
        "GE electrical interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "VE interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Eth-Trunk interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "hello-interval",
            "Info": "Specifies an interval at which Hello packets are sent.\nThe value is an integer ranging from 1 to 255, in seconds."
        },
        {
            "Parameters": "level-1",
            "Info": "Indicates an interval at which Level-1 Hello packets are sent.\n-"
        },
        {
            "Parameters": "level-2",
            "Info": "Indicates an interval at which Level-2 Hello packets are sent.\nIf neither Level-1 nor Level-2 is specified, the default level is Level-1 and Level-2.\nlevel-1 and level-2 can be configured only on IS-IS broadcast interfaces.\n-"
        },
        {
            "Parameters": "conservative",
            "Info": "Enables the conservative mode for the holdtime of the IS-IS neighbor relationship.\nIf the parameter is specified and the holdtime of the IS-IS neighbor relationship is less than 20s, the IS-IS neighbor relationship is disconnected when the hold time elapses.If the parameter is not specified and the holdtime of the IS-IS neighbor relationship is less than 20s, the IS-IS neighbor relationship is disconnected when the period of the hold time and a delay elapses.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis 1",
            "[*HUAWEI-isis-1] quit",
            "[*HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] isis enable 1",
            "[*HUAWEI-GigabitEthernet1/0/0] isis timer hello 20 level-2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn a broadcast link, Level-1 and Level-2 Hello packets are sent separately, and the intervals at which they are sent need to be set respectively. On a P2P link, neither level-1 nor level-2 is required because there is only one type of Hello packets. The shorter the interval, the more system resources used to send Hello packets. The interval should therefore be set as required."
}