{
    "PageTitle": "isis ipv6 lfa-backup",
    "FuncDef": "The isis ipv6 lfa-backup command enables an IS-IS IPv6 interface to participate in Loop-Free Alternate (LFA) calculation.\nThe undo isis ipv6 lfa-backup command disables an IS-IS IPv6 interface from participating in LFA calculation.\nThe isis ipv6 lfa-backup disable command disables an IS-IS IPv6 interface from participating in LFA calculation.\nThe undo isis ipv6 lfa-backup disable command enables an IS-IS IPv6 interface to participate in LFA calculation.\nBy default, an IS-IS IPv6 interface can participate in LFA calculation.",
    "CLIs": [
        "isis ipv6 lfa-backup [ level-1 | level-1-2 | level-2 ]",
        "undo isis ipv6 lfa-backup [ level-1 | level-1-2 | level-2 ]"
    ],
    "ParentView": [
        "Tunnel interface view",
        "FlexE interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "GE electrical interface view",
        "Loopback interface view",
        "VE interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "VBDIF interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Eth-Trunk interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "level-1",
            "Info": "Enables an IPv6 interface to participate in LFA calculation in a Level-1 area.\n-"
        },
        {
            "Parameters": "level-1-2",
            "Info": "Enables an IPv6 interface to participate in LFA calculation in Level-1 and Level-2 areas.\n-"
        },
        {
            "Parameters": "level-2",
            "Info": "Enables an IPv6 interface to participate in LFA calculation in a Level-1 area.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis 1",
            "[*HUAWEI-isis-1] ipv6 enable",
            "[*HUAWEI-isis-1] quit",
            "[*HUAWEI] interface GigabitEthernet1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] ipv6 enable",
            "[*HUAWEI-GigabitEthernet1/0/0] isis ipv6 enable",
            "[*HUAWEI-GigabitEthernet1/0/0] undo isis ipv6 lfa-backup"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, FRR calculates a backup link based on the LFA algorithm, and the backup link together with the active link is added to the forwarding table. If an error occurs on the network, FRR can fast switch traffic to the backup link before route convergence on the control plane. This feature ensures uninterrupted traffic forwarding and greatly improves the reliability of IS-IS networks.\nBy default, an IS-IS IPv6 interface can participate in LFA calculation. However, some backup links are uncertain when an active link is faulty. To prevent traffic from being transmitted along a link, you can run the undo isis ipv6 lfa-backup command on the IPv6 interface on the link to disable the interface from participating in the LFA calculation.\nPrerequisites\nIPv6 IS-IS has been enabled running the isis ipv6 enable command on a specified interface.\nPrecautions\nTo ensure that FRR can function properly, do not disable all interfaces from participating in the LFA calculation."
}