{
    "PageTitle": "isis interface limit disable",
    "FuncDef": "The isis interface limit disable command disables the limit on the number of IS-IS interfaces that can be configured on a device.\nThe undo isis interface limit disable command restores the default configuration.\nBy default, the number of IS-IS interfaces that can be configured on a device is limited.",
    "CLIs": [
        "isis interface limit disable",
        "undo isis interface limit disable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis interface limit disable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, the number of IS-IS interfaces that can be configured on a device is limited by specifying a threshold for each model of network product. To disable the limit, run the isis interface limit disable command. After the command is run, you can configure new IS-IS interfaces even if the total number exceeds the specified threshold. To restore the limit on the device, run the undo isis interface limit disable command. If the number of IS-IS interfaces on the device is greater than or equal to the specified threshold before the configuration, no more IS-IS interfaces can be added on the device.\nPrecautions\nEach device model may have a specified threshold to limit the number of IS-IS interfaces that can be configured on the device. This threshold cannot exceed the default of 6000.\nBy default, the threshold is not checked during device configuration restoration. This ensures that the isis enable and isis ipv6 enable configurations are not lost after the device is upgraded from the source version to the target version. In the target version, if the number of configured IS-IS interfaces has exceeded the threshold, no more new IS-IS interfaces can be configured. To configure more interfaces, you need to run the isis interface limit disable command.\nIf the isis interface limit disable command is not run on a device, the number of IS-IS interfaces that can be configured on the device is limited to the threshold. If the isis interface limit disable command is run, a maximum of 16384 IS-IS interfaces can be configured on the device."
}