{
    "PageTitle": "isis srlg",
    "FuncDef": "The isis srlg command adds an interface to a shared risk link group (SRLG).\nThe undo isis srlg command deletes an interface from an SRLG.\nBy default, an interface is not added to any SRLG.",
    "CLIs": [
        "isis srlg <srlg-value>",
        "undo isis srlg [ <srlg-value> ]"
    ],
    "ParentView": [
        "FlexE interface view",
        "XGE interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "100GE interface view",
        "GE electrical interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "VE interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Eth-Trunk interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "srlg-value",
            "Info": "Specifies an SRLG ID.\nThe value is an integer ranging from 0 to 4294967295."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis 1",
            "[*HUAWEI-isis-1] quit",
            "[*HUAWEI] interface GigabitEthernet1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] isis enable 1",
            "[*HUAWEI-GigabitEthernet1/0/0] isis srlg 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAn SRLG is a set of links that share a common physical resource, such as an optical fiber. These links share the same risk level. If one of the links fails, all the other links in the SRLG may also fail.\nIf two links have the same risk of failure, you can run the isis srlg command on each of the links' interfaces to add the links to the same SRLG. Then, configure IS-IS to preferentially select a backup link not in the same SRLG as the specified link during route calculation in Auto FRR, reducing the possibility of network traffic interruption.\nPrerequisites\nIS-IS has been enabled on the interface using the isis enable command in the interface view.\nFollow-up Procedure\nRun the tiebreaker srlg-disjoint preference command to configure IS-IS to preferentially select a backup link not in the same SRLG during route calculation in Auto FRR."
}