{
    "PageTitle": "isis ldp-sync",
    "FuncDef": "The isis ldp-sync command enables LDP and IS-IS synchronization on an interface.\nThe undo isis ldp-sync command disables LDP and IS-IS synchronization on an interface.\nBy default, LDP and IS-IS synchronization is disabled on an interface.",
    "CLIs": [
        "isis ldp-sync",
        "undo isis ldp-sync"
    ],
    "ParentView": [
        "Tunnel interface view",
        "FlexE interface view",
        "XGE interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "100GE interface view",
        "GE electrical interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "VE interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Eth-Trunk interface view",
        "POS interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis 1",
            "[*HUAWEI-isis-1] quit",
            "[*HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] isis enable 1",
            "[*HUAWEI-GigabitEthernet1/0/0] isis ldp-sync"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nLDP convergence depends on IS-IS route convergence. Therefore, LDP converges slower than IS-IS routes. When MPLS LDP is used on a network with active and standby links, one of the following problems may occur:\nWhen the active link is faulty, traffic forwarded over the IS-IS route and LSP is switched to the standby link. When the active link recovers, traffic forwarded over the IS-IS route is switched back to the active link earlier than the LSP. As a result, LSP traffic is lost.When IS-IS is working properly over the active link but an LDP session or LDP adjacency over the active link goes Down, the IS-IS route still uses the active link, while the LSP is deleted from the active link. Meanwhile, the LSP fails to be established over the standby link because the standby link is not an optimal IS-IS route. As a result, LSP traffic is lost.\nTo prevent traffic loss in the preceding situations, run the isis ldp-sync command to enable LDP and IS-IS synchronization on an interface of the crossing node of the active and standby links.\n\nPrerequisites\nAn IS-IS process has been enabled using the isis enable command in the interface view."
}