{
    "PageTitle": "isis bfd block",
    "FuncDef": "The isis bfd block command disables an interface from dynamically establishing BFD sessions.\nThe undo isis bfd block command cancels the configuration.\nBy default, an interface can dynamically establish BFD sessions.",
    "CLIs": [
        "isis bfd block",
        "undo isis bfd block"
    ],
    "ParentView": [
        "Tunnel interface view",
        "FlexE interface view",
        "Cellular channel interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "GE electrical interface view",
        "VE interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "VBDIF interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Eth-Trunk interface view",
        "POS interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis 1",
            "[*HUAWEI-isis-1] quit",
            "[*HUAWEI] interface GigabitEthernet1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] isis enable 1",
            "[*HUAWEI-GigabitEthernet1/0/0] isis bfd block"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBFD can provide millisecond-level fault detection, help IS-IS to detect the faults that occur on neighboring devices or links more quickly, and instruct IS-IS to recalculate routes for correct packet forwarding. To enable all IS-IS interfaces to dynamically establish BFD sessions, run the bfd all-interfaces enable command on the interfaces. To disable an interface from dynamically establishing BFD sessions, run the isis bfd block command.\nPrerequisites\nBFD has been enabled globally, and An IS-IS process has been created on the interface.\nConfiguration Impact\nAfter the isis bfd block command is run on an interface, the interface is disabled from dynamically establishing BFD sessions. As a result, fast link fault detection cannot be implemented.\nPrecautions\nIf the isis bfd block, isis bfd enable, and isis bfd static commands are run, only the last command takes effect."
}