{
    "PageTitle": "isis",
    "FuncDef": "The isis command starts an IS-IS process and specifies a VPN instance.\nThe undo isis command deletes an IS-IS process.\nBy default, an IS-IS process runs in a public network instance.",
    "CLIs": [
        "isis <process-id> [ vpn-instance <vpn-instance-name> ]",
        "isis [ vpn-instance <vpn-instance-name> ]",
        "undo isis <process-id>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "process-id",
            "Info": "Specifies the ID of an IS-IS process.\nThe value is an integer ranging from 1 to 4294967295. The default value is 1."
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis 1",
            "[*HUAWEI-isis-1] network-entity 01.0001.0000.0000.0002.00"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure other functions and features of IS-IS or IS-IS interfaces, you need to enable IS-IS first. You can enter the IS-IS view after the isis command is run.\nOn a large-scale network, if a large number of Routers run IS-IS, there will be a huge number of routes, increasing maintenance costs, slowing down route convergence, and affecting network stability. To resolve the problem, you can run the isis command to start multiple processes to reduce the number of routes to be maintained.\nIn addition, to ensure that different services are forwarded properly on the network, you can run the isis command to start multiple IS-IS processes on one device to isolate these services.\nFollow-up Procedure\nRun the network-entity command to set a NET for the Router, and run the isis enable command to enable IS-IS on each interface that needs to run IS-IS. You can start IS-IS only when these configurations are completed."
}