{
    "PageTitle": "isis circuit-level",
    "FuncDef": "The isis circuit-level command sets a link type for an interface on a Level-1-2 router that runs IS-IS.\nThe undo isis circuit-level command restores the default setting.\nThis command varies in transport and router modes. For detailed differences, see Differences Between Commands in Transport and Router Modes. This topic describes the command configuration in router mode.\nBy default, the link type of an interface on a Level-1-2 router that runs IS-IS is Level-1-2, and both Level-1 and Level-2 adjacencies can be established on the interface.",
    "CLIs": [
        "isis circuit-level [ level-1 | level-2 | level-1-2 ]",
        "undo isis circuit-level"
    ],
    "ParentView": [
        "Tunnel interface view",
        "FlexE interface view",
        "Cellular channel interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "GE electrical interface view",
        "Loopback interface view",
        "GMPLS-UNI interface view",
        "VE interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "VBDIF interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Eth-Trunk interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "level-1",
            "Info": "Indicates the Level-1 link type. After the parameter is configured, the interface can set up only Level-1 adjacencies.\n-"
        },
        {
            "Parameters": "level-2",
            "Info": "Indicates the Level-2 link type. After the parameter is configured, the interface can set up only Level-2 adjacencies.\n-"
        },
        {
            "Parameters": "level-1-2",
            "Info": "Indicates the Level-1-2 link type. After the parameter is configured, the interface can set up both Level-1 and Level-2 adjacencies.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis 1",
            "[*HUAWEI-isis-1] quit",
            "[*HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] isis enable",
            "[*HUAWEI-GigabitEthernet1/0/0] isis circuit-level level-1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen an adjacency is established between a Level-1-2 router and a remote device, the Level-1-2 router sends and receives both Level-1 and Level-2 Hello packets, wasting bandwidth and memory resources. To solve this problem, run the isis circuit-level command to set a specified link type for an interface on the Level-1-2 router.\nPrerequisites\nIS-IS has been enabled using the isis enable command in the interface view.\nConfiguration Impact\nNetwork flapping may occur if the link type of an IS-IS interface is changed during network operation. Therefore, setting a link type when configuring IS-IS is recommended.\nPrecautions\nThe link type takes effect only when the system type of IS-IS is Level-1-2. Otherwise, the level defined by the is-level command is used."
}