{
    "PageTitle": "isis peer-ip-ignore",
    "FuncDef": "The isis peer-ip-ignore command prevents IS-IS from checking the IP address of each received Hello packet.\nThe undo isis peer-ip-ignore command cancels the configuration.\nBy default, IS-IS checks the IP address of each received Hello packet.",
    "CLIs": [
        "isis peer-ip-ignore",
        "undo isis peer-ip-ignore"
    ],
    "ParentView": [
        "Tunnel interface view",
        "VBDIF interface view",
        "Cellular channel interface view",
        "IP-Trunk interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "GE electrical interface view",
        "Loopback interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "VE interface view",
        "50GE sub-interface view",
        "GE optical interface view",
        "25GE interface view",
        "POS interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis 1",
            "[*HUAWEI-isis-1] quit",
            "[*HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] isis enable",
            "[*HUAWEI-GigabitEthernet1/0/0] isis circuit-type p2p",
            "[*HUAWEI-GigabitEthernet1/0/0] isis peer-ip-ignore"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn most cases, IS-IS checks the IP address of each received Hello packet. The neighbor relationship can be established only when the IP address carried in the Hello packet and the address of the interface that receives the Hello packet belong to the same network segment. If the IP addresses of the two interfaces belong to different network segments, and the isis peer-ip-ignore command is run on the two interfaces, IS-IS does not check the peer IP address. Then, the neighbor relationship can be established on the two IS-IS interfaces. There are routes to the two different network segments in the routing table, but the IP addresses of the two interfaces on the link cannot be pinged from each other.\nThe isis peer-ip-ignore command is valid on P2P interfaces, including NBMA interfaces and the interfaces whose network type is set to P2P using the isis circuit-type p2p command. The isis peer-ip-ignore command takes effect only when it is run on the two ends of a link.\nOn a broadcast interface, you need to run the isis circuit-type p2p command in the interface view before running the isis peer-ip-ignore command. The isis circuit-type p2p command takes effect only on broadcast interfaces.On a P2P interface or an NBMA interface, you can run the isis peer-ip-ignore command without having to run the isis circuit-type p2p command first."
}