{
    "PageTitle": "isis system-id auto-recover disable",
    "FuncDef": "The isis system-id auto-recover disable command disables the system from automatically resolving IS-IS system ID conflicts.\nThe undo isis system-id auto-recover disable command enables the system to automatically resolve IS-IS system ID conflicts.\nBy default, if the system detects an IS-IS system ID conflict, it automatically changes the local system ID to resolve the conflict.",
    "CLIs": [
        "isis system-id auto-recover disable",
        "undo isis system-id auto-recover disable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis system-id auto-recover disable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA system ID uniquely identifies an IS-IS device. If the same system ID is configured for more than one device on the network, a routing loop may occur. By default, if the system detects an IS-IS system ID conflict, it automatically changes the local system ID to resolve the conflict.\nTo disable the system from automatically resolving IS-IS system ID conflicts, run the isis system-id auto-recover disable command. After the command is run, IS-IS system ID conflicts need to be manually resolved.\nThe first two bytes of the system ID automatically changed by the system are Fs, and the last four bytes are randomly generated. For example, FFFF:1234:5678 is such a system ID.\nPrecautions\nIf an IS-IS system ID conflict occurs between two directly connected devices, a neighbor relationship fails to be established only between the two devices, without affecting the entire network. As a result, the conflict is not automatically resolved in this case.\nOn broadcast networks, the system ID generated automatically is not recorded in the configuration file. If the device is restarted, the system restores this system ID to the originally configured one and then generates another one, which may be different from the one last generated automatically. If the conflict persists after the system automatically generates three system IDs, the system no longer resolves this conflict.\nA system ID change may cause an IS-IS process reset. Therefore, exercise caution."
}