{
    "PageTitle": "isis ipv6 link-group",
    "FuncDef": "The isis ipv6 link-group command binds an IS-IS IPv6 interface to an existing link group.\nThe undo isis ipv6 link-group command unbinds an IS-IS IPv6 interface from a link group.\nBy default, an IS-IS IPv6 interface is not bound to any link group.",
    "CLIs": [
        "isis ipv6 [ topology <topology-name> ] link-group <group-name> [ level-1 | level-2 ]",
        "undo isis ipv6 [ topology <topology-name> ] link-group [ <group-name> ] [ level-1 | level-2 ]"
    ],
    "ParentView": [
        "Tunnel interface view",
        "FlexE interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "GE electrical interface view",
        "Loopback interface view",
        "VE interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "VBDIF interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Eth-Trunk interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "topology topology-name",
            "Info": "Specifies the name of an IS-IS topology.\nAfter the name of an IS-IS topology is specified, the routes that travel through the member links in the link group are calculated only for this topology.\nThe value is a string of 1 to 31 case-sensitive characters without spaces. The value must start with a letter (a to z or A to Z, case sensitive) and can contain numbers, hyphens (-), or underlines (_). When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "group-name",
            "Info": "Specifies the name of a link group.\nThe value is a string of 1 to 32 case-sensitive characters. When quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "level-1",
            "Info": "Binds a Level-1 IPv6 interface to the link group.\n-"
        },
        {
            "Parameters": "level-2",
            "Info": "Binds a Level-2 IPv6 interface to the link group.\nIf neither level-1 nor level-2 is specified in the command, both Level-1 and Level-2 IPv6 interfaces are bound to the link group.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis 1",
            "[*HUAWEI-isis-1] ipv6 enable",
            "[*HUAWEI-isis-1] quit",
            "[*HUAWEI] interface GigabitEthernet1/0/0",
            "[*HUAWEI-isis-GigabitEthernet1/0/0] isis ipv6 enable",
            "[*HUAWEI-isis-GigabitEthernet1/0/0] isis ipv6 link-group link-a"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter a link group is created in the IS-IS view, run the isis link-group or isis ipv6 link-group command to bind a specified interface to the link group for the link group to take effect.\nPrerequisites\nIPv6 IS-IS has been enabled using the isis ipv6 enable command, and a link group has been created using the link-group command."
}