{
    "PageTitle": "isis ppp-negotiation",
    "FuncDef": "The isis ppp-negotiation command specifies PPP negotiation for the establishment of neighbor relationships.\nThe undo isis ppp-negotiation command restores the default negotiation mode.\nBy default, three-way handshake is adopted. Three-way handshake is backward compatible. If the neighbor supports only two-way handshake, the neighbor relationship is established through two-way handshake.",
    "CLIs": [
        "isis ppp-negotiation { 2-way | 3-way [ only ] }",
        "undo isis ppp-negotiation"
    ],
    "ParentView": [
        "Tunnel interface view",
        "VBDIF interface view",
        "Cellular channel interface view",
        "IP-Trunk interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "GE electrical interface view",
        "Loopback interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "VE interface view",
        "50GE sub-interface view",
        "GE optical interface view",
        "25GE interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "2-way",
            "Info": "Uses two-way handshake for the establishment of neighbor relationships.\n-"
        },
        {
            "Parameters": "3-way",
            "Info": "Uses three-way handshake for the establishment of neighbor relationships.\n-"
        },
        {
            "Parameters": "only",
            "Info": "Indicates that only three-way handshake is supported for the establishment of neighbor relationships and that three-way handshake is not backward compatible.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis 1",
            "[*HUAWEI-isis-1] quit",
            "[*HUAWEI] interface LoopBack 1",
            "[*HUAWEI-LoopBack1] isis enable",
            "[*HUAWEI-LoopBack1] isis ppp-negotiation 2-way"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA reliable link layer protocol is required when IS-IS runs on a P2P link. In two-way handshake mode, once a device receives a Hello packet from its neighbor, the device declares the neighbor Up. In three-way handshake mode, a device declares its neighbor Up only when it knows that the neighbor also receives its packet. Compared with two-way handshake, three-way handshake can detect unidirectional link failures, improving the link reliability.\nThe isis ppp-negotiation command configures the link negotiation mode.\nPrerequisites\nAn IS-IS process has been created on a specified interface.\nConfiguration Impact\nRunning the isis ppp-negotiation command can change the link negotiation mode of an interface.\nPrecautions\nFor a broadcast interface, set the link type of the interface to P2P before running the isis ppp-negotiation command."
}