{
    "PageTitle": "link-group",
    "FuncDef": "The link-group command creates a link group and enters the link group view.\nThe undo link-group command deletes a link group and unbinds interfaces from the link group.\nBy default, no link group is created.",
    "CLIs": [
        "link-group <group-name>",
        "undo link-group <group-name>"
    ],
    "ParentView": [
        "IS-IS view"
    ],
    "ParaDef": [
        {
            "Parameters": "group-name",
            "Info": "Specifies the name of a link group.\nThe value is a string of 1 to 32 case-sensitive characters. When quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis",
            "[*HUAWEI-isis-1] link-group link-a"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn an IS-IS dual-homing access scenario, when the traffic rate exceeds the bandwidth of a link, additional links are needed to carry the traffic. If one of the links fails and the bandwidth of the other links is not sufficient enough to carry the traffic, traffic will get lost. To prevent this problem, run the link-group command to bundle multiple links into a link group and run the cost-offset command to configure a link cost offset to be added to the link cost of the member links when the number of available member links falls below a specified number. After the link cost is adjusted, the traffic forwarding path is changed, preventing traffic loss.\nPrerequisites\nAn IS-IS process has been enabled using the isis command.\nPrecautions\nRunning the undo link-group command will delete an existing link group and unbind interfaces from the link group. Therefore, exercise caution when running this command.\nPerform the following operations for the link group feature to take effect:\nRun the link-group command in the IS-IS view to create a link group.Run the cost-offset command in the link group view to configure a link cost offset to be added to the link cost of the member links in the link group when the number of available member links falls below a specified number.Run the isis link-group or isis ipv6 link-group command in the interface view to bind the interface to the link group."
}