{
    "PageTitle": "local-mt filter-policy (IS-IS view)",
    "FuncDef": "The local-mt filter-policy command configures a policy for IS-IS local Multicast Topology (MT).\nThe undo local-mt filter-policy command deletes the policy of IS-IS local MT.\nBy default, no policy is configured for local MT.",
    "CLIs": [
        "local-mt filter-policy { acl { <acl-number> | <acl-name> } | ip-prefix <ip-prefix-name> }",
        "undo local-mt filter-policy"
    ],
    "ParentView": [
        "IS-IS view"
    ],
    "ParaDef": [
        {
            "Parameters": "acl",
            "Info": "Specifies an ACL.\n-"
        },
        {
            "Parameters": "acl-number",
            "Info": "Specifies the number of a basic ACL.\nThe value is an integer ranging from 2000 to 2999."
        },
        {
            "Parameters": "acl-name",
            "Info": "Specifies the name of a named basic ACL.\nThe value is a string of 1 to 64 case-sensitive characters without spaces. The value must start with a letter (a to z or A to Z, case sensitive)."
        },
        {
            "Parameters": "ip-prefix ip-prefix-name",
            "Info": "Indicates the name of the IP prefix list.\nThe name is a string of 1 to 169 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl 2000",
            "[*HUAWEI-acl4-basic-2000] quit",
            "[*HUAWEI] isis 1",
            "[*HUAWEI-isis-1] local-mt filter-policy acl 2000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo control the number of entries in the MIGP routing table, speed up the MIGP routing table lookup, and reduce memory resource consumption, configure a filtering policy to enable a device to add only the matching routes to the multicast source address to the MIGP routing table.\nPrerequisites\nIS-IS local MT has been enabled using the local-mt enable command."
}