{
    "PageTitle": "loop-free-alternate (IS-IS FRR view)",
    "FuncDef": "The loop-free-alternate command enables IS-IS Auto FRR to calculate loop-free backup routes based on the LFA algorithm.\nThe undo loop-free-alternate command disables IS-IS Auto FRR.\nBy default, IS-IS Auto FRR is disabled.",
    "CLIs": [
        "loop-free-alternate [ level-1 | level-2 | level-1-2 ]",
        "undo loop-free-alternate [ level-1 | level-2 | level-1-2 ]"
    ],
    "ParentView": [
        "IS-IS FRR view"
    ],
    "ParaDef": [
        {
            "Parameters": "level-1",
            "Info": "Indicates that Level-1 Auto FRR is enabled to generate loop-free backup routes.\n-"
        },
        {
            "Parameters": "level-2",
            "Info": "Indicates that Level-2 Auto FRR is enabled to generate loop-free backup routes.\n-"
        },
        {
            "Parameters": "level-1-2",
            "Info": "Indicates that Level-1 Auto FRR and Level 2 Auto FRR are enabled to generate loop-free backup routes.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis",
            "[*HUAWEI-isis-1] frr",
            "[*HUAWEI-isis-1-frr] loop-free-alternate level-2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo provide real-time transmission for network services, traffic must be fast switched if IS-IS faults occur. Configuring IS-IS Auto FRR can fast switch traffic to the backup link before route convergence on the control plane. This ensures uninterrupted traffic transmission. The backup link is calculated based on the LFA algorithm. With the neighbor that can provide the backup link as the root, the shortest path to the destination node is calculated based on the SPF algorithm. Then, the loop-free backup link with the smallest cost is calculated according to the inequality defined in standard protocols.\nPrerequisites\nAn IS-IS process has been created, and the IS-IS FRR view or IS-IS IPv6 FRR view has been displayed.\nConfiguration Impact\nAfter LFA is enabled, backup outbound interfaces and next hops are calculated according to the current topology.\nPrecautions\nIS-IS can generate loop-free backup routes only when the IS-IS Auto FRR traffic protection inequality is met. For details of IS-IS Auto FRR, see the Feature Description - IP Routing.\nIf the IS-IS level is not specified, IS-IS Auto FRR is enabled on Level-1 and Level-2 to generate backup routes.\nThe loop-free-alternate command supports IPv4 and IPv6 based IS-IS Auto FRR.\nThis command takes effect whether or not the same route is advertised by multiple nodes."
}