{
    "PageTitle": "lsdb limit",
    "FuncDef": "The lsdb limit command configures alarm and clear alarm thresholds for the number of LSPs in the LSDB. When the proportion of the number of LSPs to the maximum number of LSPs in the LSDB exceeds the alarm threshold, an alarm is generated; when the proportion of the number of LSPs to the maximum number of LSPs in the LSDB falls below the clear alarm threshold, a clear alarm is generated.\nThe undo lsdb limit command deletes the configured thresholds.\nBy default, no such thresholds are configured.",
    "CLIs": [
        "lsdb limit <limit-number> [ threshold-alarm upper-limit <upper-limit-value> lower-limit <lower-limit-value> ]",
        "undo lsdb limit"
    ],
    "ParentView": [
        "IS-IS view"
    ],
    "ParaDef": [
        {
            "Parameters": "limit-number",
            "Info": "Specifies the maximum number of LSPs in the LSDB.\nThe value is an integer ranging from 1 to 100000."
        },
        {
            "Parameters": "threshold-alarm",
            "Info": "Indicates the threshold of the number of LSPs in the LSDB.\n-"
        },
        {
            "Parameters": "upper-limit upper-limit-value",
            "Info": "Specifies the alarm threshold that triggers an alarm. If the proportion of the number of LSPs to the maximum number of LSPs in the LSDB exceeds upper-limit-value, an alarm is generated.\nThe value is an integer ranging from 1 to 100. The default value is 80."
        },
        {
            "Parameters": "lower-limit lower-limit-value",
            "Info": "Specifies the clear alarm threshold that triggers a clear alarm. If the proportion of the number of LSPs to the maximum number of LSPs in the LSDB falls below lower-limit-value, a clear alarm is generated.\nThe value is an integer ranging from 1 to 100. The default value is 70."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis",
            "[*HUAWEI-isis-1] lsdb limit 1000 threshold-alarm upper-limit 85 lower-limit 75"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAn IS-IS-capable router may advertise a large number of LSPs due to an excessive number of external routes received because of incorrect configurations or attack packets. In this situation, you can run the lsdb limit command to configure alarm and clear alarm thresholds for the number of LSPs in the LSDB. When the proportion of the number of LSPs to the maximum number of LSPs in the LSDB exceeds the alarm threshold, an alarm is generated, which facilitates troubleshooting of network administrators.\nPrerequisites\nAn IS-IS process has been created and the IS-IS view has been displayed using the isis command.\nPrecautions\nupper-limit-value must be greater than or equal to lower-limit-value."
}