{
    "PageTitle": "lsp-fragments-extend",
    "FuncDef": "The lsp-fragments-extend command enables LSP fragment extension on an IS-IS device in a specified mode and at a specified level. To enable the device to generate extended LSP fragments, at least one virtual system ID must be configured.\nThe undo lsp-fragments-extend command disables the function.\nBy default, the LSP fragment extension on an IS-IS device is disabled.",
    "CLIs": [
        "lsp-fragments-extend [ [ level-1 | level-2 | level-1-2 ] | [ mode-1 | mode-2 ] ] *",
        "undo lsp-fragments-extend [ [ level-1 | level-2 | level-1-2 ] | [ mode-1 | mode-2 ] ] *"
    ],
    "ParentView": [
        "IS-IS view"
    ],
    "ParaDef": [
        {
            "Parameters": "level-1",
            "Info": "Enables LSP fragment extension at Level-1.\n-"
        },
        {
            "Parameters": "level-2",
            "Info": "Enables LSP fragment extension at Level-2.\n-"
        },
        {
            "Parameters": "level-1-2",
            "Info": "Enables LSP fragment extension at Level-1-2.\n-"
        },
        {
            "Parameters": "mode-1",
            "Info": "Enables the device to be compatible with a device that does not support LSP fragment extension.\n-"
        },
        {
            "Parameters": "mode-2",
            "Info": "Indicates a fragment extension mode that requires LSP fragment extension on all devices.\nBy default, mode-1 and level-1-2 are used.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis",
            "[*HUAWEI-isis-1] lsp-fragments-extend mode-1 level-2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe lsp-fragments-extend command enables LSP fragment extension on an IS-IS device in a specified mode and at a specified level. One LSP fragment occupies only one byte and therefore a maximum of 256 fragments are supported. If there are a great number of LSPs and the number of fragments exceeds 256, some information is lost. LSP fragment extension is introduced to address such a problem. You can run the virtual-system command to configure one or more virtual systems to support more than 256 LSP fragments.\nPrerequisites\nVirtual systems have been configured using the virtual-system command.\nConfiguration Impact\nAfter LSP fragment extension is configured, if the number of LSP fragments exceeds 256, the excessive LSP fragments are forwarded by virtual systems."
}