{
    "PageTitle": "lsp-length",
    "FuncDef": "The lsp-length command configures a length for the LSPs that are generated and received by the current IS-IS system.\nThe undo lsp-length command restores the default setting.\nThis command varies in transport and router modes. For detailed differences, see Differences Between Commands in Transport and Router Modes. This topic describes the command configuration in router mode.\nBy default, the size of the LSP generated by the IS-IS and the size of the received LSP are 1497 bytes.",
    "CLIs": [
        "lsp-length { originate | receive } <max-size>",
        "undo lsp-length { originate | receive }"
    ],
    "ParentView": [
        "IS-IS view"
    ],
    "ParaDef": [
        {
            "Parameters": "originate",
            "Info": "Configures a length for locally generated LSPs.\n-"
        },
        {
            "Parameters": "receive",
            "Info": "Configures a length for received LSPs.\n-"
        },
        {
            "Parameters": "max-size",
            "Info": "Specifies the maximum length of an LSP, in bytes.\nThe value is an integer ranging from 512 to 16384, in bytes. The default value is 1497 bytes."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis",
            "[*HUAWEI-isis-1] lsp-length originate 1024"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nmax-size of an LSP to be generated must be less than or equal to max-size of an LSP to be received. Otherwise, the configuration fails.\nThe value of max-size in the lsp-length originate command must meet the following conditions. Otherwise, the interface MTU state is considered Down.\nThe MTU of an Ethernet interface must be greater than or equal to the sum of max-size and 3.The MTU of a P2P interface must be greater than or equal to the value of max-size.\nFor normal packet forwarding, the value of max-size set using the lsp-length receive command must also meet the preceding two conditions.\n\nPrecautions\nThe length of LSPs must be less than the MTU on an IS-IS interface; otherwise, the interface fails to send the LSPs."
}