{
    "PageTitle": "maximum load-balancing (IS-IS topology view)",
    "FuncDef": "The maximum load-balancing command sets the maximum number of equal-cost routes for load balancing.\nThe undo maximum load-balancing command restores the default value.\nBy default, load balancing is supported and the maximum number of equal-cost routes for load balancing is 64.",
    "CLIs": [
        "maximum load-balancing <number>",
        "undo maximum load-balancing"
    ],
    "ParentView": [
        "IS-IS topology view"
    ],
    "ParaDef": [
        {
            "Parameters": "number",
            "Info": "Specifies the number of equal-cost routes in load balancing mode.\nThe value is an integer that ranges from 1 to 64."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip topology multicast",
            "[*HUAWEI] isis 1",
            "[*HUAWEI-isis-1] cost-style wide",
            "[*HUAWEI-isis-1] topology multicast topology-id multicast",
            "[*HUAWEI-isis-1-topology-multicast] maximum load-balancing 2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the destinations and costs of the multiple routes discovered by one routing protocol are the same, load balancing can be implemented among them, improving link usage on a network and reducing the network congestion caused by some overloaded links. However, routes are randomly selected for forwarding traffic, which complicates service traffic management. To address this problem, run the maximum load-balancing command to set the maximum number of equal-cost routes for load balancing based on network requirements.\nPrerequisites\nAn IS-IS process has been created using the isis command.\nPrecautions\nWhen the number of equal-cost routes on the network is greater than that specified in the maximum load-balancing command, valid routes are randomly selected for load balancing.\nIf the command is run in the IS-IS view, it takes effect only in the base topology. If the command is run in the IS-IS topology view, it takes effect only in the current topology."
}