{
    "PageTitle": "metric-delay advertisement enable (IS-IS view)",
    "FuncDef": "The metric-delay advertisement enable command enables the advertisement of IPv4 delay information.\nThe undo metric-delay advertisement enable command restores the default configuration.\nBy default, the advertisement of IPv4 delay information is disabled.",
    "CLIs": [
        "metric-delay advertisement enable [ level-1 | level-2 | level-1-2 ]",
        "undo metric-delay advertisement enable [ level-1 | level-2 | level-1-2 ]"
    ],
    "ParentView": [
        "IS-IS view"
    ],
    "ParaDef": [
        {
            "Parameters": "level-1",
            "Info": "Enables the advertisement of IPv4 delay information on Level 1.\n-"
        },
        {
            "Parameters": "level-2",
            "Info": "Enables the advertisement of IPv4 delay information on Level 2.\n-"
        },
        {
            "Parameters": "level-1-2",
            "Info": "Enables the advertisement of IPv4 delay information on Level 1-2.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis 1",
            "[*HUAWEI-isis-1] cost-style wide",
            "[*HUAWEI-isis-1] traffic-eng level-2",
            "[*HUAWEI-isis-1] metric-delay advertisement enable level-2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTraditional path computation algorithms compute the optimal path to a destination address based on costs. However, such a computed path may not have the minimum delay. For services that have stringent requirements on delay, path computation can be performed based on delay instead of costs to ensure that service traffic is transmitted along the path with the minimum delay. To meet these requirements, run the metric-delay advertisement enable command to enable the advertisement of IPv4 delay information for an IS-IS process. After this function is enabled, IS-IS collects and floods information about the intra-area IPv4 link delay, and BGP-LS reports the information to the controller. This allows the controller to use the delay information to compute the optimal path on the P2P network.\nPrerequisites\nThe cost type for the IS-IS routes that a device can send and accept has been set to wide, wide-compatible, or compatible using the cost-style command. In addition, TE has been enabled for an IS-IS process using the traffic-eng command.\nPrecautions\nFor an IS-IS interface bound to a TWAMP Light session, delay information can be advertised to this interface only when the TWAMP Light session detects valid statistics. Upon receipt, IS-IS advertises and floods the delay information."
}