{
    "PageTitle": "network-entity",
    "FuncDef": "The network-entity command configures a Network Entity Title (NET) for an IS-IS process.\nThe undo network-entity command deletes the NET configured for an IS-IS process.\nBy default, no NET is configured.",
    "CLIs": [
        "network-entity <net-addr>",
        "undo network-entity <net-addr>"
    ],
    "ParentView": [
        "IS-IS view"
    ],
    "ParaDef": [
        {
            "Parameters": "net-addr",
            "Info": "Specifies a NET.\nThe value is in the X...X.XXXX. XXXX.XXXX.00 format, in which the first \"X...X\" is the area address, the twelve Xs in the middle is the System ID of the Router, and the 00 in the end is NSAP Selector (SEL)."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis 1",
            "[*HUAWEI-isis-1] network-entity 10.0001.1010.1020.1030.00"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nNET is the special form of the network service access point (NSAP). IS-IS starts only when the NET is configured for the IS-IS process.\nNET consists of the following parts:\nArea ID, which is variable (1 to 13 bytes). The area IDs of the routers in the same area are identical.System ID (6 bytes) of this router. The system ID must be unique in the whole area and backbone area.Last byte (SEL), with value 00.\nIn general, an IS-IS process is configured with only one NET. When you want to redefine an area, to combine it with other areas or divide it into sub-areas for example, you can configure the router with multiple NETs to ensure the correctness of routes.\n\nPrerequisites\nAn IS-IS process has been created and the IS-IS view has been displayed using the isis command.\nPrecautions\nAn area ID is used to uniquely identify an area in the same IS-IS domain. All devices in the same Level-1 area must share the same area ID, and devices in the same Level-2 area can have different area IDs.\nThe system ID must be unique in the whole area and backbone area.\nWhen configuring multiple NETs, ensure that they share the same system ID.\nIf the undo network-entity command is run, configurations related to the NET are deleted, which may cause some IS-IS functions to fail to take effect. Therefore, exercise caution when using the command.\nA maximum of three Network Entity Titles (NETs) can be configured for an IS-IS process.\nIf different devices in the same IS-IS domain are configured with the same NET, a conflict may occur. Although the system automatically resolves the conflict, problems may occur, for example, service functions may fail. Therefore, it is not recommended that devices in the same IS-IS domain be configured with different NETs."
}