{
    "PageTitle": "whitelist session-car isis",
    "FuncDef": "The whitelist session-car isis command sets the parameters of whitelist session-CAR for IS-IS.\nThe undo whitelist session-car isis command restores the parameters of whitelist session-CAR for IS-IS to the default values.\nBy default, whitelist session-CAR for IS-IS is enabled.",
    "CLIs": [
        "whitelist session-car isis { cir <cir-value> | cbs <cbs-value> | pir <pir-value> | pbs <pbs-value> } *",
        "undo whitelist session-car isis [ { cir <cir-value> | cbs <cbs-value> | pir <pir-value> | pbs <pbs-value> } * ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "cir cir-value",
            "Info": "Specifies a committed information rate (CIR), that is, the average rate at which packets can be transmitted or forwarded.\nThe value ranges from 0 to 1000000, in kbit/s. The default value is 8."
        },
        {
            "Parameters": "cbs cbs-value",
            "Info": "Specifies a committed burst size (CBS), which limits the maximum number of bytes available for a burst of packets in a short interval to remain within CIR.\nThe value ranges from 0 to 1000000, in bytes. The default value is 100000."
        },
        {
            "Parameters": "pir pir-value",
            "Info": "Specifies a peak information rate (PIR), that is, the highest rate at which packets can be transmitted or forwarded.\nThe value ranges from 0 to 1000000, in kbit/s. The default value is 20000."
        },
        {
            "Parameters": "pbs pbs-value",
            "Info": "Specifies a peak burst size (PBS), which limits the maximum number of bytes available for a burst of packets in a short interval to remain within PIR.\nThe value ranges from 0 to 10000000, in bytes. The default value is 9000000."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] whitelist session-car isis cir 100 cbs 500000 pir 2000 pbs 900000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo adjust the packet channel bandwidth for IS-IS session-CAR on a device, run the whitelist session-car isis command. This configuration ensures that the IS-IS packets can be properly sent if the device receives a large number of such packets.\nConfiguration Impact\nIf a session-CAR parameter in an IS-IS whitelist is set to an excessively large or small value, the involved IS-IS neighbor relationships may be disconnected or flap.\nPrecautions\nYou are advised not to change the values of session-CAR parameters in IS-IS whitelists, except under abnormal circumstances. Use the default values for these parameters instead.The PIR must be greater than or equal to the CIR, and the PBS must be greater than or equal to the CBS."
}