{
    "PageTitle": "topology(IS-IS view)",
    "FuncDef": "The topology command associates an IPv4 topology instance with an IS-IS instance and displays the IPv4 IS-IS topology instance view.\nThe undo topology command dissociates an IPv4 topology instance from an IS-IS instance.\nBy default, no IS-IS instance is associated with any IPv4 topology instance.",
    "CLIs": [
        "topology <topology-name> [ topology-id { <mt-id> | multicast } ]",
        "undo topology <topology-name>"
    ],
    "ParentView": [
        "IS-IS view"
    ],
    "ParaDef": [
        {
            "Parameters": "topology-name",
            "Info": "Specifies the name of a topology instance.\nThe value is a string of 1 to 31 case-sensitive characters without spaces. The value must start with a letter (a to z or A to Z, case sensitive) and can contain numbers, hyphens (-), or underlines (_). When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "topology-id mt-id",
            "Info": "Specifies the ID of a topology instance.\nThe value is an integer ranging from 6 to 4095. The IDs from 0 to 5 are reserved for specific topologies."
        },
        {
            "Parameters": "multicast",
            "Info": "Associates an IS-IS instance with an IPv4 multicast topology.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip topology red",
            "[*HUAWEI] isis 1",
            "[*HUAWEI-isis-1] cost-style wide",
            "[*HUAWEI-isis-1] topology red topology-id 10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe IS-IS multi-topology enables the operation of multiple independent logical topologies in an IS-IS AS. The topology command can be used to associate an IPv4 topology instance with an IS-IS instance.\nWhen using topology command to associate an IPv4 topology instance with an IS-IS instance, you need to specify topology-name and mt-id, and ensure that the specified topology name or topology ID is unique.\nTo enter the view of an existing topology, specify only topology-name.\nPrerequisites\nAn IPv4 topology instance has been created using the ip topology command, and an IS-IS instance has been created using the isis command.\nFollow-up Procedure\nRun the isis topology command in the specified interface view to associate the interface with the IS-IS topology instance.\nPrecautions\nThe topology IDs from 0 to 5 are reserved for specific topologies and cannot be used by other topologies. These topology IDs are described as follows:\n0: is reserved for an IPv4 base topology. The name of the IPv4 base topology is base and cannot be used by other topologies.1: is reserved for IPv4 inband management.2: is reserved for an IPv6 base topology that is enabled using the ipv6 topology command.3. is reserved for the IPv4 multicast topology named multicast only. The value of mt-id must be multicast. The topology multicast topology-id multicast command is used to enable the IPv4 multicast topology.4. is reserved for the IPv6 multicast topology named multicast only. The value of mt-id must be multicast. The ipv6 topology multicast topology-id multicast command is used to enable the IPv6 multicast topology.5: is reserved for IPv6 inband management.\nBefore you enable multi-topology for an IS-IS process, use the cost-style command in IS-IS view to set the cost type of IS-IS packets to wide, compatible, or wide-compatible."
}