{
    "PageTitle": "ipv6 topology (IS-IS view)",
    "FuncDef": "The ipv6 topology command associates an IPv6 topology instance with an IS-IS instance and displays the IPv6 IS-IS topology instance view.\nThe undo ipv6 topology command dissociates an IPv6 topology instance from an IS-IS instance.\nBy default, no IS-IS instance is associated with any IPv6 topology instance.",
    "CLIs": [
        "ipv6 topology <topology-name> [ topology-id { topology-id | multicast } ]",
        "undo ipv6 topology <topology-name>"
    ],
    "ParentView": [
        "IS-IS view"
    ],
    "ParaDef": [
        {
            "Parameters": "topology-name",
            "Info": "Specifies the name of a topology instance.\nThe value is a string of 1 to 31 case-sensitive characters without spaces. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "topology-id topology-id",
            "Info": "Specifies the ID of a topology instance.\nThe value is an integer ranging from 6 to 4095. The IDs from 0 to 5 are reserved for specific topologies."
        },
        {
            "Parameters": "multicast",
            "Info": "Associates an IS-IS instance with an IPv6 multicast topology.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] isis 1",
            "[*HUAWEI-isis-1] ipv6 topology blue topology-id 11"
        ]
    ],
    "ExtraInfo": "Prerequisites\nAn IPv6 topology instance and an IS-IS instance have been created.\nFollow-up Procedure\nRun the isis ipv6 topology command in the view of a specified interface to associate the interface with an IS-IS topology instance.\nPrecautions\nThe topology IDs from 0 to 5 are reserved for specific topologies and cannot be used by other topologies. These topology IDs are described as follows:\n0: is reserved for an IPv4 base topology. The name of the IPv4 base topology is base and cannot be used by other topologies.1: is reserved for IPv4 inband management.2: is reserved for an IPv6 base topology that is enabled using the ipv6 enable command.3. is reserved for the IPv4 multicast topology named multicast only. The topology-id value must be multicast. The topology multicast topology-id multicast command is used to enable the IPv4 multicast topology.4. is reserved for the IPv6 multicast topology named multicast only. The topology-id value must be multicast. The ipv6 topology multicast topology-id multicast command is used to enable the IPv6 multicast topology.5: is reserved for IPv6 inband management."
}