{
    "PageTitle": "spatial-multicast slot",
    "FuncDef": "The spatial-multicast slot command enables spatial multicast for specified boards.\nThe undo spatial-multicast slot command disables spatial multicast for specified boards.\nBy default, spatial multicast is not enabled for boards.",
    "CLIs": [
        "spatial-multicast slot { <slot-id1> [ to <slot-id2> ] } &<1-10>",
        "undo spatial-multicast slot { <slot-id1> [ to <slot-id2> ] } &<1-10>"
    ],
    "ParentView": [
        "Spatial multicast view"
    ],
    "ParaDef": [
        {
            "Parameters": "slot-id1",
            "Info": "Specifies an end slot ID.\nThe value is a string of 1 to 15 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "to slot-id2",
            "Info": "Specifies an start slot ID.\nThe value is a string of 1 to 15 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] spatial-multicast",
            "[*HUAWEI-spatial-multicast] spatial-multicast slot 1 to 2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nConventionally, an upstream interface board replicates service flows for downstream outbound interfaces.\nIf the downstream outbound interfaces reside on different interface boards, the upstream interface board needs to perform inter-board traffic replication and forwarding. The replication performance is adversely affected if the bandwidth resources are insufficient on the upstream interface board. To resolve the preceding issue, enable spatial multicast globally. Then, run the spatial-multicast slot command to enable spatial multicast for specified boards. The SFUs, instead of the upstream interface board, will then perform inter-board traffic replication.\nSpatial multicast may cause packet loss during traffic forwarding.\nPrecautions\nEnsure that the boards specified in the command have been registered, specified slot IDs are not duplicate, and the start slot ID is smaller than the end slot ID.\nThis command is supported only on the admin VS."
}