{
    "PageTitle": "spatial-multicast bandwidth (l3)",
    "FuncDef": "The spatial-multicast bandwidth command sets the bandwidth based on which load balancing is performed for Layer 3 flows of a specified or all VPN instances in a spatial multicast scenario.\nThe undo spatial-multicast command restores the default setting.\nThe default value is 3000 kbit/s for each Layer 3 flow.",
    "CLIs": [
        "spatial-multicast [ vpn-instance <vpn-name> ] <group-ip> mask <mask-value> [ <source-ip> ] bandwidth <bandwidth-value>",
        "undo spatial-multicast [ vpn-instance <vpn-name> ] <group-ip> mask <mask-value> [ <source-ip> ]"
    ],
    "ParentView": [
        "Spatial multicast view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance vpn-name",
            "Info": "Specifies a VPN instance.\nThe value is a string of 1 to 31 characters.The specified VPN instance must have been created."
        },
        {
            "Parameters": "group-ip",
            "Info": "Specifies a multicast group address.\nThe value ranges from 224.0.0.0 to 239.255.255.255, in dotted decimal notation."
        },
        {
            "Parameters": "mask mask-value",
            "Info": "Specifies the mask length of a multicast group address.\nThe value is an integer ranging from 4 to 32."
        },
        {
            "Parameters": "source-ip",
            "Info": "Specifies a multicast source address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "bandwidth-value",
            "Info": "Specifies the bandwidth based on which load balancing is performed for Layer 3 flows.\nThe value is an integer ranging from 1 to 30000000, in kbit/s."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] spatial-multicast",
            "[*HUAWEI-spatial-multicast] spatial-multicast vpn-instance vpna 225.0.0.1 mask 32 1.1.1.1 bandwidth 2500"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn a spatial multicast scenario, Layer 3 flows are balanced among SFUs. To set the bandwidth based on which load balancing is performed for Layer 3 flows, run the spatial-multicast vpn-instance bandwidth command.\nIf the group-address or source-address parameter is specified, the command configuration takes effect only for the Layer 3 multicast flow with the specified address.\nPrecautions\nThe actual forwarding capability depends on the board forwarding capability. Therefore, setting bandwidth to a value same as or approximate to the actual traffic volume is recommended.A maximum of 1000 spatial-multicast vpn-instance bandwidth command instances are supported.This command is supported only on the admin VS."
}