{
    "PageTitle": "authentication-mode (VTY-type user interface view)",
    "FuncDef": "The authentication-mode command sets the authentication mode for the login to the user interface view.\nThe undo authentication-mode command restores the default authentication mode.\nBy default, no authentication mode is set.",
    "CLIs": [
        "authentication-mode aaa",
        "authentication-mode password",
        "undo authentication-mode"
    ],
    "ParentView": [
        "VTY-type user interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "password",
            "Info": "Specifies the authentication mode for the login to the user interface view.\npassword: Password authentication."
        },
        {
            "Parameters": "aaa",
            "Info": "Specifies the authentication mode for the login to the user interface view.\naaa: AAA authentication"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] user-interface vty 0 4",
            "[~HUAWEI-ui-vty0-4] authentication-mode aaa"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] user-interface console 0",
            "[~HUAWEI-ui-console0] authentication-mode aaa"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAuthentication modes of user interfaces must be set for logging in to the device.When AAA authentication is applied to a local user, the commands that the local user can use after logging in to the device depends on the level of the local user specified in the AAA configuration.If password authentication is configured, the level of the command that a user can access is determined by the priority of the user interface after the user logs in to the system.\n\nPrecautions\nWhen password is specified in the authentication-mode command, you can run the set authentication password (user interface view) command to modify the authentication password.When aaa is specified in the authentication-mode command, the passwords set for the user interface are automatically cleared.When the undo authentication-mode is used to delete an authentication mode of a user interface, you will be prompted to confirm whether to clear the passwords set for the user interface.The password authentication mode is not secure, and it is strongly recommended to use AAA authentication mode.If the AAA authentication mode is used, run the local-user password command to configure the local user account and login password. Otherwise, user login fails.When you log in to the device through SSH, the authentication mode must be set to AAA."
}