{
    "PageTitle": "protocol inbound",
    "FuncDef": "The protocol inbound command specifies the protocols that the current user interface supports.\nThe undo protocol inbound command restores the default protocols supported by the current user interface.\nBy default, the system supports SSH protocol.",
    "CLIs": [
        "protocol inbound { all | ssh | telnet }",
        "undo protocol inbound"
    ],
    "ParentView": [
        "VTY-type user interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "all",
            "Info": "Specifies that the system supports all protocols: SSH, Telnet, and all.\n-"
        },
        {
            "Parameters": "ssh",
            "Info": "Specifies that the system supports only SSH protocol.\n-"
        },
        {
            "Parameters": "telnet",
            "Info": "Specifies that the system supports only Telnet protocol.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] user-interface vty 0 4",
            "[~HUAWEI-ui-vty0-4] protocol inbound ssh"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo manage users that log in to the user interface, specify the VTY user interface for users login and run the protocol inbound command to configure protocols supported by the VTY user interface.\nPrerequisites\nIf ssh is configured in the protocol inbound command, the authentication-mode (user interface view) command must be used to set the authentication mode to aaa. If the authentication mode is set to password, the protocol inbound ssh command cannot be executed.\nConfiguration Impact\nAfter executing the protocol inbound command, the specified VTY user interface supports users login using Telnet and SSH. The command configuration takes effect next time the user log in to the device.\nPrecautions\nWhen SSH is configured using this command, if the SSH server has been enabled and the RSA/DSA/ECC key is not configured then the users can log in to the SSH server using temporary key.\nYou are advised to use a more secure ECC authentication algorithm for higher security."
}