{
    "PageTitle": "screen-length",
    "FuncDef": "The screen-length command sets the number of lines to be displayed on a terminal screen.\nThe undo screen-length command restores the default number of lines to be displayed on a terminal screen.\nBy default, the number of lines to be displayed on a terminal screen is 24.",
    "CLIs": [
        "screen-length <screen-length>",
        "undo screen-length"
    ],
    "ParentView": [
        "VTY-type user interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "screen-length",
            "Info": "Specifies the number of lines to be displayed on a terminal screen.\nThe value is an integer ranging from 0 to 512. Value 0 indicates that the split-screen function is disabled."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] user-interface vty 0 4",
            "[~HUAWEI-ui-vty0-4] screen-length 30"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] user-interface consle 0",
            "[~HUAWEI-ui-console0] screen-length 30"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn a device that supports scrolling screen display, you can press space to display the next screen when the display is paused. You can run the screen-length command to set the number of lines on the next screen.\nPrecautions\nWhen a user logs in, the system deploys an idle user interface with the smallest number and specified type to the user based on the login mode. To ensure the screen-length takes effect only on the users that have logged in, you can run the display users command to check the login information about the users on all user interfaces. Then, you can run the screen-length command on the specified user interface to set the number of lines on the next screen.The actual number of lines displayed on the terminal screen is determined by the specification of the terminal. For example, the value set by screen-length is 30, but the specification of the terminal screen is 20. When users press space, the message sent from the device to the terminal screen is 1-30. However, if the screen displays the information from line 11 to line 30, the preceding 10 lines can be viewed by pressing UP or DOWN."
}