{
    "PageTitle": "screen-length temporary",
    "FuncDef": "The screen-length temporary command sets the number of lines in each screen of the terminal.\nThe undo screen-length temporary command restores the number of rows in each screen of the terminal to the default value.\nBy default, the number of rows in one screen is 24.",
    "CLIs": [
        "screen-length <screen-length> temporary",
        "undo screen-length temporary"
    ],
    "ParentView": [
        "VTY-type user interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "screen-length",
            "Info": "Specifies the number of lines displayed on the split screen.\nIt is an integer data type. The value ranges from 0 to 512. Zero indicates the split screen is disabled."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] user-interface vty 0",
            "[~HUAWEI-ui-vty0] screen-length 30 temporary"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] user-interface console 0",
            "[~HUAWEI-ui-console0] screen-length 30 temporary"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] user-interface aux 0",
            "[~HUAWEI-ui-aux0] screen-length 30 temporary"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe screen-length temporary command can be used to set the maximum line number on the current terminal. The configuration is temporary and is not effective after disconnection or system reboot.\nPrecautions\nWhen a user logs in, the system automatically allocates an idle user interface with the smallest number and a specified type to the user based on the login mode. To ensure that the screen-length command takes effect only on the current login user, run the display users command to check the login information about the users in all user interfaces. Then, run the screen-length command in the specified user interface view to configure the number of lines to be displayed on the next screen.\ntemporary in this command, after the user logs out, the command configuration will not take effect when the user logs in through the same user interface next time.temporary in this command, after the user logs out, the command configuration will still take effect when the user logs in through the same user interface next time.temporary is specified has a higher priority than the command configuration in which temporary is not specified. Therefore, if the command is run with the temporary parameter and then run again without the temporary parameter, the terminal displays only the configuration that contains the temporary parameter.\nThe actual number of lines displayed on the terminal screen is determined by the specification of the terminal. For example, the number configured using screen-length is 30, but the terminal screen supports only a maximum of 20 lines. When you press the space key as prompted, the device sends a message to instruct the terminal to display 30 lines on each screen. However, the terminal displays only lines 11 to 30 because of specification restrictions, and you need to press the up (UP) or down (DOWN) arrow key to view the preceding 10 lines."
}