{
    "PageTitle": "user privilege level (VTY-type user interface view)",
    "FuncDef": "The user privilege level command configures the command level for the user interface.\nThe undo user privilege level command restores the default command level.\nBy default, users logging in from a VTY user interface can use commands at Level 0. The default command level for the console port on the user interface is 15 when the command-privilege level rearrange command is run, whereas is 3 when the command-privilege level rearrange command is not run.The default command level of an AUX user interface is 0.",
    "CLIs": [
        "user privilege level <level>",
        "undo user privilege level"
    ],
    "ParentView": [
        "VTY-type user interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "level",
            "Info": "Specifies a command level.\nIf the command-privilege level rearrange configuration exists, the value of level ranges from 0 to 15.\nIf the command-privilege level rearrange configuration does not exist, the value of level ranges from 0 to 3.\nIf the command-privilege level rearrange command configuration is changed, the value of level changes based on the level mapping.\nIf the command-privilege level rearrange command configuration is added, the levels of level-0 and level-1 commands remain unchanged, the level of level-2 commands is upgraded to 10, and that of level-3 commands is upgraded to 15.If the command-privilege level rearrange command configuration is deleted, the level of level-0 commands remains unchanged, the levels of level-1 to level-9 commands are downgraded to 1, the levels of level-10 to level-14 commands are downgraded to 2, and the level of level-15 commands is downgraded to 3."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] user-interface vty 0",
            "[*HUAWEI-ui-vty0] user privilege level 2"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] user-interface console 0",
            "[~HUAWEI-ui-console0] user privilege level 2"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] user-interface aux 0",
            "[~HUAWEI-ui-aux0] user privilege level 2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the command level configured on the user interface is inconsistent with the actual level, the actual level is considered as the valid level. For example, the command level corresponding to user 001 is 3 but the command level configured on VTY 0 for the user 001 is 2. When the user logs in to the system through VTY 0, it can use the commands of level 3 or below level 3.\nPrecautions\nIf precise management of user rights is required, run the command-privilege level command to enhance the command level."
}