{
    "PageTitle": "user-interface (System view)",
    "FuncDef": "The user-interface command displays only one user interface view.\nBy default, there is no user interface view displayed.",
    "CLIs": [
        "user-interface { <ui-type> | aux <first-ui-number> } [ <last-ui-number> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "ui-type",
            "Info": "Specifies the type of user interface.\nThe value of ui-type can be console, vty, maximum-vty, or aux."
        },
        {
            "Parameters": "aux",
            "Info": "Specifies the number AUX user interface.\n-"
        },
        {
            "Parameters": "first-ui-number",
            "Info": "Specifies the first user interface to be configured.\nIf the ui-type is aux, the value of first-ui-number is 0.If the ui-type is console, the value of first-ui-number is 0.If the ui-type is vty, the value of first-ui-number is 0 to maximum configured vty minus 1."
        },
        {
            "Parameters": "last-ui-number",
            "Info": "Specifies the last user interface to be configured.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] user-interface vty 0",
            "[~HUAWEI-ui-vty0] authentication-mode aaa",
            "[~HUAWEI-ui-vty0] user privilege level 3",
            "[~HUAWEI-ui-vty0] idle-timeout 0 0",
            "Warning: Idle time-out is configured as 0, so session will never be disconnected because of timeout.",
            "[~HUAWEI-ui-vty0] screen-length 0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a user logs in to a device through an vty port, the system automatically allocates an idle user interface with the smallest number and a specified type to the user based on the login mode. The user interface helps manage and monitor the session between the device and the user. Each user interface has a corresponding user interface view where you can set a series of parameters, such as whether user authentication is required during the login and the user level after login. These parameters restrict the users that log in through this user interface, achieving unified session management.\nFollow-up Procedure\nAfter logging in to the device as a network administrator, run the display user-interface command to view user interfaces currently supported and the absolute and relative numbers of these user interfaces.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}