{
    "PageTitle": "user-interface",
    "FuncDef": "The user-interface command displays only one user interface view.\nBy default, there is no user interface view displayed.",
    "CLIs": [
        "user-interface { <ui-type> | console <first-ui-number> } [ <last-ui-number> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "ui-type",
            "Info": "Specifies the type of user interface.\nIf the user interface type is specified, use the relative user interface ID.If the user interface type is not specified, use the absolute user interface ID.\nThe value can be set to console, vty, maximum-vty, or aux."
        },
        {
            "Parameters": "console",
            "Info": "Specifies to display the Console user interface view.\n-"
        },
        {
            "Parameters": "first-ui-number",
            "Info": "Specifies the first user interface to be configured.\nIf the ui-type is console, the value of first-ui-number is 0.If the ui-type is vty, the value of first-ui-number is 0 to maximum configured vty minus 1."
        },
        {
            "Parameters": "last-ui-number",
            "Info": "Specifies the last user interface to be configured. If you specify this parameter, multiple user interface views will be displayed.\nThis parameter takes effect only when ui-type is VTY. The value of last-ui-number must be greater than that of first-ui-number.\nIf you have run the user-interface maximum-vty command in the system view to set the maximum number of VTY logins, the value of last-ui-number equals the maximum number of VTY logins minus 1."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] user-interface console 0",
            "[~HUAWEI-ui-console0]"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] user-interface vty 1",
            "[~HUAWEI-ui-vty1]"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] user-interface vty 1 3",
            "[~HUAWEI-ui-vty1-3]"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter a network administrator uses Telnet or SSH to log in to a device or logs in to a device through the console port, the system assigns a corresponding idle user interface with the smallest absolute or relative number for the network administrator to manage and monitor sessions between users and the device. One user interface corresponds to one user interface view. In a user interface view, the network administrator can set a range of parameters to specify whether login authentication is required, the level of a user after login, and other attributes. These parameter settings apply to all users logging in through this user interface, allowing user sessions to be managed in a centralized manner.\nPrerequisites\nIf you log in through the console port, ensure that a PC and an RS-232 cable have been prepared and a terminal emulation program has been installed on the PC.If you log in using Telnet or SSH, ensure that your PC can communicate with the device.\n\nPrecautions\nAfter logging in to the device as a network administrator, run the display user-interface command to view user interfaces currently supported and the absolute and relative numbers of these user interfaces."
}