{
    "PageTitle": "acl (VTY-type user interface view)",
    "FuncDef": "The acl command restricts the incoming and outgoing calls on the user interface.\nThe undo acl command can cancels the current settings.\nBy default, there is no restriction on incoming and outgoing calls.",
    "CLIs": [
        "acl { <acl4name> | <acl4num> } { inbound | outbound }",
        "acl ipv6 { <acl6name> | <acl6num> } { inbound | outbound }",
        "undo acl inbound",
        "undo acl outbound",
        "undo acl ipv6 inbound",
        "undo acl ipv6 outbound"
    ],
    "ParentView": [
        "VTY-type user interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "acl4name",
            "Info": "Specifies the name of ACL rule.\nThe value is a string of 1 to 64 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "acl4num",
            "Info": "Specifies the ID of an ACL.\nFor basic ACL, the value is an integer ranging from 2000 to 2999.\nFor advanced ACL, the value is an integer ranging from 3000 to 3999."
        },
        {
            "Parameters": "inbound",
            "Info": "Restricts the incoming calls on the user interface.\n-"
        },
        {
            "Parameters": "outbound",
            "Info": "Restricts the outgoing calls on the user interface.\n-"
        },
        {
            "Parameters": "ipv6",
            "Info": "Specifies the IPv6 protocol.\n-"
        },
        {
            "Parameters": "acl6name",
            "Info": "Specifies the name of ipv6 ACL rule.\nThe value is a string of 1 to 64 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "acl6num",
            "Info": "Specifies the ID of an ipv6 ACL.\nFor basic ACL, the value is an integer ranging from 2000 to 2999.\nFor advanced ACL, the value is an integer ranging from 3000 to 3999."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl 2000",
            "[*HUAWEI-acl4-basic-2000] quit",
            "[*HUAWEI] user-interface vty 0",
            "[*HUAWEI-ui-vty0] acl 2000 outbound"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBefore running this command, you need to run the acl command and the rule command to configure the ACL.Only the ACL of the same type can be configured without conflict on a user interface, namely, IPv4 inbound, IPv4 outbound, IPv6 inbound, and IPv6 outbound. Only one ACL can be configured for each type.After the configurations of this ACL take effect, all users in the user interface are under the restriction of this ACL.\n\nPrecautions\nIf no ACL rule is configured, running the acl command does not restrict the outgoing calls of user interfaces.\nIn the current version, only the outgoing calls of AUX user interfaces can be restricted. Incoming call restriction is not supported."
}