{
    "PageTitle": "abort trial",
    "FuncDef": "The abort trial command disables the trial running of a configuration.",
    "CLIs": [
        "abort trial [ session <session-id> ]"
    ],
    "ParentView": [
        "All views except the user view"
    ],
    "ParaDef": [
        {
            "Parameters": "session session-id",
            "Info": "Specifies the ID of a session for which the trial running of the configuration is to be disabled.\nThe value is an integer ranging from 0 to 65535."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] sysname rollback",
            "[*HUAWEI] commit trial 120",
            "Committing..done. ",
            "Info: The system enters the trial configuration mode.",
            "The system will revert to previous configuration if the trial configuration is not confirmed in 120 seconds.",
            "[*rollback] abort trial",
            "Warning: The trial configuration will be rolled back. Continue? [Y/N]:y"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter the two-phase configuration validation mode is configured and a command is run, run the commit trial command to enable the trial running of the configuration. You can specify the parameter time in the commit trial command to set the timeout period for the trial running. After the trial running of the configuration times out, the system automatically rolls the configuration back to the configuration state before the trial running. To disable the trial running of the configuration before the trial running times out, run the abort trial command to roll the system configuration back to the configuration state before the trial running.\nPrerequisites\nThe commit trial command has been run for a configuration.\nConfiguration Impact\nAfter the trial running of the configuration is disabled, the system configuration rolls back to the configuration state before the trial running.\nPrecautions\nThe abort trial command must be run in the two-phase configuration validation mode."
}