{
    "PageTitle": "clear configuration commit oldest",
    "FuncDef": "The clear configuration commit oldest command deletes the earliest generated list of configuration rollback points.",
    "CLIs": [
        "clear configuration commit oldest <number-of-commits>"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "number-of-commits",
            "Info": "Specifies the number of configuration rollback points to be deleted in the earliest generated list.\nThe value is an integer ranging from 1 to 80."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> clear configuration commit oldest 3"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the earliest configuration rollback points are no longer required, run the clear configuration commit oldest command to delete one or more of the earliest configuration rollback points. The configuration helps reclaim system resources.This command is not used to reduce the number of configuration rollback points in the earliest generated list under normal circumstances. If the number of configuration rollback points reaches the upper limit (50) in a list and subsequent configuration rollback points are generated, the earliest configuration rollback points are deleted automatically.Running the clear configuration commit oldest command deletes configuration rollback points that do not carry the label field. After that, the configuration rollback points carrying the label field become non-consecutive configuration rollback points. When the display configuration commit list command is run, the CommitId field of non-consecutive configuration rollback points contains the asterisk (*).\n\nPrerequisites\nChanges in the system configurations at the configuration rollback points have been displayed using the display configuration commit list or display configuration commit changes command to check whether a configuration rollback point must be deleted.\nFollow-up Procedure\nRun the display configuration commit list command to check that the earliest configuration rollback points have been deleted."
}