{
    "PageTitle": "configuration-occupied timeout",
    "FuncDef": "The configuration-occupied timeout command sets the timeout period before the system automatically unlocks the configuration set.\nThe undo configuration-occupied timeout command restores the default timeout period.\nBy default, the timeout period is 30 seconds.",
    "CLIs": [
        "configuration-occupied timeout <timeout-value>",
        "undo configuration-occupied timeout"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "timeout-value",
            "Info": "Specifies the timeout period before the system automatically unlocks the configuration set.\nThe value is an integer ranging from 1 to 7200, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] configuration-occupied timeout 120"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nRunning the configuration-occupied timeout command can set an allowable maximum period when no commands are delivered by the user that locks the configuration set. After the timeout period expires, the configuration set is automatically unlocked and other users can normally run commands.\nYou can run the configuration-occupied timeout command in one of the following scenarios:\nWhen a user without configuration access runs this command, the system prompts an error message.If the configuration is locked by another user, this command becomes invalid, and the system prompts an error message when the command is run.If the configuration has already been locked, the user performing the locking can modify the timeout period so that the period is recalculated.\n\nFollow-up Procedure\nAfter running the configuration-occupied timeout command, run the configuration exclusive command to lock the current configuration so that the timeout period configured is meaningful.\nPrecautions\nIf the timeout period is too short, the configuration is unlocked after a short period during which no command is run by the user that locks the configuration.If the timeout period is too long, the configuration remains locked and other users cannot obtain configuration access for a long period during which no command is run by the user that locks the configuration set.After this command is run, all users (except the user that runs this command) cannot configure commands because the configuration set is locked."
}