{
    "PageTitle": "set configuration operation cpu-limit",
    "FuncDef": "The set configuration operation cpu-limit command reduces the rate to some extent in response to the CPU overhigh caused by NMS data collection.\nThe undo set configuration operation cpu-limit command deletes the threshold configured for CPU rate decreasing.\nBy default, no threshold is configured for CPU rate decreasing.",
    "CLIs": [
        "set configuration operation cpu-limit { <percent-value> access-type snmp | <ncf-percent-value> access-type netconf }",
        "undo set configuration operation cpu-limit [ { access-type snmp | access-type netconf } ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "percent-value",
            "Info": "Specifies a threshold for CPU rate decreasing.\nThe value is an integer ranging from 30 to 100, in percentage."
        },
        {
            "Parameters": "access-type",
            "Info": "Specifies a protocol access type.\n-"
        },
        {
            "Parameters": "snmp",
            "Info": "Specifies the access type protocol is snmp.\n-"
        },
        {
            "Parameters": "ncf-percent-value",
            "Info": "Specifies a threshold for CPU rate decreasing.\nThe value is an integer ranging from 30 to 100, in percentage."
        },
        {
            "Parameters": "netconf",
            "Info": "Specifies the access type protocol is netconf.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] set configuration operation cpu-limit 50 access-type snmp"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nData collection by an NMS consumes many CPU resources. To ensure that other service runs properly, the device must reserve some resources for other services. To resolve this issue, run the set configuration operation cpu-limit command to configure a threshold for CPU rate decreasing. If the CPU usage reaches the configured threshold, the device reduces CPU resources allocated to the NMS when the NMS collects data. In this case, CPU pressure can be relieved to some extent.\nConfiguration Impact\nAfter the set configuration operation cpu-limit command is run, CPU resources that are allocated to MIB operations decrease, which increases the service processing time. If multiple NMSs are involved, an operation timeout may occur. As a result, the NMS that determines a disconnection based on a timeout is disconnected from the device.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nThis command reduces the rate to some extent only in response to the CPU overhigh caused by NMS data collection, instead of limiting the overall peak CPU rate."
}