{
    "PageTitle": "load configuration rollback changes",
    "FuncDef": "The load configuration rollback changes command loads the system configuration at a specified configuration rollback point.",
    "CLIs": [
        "load configuration rollback changes { at commit-id <at-commit-lable> | to commit-id <commit-lable> | last <number-of-commits> | to label <user-label> }"
    ],
    "ParentView": [
        "All views except the user view"
    ],
    "ParaDef": [
        {
            "Parameters": "at",
            "Info": "Delete the modifications made at the configuration rollback point.\n-"
        },
        {
            "Parameters": "commit-id",
            "Info": "Specifies the ID of a configuration rollback point.\n-"
        },
        {
            "Parameters": "at-commit-lable",
            "Info": "Specifies the ID of a configuration rollback point.\nThe value is a character string, which is automatically generated by the system. A common configuration rollback point's\nID is an integer ranging from 1000000001 to 1999999999, and a scheduled\nconfiguration rollback point's is an integer ranging from 2000000001\nto 2999999999."
        },
        {
            "Parameters": "to",
            "Info": "The system will be rolled back to the configurations when the configuration rollback point is generated.\n-"
        },
        {
            "Parameters": "commit-lable",
            "Info": "Specifies the ID of a configuration rollback point.\nThe value is a character string, which is automatically generated by the system. A common configuration rollback point's\nID is an integer ranging from 1000000001 to 1999999999, and a scheduled\nconfiguration rollback point's is an integer ranging from 2000000001\nto 2999999999."
        },
        {
            "Parameters": "last number-of-commits",
            "Info": "Specifies the number of configuration rollback points. The system will roll back the configuration changes at these configuration rollback points.\nThe value is a character string ranging from 1 to 80."
        },
        {
            "Parameters": "label user-label",
            "Info": "Specifies a user label for a configuration rollback point.\nThe value is a string of 1 to 256 case-sensitive characters. It can be any visible ASCII character except for the space. However, the string can contain spaces if it is enclosed with double quotation\nmarks (\" \"). The string cannot start with a digit or be a hyphen (-).\nThe parameter value must be unique in the system and in one-to-one mapping with commit-id."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] load configuration rollback changes last 1",
            "Warning: This operation will revert configuration changes to the previous status. Continue? [Y/N]:y",
            "Loading rollback changes.....................",
            "Configuration load succeeded."
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the configuration is incorrect, services are not running properly, or the configuration has exceeded the expected result on the network, you can run the load configuration rollback changes command to load the historical configuration of the specified configuration rollback point or the configuration with a specified user label. Then you can edit the configuration file as required.\nFor example, three configuration operations are performed, and three consecutive rollback points (a, b, and c) are generated.\nThe load configuration rollback changes at commit-id b command deletes the modification at configuration rollback point b.The load configuration rollback changes to commit-id b command rolls back the system to the configurations at configuration rollback point b.The load configuration rollback changes last 2 command deletes the modification at the latest two configuration rollback points, that is, rolls back the system to the configurations at configuration rollback point b.\n\nPrerequisites\nBefore the configuration rollback, you can run the display configuration commit changes command to check whether the configurations at the specified configuration rollback point meets the expectation.\nBefore loading the historical configuration of a specified user label, run the set configuration commit label command to create the user label.\nFollow-up Procedure\nAfter the configurations at the specified rollback point is loaded, you need to run the commit command to commit the configurations to make the modification take effect.\nIf some configurations fail to be loaded, run the display configuration rollback changes load-result command to check the configurations that fail to be loaded and the error information.\nPrecautions\nIf an interface board is replaced or removed, the configurations of the interface board may fail to be rolled back."
}