{
    "PageTitle": "display configuration candidate (All views except the user view)",
    "FuncDef": "The display configuration candidate changes command displays the difference between the candidate configuration and current running configuration.\nThe display configuration candidate merge command displays all configurations, including uncommitted and committed ones.",
    "CLIs": [
        "display configuration candidate merge",
        "display configuration candidate changes"
    ],
    "ParentView": [
        "All views except the user view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ftp server enable",
            "[*HUAWEI] display configuration candidate merge",
            "#",
            "sysname HUAWEI",
            "#",
            "interface GigabitEthernet1/0/0",
            "#",
            "ftp server enable",
            "#",
            "user-interface con 0",
            "set authentication password cipher $1c$a3XtEok2LJ$;&(SUt9vy0`JlWP6-z0<=01'5B+8NT8n9'<PL3oM$",
            "history-command max-size 30",
            "user-interface vty 0 4"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] display configuration candidate changes",
            "Building configuration",
            "  #",
            "  interface Tunnel1",
            "- mtu 1400",
            "+  mtu 1300",
            "  #",
            "+ interface Tunnel3",
            "  #"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBefore committing a set of configuration, run the display configuration candidate changes command to view the difference between the candidate configuration and current running configuration.\nThe display configuration candidate merge command displays the difference between the configuration in the candidate configuration database and that in the running configuration database. If a configuration difference exists, the command output is displayed as follows:\nCommands that exist in the candidate configuration rather than the current running configuration are prefixed with \"+\".Commands that exist in the current running configuration rather than the candidate configuration are prefixed with \"-\".If a command in the current running configuration is modified in the candidate configuration, two commands that are prefixed with \"-\" and \"+\", respectively, are displayed in sequence.\nTo check whether the configuration to be committed is correct and whether it conflicts with the existing configurations, you can run the display configuration candidate merge command.\n\nPrecautions\nThis command applies only to the two-phase validation mode.\nBefore you run the commit command to commit a configuration, a configuration conflict occurs if the current running configuration is changed. In this case, run the refresh configuration candidate command to resolve the configuration conflict, and then run the display configuration candidate changes command to view the configuration difference."
}