{
    "PageTitle": "reset saved-configuration",
    "FuncDef": "The reset saved-configuration command clears the configuration of the startup configuration file on the device.",
    "CLIs": [
        "reset saved-configuration"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> reset saved-configuration",
            "Warning: The action will delete the saved configuration on the device.",
            "The configuration will be erased to reconfigure.Continue? [Y/N]:n",
            "",
            "",
            "<HUAWEI> reset saved-configuration",
            "Warning: The action will delete the saved configuration on the device.",
            "The configuration will be erased to reconfigure.Continue? [Y/N]:y",
            "Warning: Now clearing the configuration on the device.",
            "Info: Succeeded in clearing the configuration on the device."
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter the software of the device is upgraded, if the configuration file on the storage device becomes incompatible with the new software, run the reset saved-configuration command to delete the configuration file.\nWhen the configured device is used for another purpose and the existing configuration file of the device does not meet new requirements, run the reset saved-configuration command to clear the existing configuration file and re-configure the device.\nThis command is supported only by a physical system (PS).\nConfiguration Impact\nWhen a user is saving the configuration file and another user is running this command, the configuration file is still not destroyed.\nBefore clearing the configuration file of the device, the system compares the configuration file used after the current startup with that used after the next startup of the system.\nreset saved-configuration command clears the settings for both files. The default configuration file will be used for the next startup.reset saved-configuration command clears the settings for the configuration file for the next startup, and the settings for the current configuration file are not cleared.reset saved-configuration command clears the settings for the configuration file for the next startup.reset saved-configuration command is run, the system prompts an error and no settings are cleared.\nIf you run the command to restart a device, addresses configured for management interfaces on the device will become invalid, and you have to log in to the device through a serial interface to re-configure the addresses.\n\nPrecautions\nExercise caution when using the command, and you are recommended to use it under the supervision of technical support personnel.If the configuration file for next startup is cleared and no default configuration file is set, the plug-and-play function may be affected during the next startup."
}