{
    "PageTitle": "startup default-configuration",
    "FuncDef": "The startup default-configuration command specifies the default configuration file for the system. If no configuration file is specified for the next startup, the system uses this default configuration file at the next startup.",
    "CLIs": [
        "startup default-configuration <configuration-file>"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "configuration-file",
            "Info": "Specifies the name of a configuration file to be used as the default configuration file. This file must exist.\nThe value is a string of 8 to 64 characters in the format of *.defcfg."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> startup default-configuration huawei.defcfg",
            "Info: Operating, please wait for a moment........done.",
            "Info: Succeeded in setting the configuration for booting system."
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf no default configuration file is specified for an unconfigured device, onsite configuration is required of engineers when the device starts, causing inconvenient device O&M. To implement plug-and-play upon the restart of an unconfigured device, run the startup default-configuration command to specify the default configuration file for the device. Note that the default configuration file must contain configurations required by the plug-and-play function. When the unconfigured device starts next time, it uses the default configuration file for configuration restoration.\nThe name extension of the configuration file must be .defcfg, and the configuration file must have been stored in the root directory of the device before being specified as the default configuration file. After the default configuration file is specified using the startup default-configuration command, the default configuration file in the root directory is imported to the device.\nThe default configuration file must be in plain text format, and its content can be directly viewed. After the default configuration file is specified for an unconfigured device, the device restores the commands in the configuration file one by one at the next startup.\nThe command can be configured only on a physical system (PS).\nConfiguration Impact\nIf no configuration file is specified for the next startup, the device uses the preset default configuration file for configuration restoration at the next startup.\nPrecautions\nThe size of the default configuration file cannot exceed 50 KB.Exercise caution when running this command, and you are advised to follow the instructions of the technical support personnel when you run this command."
}