{
    "PageTitle": "startup saved-configuration",
    "FuncDef": "The startup saved-configuration command specifies the configuration file to be loaded at the next startup of the system.",
    "CLIs": [
        "startup saved-configuration <configuration-file>"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "configuration-file",
            "Info": "Specifies the name of a configuration file. The file must have been created.\nThe name is a string of 5 to 64 characters in the format of *.zip, *.cfg or *.dat."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] undo set save-configuration",
            "[*HUAWEI] commit",
            "[~HUAWEI] quit",
            "<HUAWEI> startup saved-configuration huawei.cfg"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] set save-configuration",
            "[*HUAWEI] commit",
            "[~HUAWEI] quit",
            "<HUAWEI> startup saved-configuration huawei.cfg"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the configuration file becomes inapplicable due to software upgrade, run the startup saved-configuration command to specify a new configuration file to be loaded at the next startup of the system.\nThe extension of the configuration file name must be .zip, .cfg or .dat. The system configuration file must be saved in the root directory of the storage device.\nA .cfg file is a text file. You can directly view the content of a .cfg file. After a .cfg file is specified as the configuration file, the system restores the commands in the file one by one when startup.A .zip file is the compression of a .cfg file, occupying less space. After a .zip file is specified as the configuration file, the system decompresses the file into a .cfg file, and then restores the commands in the file one by one when startup.A .dat file is a binary file. If the startup software version and the .dat file version are the same, the system restores all configurations in the .dat file in batches when the device starts. This speeds up the system startup.\nThis command is supported only by a physical system (PS).\n\nConfiguration Impact\nThe configuration file to be loaded at the next startup of the system is changed.\nPrecautions\nThe specified configuration file has been created.*.dat file cannot be modified manually. Otherwise, the configuration file will fail to be loaded when the device stars, and the device will start with no configurations.If the autosave function is enabled and the startup saved-configuration command is run to modify the next-startup configuration file, a save operation is automatically triggered when the autosave interval expires. As a result, the configured next-startup configuration file is overwritten by the current configuration file. To prevent the incorrect overwriting, run the undo set save-configuration command to disable the autosave function before you configure the next-startup configuration file."
}