{
    "PageTitle": "set configuration commit",
    "FuncDef": "The set configuration commit command sets a user label for a configuration rollback point.\nThe clear configuration commit command deletes a user label for a configuration rollback point.\nBy default, no user label is set for configuration commit.",
    "CLIs": [
        "set configuration commit <commit-id> label <label-string>",
        "clear configuration commit <commit-id> label"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "commit-id",
            "Info": "Specifies the ID of a configuration rollback point.\nThe value is an integer ranging from 1000000001 to 1999999999 and generated by the system automatically."
        },
        {
            "Parameters": "label label-string",
            "Info": "Specifies a user label for a configuration rollback point.\nThe parameter value must be unique in the system and in one-to-one mappings with commit-id.\nThe value is a string of 1 to 256 case-sensitive characters. It can be any visible ASCII character except for the space. However, the string can contain spaces if it is enclosed with double quotation marks (\" \"). The string cannot start with a digit or be a hyphen (-)."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> set configuration commit 1000000002 label new_label"
        ],
        [
            "<HUAWEI> clear configuration commit 1000000002 label"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter a configuration commit operation is performed, the system automatically generates an ID for this configuration rollback point. The commit ID is an integer ranging from 1000000001 to 1999999999. If you find any difficulty in remembering a configuration commit ID, you can run the set configuration commit command to specify a user label for the configuration commit ID.You can specify a user label when you run the commit command to generate a configuration rollback point. If you have enabled the system to generate a label for a configuration commit ID, you can run the set configuration commit label command to set the label. For continuous configuration rollback points with labels, you cannot directly modify the labels. You must run the clear configuration commit label command to delete the labels of the configuration rollback points first and then run the set configuration commit label command to specify user labels for the configuration rollback points.Run the clear configuration commit label command to reset the configured label. The label is reset as the configuration commit is reset.This command is supported only on physical systems (PSs).\n\nPrerequisites\nBefore deleting a configuration rollback point, run the display configuration commit list or display configuration commit changes command to check whether a configuration rollback point can be deleted.\nFollow-up Procedure\nRun the display configuration commit list command to view information about the user label for a configuration rollback point.\nRun the display configuration commit list command to display the configuration commit label information.\nPrecautions\nIf the set configuration commit command is run several times, the latest configuration overwrites the previous configuration."
}