{
    "PageTitle": "configuration exclusive by-user-name",
    "FuncDef": "The configuration exclusive by-user-name command enables a user to lock the system configuration.\nThe undo configuration exclusive by-user-name command enables a user to unlock the system configuration.\nBy default, the system configuration is not locked.",
    "CLIs": [
        "configuration exclusive by-user-name <user-name>",
        "undo configuration exclusive by-user-name <user-name>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "user-name",
            "Info": "Specifies the name of a user.\nThe value is a string of 1 to 253 characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] configuration exclusive by-user-name root123"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nMultiple users can access a device and manage it. A user can be a controller or another type of user. If the configuration of a forwarder is modified by a non-controller user, the configurations of the controller and forwarder may be inconsistent. The configuration exclusive by-user-name command can be used to specify the controller to lock the system configuration of a forwarder to avoid the inconsistency.\nWhen multiple users manage a device at the same time, you can specify a user to lock the device. Only this user can modify the device configuration, while others cannot.\nPrecautions\nOnly one user can lock the system configuration at a time.The user that locks the system configuration must be the user specified in the configuration exclusive by-user-name command.The user that locks the system configuration can be different from the user specified in the undo configuration exclusive by-user-name command.Only users of the management user level can lock and unlock the system configuration. Users of the management user level include:Users of levels 3 to 15 when the command-privilege level rearrange command configuration existsUsers of level 3 when the command-privilege level rearrange command configuration does not exist\nThe configuration exclusive by-user-name command locks the device configuration based on the user name. Only the same user name can be used to unlock the device. The configuration exclusive command locks a device based on the session. The device can be unlocked only by the current session. After the session is logged out, the device is unlocked automatically. W11"
}