{
    "PageTitle": "event-control",
    "FuncDef": "This command is used to specify that a particular event or all events associated with an application is either generated or suppressed.",
    "CLIs": [
        "event-control <application-id> [ <event-name> | <event-number> ] [ generate ] [ <severity-level> ] [ <throttle> ] [ specific-throttle-rate <events-limit> interval <seconds> | disable-specific-throttle ] [ repeat | no-repeat ]",
        "event-control <application-id> [ <event-name> | <event-number> ] suppress",
        "no event-control <application-id> [ <event-name> | <event-number> ]"
    ],
    "ParentView": [
        "config>log"
    ],
    "ParaDef": [
        {
            "Parameters": "application-id",
            "Info": "The application whose events are affected by this event control filter. Values-A valid application name. To display a list of valid application names, use the show log applications command. \n\nSome examples of valid applications are:. ParamDefault: Default- None, this parameter must be explicitly specified."
        },
        {
            "Parameters": "event-name",
            "Info": "To generate, suppress, or revert to default for a single event, enter the specific event short name. If no event name is specified, the command applies to all events in the application. To display a list of all event short names use the event-control command. Values-Up to 32 characters. ParamDefault: Default- none"
        },
        {
            "Parameters": "event-number",
            "Info": "To generate, suppress, or revert to default for a single event, enter the specific number. If no event number is specified, the command applies to all events in the application. Values-0 to 4294967295. ParamDefault: Default- none"
        },
        {
            "Parameters": "generate",
            "Info": "Specifies that logger event is created when this event occurs. The generate keyword can be used with two optional parameters, severity-level and throttle. ParamDefault: Default- generate"
        },
        {
            "Parameters": "severity-level",
            "Info": "An ASCII string representing the severity level to associate with the specified generated events. Values-One of: cleared, indeterminate, critical, major, minor, warning.. ParamDefault: Default- The system assigned severity name"
        },
        {
            "Parameters": "throttle",
            "Info": "Specifies whether or not events of this type will be throttled. \nBy default, event throttling is on for most event types."
        },
        {
            "Parameters": "suppress",
            "Info": "This keyword indicates that the specified events will not be logged. If the suppress keyword is not specified then the events are generated by default. For example on the 7750 SR, event-control bgp suppress will suppress all BGP events. If a log event is a raising event for a Facility Alarm, and the associated Facility Alarm is raised, then changing the log event to suppress clears the associated Facility Alarm. ParamDefault: Default- generate"
        },
        {
            "Parameters": "specific-throttle-rate events-limit",
            "Info": "The log event throttling rate can be configured independently for each log event using this keyword. This specific-throttle-rate overrides the globally configured throttle rate (configure>log>throttle-rate) for the specific log event. Values-1 to 20000."
        },
        {
            "Parameters": "interval seconds",
            "Info": "specifies the number of seconds that the specific throttling intervals lasts. Values-1 to 1200."
        },
        {
            "Parameters": "disable-specific-throttle",
            "Info": "Specifies to disable the specific-throttle-rate."
        },
        {
            "Parameters": "repeat",
            "Info": "Specifies that the log event should be repeated every minute until the underlying condition is cleared. Only supported for the following log events: BGP tBgpMaxNgPfxLmtThresholdReached and PORT tmnxEqPortEtherCrcAlarm (for degrade threshold only)."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: Each event has a set of default settings. To display a list of all events and the current configuration use the event-control command."
}