{
    "PageTitle": "from",
    "FuncDef": "This command selects the source stream to be sent to a log destination.",
    "CLIs": [
        "from { [ main ] [ security ] [ change ] [ debug-trace ] }",
        "no from"
    ],
    "ParentView": [
        "config>log>log-id"
    ],
    "ParaDef": [
        {
            "Parameters": "main",
            "Info": "Instructs all events in the main event stream to be sent to the destination defined in the to command for this destination log-id. The main event stream contains the events that are not explicitly directed to any other event stream. To limit the events forwarded to the destination, configure filters using the filter command."
        },
        {
            "Parameters": "security",
            "Info": "Instructs all events in the security event stream to be sent to the destination defined in the to command for this destination log-id. The security stream contains all events that affect attempts to breach system security such as failed login attempts, attempts to access MIB tables to which the user is not granted access or attempts to enter a branch of the CLI to which access has not been granted. To limit the events forwarded to the destination, configure filters using the filter command."
        },
        {
            "Parameters": "change",
            "Info": "Instructs all events in the user activity stream to be sent to the destination configured in the to command for this destination log-id. The change event stream contains all events that directly affect the configuration or operation of this node. To limit the events forwarded to the change stream destination, configure filters using the filter command."
        },
        {
            "Parameters": "debug-trace",
            "Info": "Instructs all debug-trace messages in the debug stream to be sent to the destination configured in the to command for this destination log-id. Filters applied to debug messages are limited to application and subject."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: no from"
}