{
    "PageTitle": "route-preference",
    "FuncDef": "This command specifies the primary and secondary routing preference for traffic generated for SNMP notifications and syslog messages. If the remote destination is not reachable through the routing context specified by primary route preference then the secondary routing preference will be attempted.",
    "CLIs": [
        "route-preference primary { inband | outband } secondary { inband | outband | none }",
        "no route-preference"
    ],
    "ParentView": [
        "config>log"
    ],
    "ParaDef": [
        {
            "Parameters": "primary",
            "Info": "Specifies the primary routing preference for traffic generated for SNMP notifications and syslog messages. ParamDefault: Default- outband"
        },
        {
            "Parameters": "secondary",
            "Info": "Specifies the secondary routing preference for traffic generated for SNMP notifications and syslog messages. The routing context specified by the secondary route preference will be attempted if the remote destination was not reachable by the primary routing preference, specified by primary route preference. The value specified for the secondary routing preference must be distinct from the value for primary route preference. ParamDefault: Default- inband"
        },
        {
            "Parameters": "inband",
            "Info": "Specifies that the logging utility will attempt to use the base routing context to send SNMP notifications and syslog messages to remote destinations."
        },
        {
            "Parameters": "outband",
            "Info": "Specifies that the logging utility will attempt to use the management routing context to send SNMP notifications and syslog messages to remote destinations."
        },
        {
            "Parameters": "none",
            "Info": "Specifies that no attempt will be made to send SNMP notifications and syslog messages to remote destinations."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: no route-preference"
}