{
    "PageTitle": "ip address dhcp-alloc",
    "FuncDef": "The ip address dhcp-alloc command enables the DHCP client function on an interface.\nThe undo ip address dhcp-alloc command disables the DHCP client function from an interface.\n\nBy default, the DHCP client function is not enabled on an interface.",
    "CLIs": [
        "ip address dhcp-alloc",
        "undo ip address dhcp-alloc"
    ],
    "ParentView": [
        "PW-VE sub-interface view",
        "40GE interface view",
        "Port extension interface view",
        "GE electrical interface view",
        "Eth-Trunk sub-interface view",
        "400GE interface view",
        "50GE sub-interface view",
        "10GE interface view",
        "GE sub-interface view",
        "VE sub-interface view",
        "GE interface view",
        "25GE sub-interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "Sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "25GE interface view",
        "100ge sub-interface view",
        "Eth-Trunk interface view",
        "40GE sub-interface view",
        "10GE sub-interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] ip address dhcp-alloc"
        ]
    ],
    "ExtraInfo": "Usage Scenario\n\nTo allow a device to dynamically obtain an IP address from the DHCP server by means of DHCP, run the ip address dhcp-alloc command to enable the DHCP client function on an interface.\nAfter the DHCP client function is enabled, the interface can send a DHCP request packet to the DHCP server. Upon receipt of the request packet, the DHCP server replies with a DHCP response packet. The device can then obtain information about the assigned IP address from the DHCP response packet.\n\nPrecautions\n\n\nWhen multiple logical interfaces apply for an IP address from the same DHCP server, configure different MAC addresses for the logical interfaces. Otherwise, address assignment may fail.\nAfter the DHCP client function is enabled on an interface, the interface cannot process FORCE RENEW packets any more.\nWhen the DHCP client function is enabled on an interface, the dynamic IP address allocated to the DHCP client may conflict with the MAP public address segment. As a result, the MAP function fails to take effect. Therefore, avoid IP address conflict or overlapping during network planning.\nFor scenarios where the DHCP client function is enabled on the logical interface, after deleting the logical interface, the RELEASE message may fail to be sent. It causes that the corresponding address in the server cannot be immediately recovered."
}