{
    "PageTitle": "bridge-domain",
    "FuncDef": "The bridge-domain command creates a bridge domain as a broadcast domain and displays the bridge domain view.\nThe undo bridge-domain command removes a bridge domain which is a broadcast domain.\nBy default, no bridge domain is created.",
    "CLIs": [
        "bridge-domain <bd-id>",
        "undo bridge-domain <bd-id>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "bridge-domain bd-id",
            "Info": "Specifies the ID of a bridge domain.\nThe value is an integer\nranging from 1 to 16777215."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bridge-domain 10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA metro Ethernet network consists of the following broadcast domains:\nGlobal virtual local area network (VLAN): a traditional broadcast domain that transmits Layer 2 services.In a metro Ethernet network, VLANs are used to prevent broadcast storms. A 12-bit VLAN tag defined in IEEE 802.1Q identifies a maximum of only 4096 VLANs, which is insufficient for a great number of users in the metro Ethernet. The 802.1Q in 802.1Q (QinQ) technology is developed to increase the number of VLAN tags.QinQ relieves the VLAN resource insufficiency but has its own drawback. If only QinQ is used to implement local switch services, the virtual private LAN service (VPLS) must be configured. QinQ cannot simultaneously provide the local switch service and Layer 3 packet termination service.Virtual switching instance (VSI): a broadcast domain that transmits VPLS services.A VSI is sold as a whole to a single user, and the user can plan VLANs and service traffic in the VSI.VLANs over a VSI cannot be isolated, imposing traffic security risks. If various VLANs in a VSI have the same MAC address, the learned MAC entry is changed, which causes incorrect service forwarding.\nTo resolve the preceding problems, EVC introduces the bridge domain as a broadcast domain. To create a bridge domain, run the bridge-domain command. Bridge domains provide the following functions:\nSupports the VLAN and QinQ service local switch function.Allows different bridge domains to transmit traffic of the same VSI, and traffic in various bridge domains are distinguished using bridge domain IDs. Each bridge domain is a broadcast domain, which implements broadcast domain isolation. MAC address learning is based on a specific bridge domain, which prevents MAC entry changes.\n\nPrecautions\nMultiple bridge domains can be created on a device. Bridge domains are irrelevant to VLAN tags carried in packets."
}