{
    "PageTitle": "display ethernet uni information",
    "FuncDef": "The display ethernet uni information command displays information about traffic encapsulation types and behaviors configured on EVC Layer 2 sub-interfaces.",
    "CLIs": [
        "display ethernet uni information [ interface { <interface-type> <interface-number> | <interface-name> } ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "interface-type",
            "Info": "Specifies the name of an interface.\n-"
        },
        {
            "Parameters": "interface-number",
            "Info": "Specifies the type of an interface.\n-"
        },
        {
            "Parameters": "interface-name",
            "Info": "Specifies the number of an interface.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display ethernet uni information",
            "  gigabitethernet 1/0/1.1",
            "    Total encapsulation number: 1",
            "      encapsulation dot1q vid 10",
            "    Rewrite map 1-to-1 vid 100",
            "  gigabitethernet 1/0/2.1",
            "    Total encapsulation number: 1",
            "      encapsulation qinq vid 20 ce-vid 100",
            "    Rewrite map 2-to-1 vid 40"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn a device with multiple EVC Layer 2 sub-interfaces, to view information about traffic encapsulation and behaviors configured on the EVC Layer 2 sub-interfaces, run the display ethernet uni information command. The command output helps verify the configuration and analyze faults.\nPrerequisites\nThe traffic statistics collection mode has been set to multiple for EVC Layer 2 sub-interfaces using the statistic enable mode multiple command in the EVC Layer 2 sub-interface view. Alternatively, a traffic encapsulation type has been configured for EVC Layer 2 sub-interfaces using the encapsulation dot1q command.\nPrecautions\nThe traffic encapsulation type and behavior have been configured on a specified EVC Layer 2 sub-interface.\nIf there are a large number of EVC Layer 2 sub-interfaces on a device, specify interface-type interface-number in the display ethernet uni information command to filter the information.\nAfter the encapsulationqinq vid pe-vid ce-vid default, encapsulation default, or encapsulation untag command is run in the EVC Layer 2 sub-interface view, running the display ethernet uni information command cannot display configurations on the EVC Layer 2 sub-interface."
}