{
    "PageTitle": "encapsulation default",
    "FuncDef": "The encapsulation default command specifies an encapsulation type on an EVC Layer 2 sub-interface.\nThe undo encapsulation default command deletes an encapsulation type on an EVC Layer 2 sub-interface.\nBy default, no encapsulation type is specified on an EVC Layer 2 sub-interface.",
    "CLIs": [
        "encapsulation default",
        "undo encapsulation default"
    ],
    "ParentView": [
        "400GE Layer 2 sub-interface view",
        "50GE Layer 2 sub-interface view",
        "Eth-Trunk Layer 2 sub-interface view",
        "GE Layer 2 sub-interface view",
        "Layer 2 sub-interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/1.1 mode l2",
            "[*HUAWEI-GigabitEthernet1/0/1.1] encapsulation default"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn a Layer 2 Ethernet network, packets may not carry VLAN Tags or carry one or two VLAN Tags. To enable different packets to be forwarded through different EVC Layer 2 sub-interfaces, run this command to configure different flow encapsulation modes for the EV Layer 2 sub-interface. The encapsulation default command enables a Layer 2 sub-interface to receive packets of any encapsulation type by default. If the packets cannot meet the configuration requirements of other sub-interfaces, the packets enter this interface.\nPrecautions\nOnly a single encapsulation type can be specified on each EVC Layer 2 sub-interface. Before changing an encapsulation type, run the undo encapsulation command to delete the existing encapsulation type and run the encapsulation to specify an encapsulation type.If an interface has a VLAN configuration, the VLAN configuration does not take effect after the encapsulation default command is run. If an interface has a VLAN configuration, VLAN has to be reconfigured after the encapsulation default command is run.\nAfter an EVC Layer 2 sub-interface with the encapsulation type of default is added to a bridge domain (BD), no BDIF interface can be created in the bridge domain."
}