{
    "PageTitle": "split-horizon",
    "FuncDef": "The split-horizon command enables split horizon on a specific EVC Layer 2 sub-interface.\nThe undo split-horizon command disables split horizon on a specific EVC Layer 2 sub-interface.\nBy default, split horizon is disabled on an EVC Layer 2 sub-interface.",
    "CLIs": [
        "split-horizon",
        "undo split-horizon"
    ],
    "ParentView": [
        "Layer 2 sub-interface view",
        "50GE Layer 2 sub-interface view",
        "Eth-Trunk Layer 2 sub-interface view",
        "GE Layer 2 sub-interface view",
        "400GE Layer 2 sub-interface view",
        "VE layer2 subinterface view",
        "Global-VE layer2 subinterface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bridge-domain 10",
            "[*HUAWEI-bd10] quit",
            "[*HUAWEI] interface GigabitEthernet1/0/1.1 mode l2",
            "[*HUAWEI-GigabitEthernet1/0/1.1] bridge-domain 10",
            "[*HUAWEI-GigabitEthernet1/0/1.1] split-horizon"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA bridge domain is a broadcast domain, in which bridge domain members broadcast received packets within the domain. To reduce the broadcast volume, member interfaces that do not need to communicate can be isolated. To meet this requirement, run the split-horizon command in a specific EVC Layer 2 sub-interface view to isolate the EVC Layer 2 sub-interface with others.\nTo isolate all member interfaces in a bridge domain, run the split-horizon enable command in the BD view.\nPrecautions\nSplit horizon must be configured on each EVC Layer 2 sub-interface that needs to be isolated.If the split-horizon enable command is run in views of a BD and its EVC Layer 2 sub-interfaces, split horizon fails to take effect on the EVC Layer 2 sub-interfaces.Split horizon-enabled EVC Layer 2 sub-interfaces can be isolated from one another, but they are not isolated from EVC Layer 2 sub-interfaces on which split horizon is not configured. In addition, EVC Layer 2 sub-interfaces on which split horizon is not configured are not isolated from one another.Split horizon is configured in the BD view to isolate EVC Layer 2 sub-interfaces within the specific BD."
}