{
    "PageTitle": "bridge-domain (Layer 2 subinterface view)",
    "FuncDef": "The bridge-domain command adds an EVC Layer 2 sub-interface to a bridge domain.\nThe undo bridge-domain command removes an EVC Layer 2 sub-interface from a bridge domain.\nBy default, no EVC Layer 2 sub-interface is added to a bridge domain.",
    "CLIs": [
        "bridge-domain <bd-id>",
        "undo bridge-domain"
    ],
    "ParentView": [
        "400GE Layer 2 sub-interface view",
        "50GE Layer 2 sub-interface view",
        "Eth-Trunk Layer 2 sub-interface view",
        "GE Layer 2 sub-interface view",
        "Global-VE layer2 subinterface view",
        "VE layer2 subinterface view",
        "Layer 2 sub-interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "bridge-domain bd-id",
            "Info": "Specifies the ID of a bridge domain.\nThe value is an integer\nranging from 1 to 16777215."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bridge-domain 10",
            "[*HUAWEI-bd10] quit",
            "[*HUAWEI] interface GigabitEthernet 1/0/1.1 mode l2",
            "[*HUAWEI-GigabitEthernet1/0/1.1] bridge-domain 10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBefore a created bridge domain can forward service packets, a sub-interface must be added to the bridge domain using the bridge-domain command in a specific EVC Layer 2 sub-interface view.\nPrerequisites\n A bridge domain has been created using the bridge-domain bd-id command in the system view. An EVC Layer 2 sub-interface has been created using the interface interface-type interface-number.subnum mode l2 command in the system view.\n\nPrecautions\nIn the scenario where an EVC dot1q and QinQ sub-interface accesses a BD for transparent transmission, the smallest VLAN ID pair or Q pair is learned during MAC address learning and broadcast packet duplication. When the smallest VLAN ID pair or Q pair is changed, traffic is interrupted. Therefore, before changing the smallest VLAN ID pair or Q pair, unbind the sub-interface from a BD or shut down the sub-interface.\nAn interface supports various types of sub-interfaces, such as ordinary sub-interfaces, EVC Layer 2 sub-interfaces, Dot1q sub-interfaces, and QinQ sub-interfaces. Among these sub-interfaces, only EVC Layer 2 sub-interfaces can be added to a bridge domain. Each EVC Layer 2 sub-interface can be added only to a single bridge domain."
}