{
    "PageTitle": "dhcp user chasten",
    "FuncDef": "The dhcp user chasten command configures parameters for DHCP user access restriction.\nThe undo dhcp user chasten command restores the default parameter configuration for DHCP user access restriction.\nBy default, DHCP user access restriction is enabled. If the number of connection request packets from a DHCP user exceeds 10 within 180 seconds, the user is suppressed for 300 seconds.",
    "CLIs": [
        "dhcp user chasten request-packets <reqPktNum> check-period <checkPer> restrain-period <restrainPer>",
        "undo dhcp user chasten [ request-packets <reqPktNum> check-period <checkPer> restrain-period <restrainPer> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "check-period checkPer",
            "Info": "Specifies a check period. DHCP users are in the check state during this period.\nThe value is an integer ranging from 1 to 3600, in seconds. The default value is 180."
        },
        {
            "Parameters": "restrain-period restrainPer",
            "Info": "Specifies a suppression period. DHCP users are in the suppression state during this period.\nThe value is an integer ranging from 1 to 3600, in seconds. The default value is 300."
        },
        {
            "Parameters": "request-packets reqPktNum",
            "Info": "Specifies the maximum number of connection request packets.\nThe value is an integer ranging from 1 to 10000. The default value is 10."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dhcp user chasten request-packets 1000 check-period 60 restrain-period 120"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a large number of invalid connection request packets exist on a network, the network may be overloaded and even authorized users may not go online. By default, DHCP user access restriction is enabled. If the number of connection request packets from a DHCP user exceeds 10 within 180 seconds, the user is suppressed for 300 seconds. If the default parameter configuration for DHCP user access restriction does not meet service requirements, you can run the dhcp user chasten command to adjust it."
}