{
    "PageTitle": "bw-activity",
    "FuncDef": "This command defines how the multicast ingress path manager determines the amount of bandwidth required by a multicast channel. The default setting is dynamic which causes the bandwidth manager to use the bandwidth policies dynamic rate table entries to determine the current rate. The alternative setting is use-admin-bw which causes the bandwidth manager to use the configured admin-bw associated with the channel. The use-admin-bw setting also requires an active and inactive threshold to be defined which allows the bandwidth manager to determine when the channel is actively using ingress path bandwidth and when the channel is idle.",
    "CLIs": [
        "bw-activity { use-admin-bw | dynamic [ falling-delay <seconds> ] } [ black-hole-rate <kbps> ]",
        "no bw-activity"
    ],
    "ParentView": [
        "config>mcast-mgmt>mcast-info-plcy>bundle>channel",
        "config>mcast-mgmt>mcast-info-plcy>bundle>source-override"
    ],
    "ParaDef": [
        {
            "Parameters": "use-admin-bw | dynamic",
            "Info": "The use-admin-bw and dynamic keywords are mutually exclusive and one must be specified when executing the bw-activity command. The use-admin-bw keyword indicates the channels current ingress bandwidth should be derived from the admin-bw setting. The admin-bw setting must not currently be set to 0 for the use-admin-bw setting to succeed. \nThe dynamic keyword indicates that the multicast ingress path manager should use the dynamic rate table (as defined in the bandwidth-policy) to derive the channels current ingress rate."
        },
        {
            "Parameters": "falling-delay seconds",
            "Info": "Specifies the value the bandwidth manager uses the falling-delay threshold to hold on to the previous highest bandwidth until the delay time has expired while operating in dynamic bandwidth mode. This allows the bandwidth manager to ignore momentary drops in channel bandwidth. Values-10 to 3600. ParamDefault: Default- 30"
        },
        {
            "Parameters": "black-hole-rate kbps",
            "Info": "Specifies a rate at which a channel is placed in the black-hole state. The kilobits-per-second parameter is expressed as an integer and represents multiples of 1,000 bits per second. Values-1 to 40000000. ParamDefault: Default- None"
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}