{
    "PageTitle": "vpls",
    "FuncDef": "This command creates or edits a VPLS instance. If theservice-iddoes not exist, a context for the service is created. If theservice-idexists, the context for editing the service is entered.",
    "CLIs": [
        "vpls <service-id> [ customer <customer-id> ] [ vpn <vpn-id> ] [ m-vpls ] [ b-vpls | i-vpls ] [ etree ] [ name <name> ] [ create ]",
        "no vpls <service-id>"
    ],
    "ParentView": [
        "config>service"
    ],
    "ParaDef": [
        {
            "Parameters": "service-id",
            "Info": "Specifies the unique service identification number identifying the service in the service domain. This ID must be unique to this service and may not be used for any other service of any type. The service-id must be the same number used for every router on which this service is defined. Values-service-id: 1 to 214748364."
        },
        {
            "Parameters": "customer-id",
            "Info": "Specifies the customer ID number to be associated with the service. This parameter is required on service creation and optional for service editing or deleting. Values-1 to 2147483647."
        },
        {
            "Parameters": "vpn-id",
            "Info": "Specifies the VPN ID number which allows you to identify VPNs by a VPN identification number. Values-1 to 2147483647. ParamDefault: Default- null (0)"
        },
        {
            "Parameters": "m-vpls",
            "Info": "Specifies a managed VPLS."
        },
        {
            "Parameters": "name",
            "Info": "Configures an optional service name identifier, up to 64 characters, to a given service. This service name can then be used in configuration references, display, and show commands throughout the system. A defined service name can help the service provider or administrator to identify and manage services within the SR OS platforms."
        },
        {
            "Parameters": "create",
            "Info": "Keyword used to create the service ID. The create keyword requirement can be enabled/disabled in the environment>create context."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}