{
    "PageTitle": "set next-run-mode",
    "FuncDef": "The set next-run-mode command sets a running mode for a specified chassis for next startup.\nThe undo set next-run-mode command restores the default running mode for a specified chassis for next startup.\nBy default, the running mode of a specified chassis for next startup is single-chassis.",
    "CLIs": [
        "set chassis <chassis-id> next-run-mode <next-run-mode> <nextclusterid>",
        "set next-run-mode <next-run-mode> <nextclusterid>",
        "undo set chassis <chassis-id> next-run-mode",
        "undo set next-run-mode"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "next-run-mode next-run-mode",
            "Info": "Specifies a running mode for a chassis for next startup.\nThe value can be virtual-cluster-chassis."
        },
        {
            "Parameters": "nextclusterid",
            "Info": "Specifies the virtual cluster ID of a chassis for next startup.\nThe value is an integer."
        },
        {
            "Parameters": "chassis chassis-id",
            "Info": "Specifies a chassis, which is represented in the form of chassis type+chassis ID.\nThe chassis ID is 1 or 2. A chassis example is CLC1 or CLC2."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] set next-run-mode virtual-cluster-chassis 1",
            "Warning: After setting the next startup mode, replace the configuration file and restart the device.",
            "Please confirm,will you set clc1 next-run-mode virtual-cluster-chassis and cluster-id 1 ? [Y/N]:",
            "Operation succeed,the clc1 next-run-mode is virtual-cluster-chassis cluster id 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen deploying a virtual cluster system, you must run the set next-run-mode command to set a running mode for a specified chassis for next startup.\nImplementation Procedure\nAfter the set next-run-mode command is run, the system prompts you whether to continue. Enter Y to continue. The configuration will take effect after the device restarts. Enter N to cancel the setting of the running mode.\nConfiguration Impact\nIf chassis-id is not specified, the running mode of the chassis on which the master main control board resides for next startup is configured.\nFollow-up Procedure\nRestart the device for the configuration to take effect.\nPrecautions\nThe virtual cluster feature is under license control.\nIn VS mode, this command is supported only by the admin VS."
}