{
    "PageTitle": "mirror instance location",
    "FuncDef": "The mirror instance location command creates a port mirroring instance and displays the mirroring instance view.\nThe undo mirror instance location command deletes a port mirroring instance.\nBy default, no mirroring instance is configured on the device.",
    "CLIs": [
        "mirror instance <instance-name> location",
        "undo mirror instance <instance-name>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "instance-name",
            "Info": "Specifies the name of a mirroring instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mirror instance 1 location",
            "[*HUAWEI-mirror-instance-1]"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn an EVC scenario, to mirror and analyze traffic on an EVC interface or a bridge domain, create a mirrored port. You can create a mirrored port in common mode or in mirroring instance mode.\nTo create a mirrored port in common mode, run the port-mirroring { inbound | outbound } command.Before creating a mirrored port in mirroring instance mode, run the mirror instance location command to create a mirroring instance and run the port-mirroring instance { inbound | outbound } command to apply the mirroring instance to an interface.\nThe differences between the two modes are as follows:\nThe common mode supports interface-based mirroring, and the mirroring instance mode supports only Board-based mirroring.CAR can be implemented for mirrored traffic in both modes. In common mode, CAR is implemented on each interface. In mirroring instance mode, a shared CAR can be configured in a mirroring instance and applies to different interfaces bound to the mirroring instance, which simplifies configuration and optimizes CAR resource usage.A shared instance can be configured for multiple interfaces. To be specific, multiple interfaces can share a mirroring instance. This feature allows more interfaces to support port mirroring when the mirroring specification is insufficient.\n\nPrecautions\nAfter a mirroring instance is deleted, all configurations in the mirroring instance will be deleted."
}