{
    "PageTitle": "mirror to observe-index",
    "FuncDef": "The mirror to observe-index command specifies an observing port for mirroring packets on an interface board (this kind of observing port is called the observing port for the interface board).\nThe undo mirror to observe-index command cancels the configuration.\nBy default, the Device is not configured with the observing port for the interface board.",
    "CLIs": [
        "mirror to observe-index <observe-index>",
        "undo mirror to observe-index <observe-index>"
    ],
    "ParentView": [
        "Slot view"
    ],
    "ParaDef": [
        {
            "Parameters": "observe-index observe-index",
            "Info": "Specifies the index of the observing port.\nThe value is an integer ranging from 1 to 255."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] slot 1",
            "[~HUAWEI-slot-1] mirror to observe-index 2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo send the packets received on an interface board to an observing port, you must configure a mirroring port on the interface board, and then run the mirror to observe-index command to specify an observing index for the interface board. In this manner, the packets received on the interface board are sent to the observing port with the specified observing index. The observing port specified in the mirror to observe-index command is an observing port to which the packets received on the entire interface board are mirrored.\nPrerequisites\nBefore running the mirror to observe-index command, you must have configured the associated observing port through the port-observing observe-index command.\nConfiguration Impact\nAfter the observing index of an interface board is specified, all the packets on the mirroring port of the interface board are mirrored to the observing port with the specified observing index. If the associated observing port is not configured through the port-observing observe-index command, the mirror to observe-index command can still be run but does not take effect.\nThe packets received on an interface board can be mirrored to the observing port on any interface board. That is, an observing port can be configured on a local or any other interface board.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}