{
    "PageTitle": "port-observing observe-index",
    "FuncDef": "The port-observing observe-index command specifies an observing port on an interface board.\nThe undo port-observing observe-index command deletes the configuration.\nBy default, no observing port is configured.",
    "CLIs": [
        "port-observing observe-index <observe-index>",
        "port-observing observe-index <observe-index> [ without-filter ]",
        "undo port-observing observe-index <observe-index>",
        "undo port-observing observe-index <observe-index> [ without-filter ]"
    ],
    "ParentView": [
        "100ge sub-interface view",
        "100GE interface view",
        "10GE sub-interface view",
        "10G LAN interface view",
        "25GE sub-interface view",
        "25GE interface view",
        "400GE interface view",
        "40GE sub-interface view",
        "40GE interface view",
        "50GE interface view",
        "Eth-Trunk sub-interface view",
        "Eth-Trunk interface view",
        "GE optical interface view",
        "GE sub-interface view",
        "IP-Trunk interface view",
        "POS interface view",
        "Layer 2 Eth-Trunk interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "observe-index observe-index",
            "Info": "Specifies the index of an observing port.\nThe value is an integer ranging from 1 to 255."
        },
        {
            "Parameters": "without-filter",
            "Info": "Disables the observing port from filtering mirrored packets.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet2/0/0",
            "[~HUAWEI-GigabitEthernet2/0/0] port-observing observe-index 2"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] port-observing observe-index 1 without-filter"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAn observing port copies the packets sent from or received by the mirrored port to a packet analyzer. To check packets sent from or received by an interface, you can run the port-observing observe-index command to configure the interface as the mirrored port. Then, you can configure an observing port to copy packets (sent or received) on the mirrored port to a packet analyzer.\nIn the SIG mirroring scenario, if mirrored packet filtering is configured on the observing port, the filtering function does not take effect. As a result, packets do not match rules and are discarded. To resolve this problem, run the port-observing observe-index without-filter command.\nFollow-up Procedure\nAn observing interface is configured and an observing port for the interface board is specified on the interface board where the mirrored port resides. Alternatively, configure an associated observing port for the mirrored port.\nPrecautions\nAn index corresponds to only one observing port.\nAfter being configured as the observing port, the interface cannot be configured to process other services.\nThe same interface can serve as either the observing port or the mirrored port.\nThe observing port and mirrored port cannot be configured on the main interface or sub-interfaces of the same Eth-Trunk interface."
}