{
    "PageTitle": "port-mirroring without-linklayer-header",
    "FuncDef": "The port-mirroring without-linklayer-header command configures a mirrored port to mirror packets from Layer 3 headers.\nThe undo port-mirroring without-linklayer-header command configures a mirrored port to mirror packets from Layer 2 headers.\nBy default, a mirrored port mirrors packets from Layer 2 headers.",
    "CLIs": [
        "port-mirroring without-linklayer-header",
        "undo port-mirroring without-linklayer-header"
    ],
    "ParentView": [
        "100ge sub-interface view",
        "100GE interface view",
        "10GE sub-interface view",
        "10G LAN interface view",
        "10G WAN interface view",
        "400GE interface view",
        "40GE sub-interface view",
        "40GE interface view",
        "Eth-Trunk sub-interface view",
        "Eth-Trunk interface view",
        "GE-Trunk member interface view",
        "GE optical interface view",
        "GE sub-interface view",
        "IP-Trunk interface view",
        "MP-group interface view",
        "POS interface view",
        "Serial interface view",
        "Port extension interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] port-mirroring inbound",
            "[*HUAWEI-GigabitEthernet1/0/0] port-mirroring without-linklayer-header"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn the SIG mirroring scenario, when the port mirroring function is configured, the SIG imports traffic to the mirrored port and copies the traffic into multiple flows using the port mirroring function. The mirrored port is configured to mirror packets from Layer 2 or Layer 3 headers. After mirrored packets are sent to the observing port, the observing port removes Layer 2 headers of the original packets and encapsulates the specified destination MAC address into the packets for subsequent forwarding.\nAfter this command is configured on the mirrored port, the port-observing observe-index without-filter command must be configured on the observing port.\nPrerequisites\nThe mirrored port has been configured so that the port-mirroring without-linklayer-header command can take effect.\nPrecautions\nDo not configure an interface as both an observing port and a mirrored port.\nWhen the port-mirroring without-linklayer-header command is configured on the mirrored port and the port-observing with-linker-header command is configured on the observing port, the port-mirroring without-linklayer-header command on the mirrored port takes effect.\nAfter this command is configured, the corresponding observing port does not support the port-observing pop-label command."
}