{
    "PageTitle": "port-observing pop-label",
    "FuncDef": "The port-observing pop-label command enables an observing interface to remove labels from MPLS packets.\nThe undo port-observing pop-label command disables an observing interface from removing labels from MPLS packets.\nBy default, an observing interface does not remove labels from received MPLS packets.",
    "CLIs": [
        "port-observing pop-label { one | two | all } [ sub-interface extend ]",
        "undo port-observing pop-label",
        "undo port-observing pop-label { one | two | all } [ sub-interface extend ]"
    ],
    "ParentView": [
        "100GE interface view",
        "10G LAN interface view",
        "400GE interface view",
        "40GE interface view",
        "Layer 2 GE interface view",
        "GE interface view",
        "GE electrical interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "one",
            "Info": "Enables an observing interface to remove labels from MPLS packets each with a single label.\n-"
        },
        {
            "Parameters": "two",
            "Info": "Enables an observing interface to remove all labels from MPLS packets each with double labels.\n-"
        },
        {
            "Parameters": "all",
            "Info": "Enables an observing interface to remove all labels from MPLS packets each with either a single label or double labels.\n-"
        },
        {
            "Parameters": "sub-interface",
            "Info": "Sub-interface.\n-"
        },
        {
            "Parameters": "extend",
            "Info": "Specify pop mpls label feature.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet2/0/3",
            "[~HUAWEI-GigabitEthernet2/0/3] port-observing observe-index 1",
            "[*HUAWEI-GigabitEthernet2/0/3] port-observing pop-label one"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen a mirroring-enabled interface on an MPLS tunnel functions as an observing interface, to enable this interface to remove labels from MPLS packets, run the port-observing pop-label command.\nTo enable a sub-interface to remove labels from MPLS packets, run the port-observing pop-label { one | two | all } sub-interface extend command. In addition, run the port-observing with-linklayer-header command on the observing port to configure mirroring to cover link-layer headers of packets so that mirrored packets carry Layer 2 header information.\nPrerequisites\nAn interface on an MPLS tunnel has been configured as an observing interface.\nConfiguration Impact\nIf the port-observing pop-label command is run more than once, the latest configuration overrides the previous one.\nThe port-observing pop-label command does not take effect on MPLS packets each with more than two labels.\nPrecautions\nThe port-observing pop-label and port-observing dest-mac commands are mutually exclusive.\nThe port-observing pop-label { one | two | all } sub-interface extend command does not take effect on the LPUF-50/LPUF-50-L/LPUI-21-L/LPUI-51-L/LPUF-51/LPUF-51-B/LPUI-51/LPUI-51-B/LPUS-51/LPUF-101/LPUF-101-B/LPUI-101/LPUI-101-B/LPUS-101."
}