{
    "PageTitle": "reflector cluster-id (BGP-LS address family view)",
    "FuncDef": "The reflector cluster-id command sets a cluster ID for an RR.\nThe undo reflector cluster-id command deletes the cluster ID configured for an RR.\nBy default, each RR uses its router ID as the cluster ID.",
    "CLIs": [
        "reflector cluster-id { <cluster-id-value> | <cluster-id-ipv4> }",
        "undo reflector cluster-id"
    ],
    "ParentView": [
        "BGP-LS address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "cluster-id-value",
            "Info": "Specifies the cluster ID of an RR.\nThe value can be an integer ranging from 1 to 4294967295 or in the format of an IPv4 address."
        },
        {
            "Parameters": "cluster-id-ipv4",
            "Info": "Specifies the IPv4 address of an RR.\nIt is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] link-state-family unicast",
            "[*HUAWEI-bgp-af-ls] reflector cluster-id 50"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nSometimes, more than one RR needs to be configured in a cluster to improve network reliability and prevent single-point failures. If a cluster has more than one RR, the reflector cluster-id command needs to be used to set the same cluster ID for the RRs. This helps to identify the cluster and avoid routing loops.\nConfiguring an RR allows IBGP peers to advertise routes learned in the local AS to each other. The Cluster_List attribute is introduced to avoid loops within an AS. The Cluster_List is composed of a series of Cluster_IDs. It records all the RRs through which a route passes.\nConfiguration Impact\nIf the reflector cluster-id command is run several times, the latest configuration overrides the previous one.\nPrecautions\nTo ensure that a client can learn the routes reflected by an RR, the Cluster ID configured on the RR must be different from the Cluster ID of the client (By default, the client uses its Router ID as the cluster ID). If the Cluster ID is the same as the Cluster ID of the client, the client discards received routes."
}