{
    "PageTitle": "hard-pipe enable",
    "FuncDef": "The hard-pipe enable command enables a static bidirectional co-routed CR-LSP to function as a public network CR-LSP for an IP hard pipe.\nThe undo hard-pipe command disables a static bidirectional co-routed CR-LSP from functioning as a public network CR-LSP for an IP hard pipe.\nBy default, a static bidirectional co-routed CR-LSP does not function as a public network CR-LSP for an IP hard pipe.",
    "CLIs": [
        "hard-pipe enable",
        "undo hard-pipe"
    ],
    "ParentView": [
        "Static bidirectional co-routed egress view",
        "Static bidirectional co-routed ingress view",
        "Static bidirectional co-routed transit view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] bidirectional static-cr-lsp ingress Tunnel10",
            "[*HUAWEI-bi-static-ingress-Tunnel10] hard-pipe enable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] bidirectional static-cr-lsp transit abc",
            "[*HUAWEI-bi-static-transit-abc] hard-pipe enable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] bidirectional static-cr-lsp egress 123",
            "[*HUAWEI-bi-static-egress-123] hard-pipe enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAn IP hard pipe is a pipe technique that establishes a static PW over a static bidirectional co-routed CR-LSP to simulate an SDH leased line. To enable a device to use a static PW over a static bidirectional co-routed CR-LSP as a public network CR-LSP for an IP hard pipe, run the hard-pipe enable command.\nPrerequisites\nA static bidirectional co-routed CR-LSP has been created using the bidirectional static-cr-lsp command.\nPrecautions\nNote the following issues:\nDo not specify the bandwidth for the static bidirectional co-routed CR-LSP.The outgoing-interface interface-type interface-number parameter must be configured to specify an outbound interface of the static bidirectional co-routed CR-LSP."
}