{
    "PageTitle": "qos soft-pipe trap-threshold output-rate",
    "FuncDef": "The qos soft-pipe trap-threshold output-rate command sets the alarm and clear alarm thresholds for the outbound bandwidth usage of the soft pipe.\nThe undo qos soft-pipe trap-threshold output-rate command restores the default alarm and clear alarm thresholds for the outbound bandwidth usage of the soft pipe.\nBy default, the pre-warning threshold, alarm threshold, and clear alarm threshold for the outbound bandwidth usage of the soft pipe are 95%, 98%, and 90%, respectively.",
    "CLIs": [
        "qos soft-pipe trap-threshold output-rate <bandwidth-in-use> [ resume-rate <resume-threshold> ]",
        "undo qos soft-pipe trap-threshold output-rate [ <bandwidth-in-use> [ resume-rate <resume-threshold> ] ]"
    ],
    "ParentView": [
        "Eth-Trunk interface view",
        "GE interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "bandwidth-in-use",
            "Info": "Specifies an alarm threshold for the outbound bandwidth usage of the soft pipe.\nThe value is an integer ranging from 1 to 100. The default value is 98."
        },
        {
            "Parameters": "resume-rate resume-threshold",
            "Info": "Specifies a clear alarm threshold for the outbound bandwidth usage of the soft pipe.\nThe value is an integer ranging from 1 to bandwidth-in-use. If bandwidth-in-use is configured, the default value is bandwidth-in-use. If bandwidth-in-use is not configured, the default value is 90."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] qos hard-pipe share-mode bandwidth 100 outbound",
            "[~HUAWEI-GigabitEthernet1/0/0] qos soft-pipe trap-threshold output-rate 80 resume-rate 75"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter the hard pipe is configured on the network-side or AC-side interface, you can configure an alarm threshold for the soft pipe bandwidth usage to monitor the soft pipe load on the device. When the bandwidth usage exceeds the pre-warning or alarm threshold, the device reports an alarm to prompt users to properly plan service traffic or expand the device capacity. You can set the alarm threshold and clear alarm threshold as required.\nThe pre-warning threshold cannot be configured and is calculated as follows:\nWhen the alarm threshold minus clear alarm threshold is greater than or equal to 5%, the pre-warning threshold is the alarm threshold minus 3%.When the alarm threshold minus clear alarm threshold is lower than 5%, the pre-warning threshold is equal to the alarm threshold."
}