{
    "PageTitle": "broadcast-copy fast disable",
    "FuncDef": "The broadcast-copy fast disable command disables the hardware copy function on an interface.\nThe undo broadcast-copy fast disable command restores the default interface configuration.\nBy default, the hardware copy function is not enabled.",
    "CLIs": [
        "broadcast-copy fast disable",
        "undo broadcast-copy fast disable"
    ],
    "ParentView": [
        "Eth-Trunk sub-interface view",
        "GE sub-interface view",
        "Global VE sub-interface view",
        "VE sub-interface view",
        "VLANIF interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/2.1",
            "[*HUAWEI-GigabitEthernet 1/0/2.1] encapsulation dot1q-termination",
            "[*HUAWEI-GigabitEthernet 1/0/2.1] broadcast-copy fast disable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe broadcast-copy fast disable command can be configured only in the interface view. The protocol packet copy function is always disabled for an interface in the system view. To restore the default interface configuration, run the undo broadcast-copy fast disable command.\nPrecautions\nThis command is applicable only to the super VLANIF interface, dot1q VLAN tag termination sub-interface, and QinQ VLAN tag termination sub-interface.\nThe hardware copy function does not take effect when few VLAN IDs or QinQ VLAN IDs are configured on an interface.\nThe hardware copy function does not take effect when no resources can be requested because all multicast resources are used up or the number of requested resources exceeds the maximum number of resources used by hardware copy.\nThe hardware replication function consumes multicast resources and may affect services such as IPTV multicast and Layer 2 VPN broadcast services on the device. Handle the resource alarms on the device in time to prevent other services from being affected after the hardware replication function is enabled in case of an emergency.\nAfter a large number of VLANs are configured on an interface and the hardware replication function is enabled, the device rapidly sends a large number of packets, causing heavy burden on the peer device."
}