{
    "PageTitle": "broadcast-copy fast enable",
    "FuncDef": "The broadcast-copy fast enable command enables the hardware copy function.\nThe undo broadcast-copy fast enable command disables the hardware copy function.\nBy default, the hardware copy function is not enabled.",
    "CLIs": [
        "broadcast-copy fast enable",
        "undo broadcast-copy fast enable"
    ],
    "ParentView": [
        "Eth-Trunk sub-interface view",
        "GE sub-interface view",
        "Global VE sub-interface view",
        "VE sub-interface view",
        "VLANIF interface view",
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] broadcast-copy fast enable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/2.1",
            "[*HUAWEI-GigabitEthernet 1/0/2.1] encapsulation dot1q-termination",
            "[*HUAWEI-GigabitEthernet 1/0/2.1] broadcast-copy fast enable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] vlan 1",
            "[*HUAWEI-vlan1] aggregate-vlan",
            "[*HUAWEI-vlanif1] interface vlanif 1",
            "[*HUAWEI-vlanif1] broadcast-copy fast enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a device is configured with a super VLANIF interface, a dot1q termination sub-interface, and a QinQ termination sub-interface and these interfaces are configured with a large number of VLANs, the protocol packets need to be broadcast to all these VLANs, causing heavy burden on the CPU or even packet forwarding failures. In case of an emergency, you can run the broadcast-copy fast enable command to enable the hardware replication function for broadcast protocol packets. After this function is enabled, the replication of broadcast protocol packets is implemented on hardware, reducing the consumption of CPU performance. The current version supports hardware replication on multicast packets (including IGMP and MLD packets), ARP broadcast requests, ND multicast requests, and DHCP snooping packets.\nTo globally enable the protocol packet copy function, run the broadcast-copy fast enable command in the system view. To enable the protocol packet copy function for an interface, run the broadcast-copy fast enable command in the interface view. To disable the protocol packet copy function, run the undo broadcast-copy fast enable command.\nPrecautions\nThis command is applicable only to the super VLANIF interface, dot1q VLAN tag termination sub-interface, and QinQ VLAN tag termination sub-interface.\nThe hardware copy function does not take effect when few VLAN IDs or QinQ VLAN IDs are configured on an interface.\nThe hardware copy function does not take effect when no resources can be requested because all multicast resources are used up or the number of requested resources exceeds the maximum number of resources used by hardware copy.\nThe hardware replication function consumes multicast resources and may affect services such as IPTV multicast and Layer 2 VPN broadcast services on the device. Handle the resource alarms on the device in time to prevent other services from being affected after the hardware replication function is enabled in case of an emergency.\nAfter a large number of VLANs are configured on an interface and the hardware replication function is enabled, the device rapidly sends a large number of packets, causing heavy burden on the peer device."
}