{
    "PageTitle": "clear ip df",
    "FuncDef": "The clear ip df command enables a device to forcibly fragment IP packets on an outbound interface.\nThe undo clear ip df command disables a device from forcibly fragmenting IP packets on an outbound interface.\nBy default, a device is disabled from forcibly fragmenting IP packets on an outbound interface is disabled.",
    "CLIs": [
        "clear ip df",
        "undo clear ip df"
    ],
    "ParentView": [
        "Virtual template view",
        "Tunnel interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "GE electrical interface view",
        "Port extension interface view",
        "Loopback interface view",
        "Remote-AP interface view",
        "Serial interface view",
        "GMPLS-UNI interface view",
        "400GE interface view",
        "10GE interface view",
        "VE interface view",
        "MP-group interface view",
        "Global VE interface view",
        "POS sub-interface view",
        "VBDIF interface view",
        "VE sub-interface view",
        "GE interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Vbridge interface view",
        "Global VE sub-interface view",
        "Sub-interface view",
        "50GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Eth-Trunk interface view",
        "POS interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] clear ip df"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAn IP header contains a Don't Fragment (DF) field, indicating whether an IP packet can be fragmented. If the DF field of an IP packet is set to 1, a device does not fragment the packet. If the size of an IP packet is greater than the MTU of an interface because of a protocol encapsulation, a device discards the packet and sends ICMP error messages, causing data loss. To prevent data loss in this scenario, run the clear ip df command to enable the forced fragmentation of IP packets.\nConfiguration Impact\nIf the function is enabled, the system resets the DF field to 0 and performs fragmentation when the IP packet meets the following requirements:\nDF field in the IP header is 1.Size of the packet is larger than the MTU configured on the outbound interface.\n\nPrecautions\nThis command takes effect only for the packets that are sent to the CPU for software forwarding but not for the packets that are forwarded."
}