{
    "PageTitle": "host-packet type management-protocol dscp",
    "FuncDef": "The host-packet type management-protocol dscp command sets a priority value for management protocol packets.\nThe undo host-packet type management-protocol dscp command deletes the priority value of management protocol packets.\nBy default, the ToS value is used as the priority value.",
    "CLIs": [
        "host-packet type management-protocol dscp <dscp-value>",
        "undo host-packet type management-protocol dscp"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "management-protocol",
            "Info": "Indicates management protocol packets.\n-"
        },
        {
            "Parameters": "dscp dscp-value",
            "Info": "Specifies a priority value of protocol packets.\nThe value is an integer ranging from 0 to 63."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] host-packet type management-protocol dscp 44"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo set a priority value for management protocol packets or control protocol packets, run the host-packet type command. Generally, each protocol has a default DSCP value, and the DSCP values of some protocols can be configured using the host-packet type command or the corresponding commands for changing the DSCP values of the protocols. In this case, the rules for the DSCP values to take effect as follows:If a protocol has its own command for changing the DSCP value, the DSCP value configured using its own command takes effect regardless of whether the DSCP value is controlled by the host-packet type command.If a protocol does not have its own command for changing the DSCP value and the DSCP value is controlled by the host-packet type command, the DSCP value configured using the command takes effect.If a protocol does not have its own command for changing the DSCP value and the DSCP value is not controlled by the host-packet type command, the default DSCP value takes effect.\n\nFor details about how to change the values of ToS/DSCP and Traffic Class/DSCP, see: Feature Description > IP Services > IPv4 > DSCP.\n\nPrecautions\ndscp-value specified in the host-packet type command only represents the priority of protocol packets.\nWhether the priority of the protocol packets configured using this command takes effect depends on the specific service."
}