{
    "PageTitle": "display icmp statistics",
    "FuncDef": "The display icmp statistics command displays ICMP packet statistics.",
    "CLIs": [
        "display icmp statistics",
        "display icmp statistics interface { <interface-name> | <interface-type> <interface-num> }"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "interface interface-type interface-num",
            "Info": "Specifies the type and number of an interface. If this parameter is specified, ICMP packet statistics on the specified interface are displayed.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display icmp statistics",
            "Input:  bad formats          0          bad checksum              0   ",
            "        echo                 0          destination unreachable   0   ",
            "        source quench        0          redirects                 0   ",
            "        echo reply           0          parameter problem         0   ",
            "        timestamp request    0          information request       0   ",
            "        mask requests        0          mask replies              0   ",
            "        time exceeded        0          timestamp reply           0   ",
            "        Mping request        0          Mping reply               0   ",
            "Output: echo                 0          destination unreachable   132360   ",
            "        source quench        0          redirects                 0   ",
            "        echo reply           0          parameter problem         0   ",
            "        timestamp request    0          information reply         0   ",
            "        mask requests        0          mask replies              0   ",
            "        time exceeded        0          timestamp reply           0",
            "        Mping request        0          Mping reply               0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe Internet Control Message Protocol (ICMP) is an error-reporting mechanism and is used by IP or an upper-layer protocol (TCP or UDP). An ICMP packet is encapsulated as a part of an IP datagram and transmitted through the Internet.\nWhen an error occurs during the IP datagram forwarding, ICMP reports the error to the source of the IP datagram, but does not rectify the error or notify the intermediate devices of the error.\nTo check statistics about ICMP packets, including sent and received ICMP error packets, echo request packets, and echo reply packets, run the display icmp statistics command.\nDuring the ping or traceroute operations, for example, run the display icmp statistics command on the Router to check whether the number of sent and received packets is correct.\nPrecautions\nNetwork attackers sometimes make use of ICMP packets to obtain network information for attacking the network. If the \"destination unreachable\", \"redirects\", \"echo reply\", and \"time exceeded\" field values displayed are large, check whether the device is being attacked."
}