{
    "PageTitle": "ip option enable (interface view)",
    "FuncDef": "The ip option enable command enables the system to process IP packets with route options.\nThe undo ip option enable command disables the system from processing IP packets with route options.\n\nBy default, the system processes IP packets with route options.",
    "CLIs": [
        "ip option { route-alert | route-record | source-route | time-stamp } enable",
        "ip option { route-alert | route-record | source-route | time-stamp } inherent-global",
        "undo ip option { route-alert | route-record | source-route | time-stamp } enable"
    ],
    "ParentView": [
        "IP-Trunk interface view",
        "Port extension interface view",
        "Loopback interface view",
        "Remote-AP interface view",
        "GMPLS-UNI interface view",
        "400GE interface view",
        "MP-group interface view",
        "Trunk serial interface view",
        "POS sub-interface view",
        "GE sub-interface view",
        "POS-Trunk interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "Mtunnel view",
        "Vbridge interface view",
        "Global VE sub-interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "25GE interface view",
        "Virtual template view",
        "Tunnel interface view",
        "PW-VE sub-interface view",
        "40GE interface view",
        "GE electrical interface view",
        "DcnInterface-interface view",
        "Global MP-group interface view",
        "LMP configuration view",
        "Serial interface view",
        "MTI interface view",
        "Eth-Trunk sub-interface view",
        "50GE sub-interface view",
        "10GE interface view",
        "LMP interface view",
        "VBDIF interface view",
        "GE interface view",
        "100GE interface view",
        "VLANIF interface view",
        "50GE interface view",
        "100ge sub-interface view",
        "40GE sub-interface view",
        "Eth-Trunk interface view",
        "10GE sub-interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "route-alert",
            "Info": "Enables the system to process IP packets with the route-alert option.\n-"
        },
        {
            "Parameters": "route-record",
            "Info": "Enables the system to process IP packets with the route-record option.\n-"
        },
        {
            "Parameters": "source-route",
            "Info": "Enables the system to process IP packets with the source-route option. This option determines the path along which packets are transmitted.\n-"
        },
        {
            "Parameters": "time-stamp",
            "Info": "Enables the system to process IP packets with the time-stamp option. This option calculates the time spent on packet transmission and processing.\n-"
        },
        {
            "Parameters": "inherent-global",
            "Info": "Clears the configuration on an interface and restores the configuration of processing IP packets with route options on the interface to the system configuration. This parameter can be configured only in the interface view.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] undo ip option route-alert enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\n\nIP packets can carry the following route options:\n\nRoute-alert\nRoute-record\nSource-route\nTime-stamp\n\nGenerally, these options are used for diagnosing network paths and temporarily transmitting special services. These options, however, may be used by attackers to spy on the network structure for initiating attacks. Therefore, you need to run the ip option enable command to enable the system to process IP packets with route options or run the undo ip option enable command to disable the system from processing IP packets with route options.\nBy default, the system processes IP packets with route options. To prevent attacks that make use of IP packets with route options, disable the system from processing IP packets with route options.\n\nConfiguration Impact\n\nAfter the system is disabled from processing IP packets with route options, the system collects only statistics about discarded packets.\n\nPrecautions\n\nIf the network status is normal and the system is required to process IP packets with route options, run the ip option enable command.\nRoute priorities configured in the interface view take precedence over those configured in the system view.\nThe execution of the undo ip option enable command may affect the CPU processing of IP packets that carry the corresponding routing entries. For example, after the undo ip option route-alert enable command is run, the CPU processing of RSVP-TE packets is affected."
}