{
    "PageTitle": "ip address ignore primary-sub enable",
    "FuncDef": "The ip address ignore primary-sub enable command enables a device to ignore the primary or secondary status of IP addresses.\nThe undo ip address ignore primary-sub enable command restores the default configuration.\nBy default, a device differentiates primary IP addresses from secondary IP addresses.",
    "CLIs": [
        "ip address ignore primary-sub enable",
        "undo ip address ignore primary-sub enable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip address ignore primary-sub enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf both primary and secondary IP addresses are configured on an interface, the primary IP address can be deleted only after all secondary IP addresses are deleted by default. If the primary IP address of an interface needs to be deleted during a service cutover, the default configuration affects user services of the secondary IP addresses. To resolve this problem, run the ip address ignore primary-sub enable command to enable the device to ignore the primary or secondary status of IP addresses so that any IP address configured on the interface can be deleted.\nConfiguration Impact\nAfter a device is enabled to ignore the primary or secondary status of IP addresses, no secondary IP address can be configured using the ip address ip-address sub command.\nIn primary/secondary IP address mode, the device uses the primary IP address of an interface to interact with other devices while processing specific services. When a device is enabled to ignore the primary or secondary status of IP addresses, the device uses the first IP address of an interface to interact with other devices while processing specific services. For example, the device uses the first IP address of an interface to establish a neighbor relationship while processing a routing protocol service (the neighbor relationship can be viewed using the display this command on the interface).\nPrecautions\nFor IP addresses in primary or secondary mode:One primary IP address and multiple secondary IP addresses can be configured on an interface.If a secondary IP address exists, the primary IP address cannot be deleted.If both primary and secondary IP addresses are configured on an interface of a device, the device cannot be enabled to ignore the primary or secondary status of IP addresses.\nFor IP addresses whose primary or secondary status is ignored:Multiple IP addresses can be configured on an interface.Any IP address configured on an interface can be deleted.If multiple IP addresses are configured on an interface of a device, the device cannot be configured to differentiate primary IP addresses from secondary IP addresses.\n\n\nThe ip address ignore primary-sub enable and ip address conflict check disable commands are mutually exclusive."
}