{
    "PageTitle": "ip address ppp-negotiate",
    "FuncDef": "The ip address ppp-negotiate command enables IP address negotiation on an interface.\nThe undo ip address ppp-negotiate command disables IP address negotiation on an interface.\nBy default, IP address negotiation is disabled on interfaces.",
    "CLIs": [
        "ip address ppp-negotiate",
        "undo ip address ppp-negotiate"
    ],
    "ParentView": [
        "Global MP-group interface view",
        "MP-group interface view",
        "POS interface view",
        "POS-Trunk interface view",
        "Trunk serial interface view",
        "Serial interface view",
        "Virtual template view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface pos 1/0/0",
            "[*HUAWEI-Pos1/0/0] ip address ppp-negotiate"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface virtual-template 10",
            "[*HUAWEI-Virtual-Template10] ip address ppp-negotiate"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface mp-group 1/0/1",
            "[*HUAWEI-Mp-group1/0/1] ip address ppp-negotiate"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo enable IP address negotiation on an interface, run the ip address ppp-negotiate command. This command applies only to PPP-encapsulated interfaces. After IP address negotiation is enabled on an interface, the access server can assign an IP address to the interface.\nPrerequisites\nAn IP address to be assigned to the client has been specified on the server.\nConfiguration Impact\nAfter IP address negotiation is enabled on an interface, you do not need to configure an IP address for the interface, and the interface can obtain an IP address through negotiation. In addition, you cannot configure a secondary IP address for the interface.\nPrecautions\nWhen configuring IP address negotiation on an interface, note the following:\nIf the interface has been assigned an IP address, the IP address is deleted.PPP supports IP address negotiation. Therefore, enable IP address negotiation on an interface only when the interface is encapsulated with PPP. When the PPP protocol status goes Down, the IP address obtained through negotiation is deleted.If you configure IP address negotiation on an interface that already has IP address negotiation configured, the IP address obtained through the original negotiation is deleted and a new IP address is obtained through negotiation.After the IP address obtained through negotiation is deleted, the interface is addressless."
}