{
    "PageTitle": "smart-clock ptp priority",
    "FuncDef": "The smart-clock ptp priority command configures the priority 1 or priority 2 value of the time source for an Atom GPS/GNSS module.\nThe undo smart-clock ptp priority command cancels the priority 1 or priority 2 value of the time source for an Atom GPS/GNSS module.\nBy default, the priority1 or priority 2 value of the time source for an Atom GPS/GNSS module is 128.",
    "CLIs": [
        "smart-clock ptp { priority1 <priority1-value> | priority2 <priority2-value> }",
        "undo smart-clock ptp { priority1 [ <priority1-value> ] | priority2 [ <priority2-value> ] }"
    ],
    "ParentView": [
        "GE interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "priority1 priority1-value",
            "Info": "Specifies the priority 1 value of the time source for an Atom GPS/GNSS module.\nThe value is an integer that ranges from 0 to 255. The smaller the value is, the higher the priority is."
        },
        {
            "Parameters": "priority2 priority2-value",
            "Info": "Specifies the priority 2 value of the time source for an Atom GPS/GNSS module.\nThe value is an integer that ranges from 0 to 255. The smaller the value is, the higher the priority is."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[HUAWEI] interface GigabitEthernet 1/0/0",
            "[HUAWEI-GigabitEthernet1/0/0] smart-clock ptp priority1 60"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen an Atom GPS/GNSS module is inserted into a GE optical interface on a device, the GE optical interface can function as the 1588v2 master to send 1588v2 packets for time synchronization. The device can function as the 1588v2 slave to perform time synchronization with the Atom GPS/GNSS module. Also, 1588v2 parameters for the Atom GPS/GNSS module can be configured on the device.\nPriority 1 or priority 2 of the time source is mainly used for BMC selection during 1588v2 time synchronization. To configure the priority 1 or priority 2 value of the time source for the Atom GPS/GNSS module on a GE optical interface, run the smart-clock ptp priority command.\nPrecautions\nThe priority 1 or priority 2 configuration fails if the interface is not a GE optical interface.\nIf the Atom GPS/GNSS module has been positioned on the GE optical interface, the priority 1 or priority 2 configuration will be delivered to the Atom GPS/GNSS module.\nIf the Atom GPS/GNSS module on the GE optical interface is not positioned, the priority 1 or priority 2 configuration fails. Such configuration can be delivered to the Atom GPS/GNSS module only when an Atom GPS/GNSS module is positioned."
}