{
    "PageTitle": "smart-clock recovery enable",
    "FuncDef": "The smart-clock recovery enable command enables the self-healing function of an Atom GPS/GNSS module on a specified interface.\nThe undo smart-clock recovery enable command disables the self-healing function of an Atom GPS/GNSS module on a specified interface.\nBy default, the self-healing function of an Atom GPS/GNSS module is not enabled on a specified interface.",
    "CLIs": [
        "smart-clock recovery enable",
        "undo smart-clock recovery enable"
    ],
    "ParentView": [
        "GE interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] smart-clock recovery enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo enable automatic recovery for the AE 905S module in a 1GE optical interface of an Device, run the smart-clock recovery enable command. The Device supports real-time detection of the IIC watchdog. After automatic recovery is enabled for the AE 905S module in a 1GE optical interface and the Device detects an IIC watchdog exception in the AE 905S module, the Device automatically resets the AE 905S module and disables SyncE and 1588v2 of the 1GE optical interface that houses the AE 905S module. After the configured WTR time elapses, the Device enables SyncE and 1588v2 for the 1GE optical interface again. If automatic recovery is not enabled, the Device remains in the abnormal state upon an AE 905S module exception and needs to be handled.\nConfiguration Impact\nAfter this command is run, the device recovers after the WTR timer is expired.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nDuring self-healing of the Atom GPS/GNSS module, the SyncE and 1588v2 functions are temporarily disabled, but the related configurations are not deleted.\nThe priority 1 or priority 2 configuration fails if the interface is not a GE optical interface.If the Atom GPS/GNSS module has been positioned on the GE optical interface, the priority 1 or priority 2 configuration will be delivered to the Atom GPS/GNSS module.If the Atom GPS/GNSS module on the GE optical interface is not positioned, the priority 1 or priority 2 configuration fails. Such configuration can be delivered to the Atom GPS/GNSS module only when an Atom GPS/GNSS module is positioned."
}