{
    "PageTitle": "smart-clock ptp domain",
    "FuncDef": "The smart-clock ptp domain command configures a clock domain for an Atom GPS/GNSS module on a specified interface.\nThe undo smart-clock ptp domain command cancels the configured clock domain on an Atom GPS/GNSS module.\nBy default, the clock domain value of an Atom GPS/GNSS module is 0.",
    "CLIs": [
        "smart-clock ptp domain <domain-value>",
        "undo smart-clock ptp domain [ <domain-value> ]"
    ],
    "ParentView": [
        "GE interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "domain domain-value",
            "Info": "Specifies the clock domain value of an Atom GPS/GNSS module.\nThe value is an integer ranging from 0 to 255."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] smart-clock ptp domain 60"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA physical network can be logically divided into multiple clock domains. Each clock domain has a clock source, and all the devices in the domain need to be synchronized with the clock source. The devices in different clock domains do not have to perform clock synchronization between each other. If a device needs to track time information about an Atom GPS/GNSS module, the clock domain values must be the same. To configure the clock domain value of an Atom GPS/GNSS module on a GE optical interface, run the smart-clock ptp domain command.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nThe priority 1 or priority 2 configuration fails if the interface is not a GE optical interface.If the Atom GPS/GNSS module has been positioned on the GE optical interface, the priority 1 or priority 2 configuration will be delivered to the Atom GPS/GNSS module.If the Atom GPS/GNSS module on the GE optical interface is not positioned, the priority 1 or priority 2 configuration fails. Such configuration can be delivered to the Atom GPS/GNSS module only when an Atom GPS/GNSS module is positioned."
}