{
    "PageTitle": "display mld group static",
    "FuncDef": "The display mld group static command displays information about Multicast Listener Discovery (MLD) groups, including MLD groups that hosts dynamically join by sending Report messages and multicast groups that hosts are configured to statically join by using commands.",
    "CLIs": [
        "display mld group [ <GrpAddr6> | interface { <port-type> <port-num> | <port-name> } ] * static [ verbose ]",
        "display mld { vpn-instance <vpn-instance-name> | all-instance } group [ <GrpAddr6> | interface { <port-type> <port-num> | <port-name> } ] * static [ verbose ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "interface port-type port-num",
            "Info": "Specifies the type and number of an interface.\n-"
        },
        {
            "Parameters": "static",
            "Info": "Displays information about MLD groups that hosts statically join.\n-"
        },
        {
            "Parameters": "verbose",
            "Info": "Displays detailed information about MLD multicast groups that hosts join.\n-"
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "all-instance",
            "Info": "Specifies all VPN instance.\n-"
        },
        {
            "Parameters": "group GrpAddr6",
            "Info": "Specifies an IPv6 multicast group address.\nThe value is in hexadecimal notation and in the format of FFxA:xxxx:xxxx::xxxx, in which x ranges from 0 to F and A is 0 or ranges from 3 to F."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display mld group static",
            "Static join group information of VPN-Instance: public net",
            " GigabitEthernet1/0/0:",
            "  Total 1 MLD entry",
            "   Group Address    Source Address   Expires   ",
            "   FF25::1          2001:db8:1::1    never"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf static is specified, the command displays only information about MLD groups that hosts statically join. Otherwise, the command displays information about all MLD groups that hosts join.\nIf both static and verbose are specified, the command displays detailed information about MLD groups that hosts statically join."
}