{
    "PageTitle": "query ipsec sa",
    "FuncDef": "The query ipsec sa command globally specifies a security association (SA) using which interfaces authenticate sent and received MLD Query messages to implement IP Security (IPsec) authentication.\nThe undo query ipsec sa command restores the default configuration.\nBy default, no SA is specified globally, so that interfaces do not authenticate sent or received MLD Query messages.",
    "CLIs": [
        "query ipsec sa <sa-name>",
        "undo query ipsec sa"
    ],
    "ParentView": [
        "MLD view",
        "VPN instance MLD view"
    ],
    "ParaDef": [
        {
            "Parameters": "sa-name",
            "Info": "Specifies the name of an SA.\nIt is a string of 1 to 15 case-sensitive characters, spaces not supported. The characters can be letters or numbers, hyphens (-) not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast ipv6 routing-enable",
            "[*HUAWEI] ipsec sa sa1",
            "[*HUAWEI-ipsec-sa-sa1] quit",
            "[*HUAWEI] mld",
            "[*HUAWEI-mld] query ipsec sa sa1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn a multicast network, forged MLD Query messages may be used to attack devices, causing devices unable to forward multicast traffic. To protect a device against attacks launched using forged MLD Query messages, run the query ipsec sa command to configure the device to authenticate sent and received MLD Query messages based on a specified SA.\nThe query ipsec sa command configuration enables interfaces to authenticate only MLD Query messages.\nPrerequisites\nThe multicast routing function has been enabled using the multicast ipv6 routing-enable command.Basic IPsec functions have been configured.\n\nPrecautions\nIf the query ipsec sa command is run more than once, the latest configuration overrides the previous one. If the query ipsec sa and ipsec sa commands are both configured, the command configured later overrides the command configured earlier.\nThe function of this command is the same as that of the mld query ipsec sa command used in the interface view. The configuration in the MLD view is used only when the configuration in the interface view is not available."
}