{
    "PageTitle": "adaptation-rule",
    "FuncDef": "This command can be used to override specific attributes of the specified queue s adaptation rule parameters. The adaptation rule controls the method used by the system to derive the operational CIR and PIR settings when the queue is provisioned in hardware. For the CIR and PIR parameters individually, the system attempts to find the best operational rate depending on the defined constraint.",
    "CLIs": [
        "adaptation-rule [ pir adaptation-rule ] [ cir adaptation-rule ]",
        "no adaption-rule"
    ],
    "ParentView": [
        "config>service>apipe>sap>egress>queue-override>queue",
        "config>service>apipe>sap>ingress>queue-override>queue",
        "config>service>epipe>sap>egress>queue-override>queue",
        "config>service>epipe>sap>ingress>queue-override>queue",
        "config>service>fpipe>sap>egress>queue-override>queue",
        "config>service>fpipe>sap>ingress>queue-override>queue",
        "config>service>ipipe>sap>egress>queue-override>queue",
        "config>service>ipipe>sap>ingress>queue-override>queue"
    ],
    "ParaDef": [
        {
            "Parameters": "pir",
            "Info": "The pir parameter defines the constraints enforced when adapting the PIR rate defined within the queue queue-id rate command. The pir parameter requires a qualifier that defines the constraint used when deriving the operational PIR for the queue. When the rate command is not specified, the default applies."
        },
        {
            "Parameters": "cir",
            "Info": "The cir parameter defines the constraints enforced when adapting the CIR rate defined within the queue queue-id rate command. The cir parameter requires a qualifier that defines the constraint used when deriving the operational CIR for the queue. When the cir parameter is not specified, the default constraint applies."
        },
        {
            "Parameters": "adaptation-rule",
            "Info": "Specifies the criteria to use to compute the operational CIR and PIR values for this queue, while maintaining a minimum offset. Values-max - The max (maximum) keyword is mutually exclusive with the min and closest options. When max is defined, the operational PIR for the queue will be equal to or less than the administrative rate specified using the rate command.."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: no adaptation-rule"
}