{
    "PageTitle": "cpipe",
    "FuncDef": "This command configures a Circuit Emulation Services instance.",
    "CLIs": [
        "cpipe <service-id> [ customer <customer-id> ] [ vpn <vpn-id> ] [ vc-type { satop-e1 | satop-t1 | [ vc-switching ] | cesopsn | cesopsn-cas } ] [ vc-switching ] [ test ] [ create ] [ name <name> ]",
        "no cpipe <service-id>"
    ],
    "ParentView": [
        "config>service"
    ],
    "ParaDef": [
        {
            "Parameters": "service-id",
            "Info": "The unique service identification number or string identifying the service in the service domain. This ID must be unique to this service and may not be used for any other service of any type. The service-id must be the same number used for every router on which this service is defined. Values-service-id: 1 to 2147483647."
        },
        {
            "Parameters": "customer-id",
            "Info": "Specifies the customer ID number to be associated with the service. This parameter is required on service creation and optional for service editing or deleting. Values-1 to 2147483647."
        },
        {
            "Parameters": "vpn vpn-id",
            "Info": "Specifies the VPN ID number which allows you to identify virtual private networks (VPNs) by a VPN ID. If this parameter is not specified, the VPN ID uses the same service ID number. Values-1 to 2147483647. ParamDefault: Default- null (0)"
        },
        {
            "Parameters": "vc-type",
            "Info": "The vc-type defines the type of unstructured or structured circuit emulation service to be configured. Values-satop-e1: Unstructured E1 circuit emulation service.. ParamDefault: Default- satop-e1"
        },
        {
            "Parameters": "vc-switching",
            "Info": "Specifies if the pseudowire switching signaling is used for the spoke SDPs configured in this service."
        },
        {
            "Parameters": "test",
            "Info": "Specifies a unique test service type for the service context which will contain only a SAP configuration. The test service can be used to test the throughput and performance of a path for MPLS-TP PWs. This parameter applies to the 7450 ESS and 7750 SR only."
        },
        {
            "Parameters": "create",
            "Info": "Keyword used to create the service. The create keyword requirement can be enabled/disabled in the environment>create context."
        },
        {
            "Parameters": "name name",
            "Info": "Configures an optional service name identifier, up to 64 characters, to a given service. This service name can then be used in configuration references, display, and show commands throughout the system. A defined service name can help the service provider or administrator to identify and manage services within the SR OS platforms. Values-name:\t\t up to 64 characters."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}