{
    "PageTitle": "fpipe",
    "FuncDef": "This command configures an Fpipe service. An Fpipe provides a point-to-point L2 VPN connection to a remote SAP or to another local SAP. An Fpipe connects only Frame Relay endpoints either locally or over a PSN to a remote endpoint of the same type.",
    "CLIs": [
        "fpipe <service-id> [ customer <customer-id> ] [ create ] [ vpn <vpn-id> ] [ vc-type <fr-dlci> ] [ vc-switching ] [ name <name> ]",
        "no fpipe <service-id>"
    ],
    "ParentView": [
        "config>service"
    ],
    "ParaDef": [
        {
            "Parameters": "service-id",
            "Info": "The unique service identification number or string identifying the service in the service domain. This ID must be unique to this service and may not be used for any other service of any type. The service-id must be the same number used for every 7750 SR on which this service is defined. Values-service-id: 1 to 2147483647."
        },
        {
            "Parameters": "customer-id",
            "Info": "Specifies the customer ID number to be associated with the service. This parameter is required on service creation and optional for service editing or deleting. Values-1 to 2147483647."
        },
        {
            "Parameters": "vpn vpn-id",
            "Info": "Specifies the VPN ID number which allows you to identify virtual private networks (VPNs) by a VPN identification number. Values-1 to 2147483647. ParamDefault: Default- null (0)"
        },
        {
            "Parameters": "vc-type",
            "Info": "Specifies a 15 bit value that defines the type of the VC signaled to the peer. Its values are defined in draft-ietf-pwe3-iana-allocation and it defines both the signaled VC type as well as the resulting datapath encapsulation over the Apipe. Values-fr-dlci."
        },
        {
            "Parameters": "vc-switching",
            "Info": "Specifies if the pseudowire switching signaling is used for the spoke SDPs configured in this service."
        },
        {
            "Parameters": "name name",
            "Info": "Configures an optional service name identifier, up to 64 characters, to a given service. This service name can then be used in configuration references, display, and show commands throughout the system. A defined service name can help the service provider or administrator to identify and manage services within the SR OS platforms. Values-name:\t\t up to 64 characters."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}