{
    "PageTitle": "mip",
    "FuncDef": "This command allows Maintenance Intermediate Points (MIPs). The creation rules of the MIP are dependent on the mhf-creation configuration for the MA.",
    "CLIs": [
        "mip [ mac <mac-address> ] [ primary-vlan-enable <vlan-id> ]",
        "mip default-mac [ primary-vlan-enable <vlan-id> ]",
        "no mip"
    ],
    "ParentView": [
        "config>service>epipe>sap>eth-cfm",
        "config>service>epipe>spoke-sdp>eth-cfm"
    ],
    "ParaDef": [
        {
            "Parameters": "mac",
            "Info": "Provides a method for manually configuring the MIP MAC address."
        },
        {
            "Parameters": "mac-address",
            "Info": "Specifies the MAC address of the MIP. Values-6-byte mac-address in the form of xx:xx:xx:xx:xx:xx or xx-xx-xx-xx-xx-xx of the MIP. The MAC address must be unicast. Using the all-zeros address is equivalent to the no form of this command.."
        },
        {
            "Parameters": "default-mac",
            "Info": "Using the no command deletes the MIP. This parameter should be used if the operator wants to change the MAC address back to the default MAC without having to delete and reconfigure the MIP."
        },
        {
            "Parameters": "primary-vlan-enable",
            "Info": "Provides a method for linking the MIP with the primary VLAN configured under the bridge-identifier for the MA. This is only allowed if the mhf-creation method is static. MIPs cannot be changed from or to primary VLAN functions without first being deleted. This must be configured as part of the creation step and can only be changed by deleting the MIP and re-creating it. Primary VLANs are only supported under Layer 2 Epipe and VPLS services."
        },
        {
            "Parameters": "vlan-id",
            "Info": "Must match the VLAN id under the bridge-identifier for the MA that is appropriate for this service. Values-0 to 4094."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: no mip"
}