{
    "PageTitle": "policer-control-policy",
    "FuncDef": "This command, within the QoS CLI node, is used to create, delete or modify policer control policies. A policer control policy is very similar to the scheduler-policy which is used to manage a set of queues by defining a hierarchy of virtual schedulers and specifying how the virtual schedulers interact to provide an aggregate SLA. In a similar fashion, the policer-control-policy controls the aggregate bandwidth available to a set of child policers. Once created, the policy can be applied to ingress or egress SAPs.",
    "CLIs": [
        "policer-control-policy <policy-name>",
        "no policer-control-policy"
    ],
    "ParentView": [
        "config>service>apipe>sap>egress",
        "config>service>apipe>sap>ingress",
        "config>service>cpipe>sap>egress",
        "config>service>cpipe>sap>ingress",
        "config>service>epipe>sap>egress",
        "config>service>epipe>sap>ingress",
        "config>service>fpipe>sap>egress",
        "config>service>fpipe>sap>ingress",
        "config>service>ipipe>sap>egress",
        "config>service>ipipe>sap>ingress"
    ],
    "ParaDef": [
        {
            "Parameters": "policy-name",
            "Info": "Each policer-control-policy must be created with a unique policy name. The name given as policy-name must adhere to the system policy ASCII naming requirements. If the defined policy-name already exists, the system will enter that policy s context for editing purposes. If policy-name does not exist, the system will attempt to create a policy with the specified name. Creating a policy may require use of the create parameter when the system is configured for explicit object creation mode."
        },
        {
            "Parameters": "create",
            "Info": "The keyword is required when a new policy is being created and the system is configured for explicit object creation mode."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: none"
}