{
    "PageTitle": "qos",
    "FuncDef": "This command associates a Quality of Service (QoS) policy with an ingress Service Access Point (SAP).",
    "CLIs": [
        "qos <policy-id> [ shared-queuing ] [ fp-redirect-group <queue-group-name> instance <instance-id> ]",
        "no qos"
    ],
    "ParentView": [
        "config>service>apipe>sap>ingress",
        "config>service>cpipe>sap>ingress",
        "config>service>epipe>sap>ingress",
        "config>service>fpipe>sap>ingress",
        "config>service>ipipe>sap>ingress"
    ],
    "ParaDef": [
        {
            "Parameters": "policy-id",
            "Info": "The ingress policy ID to associate with SAP or IP interface on ingress. The policy ID must already exist. Values-1 to 65535."
        },
        {
            "Parameters": "shared-queuing",
            "Info": "This keyword can only be specified on SAP ingress. The shared-queuing keyword specifies the shared queue policy will be used by this SAP. When the value of this object is null, the SAP will use individual ingress QoS queues, instead of the shared ones."
        },
        {
            "Parameters": "fp-redirect-group",
            "Info": "This keyword can only be used on SAP ingress and associates a SAP ingress with an instance of a named queue group template on the ingress forwarding plane of a specified IOM/IMM/XMA. The queue-group-name and instance instance-id are mandatory parameters when executing the command."
        },
        {
            "Parameters": "queue-group-name",
            "Info": "Specifies the name of the queue group to be instance on the forwarding plane of the IOM/IMM/XMA, up to 32 characters in length. The queue-group-name must correspond to a valid ingress forwarding plane queue group, created under config>card>fp>ingress>access."
        },
        {
            "Parameters": "instance-id",
            "Info": "Specifies the instance of the named queue group on the IOM/IMM/XMA ingress forwarding plane."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: none"
}