{
    "PageTitle": "scheduler",
    "FuncDef": "This command can be used to override specific attributes of the specified scheduler name. A scheduler defines bandwidth controls that limit each child (other schedulers, policers, and queues) associated with the scheduler. Scheduler objects are created within the hierarchical tiers of the policy. It is assumed that each scheduler created will have policers, queues or other schedulers defined as child associations. The scheduler can be a child which takes bandwidth from a scheduler in a higher tier. A total of 32 schedulers can be created within a single scheduler policy with no restriction on the distribution between the tiers.",
    "CLIs": [
        "scheduler <scheduler-name> [ create ]",
        "no scheduler <scheduler-name>"
    ],
    "ParentView": [
        "config>service>apipe>sap>egress>sched-override",
        "config>service>apipe>sap>ingress>sched-override",
        "config>service>cpipe>sap>egress>sched-override",
        "config>service>cpipe>sap>ingress>sched-override",
        "config>service>epipe>sap>egress>sched-override",
        "config>service>epipe>sap>ingress>sched-override",
        "config>service>fpipe>sap>egress>sched-override",
        "config>service>fpipe>sap>ingress>sched-override",
        "config>service>ipipe>sap>egress>sched-override",
        "config>service>ipipe>sap>ingress>sched-override"
    ],
    "ParaDef": [
        {
            "Parameters": "scheduler-name",
            "Info": "The name of the scheduler. Values-Valid names consist of any string up to 32 characters long composed of printable, 7-bit ASCII characters. If the string contains special characters (#, $, spaces, and so on), the entire string must be enclosed within double quotes.. ParamDefault: Default- None. Each scheduler must be explicitly created."
        },
        {
            "Parameters": "create",
            "Info": "This optional keyword explicitly specifies that it is acceptable to create a scheduler with the given scheduler-name. If the create keyword is omitted, scheduler-name is not created when the system environment variable create is set to true. This safeguard is meant to avoid accidental creation of system objects (such as schedulers) while attempting to edit an object with a mistyped name or ID. The keyword has no effect when the object already exists."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}