{
    "PageTitle": "spoke-sdp",
    "FuncDef": "This command binds a service to an existing Service Distribution Point (SDP). A spoke SDP is treated like the equivalent of a traditional bridge \"port\" where flooded traffic received on the spoke SDP is replicated on all other \"ports\" (other spoke and mesh SDPs or SAPs) and not transmitted on the port it was received.",
    "CLIs": [
        "spoke-sdp <sdp-id> [ <:vc-id> ] [ vc-type { ether | vlan } ] [ create ] [ no-endpoint ]",
        "spoke-sdp <sdp-id> [ <:vc-id> ] [ vc-type { ether | vlan } ] [ create ] endpoint <endpoint-name> [ icb ]",
        "no spoke-sdp <sdp-id> [ <:vc-id> ]"
    ],
    "ParentView": [
        "config>service>epipe"
    ],
    "ParaDef": [
        {
            "Parameters": "sdp-id",
            "Info": "The SDP identifier. Values-1 to 17407."
        },
        {
            "Parameters": "vc-id",
            "Info": "The virtual circuit identifier. The VC-ID is not used with L2TPv3 SDPs or L2oGRE tunnels, however it must be configured. Values-1 to 4294967295."
        },
        {
            "Parameters": "vc-type",
            "Info": "This command overrides the default VC type signaled for the spoke or mesh binding to the far end of the SDP. The VC type is a 15 bit-quantity containing a value which represents the type of VC. The actual signaling of the VC type depends on the signaling parameter defined for the SDP. If signaling is disabled, the vc-type command can still be used to define the dot1q value expected by the far-end provider equipment. A change of the bindings VC type causes the binding to signal the new VC type to the far end when signaling is enabled. Values-ethernet."
        },
        {
            "Parameters": "ether",
            "Info": "Defines the VC type as Ethernet. The ethernet and vlan keywords are mutually exclusive. When the VC type is not defined then the default is Ethernet for spoke SDP bindings. Defining Ethernet is the same as executing no vc-type and restores the default VC type for the spoke SDP binding."
        },
        {
            "Parameters": "vlan",
            "Info": "Defines the VC type as VLAN. The top VLAN tag, if a VLAN tag is present, is stripped from traffic received on the pseudowire, and a VLAN tag is inserted when forwarding into the pseudowire. The ethernet and vlan keywords are mutually exclusive. When the VC type is not defined then the default is Ethernet for spoke SDP bindings."
        },
        {
            "Parameters": "no-endpoint",
            "Info": "Removes the association of a spoke SDP with an explicit endpoint name."
        },
        {
            "Parameters": "endpoint-name",
            "Info": "Specifies the name of the service endpoint."
        },
        {
            "Parameters": "icb",
            "Info": "Configures the spoke SDP as an inter-chassis backup SDP binding."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: No sdp-id is bound to a service."
}