{
    "PageTitle": "rip authentication-mode md5",
    "FuncDef": "The rip authentication-mode md5 command sets the authentication mode to MD5 authentication mode.\nThe undo rip authentication-mode md5 command deletes the configured authentication mode.\nBy default, authentication for RIP-2 is disabled on an interface. Configuring authentication is recommended to ensure system security.",
    "CLIs": [
        "rip authentication-mode md5 nonstandard keychain <keychain-name>",
        "undo rip authentication-mode md5 nonstandard keychain"
    ],
    "ParentView": [
        "Tunnel interface view",
        "VBDIF interface view",
        "FlexE interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "100GE interface view",
        "GE electrical interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "GMPLS-UNI interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Eth-Trunk interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "md5",
            "Info": "Indicates the Message Digest version 5 (MD5) authentication mode.\nFor the sake of security, using the HMAC-SHA256 algorithm rather than the MD5 algorithm is recommended.\n-"
        },
        {
            "Parameters": "nonstandard",
            "Info": "Indicates that the packet for MD5 ciphertext authentication is in the nonstandard format (IETF standard).\n-"
        },
        {
            "Parameters": "keychain keychain-name",
            "Info": "Specifies a keychain name.\nBefore configuring this parameter, run the keychain command to create a keychain. Then, run the key-id, key-string, and algorithm commands to configure a key ID, a password, and an authentication algorithm for this keychain. Otherwise, the authentication will fail.\nIf the dependent keychain is deleted, the neighbor relationship may be interrupted. Therefore, exercise caution when deleting the keychain.\nThe value is a string of 1 to 47 case-insensitive characters.\nA password cannot contain a question mark (?), but can contain spaces if surrounded by double quotation marks (\"\"). In this case, the double quotation marks are part of the password."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] rip authentication-mode md5 nonstandard keychain abcDEF-13579"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo ensure network security, you can enable a router to authenticate received packets based on the pre-defined authentication mode or add authentication information to the packets to be sent. Only the packets that are authenticated can be forwarded on the network.\nThe rip authentication-mode command enables the local interface to discard all the RIP packets with authentication passwords that are different from the one set using this command. You can also enable the interface to add the set authentication password to all the Hello packets to be sent."
}