{
    "PageTitle": "timers rip triggered",
    "FuncDef": "The timers rip triggered command sets the value of the triggered timer.\nThe undo timers rip triggered command disables the triggered timer or restores the default value of the triggered timer.\nBy default, the triggered timer is disabled.",
    "CLIs": [
        "timers rip triggered { minimum-interval <minimum-interval> | incremental-interval <incremental-interval> | maximum-interval <maximum-interval> } *",
        "undo timers rip triggered [ minimum-interval [ minimum-interval ] | incremental-interval [ incremental-interval ] | maximum-interval [ maximum-interval ] ] *"
    ],
    "ParentView": [
        "RIP view"
    ],
    "ParaDef": [
        {
            "Parameters": "minimum-interval minimum-interval",
            "Info": "Specifies the minimum interval for triggering Update packets.\nThe value is an integer ranging from 100 to 5000, in milliseconds. The default value is 100."
        },
        {
            "Parameters": "incremental-interval incremental-interval",
            "Info": "Specifies the incremental interval for triggering Update packets.\nThe value is an integer ranging from 100 to 1000, in milliseconds. The default value is 100."
        },
        {
            "Parameters": "maximum-interval maximum-interval",
            "Info": "Specifies the maximum interval for triggering Update packets.\nThe value is an integer ranging from 200 to 5000, in milliseconds. The default value is 5000."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] rip 1",
            "[*HUAWEI-rip-1] timers rip triggered minimum-interval 1000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn a stable network, you can set a large value for the triggered timer. On a network whose topology frequently changes, do not set the value of the triggered timer too small; otherwise devices will send Update packets frequently.\nConfiguration Impact\nIf the timers rip triggered command is run more than once, the latest configuration overrides the previous one.\nPrecautions\nIf you run the undo timers rip triggered command without specifying other parameters(or all parameters), the triggered timer is disabled. If you specify other parameters(do not specify all parameters), it means that the triggered timer is still turned on, but the specified parameter value is restored to the default value."
}