{
    "PageTitle": "timers rip",
    "FuncDef": "The timers rip command sets RIP timer values.\nThe undo timers rip command restores the default RIP timers.\nThe timers rip  command is a configuration recovery command, which takes effect only when the configuration is recovered.\nBy default, timers adopt default values.",
    "CLIs": [
        "timers rip <update> <age> <suppress> <garbage-collect>",
        "undo timers rip"
    ],
    "ParentView": [
        "RIP view"
    ],
    "ParaDef": [
        {
            "Parameters": "update",
            "Info": "Specifies the interval at which Update packets are sent.\nThe value is an integer ranging from 1 to 86400, in seconds. The default value is 30."
        },
        {
            "Parameters": "age",
            "Info": "Specifies the aging time of a route.\nThe value is an integer ranging from 1 to 86400, in seconds. The default value is 180."
        },
        {
            "Parameters": "suppress",
            "Info": "Specifies the period in which the optimal route is suppressed from being advertised.\nThe value is an integer ranging from 0 to 86400, in seconds. It is set to 0 in the current version."
        },
        {
            "Parameters": "garbage-collect",
            "Info": "Specifies the time for deleting a route from the routing table (the garbage collection time defined in the standard).\nThe value is an integer ranging from 1 to 86400, in seconds. The default value is 120."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] rip 100",
            "[*HUAWEI-rip-1] timers rip 60 180 0 120"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo adjust RIP timers, run the timers rip command, which improves routing protocol performance.\nThe relationship between the values of the four timers is: update < age and suppress < garbage-collect. For example, if the value of the update timer is larger than that of the age timer, a device cannot inform its neighbors whether RIP routes change during the update time.\nPrecautions\nIf the values of the four timers are set improperly, routes will become unstable and route convergence will slow down. Generally, the four timers adopt the default values."
}