{
    "PageTitle": "summary (RIP view)",
    "FuncDef": "The summary command enables RIP classful summarization. The summarized routes are advertised in the form of a natural mask.\nThe undo summary command cancels the classful summarization so that subnet routes can be advertised and that subnets can communicate with each other.\nBy default, RIP-2 enables classful summarization.",
    "CLIs": [
        "summary",
        "summary always",
        "undo summary",
        "undo summary always"
    ],
    "ParentView": [
        "RIP view"
    ],
    "ParaDef": [
        {
            "Parameters": "always",
            "Info": "Indicates that RIP classful summarization takes effect, regardless of whether split horizon or poison reverse is configured.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] rip 1",
            "[*HUAWEI-rip-1] summary"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] rip 1",
            "[*HUAWEI-rip-1] summary always"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn large-scale RIP networks, storing routing entries consumes a large number of memory resources, and transmitting and processing routes consume lots of network resources. RIP-2 classful summarization can address this problem. Route summarization allows multiple routes with the same IP prefix and destination IP address to be summarized into one, which reduces the number of routing entries and improves scalability and efficiency of large-scale networks.\nIf poison reverse has been enabled using the rip poison-reverse command or split horizon has been enabled using the rip split-horizon command, the default classful summarization function does not take effect. In this situation, run the summary always command to re-enable this function.\nPrerequisites\nA RIP process has been created and the RIP view has been displayed using the rip command.\nPrecautions\nClassful summarization does not take effect in RIP-1.\nRoute summarization configured on an interface takes precedence over that configured in the RIP process. The rip summary-address command takes precedence over the summary command."
}