{
    "PageTitle": "rip bfd static",
    "FuncDef": "The rip bfd static command enables static BFD on a specified RIP interface.\nThe undo rip bfd static command disables static BFD from a specified RIP interface.\nBy default, static BFD is disabled on a RIP interface.",
    "CLIs": [
        "rip bfd static",
        "undo rip bfd static"
    ],
    "ParentView": [
        "Tunnel interface view",
        "FlexE interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "100GE interface view",
        "GE electrical interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "GMPLS-UNI interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Eth-Trunk interface view",
        "POS interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] rip bfd static"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nRIP-capable devices detect neighbor status by exchanging Update packets periodically. By default, a local device cannot detect a link failure until 180s after the link failure occurs. During this period, carriers or users may suffer the loss of a large number of packets, which cannot meet the requirements for high reliability on networks running high-speed data services. To address this problem, configure BFD.\nThe rip bfd static command enables static BFD on a specified RIP-capable interface, which speeds up link fault detection.\nThis command also enables one-arm BFD on a device supporting BFD to create a BFD session with another device that does not support BFD.\nPrerequisites\nBFD has been enabled using the bfd command.\nPrecautions\nThe rip bfd block, rip bfd enable, and rip bfd static commands are mutually exclusive. The latest configuration overrides the previous one.\nIf the command is run, the existing BFD configuration mode will be changed."
}