{
    "PageTitle": "silent-interface (RIP view)",
    "FuncDef": "The silent-interface command enables an interface to receive RIP packets to update its routing table but disables it from sending RIP packets.\nThe undo silent-interface command re-enables an interface to send updated packets.\nBy default, an interface is not suppressed.",
    "CLIs": [
        "silent-interface [ disable ] { <interface-type> <interface-number> | <interface-name> }",
        "undo silent-interface { <interface-type> <interface-number> | <interface-name> }",
        "undo silent-interface disable { <interface-type> <interface-number> | <interface-name> }"
    ],
    "ParentView": [
        "RIP view"
    ],
    "ParaDef": [
        {
            "Parameters": "disable",
            "Info": "Enables interfaces to send RIP packets.\n-"
        },
        {
            "Parameters": "interface-type",
            "Info": "Specifies the type of an interface.\n-"
        },
        {
            "Parameters": "interface-number",
            "Info": "Specifies the number of an interface.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] rip 100",
            "[*HUAWEI-rip-100] silent-interface GigabitEthernet 1/0/0",
            "[*HUAWEI-rip-100] peer 10.1.1.1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] rip 100",
            "[*HUAWEI-rip-100] silent-interface all",
            "[*HUAWEI-rip-100] silent-interface disable GigabitEthernet 1/0/0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen a device running RIP is connected to a network running other routing protocols, you can run the silent-interface command on the interface that connects the device to the network to prevent the interface from sending useless packets to the network.\nIf you want a small number of interfaces to broadcast or multicast RIP packets, you can run the silent-interface all command first to prevent all interfaces from broadcasting or multicasting RIP packets and then run the silent-interface disable interface-type interface-number command to re-enable the small number of interfaces to broadcast or multicast RIP packets.\nYou can run the silent-interface and peer (RIP) commands to advertise routes to a specified device.\nPrecautions\nThe silent-interface command that is run in a RIP process takes precedence over the rip input or rip output command that is run on an interface."
}