{
    "PageTitle": "address",
    "FuncDef": "This command configures the local subscriber subnets available on a subscriber IP interface. The configured ip-address and mask define the address space associated with the subscriber subnet. Up to 16 IP subnets can be created on a single subscriber IP interface. Each subnet supports a locally owned IP host address within the subnet that is not expected to appear on other routers that may be servicing the same subscriber subnet. For redundancy purposes, the keywordgw-addressdefines a separate IP address within the subnet for Subscriber Routed Redundancy Protocol (SRRP) routing. This IP address must be the same on the local and remote routers participating in a common SRRP instance.",
    "CLIs": [
        "address { <ip-address/mask> | <ip-address> <netmask> } [ gw-ip-address <ip-address> ] [ populate-host-routes ] [ track-srrp <srrp-instance> [ holdup-time <msecs> ] ]",
        "no address { <ip-address/mask> | <ip-address> <netmask> } [ gw-ip-address <ip-address> ] [ populate-host-routes ] [ track-srrp <srrp-instance> [ holdup-time <msecs> ] ]"
    ],
    "ParentView": [
        "config>service>vprn>subscriber-interface"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address/mask | ip-address netmask",
            "Info": "Specifies the address space associated with the subscriber subnet."
        },
        {
            "Parameters": "gw-ip-address ip-address",
            "Info": "Specifies a separate IP address within the subnet for SRRP routing purposes. This parameter must be followed by a valid IP interface that exists within the subscriber subnet created by the address command. The defined gateway IP address cannot currently exist as a subscriber host (static or dynamic). If the defined ip-address already exists as a subscriber host address, the address command fails. The specified ip-address must be unique within the system."
        },
        {
            "Parameters": "populate-host-routes",
            "Info": "Specifies to populate subscriber-host routes in local FIB. Storing them in FIB benefits topologies only where the external router advertises more specific routes than the one corresponding to locally configured subscriber-interface subnets."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}