{
    "PageTitle": "authentication-key",
    "FuncDef": "This command sets the authentication key-id, type and key used to authenticate NTP PDUs sent by the broadcast server function toward external clients or to authenticate NTP PDUs received from external unicast clients within the VPRN routing instance. For authentication to work, the authentication key-id, type, and key value must match.",
    "CLIs": [
        "authentication-key <key-id> { key <key> } [ hash | hash2 ] type { des | message-digest }",
        "no authentication-key <key-id>"
    ],
    "ParentView": [
        "config>service>vprn>ntp"
    ],
    "ParaDef": [
        {
            "Parameters": "key-id",
            "Info": "Configure the authentication key-id that will be used by the node when transmitting or receiving Network Time Protocol packets. Values-1 to 255."
        },
        {
            "Parameters": "key",
            "Info": "The authentication key associated with the configured key-id, the value configured in this parameter is the actual value used by other network elements to authenticate the NTP packet."
        },
        {
            "Parameters": "hash",
            "Info": "Specifies the key is entered in an encrypted form. If the hash or hash2 parameter is not used, the key is assumed to be in an unencrypted, clear text form. For security, all keys are stored in encrypted form in the configuration file with the hash or hash2 parameter specified."
        },
        {
            "Parameters": "hash2",
            "Info": "Specifies the key is entered in a more complex encrypted form that involves more variables than the key value alone, meaning that the hash2 encrypted variable cannot be copied and pasted. If the hash or hash2 parameter is not used, the key is assumed to be in an unencrypted, clear text form. For security, all keys are stored in encrypted form in the configuration file with the hash or hash2 parameter specified."
        },
        {
            "Parameters": "type",
            "Info": "This parameter determines if DES or message-digest authentication is used. Values-des - Specifies that DES authentication is used for this key. The des value is not supported in FIPS-140-2 mode.."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}