{
    "PageTitle": "community",
    "FuncDef": "This command sets the SNMP community name(s) to be used with the associated VPRN instance. These VPRN community names are used to associate SNMP v1/v2c requests with a particular vprn context and to return a reply that contains VPRN-specific data or limit SNMP access to data in a specific VPRN instance.",
    "CLIs": [
        "community <community-name> [ hash | hash2 ] [ access-permissions ] [ version <SNMP-version> ] [ src-access-list list-name ]",
        "no community [ <community-name> ]"
    ],
    "ParentView": [
        "config>service>vprn>snmp"
    ],
    "ParaDef": [
        {
            "Parameters": "community-name",
            "Info": "Specifies the SNMP v1/v2c community name. This is a secret/confidential key used to access SNMP and specify a context (base vs vprn1 vs vprn2)."
        },
        {
            "Parameters": "hash",
            "Info": "Specifies the key is entered in an encrypted form. If the hash or hash2 parameter is not used, the key is assumed to be in an unencrypted, clear text form. For security, all keys are stored in encrypted form in the configuration file with the hash or hash2 parameter specified."
        },
        {
            "Parameters": "hash2",
            "Info": "Specifies the key is entered in a more complex encrypted form that involves more variables than the key value alone, meaning that the hash2 encrypted variable cannot be copied and pasted. If the hash or hash2 parameter is not used, the key is assumed to be in an unencrypted, clear text form. For security, all keys are stored in encrypted form in the configuration file with the hash or hash2 parameter specified."
        },
        {
            "Parameters": "version SNMP-version",
            "Info": "Specifies the SNMP version. Values-v1, v2c, both."
        },
        {
            "Parameters": "access-permissions",
            "Info": "Specifies the access rights to MIB objects. Values-r - Grants only read access to MIB objects. Creates an association of the community-name with the snmp-vprn-ro access group.\nrw - Grants read and write access to MIB objects. Creates an association of the community-name with the snmp-vprn access group.."
        },
        {
            "Parameters": "list-name",
            "Info": "Configures the community to reference a specific src-access-list (created under configure system security snmp), which will be used to validate the source IP address of all received SNMP requests that use this community. Multiple community (vprn or base router) and usm-community instances can reference the same src-access-list."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}