{
    "PageTitle": "monitor-oper-group",
    "FuncDef": "This command configures PIM to monitor the state of an operational group to provide a redundancy mechanism. PIM monitors the operational group and changes its DR priority to the specified value when the status of the operational group is up. This enables the router to become the PIM DR only when the operational group is up. If the operational group status changes to down, PIM changes its DR priority to the default or the value configured withpriorityunderconfig>service>vprn>pim>if. Theoper-groupgroup-namemust already be configured under theconfig>servicecontext before its name is referenced in this command. Two operational groups are supported per PIM interface.",
    "CLIs": [
        "monitor-oper-group <group-name> family { ipv4 | ipv6 } { add | set | subtract } <value>",
        "no monitor-oper-group [ family { ipv4 | ipv6 } ]"
    ],
    "ParentView": [
        "config>service>vprn>pim>if"
    ],
    "ParaDef": [
        {
            "Parameters": "group-name",
            "Info": "Specifies the operational group identifier up to 32 characters in length."
        },
        {
            "Parameters": "family",
            "Info": "Specifies the address family."
        },
        {
            "Parameters": "ipv4",
            "Info": "Specifies the IPv4 designated router priority."
        },
        {
            "Parameters": "ipv6",
            "Info": "Specifies the IPv6 designated router priority."
        },
        {
            "Parameters": "add",
            "Info": "Specifies that the value is to be added to the existing priority to become the designated router."
        },
        {
            "Parameters": "subtract",
            "Info": "Specifies that the value is to be subtracted from the existing priority to become the designated router."
        },
        {
            "Parameters": "set",
            "Info": "Specifies the priority to become the designated router."
        },
        {
            "Parameters": "value",
            "Info": "Specifies the priority modifier expressed as a decimal integer. Values-1 to 4294967295."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}