{
    "PageTitle": "prefix",
    "FuncDef": "This command allows a list of prefixes (using the prefix command multiple times) to be routed to hosts associated with this pool. Each prefix will be represented in the associated FIB with a reference to the pool. Prefixes are defined as being for prefix delegation (pd) or use on a WAN interface or host (wan-host).",
    "CLIs": [
        "prefix <ipv6-address/prefix-length> [ failover { local | remote | access-driven } ] [ pd ] [ wan-host ] [ create ]",
        "no prefix <ipv6-address/prefix-length>"
    ],
    "ParentView": [
        "config>router>dhcp6>server>pool",
        "config>service>vprn>dhcp6>server>pool"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv6-address",
            "Info": "Specifies the 128-bit IPv6 address. Values-128-bit hexadecimal IPv6 address in compressed form."
        },
        {
            "Parameters": "prefix-length",
            "Info": "Specifies the length of any associated aggregate prefix. Values-32 to 63."
        },
        {
            "Parameters": "failover",
            "Info": "This command designates a IPv6 prefix as local, remote or access-driven. This is used when multi-chassis synchronization is enabled."
        },
        {
            "Parameters": "local",
            "Info": "An IPv6 prefix designated as local is used for new lease grants or to renew the existing lease grants. Local prefix designation should be always paired with the remote designation of the same prefix on the peering node."
        },
        {
            "Parameters": "remote",
            "Info": "An IPv6 prefix designated as remote is used only to renew the existing DHCP leases. The new leases will be delegated from it only after the maximum-client-lead-time + partner-down-delay time elapses. At that point we say that the remote IPv6 prefix has been taken over."
        },
        {
            "Parameters": "access-driven",
            "Info": "An IPv4 prefix designated as access-driven is used for new lease grants or to renew the existing lease grants regardless of the state of the intercommunication link (operational or failed). In this mode of operation the IPv6 prefix is actively shared between the two DHCPv6 server nodes. This can be used on both DHCPv6 servers only in cases where the access protection mechanism (SRRP or MC-LAG) will ensure that there is only a single active path for DHCPv6 clients using the same IPv6 prefix available to one of the redundant DHCPv6 nodes."
        },
        {
            "Parameters": "pd",
            "Info": "Specifies that this aggregate is used by IPv6 ESM hosts for DHCPv6 prefix-delegation."
        },
        {
            "Parameters": "wan-host",
            "Info": "Specifies that this aggregate is used by IPv6 ESM hosts for local addressing or by a routing gateway s WAN interface."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: failover local"
}