{
    "PageTitle": "qos",
    "FuncDef": "This command associates a network Quality of Service (QoS) policy with a network IP interface. Only one network QoS policy can be associated with an IP interface at one time. Attempts to associate a second QoS policy return an error.",
    "CLIs": [
        "qos <network-policy-id> port-redirect-group <queue-group-name> egress-instance <instance-id> fp- redirect-group <queue-group-name> ingress-instance <instance-id>",
        "no qos"
    ],
    "ParentView": [
        "config>service>vprn>nw-if"
    ],
    "ParaDef": [
        {
            "Parameters": "network-policy-id",
            "Info": "An existing network policy ID to associate with the IP interface. Values-1 to 65535."
        },
        {
            "Parameters": "port-redirect-group queue-group-name",
            "Info": "This optional parameter specifies the egress queue-group used for all egress forwarding-class redirections specified within the network QoS policy ID. The specified queue-group-name must exist as an egress queue group applied to the egress context of the port associated with the IP interface."
        },
        {
            "Parameters": "egress-instance instance-id",
            "Info": "Since multiple instances of the same egress queue-group can be applied to the same port this optional parameter is used to specify which particular instance to associate with this particular network IP interface. Values-1 to 16384."
        },
        {
            "Parameters": "fp- redirect-group queue-group-name",
            "Info": "This optional parameter specifies the ingress queue-group used for all ingress forwarding-class redirections specified within the network QoS policy ID. The specified queue-group-name must exist as an ingress queue group applied to the ingress context of the forwarding plane associated with the IP interface."
        },
        {
            "Parameters": "ingress-instance instance-id",
            "Info": "Since multiple instances of the same ingress queue-group can be applied to the same forwarding plane this parameter is required to specify which particular instance to associate with this particular network IP interface. Values-1 to 16384."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: no qos"
}