{
    "PageTitle": "secondary",
    "FuncDef": "This command assigns a secondary IP address to the interface. Up to 16 total primary and secondary IPv4 and IPv6 addresses can be assigned to network interfaces, and up to 256 to access interfaces. Each address can be configured in an IP address, IP subnet or broadcast address format.",
    "CLIs": [
        "secondary { <ip-address/mask> | <ip-address> <netmask> } [ broadcast all-ones | host-ones ] [ igp-inhibit ]",
        "no secondary { <ip-address/mask> | <ip-address> <netmask> }"
    ],
    "ParentView": [
        "config>service>vprn>if",
        "config>service>vprn>nw-if"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address",
            "Info": "The IP address of the IP interface. The ip-address portion of the address command specifies the IP host address that will be used by the IP interface within the subnet. This address must be unique within the subnet and specified in dotted decimal notation. Allowed values are IP addresses in the range 1.0.0.0 - 223.255.255.255 (with support of /31 subnets)."
        },
        {
            "Parameters": "mask",
            "Info": "The subnet mask in dotted decimal notation. When the IP prefix is not specified in CIDR notation, a space separates the ip-address from a traditional dotted decimal mask. The mask parameter indicates the complete mask that will be used in a logical  AND  function to derive the local subnet of the IP address. Allowed values are dotted decimal addresses in the range 128.0.0.0 - 255.255.255.252. A mask of 255.255.255.255 is reserved for system IP addresses."
        },
        {
            "Parameters": "netmask",
            "Info": "Specifies a string of 0s and 1s that mask or screen out the network part of an IP address so that only the host computer part of the address remains."
        },
        {
            "Parameters": "broadcast",
            "Info": "The optional broadcast parameter overrides the default broadcast address used by the IP interface when sourcing IP broadcasts on the IP interface. If no broadcast format is specified for the IP address, the default value is host-ones which indicates a subnet broadcast address. Use this parameter to change the broadcast address to all-ones or revert back to a broadcast address of host-ones."
        },
        {
            "Parameters": "all-ones",
            "Info": "The all-ones keyword following the broadcast parameter specifies the broadcast address used by the IP interface for this IP address will be 255.255.255.255, also known as the local broadcast."
        },
        {
            "Parameters": "host-ones",
            "Info": "The host-ones keyword following the broadcast parameter specifies that the broadcast address used by the IP interface for this IP address will be the subnet broadcast address. This is an IP address that corresponds to the local subnet described by the ip-address and the mask-length or mask with all the host bits set to binary one. This is the default used by an IP interface."
        },
        {
            "Parameters": "igp-inhibit",
            "Info": "The optional igp-inhibit parameter signals that the given secondary IP interface should not be recognized as a local interface by the running IGP. For OSPF and IS-IS, this means that the specified secondary IP interfaces will not be injected and used as passive interfaces and will not be advertised as internal IP interfaces into the IGP s link state database. For RIP, this means that these secondary IP interfaces will not source RIP updates."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}