{
    "PageTitle": "apply redirect ipv6",
    "FuncDef": "The apply redirect ipv6 command precisely redirects the traffic that matches a filtering rule carried in BGP Flow Specification static routes to a specified SRv6 TE Policy.\nThe undo apply redirect ipv6 command cancels the configuration.\nBy default, traffic is not redirected.",
    "CLIs": [
        "apply redirect ipv6 <redirectIPv6RT> color <colorValue> prefix-sid <prefix-sid-value>",
        "undo apply redirect ipv6 [ <redirectIPv6RT> color <colorValue> prefix-sid <prefix-sid-value> ]"
    ],
    "ParentView": [
        "Flow-Route view"
    ],
    "ParaDef": [
        {
            "Parameters": "redirectIPv6RT",
            "Info": "Specifies the IPv6 address of the next hop for redirection.\nThe value is in the format of ipv6-address.0 or ipv6-address:1. ipv6-address is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "color colorValue",
            "Info": "Specifies the color attribute for redirecting traffic to an SRv6 TE Policy.\nThe value of the color attribute is in the format of color flag:4-byte user-defined number; for example, the value can be set to 0:100. Currently, the color flag value is fixed at 0, and the 4-byte user-defined number is an integer ranging from 0 to 4294967295."
        },
        {
            "Parameters": "prefix-sid prefix-sid-value",
            "Info": "Specifies a prefix SID.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] flow-route fr",
            "[*HUAWEI-flow-route] apply redirect ipv6 1::1.0 color 0:54 prefix-sid 2:2::2:2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn static Flow Specification scenarios, you can run the apply redirect ipv6 command to precisely redirect the traffic that matches a filtering rule carried in BGP Flow Specification static routes to a specified SRv6 TE Policy. Traffic can be redirected to an SRv6 TE Policy only if the created tunnel policy and the redirection next hop IPv6, color, and prefix SID attributes match the specified SRv6 TE Policy.\nWhen you configure static BGP Flow Specification, ensure that the apply redirect ipv6 command and the redirect tunnelv6 tunnel-selector command are both run so that traffic can be redirected to a specified SRv6 TE Policy."
}