{
    "PageTitle": "display bgp flow vpnv6 vpn-instance routing-table peer",
    "FuncDef": "The display bgp flow vpnv6 vpn-instance routing-table peer received-routes active command displays information about BGP VPN IPv6 Flow Specification and BGP VPNv6 Flow Specification routes.",
    "CLIs": [
        "display bgp flow vpnv6 vpn-instance <vpn-instance-name> routing-table peer <remoteIpv4Addr> advertised-routes",
        "display bgp flow vpnv6 vpn-instance <vpn-instance-name> routing-table peer <remoteIpv6Addr> advertised-routes",
        "display bgp flow vpnv6 vpn-instance <vpn-instance-name> routing-table peer <remoteIpv4Addr> received-routes",
        "display bgp flow vpnv6 vpn-instance <vpn-instance-name> routing-table peer <remoteIpv6Addr> received-routes",
        "display bgp flow vpnv6 vpn-instance <vpn-instance-name> routing-table peer <remoteIpv4Addr> received-routes active",
        "display bgp flow vpnv6 vpn-instance <vpn-instance-name> routing-table peer <remoteIpv6Addr> received-routes active"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance-name",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "remoteIpv4Addr",
            "Info": "Specifies an IPv4 address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "advertised-routes",
            "Info": "Displays information about routes advertised to a specified peer.\n-"
        },
        {
            "Parameters": "remoteIpv6Addr",
            "Info": "Specifies an IPv6 address.\nThe address is a 32-bit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "received-routes",
            "Info": "Displays information about routes received from a specified peer.\n-"
        },
        {
            "Parameters": "active",
            "Info": "Displays information about the active routes received from a specified peer.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display bgp flow vpnv6 vpn-instance aa routing-table peer 10.1.1.1 received-routes active",
            " ",
            " BGP Local router ID is 1.1.1.1",
            " Status codes: * - valid, > - best, d - damped, x - best external, a - add path,",
            "               h - history,  i - internal, s - suppressed, S - Stale",
            "               Origin : i - IGP, e - EGP, ? - incomplete",
            " RPKI validation codes: V - valid, I - invalid, N - not-found",
            "",
            "    ",
            " VPN-Instance aa, Router ID 1.1.1.1:",
            "",
            " Total Number of Routes: 1",
            " * >  ReIndex : 69",
            "      Dissemination Rules:",
            "       Source IP      : 12::12/128",
            "       MED      : 0                   PrefVal  : 0                   ",
            "       LocalPref:                           ",
            "       Path/Ogn : 200i"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo check information about BGP VPN IPv6 Flow Specification and BGP VPNv6 Flow Specification routes, run the display bgp flow vpnv6 vpn-instance routing-table peer received-routes active command. The command output shows information about both active and inactive BGP VPN IPv6 Flow Specification and BGP VPNv6 Flow Specification routes."
}