{
    "PageTitle": "flow-interface-group (Flow-route view)",
    "FuncDef": "The flow-interface-group command associates a BGP Flow Specification interface group with a BGP Flow Specification route.\nThe undo flow-interface-group command restores the default configuration.\nBy default, a BGP Flow Specification interface group is not associated with a BGP Flow Specification route.",
    "CLIs": [
        "flow-interface-group <infGrpId>",
        "undo flow-interface-group <infGrpId>"
    ],
    "ParentView": [
        "Flow-Route view"
    ],
    "ParaDef": [
        {
            "Parameters": "infGrpId",
            "Info": "Specifies a BGP Flow Specification interface group ID.\nThe value is an integer ranging from 0 to 16383."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] flow-route Rule1",
            "[*HUAWEI-flow-route] flow-interface-group 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWithout a BGP Flow Specification interface group, the traffic filtering rules configured for BGP Flow Specification routes take effect globally, not on a specified interface. If a BGP Flow Specification interface group is configured, the traffic filtering rules configured for BGP Flow Specification routes also take effect on a specified interface. In this manner, traffic can be forwarded based on the rules of the BGP Flow Specification routes on the specified interface.\nAfter a BGP Flow Specification interface group is created using the flow-interface-group command, you need to run the interface (BGP Flow Specification interface group view) command to add an interface to the group.\nBetween forwarders, the flow-interface-group command needs to be run in the Flow-Route view to associate a BGP Flow Specification interface group with a BGP Flow Specification route so that the traffic filtering rules configured for the route take effect on a specified interface.The command is not required between the controller and forwarders.\n\nPrerequisites\nA BGP Flow Specification route has been created and its view has been displayed using the flow-route command."
}