{
    "PageTitle": "flow-route ipv6",
    "FuncDef": "The flow-route ipv6 command configures a static BGP IPv6 Flow Specification route and displays the Flow-Route view.\nThe undo flow-route ipv6 command deletes the static BGP IPv6 Flow Specification route.\nBy default, no static BGP IPv6 Flow Specification route is created.",
    "CLIs": [
        "flow-route <flowroute-name> ipv6",
        "undo flow-route <flowroute-name> ipv6"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "flowroute-name",
            "Info": "Specifies the name of a static BGP Flow Specification route.\nThe value is a string of 1 to 30 case-sensitive characters without any space. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] flow-route rule2 ipv6"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo filter out the attack traffic of a certain type, you can run the flow-route ipv6 command to manually configure a static BGP IPv6 Flow Specification route with a filtering rule and a traffic controlling action. Receiving the route, a BGP IPv6 Flow Specification peer generates a traffic policy to control the attack traffic.\nOne BGP IPv6 Flow Specification route can include multiple if-match and apply clauses. The if-match clauses define filtering rules. The apply clauses specify actions. The relationships between if-match clauses and between apply clauses are as follows:\nThe relationship between if-match clauses of different types is \"AND\".The relationship between apply clauses is \"AND\".\nAll traffic matching if-match filtering rules must be filtered with the actions specified by apply clauses.\n\nConfiguration Impact\nAfter the BGP IPv6 Flow address family is enabled using the flow-route ipv6 and ipv6-family flow commands, the generated BGP IPv6 Flow Specification route is imported to the BGP routing table.\nif-match port and if-match destination-port or if-match source-port are mutually exclusive.\nPrecautions\nBGP Flow Specification does not support next-rule behaviors."
}