{
    "PageTitle": "flow-interface-group (System view)",
    "FuncDef": "The flow-interface-group command creates a BGP Flow Specification interface group and displays the interface group view or directly displays the view of an existing BGP Flow Specification interface group.\nThe undo flow-interface-group command deletes a BGP Flow Specification interface group.\nBy default, no BGP Flow Specification interface group is created.",
    "CLIs": [
        "flow-interface-group <group-id>",
        "undo flow-interface-group <group-id>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "group-id",
            "Info": "Specifies a BGP Flow Specification interface group ID.\nThe value is an integer ranging from 0 to 16383."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] flow-interface-group 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWithout a BGP Flow Specification interface group, the traffic filtering rules configured for BGP Flow Specification routes take effect globally, not on a specified interface. If a BGP Flow Specification interface group is configured, the traffic filtering rules configured for BGP Flow Specification routes also take effect on a specified interface. In this manner, traffic can be forwarded based on the rules of the BGP Flow Specification routes on the specified interface.\nFollow-up Procedure\nAfter a BGP Flow Specification interface group is created and its view is displayed using the flow-interface-group command in the system view, the following operations need to be performed so that the traffic filtering rules configured for a BGP Flow Specification route take effect on a specified interface:\nRun the interface command in the BGP Flow Specification interface group view to add an interface to the group.Run the flow-interface-group command in the Flow-Route view to associate the BGP Flow Specification interface group with a BGP Flow Specification route.\nThe preceding operations are required between forwarders, not between the controller and forwarders.\n\nPrecautions\nThe traffic filtering rules of a BGP Flow Specification route that are configured on an interface take precedence over those configured globally. If no traffic filtering rules are configured on an interface for a BGP Flow Specification route, the global configuration takes effect."
}