{
    "PageTitle": "flowspec protocol-protect disable",
    "FuncDef": "The flowspec protocol-protect disable command disables BGP FlowSpec protocol protection.\nThe undo flowspec protocol-protect disable command restores the default configuration.\nBy default, the BGP FlowSpec protocol protection function is enabled.",
    "CLIs": [
        "flowspec protocol-protect { ipv4 | ipv6 } disable",
        "undo flowspec protocol-protect { ipv4 | ipv6 } disable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv4",
            "Info": "Indicates the BGP IPv4 FlowSpec protocol protection function.\n-"
        },
        {
            "Parameters": "ipv6",
            "Info": "Indicates the BGP IPv6 FlowSpec protocol protection function.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] flowspec protocol-protect ipv4 disable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] flowspec protocol-protect ipv6 disable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] undo flowspec protocol-protect ipv4 disable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] undo flowspec protocol-protect ipv6 disable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nPackets to be sent to the CPU and used to establish protocol sessions may match BGP FlowSpec routes in which the action is deny or redirect. In this case, packets are discarded or redirected, causing session establishment failures. To prevent such failures, the BGP FlowSpec protocol protection function can be used. With this function that is enabled by default, the preceding matching packets are not discarded or redirected so that protocol session can be properly established. If the system does not need the BGP FlowSpec protocol protection function, run the flowspec protocol-protect { ipv4 | ipv6 } disable command in the system view to disable the function.\nPrecautions\nThe command is not supported by the following boards: LPUF-50/LPUF-50-L/LPUI-21-L/LPUI-51-L/LPUF-51/LPUF-51-B/LPUI-51/LPUI-51-B/LPUS-51/LPUF-101/LPUF-101-B/LPUI-101/LPUI-101-B/LPUS-101.\nIn VS mode, this command is supported only by the admin VS."
}