{
    "PageTitle": "flowspec disable",
    "FuncDef": "The flowspec disable command disables BGP Flow Specification on an interface.\nThe undo flowspec disable command enables BGP Flow Specification on an interface.\nBy default, BGP Flow Specification is enabled on an interface.",
    "CLIs": [
        "flowspec disable [ ipv4 | ipv6 ]",
        "undo flowspec disable [ ipv4 | ipv6 ]"
    ],
    "ParentView": [
        "100GE interface view",
        "10G LAN interface view",
        "40GE interface view",
        "Eth-Trunk interface view",
        "GE optical interface view",
        "GE electrical interface view",
        "IP-Trunk interface view",
        "POS interface view",
        "Port extension interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv4",
            "Info": "Disable BGP IPv4 Flow Specification on an interface.\n-"
        },
        {
            "Parameters": "ipv6",
            "Info": "Disable BGP IPv6 Flow Specification on an interface.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] flowspec disable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 2/0/0",
            "[~HUAWEI-GigabitEthernet2/0/0] flowspec disable ipv6"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen BGP Flow Specification is not required on an interface, you can disable BGP Flow Specification on the interface.\nWhen the flowspec disable command is configured on an interface:\nIf ipv4 and ipv6 are not specified, all BGP Flow Specification functions are disabled on the interface. To be specific, both BGP IPv4 Flow Specification and BGP IPv6 Flow Specification functions do not take effect on the interface.If only ipv4 is specified, the BGP IPv4 Flow Specification function is disabled and does not take effect on the interface, whereas the BGP IPv6 Flow Specification function still takes effect.If only ipv6 is specified, the BGP IPv6 Flow Specification function is disabled and does not take effect on the interface, whereas the BGP IPv4 Flow Specification function still takes effect.\n\nPrecautions\nThe flowspec disable and flowspec refluence commands are mutually exclusive.\nThis command can be configured only on the main interface and cannot be configured on sub-interfaces or Eth-Trunk member interfaces. When the command is configured on a main interface, the command configuration also takes effect on its sub-interfaces, regardless of whether the main interface and its sub-interfaces belong to the same VS.\nflowspec disable is mutually exclusive with flowspec disable ipv4 or flowspec disable ipv6. flowspec disable ipv4 and flowspec disable ipv6 are not mutually exclusive and can be both configured."
}