{
    "PageTitle": "if-match icmp-type",
    "FuncDef": "The if-match icmp-type command configures a filtering rule based on the type of an ICMP packet.\nThe undo if-match icmp-type command deletes the filtering rule based on the type of an ICMP packet.\nBy default, no filtering rule based on the type of an ICMP packet is configured.",
    "CLIs": [
        "if-match icmp-type { greater-than | less-than | equal } icmp-type",
        "if-match icmp-type greater-than icmp-type less-than <upper-icmp-type-value>",
        "undo if-match icmp-type",
        "undo if-match icmp-type greater-than icmp-type less-than <upper-icmp-type-value>",
        "undo if-match icmp-type { greater-than | less-than | equal } icmp-type"
    ],
    "ParentView": [
        "Flow-Route IPv6 VPN instance view",
        "Flow-Route VPN instance view",
        "Flow-Route-IPv6 view",
        "Flow-Route view"
    ],
    "ParaDef": [
        {
            "Parameters": "greater-than",
            "Info": "Indicates that the type of an ICMP packet is greater than the specified one.\n-"
        },
        {
            "Parameters": "less-than",
            "Info": "Indicates that the type of an ICMP packet is smaller than the specified one.\n-"
        },
        {
            "Parameters": "equal",
            "Info": "Indicates that the type of an ICMP packet is equal to the specified one.\n-"
        },
        {
            "Parameters": "icmp-type",
            "Info": "Specifies the ICMP packet type.\nThe value is an integer ranging from 0 to 255."
        },
        {
            "Parameters": "upper-icmp-type-value",
            "Info": "Specifies the upper limit of a range that identifies ICMP packet types.\nThe value is an integer ranging from 0 to 255."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] flow-route Rule1",
            "[*HUAWEI-flow-route] if-match icmp-type equal 13"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] flow-route Rule1 ipv6",
            "[*HUAWEI-flow-route-ipv6] if-match icmp-type equal 13"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] flow-route Rule1 vpn-instance va",
            "[*HUAWEI-flow-route-va] if-match icmp-type greater-than 13 less-than 20"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo improve network performance or security, you can run the if-match icmp-type and if-match icmp-code commands to configure a filtering rule related to an ICMP packet for a BGP (IPv6) Flow Specification route or BGP (IPv6) VPN Flow Specification route to control traffic. There are two situations:\nOn a secure network, routers can receive ICMP packets. However, when network traffic load is heavy, host unreachable or port unreachable events frequently occur, and routers receive a large number of ICMP packets, increasing network burdens and degrading router performance.On an insecure network, network attackers often use ICMP error packets to spy on the internal structure of the network.\n\nPrerequisites\nA static BGP (IPv6) Flow Specification route or BGP (IPv6) VPN Flow Specification route has been created using the flow-route command in the system view.\nPrecautions\nA maximum of five filtering rules based on ICMP packet types can be configured for a BGP Flow Specification route."
}