{
    "PageTitle": "if-match packet-length",
    "FuncDef": "The if-match packet-length command configures a packet-length-based matching rule for a BGP (IPv6) Flow Specification route or BGP VPN Flow Specification route to filter packets.\nThe undo if-match packet-length command deletes a packet-length-based matching rule from a BGP (IPv6) Flow Specification route or BGP VPN Flow Specification route.\nBy default, no packet-length-based matching rule is configured for a BGP (IPv6) Flow Specification route or BGP VPN Flow Specification route to filter packets.",
    "CLIs": [
        "if-match packet-length { greater-than | less-than | equal } <packet-length-value>",
        "if-match packet-length greater-than <packet-length-value> less-than <upper-packet-length-value>",
        "undo if-match packet-length [ { greater-than | less-than | equal } <packet-length-value> ]",
        "undo if-match packet-length greater-than <packet-length-value> less-than <upper-packet-length-value>"
    ],
    "ParentView": [
        "Flow-Route IPv6 VPN instance view",
        "Flow-Route VPN instance view",
        "Flow-Route-IPv6 view",
        "Flow-Route view"
    ],
    "ParaDef": [
        {
            "Parameters": "greater-than",
            "Info": "Matches packets with a length greater than a specified value.\n-"
        },
        {
            "Parameters": "less-than",
            "Info": "Matches packets with a length less than a specified value.\n-"
        },
        {
            "Parameters": "equal",
            "Info": "Matches packets of a specified length.\n-"
        },
        {
            "Parameters": "packet-length-value",
            "Info": "Specifies a packet length.\nThe value is an integer ranging from 0 to 9600."
        },
        {
            "Parameters": "upper-packet-length-value",
            "Info": "Specifies the upper limit of a packet length.\nThe value is an integer ranging from 0 to 9600, in bytes."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] flow-route Rule1",
            "[*HUAWEI-flow-route] if-match packet-length greater-than 25"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] flow-route Rule1 vpn-instance va",
            "[*HUAWEI-flow-route-va] if-match packet-length greater-than 25 less-than 50"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure a packet-length-based matching rule for a BGP (IPv6) Flow Specification route or BGP (IPv6) VPN Flow Specification route to filter packets, run the if-match packet-length command. The action specified in the apply clause is implemented only on the packets that match the if-match clause.\nPrerequisites\nA BGP (IPv6) Flow Specification route or BGP (IPv6) VPN Flow Specification route has been created using the flow-route command in the system view.\nConfiguration Impact\nAfter you configure the flow-route ipv6 command, this command cannot be executed and a prompt message is displayed if being manually configured, and this command can be successfully executed if being dynamically delivered. However, this command does not take effect.\nPrecautions\nA maximum of five filtering rules based on the packet length can be configured for a BGP Flow Specification route."
}