{
    "PageTitle": "if-match source-port",
    "FuncDef": "The if-match source-port command configures a filtering rule based on the source port number.\nThe undo if-match source-port command deletes the filtering rule based on the source port number.\nBy default, no filtering rule based on the source port number is configured.",
    "CLIs": [
        "if-match source-port { greater-than | less-than | equal } <port>",
        "if-match source-port greater-than <port> less-than <upper-port-value>",
        "undo if-match source-port",
        "undo if-match source-port { greater-than | less-than | equal } <port>",
        "undo if-match source-port greater-than <port> less-than <upper-port-value>"
    ],
    "ParentView": [
        "Flow-Route IPv6 VPN instance view",
        "Flow-Route VPN instance view",
        "Flow-Route-IPv6 view",
        "Flow-Route view"
    ],
    "ParaDef": [
        {
            "Parameters": "greater-than",
            "Info": "Indicates that the source port number is greater than the specified one.\n-"
        },
        {
            "Parameters": "less-than",
            "Info": "Indicates that the source port number is smaller than the specified one.\n-"
        },
        {
            "Parameters": "equal",
            "Info": "Indicates that the source port number is equal to the specified one.\n-"
        },
        {
            "Parameters": "port",
            "Info": "Specifies the source port number of the traffic.\nThe value is an integer ranging from 0 to 65535."
        },
        {
            "Parameters": "upper-port-value",
            "Info": "Specifies the upper limit of a source port number.\nThe value is an integer ranging from 0 to 65535."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] flow-route Rule1",
            "[*HUAWEI-flow-route] if-match source-port equal 179"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] flow-route Rule1 ipv6",
            "[*HUAWEI-flow-route-ipv6] if-match source-port equal 179"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] flow-route Rule1 vpn-instance va",
            "[*HUAWEI-flow-route-va] if-match source-port greater-than 150 less-than 200"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe if-match source-port command is used to configure a filtering rule based on the source port number for a BGP (IPv6) Flow Specification route or BGP (IPv6) VPN Flow Specification route. Traffic matching the filtering rule will be controlled with the action specified by the apply clause.\nPrerequisites\nA static BGP (IPv6) Flow Specification route or BGP (IPv6) VPN Flow Specification route has been created using the flow-route command in the system view.\nPrecautions\nMake sure that the source port number is within the range, because if the source port number is beyond the range, protocol packets sent by the source port cannot be forwarded.\nA maximum of five filtering rules based on the source port number can be configured for a BGP Flow Specification route."
}