{
    "PageTitle": "if-match fragment-type",
    "FuncDef": "The if-match fragment-type command configures a filtering rule based on the fragment type.\nThe undo if-match fragment-type command deletes the filtering rule based on the fragment type.\nBy default, no filtering rule based on the fragment type is configured.",
    "CLIs": [
        "if-match fragment-type { not | match } { fragment | non-fragment | fragment-spe-first }",
        "undo if-match fragment-type",
        "undo if-match fragment-type { not | match } { fragment | non-fragment | fragment-spe-first }"
    ],
    "ParentView": [
        "Flow-Route IPv6 VPN instance view",
        "Flow-Route VPN instance view",
        "Flow-Route-IPv6 view",
        "Flow-Route view"
    ],
    "ParaDef": [
        {
            "Parameters": "not",
            "Info": "Indicates that traffic that does not match the fragment type can pass the filtering rule.\n-"
        },
        {
            "Parameters": "match",
            "Info": "Indicates that traffic matching the fragment type can pass the filtering rule.\n-"
        },
        {
            "Parameters": "fragment",
            "Info": "Indicates that fragments are checked.\n-"
        },
        {
            "Parameters": "non-fragment",
            "Info": "Indicates that non-fragmented packets are checked.\n-"
        },
        {
            "Parameters": "fragment-spe-first",
            "Info": "Indicates that the first fragmented packet is checked.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] flow-route rule1",
            "[*HUAWEI-flow-route] if-match fragment-type not fragment"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe if-match fragment-type command is used to configure a filtering rule based on the fragment type for a BGP (IPv6) Flow Specification route or BGP (IPv6) VPN Flow Specification route. Traffic matching the filtering rule will be controlled with the action specified by the apply clause.\nPrerequisites\nA static BGP (IPv6) Flow Specification route or BGP (IPv6) VPN Flow Specification route has been created using the flow-route command in the system view.\nConfiguration Impact\nAfter you configure the flow-route ipv6 command, this command cannot be executed and a prompt message is displayed if being manually configured, and this command can be successfully executed if being dynamically delivered. However, this command does not take effect.\nPrecautions\nIf the filtering rules that are configured using the if-match fragment-type not and if-match fragment-type match commands are based on the same fragment type (fragment, non-fragment, or fragment-spe-first), the latter command configuration overrides the previous one."
}