{
    "PageTitle": "if-match destination-origin-as",
    "FuncDef": "The if-match destination-origin-as command configures a filtering rule that is based on the origin AS number of the destination IP address.\nThe undo if-match destination-origin-as command deletes a filtering rule that is based on the origin AS number of the destination IP address.\nBy default, no filtering rule that is based on the origin AS number of the destination IP address is configured.",
    "CLIs": [
        "if-match destination-origin-as <as-number>",
        "undo if-match destination-origin-as [ <as-number> ]"
    ],
    "ParentView": [
        "Flow-Route view"
    ],
    "ParaDef": [
        {
            "Parameters": "as-number",
            "Info": "Specifies an AS number.\nFor an integral AS number, the value is an integer ranging from 1 to 4294967295.\nFor an AS number in dotted notation, the value is in the format of x.y, where x and y are integers ranging from 1 to 65535 and from 0 to 65535, respectively."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] flow-route Rule1",
            "[*HUAWEI-flow-route] if-match destination-origin-as 255"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure a filtering rule that is based on the origin AS number of the destination IP address, run the if-match destination-origin-as command. The traffic behavior specified in the apply clause applies to the traffic that matches the origin AS number of the destination IP address.\nPrerequisites\nA static BGP Flow Specification route has been created using the flow-route command in the system view.\nConfiguration Impact\nIf you run the if-match destination-origin-as command for the same BGP Flow Specification route more than once, the latest configuration overrides the previous one.\nPrecautions\nAfter the filtering rule is configured, you also need to perform the following operations:\nRun the peer advertise destination-origin-as command to enable the device to advertise the filtering rule that is based on the origin AS number of the destination IP address to the specified peer.Run the check-origin-as enable command to allow the received BGP Flow Specification routes carrying a filtering rule that is based on the origin AS number of the destination IP address to be valid.Create a BGP Flow Specification interface group and associate the interface group with the BGP Flow Specification route."
}