{
    "PageTitle": "peer redirect tunnelv6",
    "FuncDef": "The peer redirect tunnelv6 command enables a device to process the redirection next hop IPv6, color, and prefix SID attributes carried in BGP Flow Specification routes received from a peer.\nThe undo peer redirect tunnelv6 command restores the default configuration.\nBy default, a device cannot process the redirection next hop IPv6, color, and prefix SID attributes carried in BGP Flow Specification routes received from a peer.",
    "CLIs": [
        "peer <ipv4-address> redirect tunnelv6",
        "undo peer <ipv4-address> redirect tunnelv6"
    ],
    "ParentView": [
        "BGP-Flow address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv4-address",
            "Info": "Specify an IPv4 peer address.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 10.1.1.1 as-number 200",
            "[*HUAWEI-bgp] ipv4-family flow",
            "[*HUAWEI-bgp-af-ipv4-flow] peer 10.1.1.1 enable",
            "[*HUAWEI-bgp-af-ipv4-flow] peer 10.1.1.1 redirect tunnelv6"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn a dynamic BGP Flow Specification scenario, you can run the peer redirect tunnelv6 command to enable a device to process the redirection next hop IPv6, color, and prefix SID attributes carried in BGP Flow Specification routes received from a peer. To trigger traffic redirection to an SRv6 TE Policy tunnel, ensure that the redirect tunnelv6 tunnel-selector command and the peer redirect tunnelv6 command are both run.\nPrecautions\nIf a device with the peer redirect ip command configured receives messages carrying the redirection next hop attribute from the specified peer, the device redirects traffic to the IP address of the redirection next hop regardless of whether the peer redirect tunnelv6 command is run.\nIf a device with the peer redirect tunnelv6 command configured receives messages carrying only the redirection next hop IPv6 attribute from the specified peer, the device redirects traffic to the specified IPv6 tunnel."
}