{
    "PageTitle": "redirect tunnelv6 tunnel-selector",
    "FuncDef": "The redirect tunnelv6 tunnel-selector command enables a device to recurse routes carrying the redirection IPv6 next-hop address, color, and prefix SID attributes to tunnels.\nThe undo redirect tunnelv6 tunnel-selector command restores the default configuration.\nBy default, routes carrying the redirection IPv6 next-hop address, color, and prefix SID attributes cannot recurse to tunnels.",
    "CLIs": [
        "redirect tunnelv6 tunnel-selector <tunnel-selector-name>",
        "undo redirect tunnelv6 tunnel-selector [ <tunnel-selector-name> ]"
    ],
    "ParentView": [
        "BGP-Flow address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "tunnel-selector-name",
            "Info": "Name of the tunnel policy selector.\nThe value is a string of 1 to 40 case-sensitive characters, spaces not supported. The string can contain spaces if it is enclosed with double quotation marks (\")."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] tunnel-selector ts1 permit node 1",
            "[*HUAWEI-tunnel-selector] commit",
            "[~HUAWEI-tunnel-selector] quit",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] peer 10.1.1.1 as-number 200",
            "[*HUAWEI-bgp] ipv4-family flow",
            "[*HUAWEI-bgp-af-ipv4-flow] redirect tunnelv6 tunnel-selector ts1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen dynamic BGP FlowSpec is configured, the redirect tunnelv6 tunnel-selector command must be used together with the peer redirect tunnelv6 command. L2VPN-AD routes can recurse to SRv6 TE Policies only after both commands are run.\nWhen static BGP FlowSpec is configured, the redirect tunnelv6 tunnel-selector command must be used together with the apply redirect ipv6 command. L2VPN-AD routes can recurse to SRv6 TE Policies only after both commands are run.\nPrecautions\nThe SRv6 TE Policy Group of tunnel is not supported in a tunnel selector specified in the command."
}