{
    "PageTitle": "routing-table rib-only (BGP-IPv6-flow address family view)",
    "FuncDef": "The routing-table rib-only command disables a device from delivering a BGP IPv6 Flow Specification route to the FES forwarding table.\nThe undo routing-table rib-only command restores the default configuration.\nBy default, a device is enabled to deliver a BGP (IPv6) Flow Specification or BGP (IPv6) VPN Flow Specification route to the FES forwarding table.",
    "CLIs": [
        "routing-table rib-only [ route-policy <route-policy-name> | route-filter <route-filter-name> ]",
        "undo routing-table rib-only"
    ],
    "ParentView": [
        "BGP-IPv6-flow address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "route-policy route-policy-name",
            "Info": "Specifies the name of a route-policy.\nThe name is a string of 1 to 200 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "route-filter route-filter-name",
            "Info": "Specifies the name of a route-filter.\nThe value is a string of 1 to 200 case-sensitive characters, spaces not supported. If parameters are included in the referenced route-filter, specify values for them in the format of (var1, var2, ...var8) behind the route-filter name. A maximum of eight parameters can be specified, and each value ranges from 1 to 200 characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] ipv6-family flow",
            "[*HUAWEI-bgp-af-ipv6-flow] routing-table rib-only"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo disable a device from delivering a BGP (IPv6) Flow Specification or BGP (IPv6) VPN Flow Specification route to the FES forwarding table, run the routing-table rib-only command. This command can be used when the BGP (IPv6) Flow Specification or BGP (IPv6) VPN Flow Specification route attribute does not need to take effect on a local device.\nWhen route-policy-name or route-filter-name is specified in the command, the routes matching the policy are not added to the FES forwarding table, and the routes not matching the policy are added to the FES forwarding table."
}