{
    "PageTitle": "ipv4-flow vpn-instance",
    "FuncDef": "The ipv4-flow vpn-instance command enables the BGP-Flow VPN instance IPv4 address family and displays its view.\nThe undo ipv4-flow vpn-instance command deletes the BGP-Flow VPN instance IPv4 address family view.\nBy default, the BGP-Flow VPN instance IPv4 address family is disabled.",
    "CLIs": [
        "ipv4-flow vpn-instance <vpn-instance-name>",
        "undo ipv4-flow vpn-instance <vpn-instance-name>"
    ],
    "ParentView": [
        "BGP view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[~HUAWEI-vpn-instance-vpna] ipv4-family",
            "[~HUAWEI-vpn-instance-vpna-af-ipv4] quit",
            "[~HUAWEI-vpn-instance-vpna] quit",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] vpn-instance vpna",
            "[*HUAWEI-bgp-instance-vpna] peer 1.1.1.1 as-number 100",
            "[*HUAWEI-bgp-instance-vpna] quit",
            "[*HUAWEI-bgp] ipv4-flow vpn-instance vpna",
            "[*HUAWEI-bgp-flow-vpna]"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo enable the BGP-Flow VPN instance IPv4 address family and enter its view, run the ipv4-flow vpn-instance command. Then you can perform configurations in the BGP-Flow VPN instance IPv4 address family view.\nPrerequisites\nA BGP VPN instance has been created and its view has been displayed using the vpn-instance command.\nConfiguration Impact\nAfter the ipv4-flow vpn-instance command is run, the created BGP Flow Specification route is automatically imported to the BGP VPN routing table.\nPrecautions\nThe undo ipv4-flow vpn-instance command deletes all configurations from the BGP-Flow VPN instance IPv4 address family view and deletes BGP Flow Specification routes from the BGP VPN routing table."
}