{
    "PageTitle": "route match-destination (BGP-Flow VPN instance IPv6 address family view)",
    "FuncDef": "The route match-destination command enables a device to change the prefix of each BGP (IPv6) Flow Specification route or BGP (IPv6) VPN Flow Specification route that matches the export or import policy of a peer to the destination IP address specified in the if-match destination command.\nThe undo route match-destination command restores the default configuration.\nBy default, all 0s (0.0.0.0/0 for IPv4 and 0::0/0 for IPv6) are used as the prefix of each BGP (IPv6) Flow Specification route or BGP (IPv6) VPN Flow Specification route that matches the export or import policy of a peer.",
    "CLIs": [
        "route match-destination",
        "undo route match-destination"
    ],
    "ParentView": [
        "BGP-Flow VPN instance IPv6 address family view",
        "BGP-Flow VPN instance IPv4 address family view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[~HUAWEI-vpn-instance-vpna] ipv6-family",
            "[~HUAWEI-vpn-instance-vpna-af-ipv6] quit",
            "[~HUAWEI-vpn-instance-vpna] quit",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] vpn-instance vpna",
            "[*HUAWEI-bgp-instance-vpna] quit",
            "[*HUAWEI-bgp] ipv6-flow vpn-instance vpna",
            "[*HUAWEI-bgp-flow-6-vpna] route match-destination"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, all 0s (0.0.0.0/0 for IPv4 and 0::0/0 for IPv6) are used as the prefix of each BGP (IPv6) Flow Specification route or BGP (IPv6) VPN Flow Specification route that matches the export or import policy of a peer. To enable a device to change the prefix of each BGP (IPv6) Flow Specification route or BGP (IPv6) VPN Flow Specification route that matches the export or import policy of a peer to the destination IP address specified in the if-match destination command, run the route match-destination command."
}