{
    "PageTitle": "if-match destination (Flow-Route VPN instance view)",
    "FuncDef": "The if-match destination command configures a filtering rule based on the destination address.\nThe undo if-match destination command deletes the filtering rule based on the destination address.\nBy default, no filtering rule based on the destination address is configured.",
    "CLIs": [
        "if-match destination <ipv4Address> [ <maskLenEx> | <mask> ]",
        "undo if-match destination"
    ],
    "ParentView": [
        "Flow-Route VPN instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv4Address",
            "Info": "Specifies the destination address of the traffic.\nThis value is in dotted decimal notation."
        },
        {
            "Parameters": "maskLenEx",
            "Info": "Specifies the destination address mask of the traffic.\nThe value is an integer ranging from 0 to 32."
        },
        {
            "Parameters": "mask",
            "Info": "Specifies the destination address mask of the traffic.\nThis value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[~HUAWEI-vpn-instance-vpna] quit",
            "[~HUAWEI] flow-route Rule1 vpn-instance vpna",
            "[*HUAWEI-flow-route-vpna] if-match destination 10.1.1.1 24"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo filter out the attack traffic to a specified destination, you can run the if-match destination command to configure a filtering rule based on the destination address for the BGP Flow Specification route or BGP VPN Flow Specification route. Traffic matching the filtering rule will be controlled with the action specified by the apply clause.\nPrerequisites\nA static BGP Flow Specification IPv4 route has been created using the flow-route command in the system view.\nA static BGP VPN Flow Specification route has been configured using the flow-route vpn-instance command in the system view.\nConfiguration Impact\nIf if-match destination is configured in a BGP Flow Specification route or BGP VPN Flow Specification route, a BGP (IPv6) Flow Specification peer or BGP VPN Flow Specification peer authenticates the route after receiving it. The route is valid only when it passes the authentication rule specified by RFC5575.\nIf you run the if-match destination command for the same BGP Flow Specification route or BGP VPN Flow Specification route several times, the last configuration takes effect.\nFollow-up Procedure\nIf the BGP Flow Specification route or BGP VPN Flow Specification route carrying a filtering rule specified by the if-match destination command fails to be authenticated by the remote BGP (IPv6) Flow Specification peer or BGP (IPv6) VPN Flow Specification peer, run the peer validation-disable command to cancel the authentication."
}