{
    "PageTitle": "flow-route vpn-instance",
    "FuncDef": "The flow-route vpn-instance command configures a static BGP VPN Flow Specification route and displays the Flow-Route VPN instance view.\nThe undo flow-route vpn-instance command deletes the static BGP VPN Flow Specification route.\nBy default, no static BGP VPN Flow Specification route is created.",
    "CLIs": [
        "flow-route <flowroute-name> vpn-instance <vpn-instance-name>",
        "undo flow-route <flowroute-name> vpn-instance <vpn-instance-name>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "flowroute-name",
            "Info": "Specifies the name of a static BGP Flow Specification route or BGP VPN Flow Specification route.\nThe value is a string of 1 to 30 case-sensitive characters without any space. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "vpn-instance-name",
            "Info": "Specifies a VPN instance name.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpna",
            "[~HUAWEI-vpn-instance-vpna] quit",
            "[~HUAWEI] flow-route rule2 vpn-instance vpna",
            "[*HUAWEI-flow-route-vpna]"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo filter out the attack traffic of a certain type, you can run the fow-route vpn-instance command to manually configure a static BGP VPN Flow Specification route with a filtering rule and a traffic controlling action. Receiving the route, a BGP VPN Flow Specification peer generates a traffic policy to control the attack traffic.\nOne BGP VPN Flow Specification route can include multiple if-match and apply clauses. The if-match clauses define filtering rules. The apply clauses specify actions. The relationships between if-match clauses and between apply clauses are as follows:\nThe relationship between if-match clauses of different types is \"AND\".The relationship between apply clauses is \"AND\".\nAll traffic matching if-match filtering rules must be filtered with the actions specified by apply clauses.\n\nConfiguration Impact\nAfter this command and ipv4-flow vpn-instance commands are run, BGP VPN Flow Specification routes are automatically added to the BGP routing table.\nif-match port and if-match destination-port or if-match source-port are mutually exclusive.\nPrecautions\nBGP Flow Specification does not support next-rule behaviors."
}