{
    "PageTitle": "backup hot-standby (SR-MPLS TE Policy view)",
    "FuncDef": "The backup hot-standby enable command enables hot standby (HSB) for an SR-MPLS TE Policy.\nThe undo backup hot-standby enable command deletes the preceding configuration.\nThe backup hot-standby disable command disables HSB for an SR-MPLS TE Policy.\nThe undo backup hot-standby disable command deletes the preceding configuration.\nThe undo backup hot-standby command deletes the HSB configuration of an SR-MPLS TE Policy and allows a device to inherit the configuration of the sr-te-policy backup hot-standby enable command run in the Segment Routing view.\nBy default, the configuration of the sr-te-policy backup hot-standby enable command run in the Segment Routing view is inherited directly.",
    "CLIs": [
        "backup hot-standby { enable | disable }",
        "undo backup hot-standby [ { enable | disable } ]"
    ],
    "ParentView": [
        "SR-MPLS TE policy view"
    ],
    "ParaDef": [
        {
            "Parameters": "enable",
            "Info": "Enables HSB for an SR-MPLS TE Policy.\n-"
        },
        {
            "Parameters": "disable",
            "Info": "Disables HSB for an SR-MPLS TE Policy. After you run the backup hot-standby disable command, HSB path information about the SR-MPLS TE Policy is deleted.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] segment-routing",
            "[*HUAWEI-segment-routing] sr-te policy policy1 endpoint 1.1.1.1 color 100",
            "[*HUAWEI-segment-routing-te-policy-policy1] backup hot-standby disable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe sr-te-policy backup hot-standby enable command enables HSB for all SR-MPLS TE Policies. However, the backup hot-standby command enables HSB for a single SR-MPLS TE Policy. If the sr-te-policy backup hot-standby enable command and the backup hot-standby command are both run for an SR-MPLS TE Policy, the backup hot-standby command configuration takes precedence."
}