{
    "PageTitle": "sr-te policy",
    "FuncDef": "The sr-te policy command creates an SR-MPLS TE Policy and displays the SR-MPLS TE Policy view.\nThe undo sr-te policy command deletes an SR-MPLS TE Policy.\nBy default, no SR-MPLS TE Policy is created.",
    "CLIs": [
        "sr-te policy <policy-name> [ endpoint <ipv4-address> color <color-value> ]",
        "undo sr-te policy <policy-name> [ endpoint <ipv4-address> color <color-value> ]"
    ],
    "ParentView": [
        "Segment routing view"
    ],
    "ParaDef": [
        {
            "Parameters": "policy-name",
            "Info": "Specifies the name of an SR-MPLS TE Policy.\nThe value is a string of 1 to 31 case-sensitive characters. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "endpoint ipv4-address",
            "Info": "Specifies the endpoint of an SR-MPLS TE Policy.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "color color-value",
            "Info": "Specifies the color value of an SR-MPLS TE Policy.\nThe value is an integer ranging from 0 to 4294967295."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] segment-routing",
            "[*HUAWEI-segment-routing] sr-te policy p1 endpoint 1.1.1.1 color 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nSR-MPLS TE Policies are used to direct traffic to traverse an SR-MPLS TE network. Each SR-MPLS TE Policy can have multiple candidate paths with different preferences. You can specify one of the paths to direct traffic forwarding. The candidate path with the highest preference can be selected as an active path.\nAfter the endpoint and color attributes are configured for an SR-MPLS TE Policy, traffic can be steered into the SR-MPLS TE Policy only when the next-hop address and color in the route of the traffic match the two attributes of the SR-MPLS TE Policy, respectively. Each policy can be configured with only one endpoint and color."
}