{
    "PageTitle": "lmp interface enable",
    "FuncDef": "The lmp interface enable command creates an in-band LMP interface, also known as an in-band control channel interface.\nThe undo lmp interface enable command deletes an in-band LMP interface.\nBy default, in-band LMP interfaces do not exist in the system.",
    "CLIs": [
        "lmp interface enable",
        "undo lmp interface enable"
    ],
    "ParentView": [
        "100GE interface view",
        "10GE interface view",
        "40GE interface view",
        "GE optical interface view",
        "GE electrical interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] lmp",
            "[*HUAWEI-lmp] quit",
            "[*HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] lmp interface enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAs an extension of MPLS, GMPLS separates the data channel from the control channel. If a fault occurs on the control channel, the data channel will not be affected, and service interruptions can be prevented. This enhances network robustness.\nSeparation between the control channel and the data channel may be implemented in either of the following modes:\nIf the control channel and data channel are separated in in-band mode, run the lmp interface enable command on the data channel interface where GMPLS TE is enabled to configure the interface to serve also as the in-band control channel interface.\nConfiguration Impact\nAfter the lmp interface enable command is run, the system will automatically generate a virtual LMP interface. (The in-band control channel interface is also called the LMP interface.) The number of the LMP interface is the same as that of the physical interface, and the LMP interface automatically borrows the IP address of the physical interface.\nPrecautions\nThis command can only be used on IP devices that are connected to optical network devices. Do not use other non-such devices."
}