{
    "PageTitle": "node-id",
    "FuncDef": "The node-id command configures an IP address for a Link Management Protocol (LMP) neighbor.\nThe undo node-id command deletes the configured IP address of an LMP neighbor.\nBy default, no IP address is configured for an LMP neighbor.",
    "CLIs": [
        "node-id <ip-address>",
        "undo node-id [ <ip-address> ]"
    ],
    "ParentView": [
        "LMP neighbor view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address",
            "Info": "Specifies the IP address of an LMP neighbor.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] lmp",
            "[*HUAWEI-lmp] peer OTN1",
            "[*HUAWEI-lmp-peer-OTN1] lmp static",
            "[*HUAWEI-lmp-peer-OTN1] node-id 10.1.1.1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nGeneralized Multi-Protocol Label Switching (GMPLS) separates a control channel from a data channel, and uses LMP to manage physical links for data and control channels. LMP includes dynamic LMP and static LMP.\nCurrently, the device supports only static LMP, meaning that the VRP cannot automatically discover LMP neighbors or LMP bind neighbors to data and control channel interfaces. You need to configure LMP neighbors (including names and IP addresses of the neighbors) for the VRP, and manually bind the neighbors to data and control channel interfaces, allowing the neighbors to manage the physical links for the data and control channels.\nAfter having created an LMP neighbor, you need to run the address command to configure an IP address for this neighbor. Specifying the node ID (LSR ID) of an LMP neighbor as the LMP neighbor's IP address is recommended.\nPrerequisites\nBefore running the address command, you need to:\nRun the peer command to configure an LMP neighbor.Run the lmp static command to enable static LMP.\n\nPrecautions\nIf the address command is run to configure an IP address for an LMP neighbor that has already had an IP address, the newly configured IP address will take effect and overwrite the original one."
}