{
    "PageTitle": "gmpls-tunnel",
    "FuncDef": "The gmpls-tunnel command displays the view of an existing GMPLS UNI tunnel or creates a GMPLS UNI tunnel and displays its view.\nThe undo gmpls-tunnel command deletes a GMPLS UNI tunnel.\nBy default, GMPLS UNI tunnels are not created.",
    "CLIs": [
        "gmpls-tunnel <gmpls-tunnel-name>",
        "undo gmpls-tunnel <gmpls-tunnel-name>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "gmpls-tunnel-name",
            "Info": "Specifies the name of a GMPLS UNI tunnel.\nThe value is a string of 1 to 63 characters, spaces not supported. The value must start with a letter and cannot contain a slash (/)."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] gmpls-tunnel toRt2",
            "[*HUAWEI-gmpls-tunnel-toRt2] destination 2.2.2.2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAccording to the convention, interworking between IP networks and transport networks needs to be configured manually, which is time consuming and increases carriers' service provision and maintenance costs. Generalized Multi-Protocol Label Switching (GMPLS) properly solves the problem. Using GMPLS for interconnection between IP networks and transport networks is recommended because this technology can greatly reduce service operation and maintenance costs.\nAt present, the device applies the GMPLS technology in the UNI model. The configuration is rather simple. You only need to configure a GMPLS UNI tunnel on the ingress EN and egress EN of IP networks. Then a tunnel will be automatically created across the transport network.\nAfter a GMPLS UNI tunnel is established, the two ends of the tunnel need to be bound to physical interfaces and the IP addresses and routing information of the interfaces need to be advertised to the IP networks. IP services then can be transmitted over the GMPLS UNI tunnel. In real world situations, the interfaces bound to the GMPLS UNI tunnel can be used as common physical interfaces.\nPrerequisites\nThe mpls te command has been run to enable MPLS TE globally.\nFollow-up Procedure\nConfigure tunnel attributes in the GMPLS UNI tunnel view, such as tunnel bandwidth and service authentication."
}