{
    "PageTitle": "bandwidth (GMPLS tunnel view)",
    "FuncDef": "The bandwidth command configures bandwidth for a GMPLS UNI tunnel.\nThe undo bandwidth command restores the default configuration.\nBy default, no bandwidth is configured for a GMPLS UNI tunnel.",
    "CLIs": [
        "bandwidth <bw-value>",
        "undo bandwidth"
    ],
    "ParentView": [
        "GMPLS tunnel view"
    ],
    "ParaDef": [
        {
            "Parameters": "bw-value",
            "Info": "Specifies the bandwidth for a GMPLS UNI tunnel.\nThe value ranges from 1 to 4000000000, in kbit/s."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] gmpls-tunnel toRt2",
            "[*HUAWEI-gmpls-tunnel-toRt2] bandwidth 5000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter running the gmpls-tunnel command to establish a GMPLS UNI tunnel, you need to run the bandwidth command in the GMPLS UNI tunnel view to configure bandwidth for the tunnel. The bandwidth command only needs to be run on an ingress EN, and does not need to be run on an egress EN to configure bandwidth for a reverse GMPLS UNI LSP. After the bandwidth command is run on an ingress EN, GMPLS UNI will automatically set up forward and reverse UNI LSPs with the same bandwidth.\nGMPLS UNI uses Resource Reservation Protocol-Traffic Engineering (RSVP-TE) to set up a bidirectional GMPLS UNI LSP. Both the forward and reverse UNI LSPs have the same TE requirements. You need to configure bandwidth for a GMPLS UNI tunnel based on the bandwidth required by GMPLS UNI services. GMPLS UNI adds the configured bandwidth to Path and Resv messages and reserves the same amount of bandwidth resources for setting up both the forward and reverse UNI LSPs.\nPrerequisites\nThe gmpls-tunnel command has been run to establish a GMPLS UNI tunnel.\nPrecautions\nIf the bandwidth command is run to configure bandwidth for a GMPLS UNI tunnel that has already been allocated bandwidth, the newly configured bandwidth will take effect and overwrite the original one."
}