{
    "PageTitle": "display pce protocol session",
    "FuncDef": "The display pce protocol session command displays PCEP session information.",
    "CLIs": [
        "display pce protocol session [ <ip-address> | verbose ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address",
            "Info": "Specifies the IP address of a server that establishes a PCEP session with a local client.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "verbose",
            "Info": "Displays detailed information about a PCEP session.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display pce protocol session",
            "Peer IP             State      Session ID",
            "10.2.2.2            UP         100"
        ],
        [
            "<HUAWEI> display pce protocol session verbose",
            "Session IP               : 10.7.7.7",
            "Session ID               : 73",
            "State                    : UP",
            "Keepalive Timer          : 30",
            "Hold Timer               : 120",
            "Peer Keepalive Timer     : 30",
            "Peer Hold Timer          : 120",
            "Session Capability       : Stateful, PCE-Init, Segment-Routing, Label-Stitch",
            "Session Preference       : 3(YES)",
            "Session Active Time      : 2017-07-19 13:20:50",
            "Last session down reason : Hold Timer Expired",
            "Notification Status      : Normal",
            "Maximum Segment Depth    : 10",
            "Stitch Label Base        : 321536",
            "Stitch Label Size        : 10240",
            "SSL Policy               : policy1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo view PCEP session information, run the display pce protocol session command. The command output contains the peer IP address, parameters on both ends, the session status, and causes for session errors.\nRun the display pce protocol session command to view the PCEP session status. If the State field is IDLE, a PCEP session fails to be established. Perform the following operations for fault diagnosis:\nRun the display ip routing-table command to view routes. If no route to the PCEP peer IP address exists, run the display ip routing-table command to obtain the command output for fault diagnosis. If a route to the PCEP peer IP address exists, go to the next step.Run the ping command to check whether the PCEP peer IP address is reachable. If the IP address is unreachable, obtain the ping command output for fault diagnosis.If the problem persists, run the display pce protocol session verbose command to view detailed PCEP session information. Use the command output to analyze the cause for the failure to establish the PCEP session.The Keepalive Timer field indicates the heartbeat timer of a PCEP session on the local end, and the Peer Keepalive Timer field indicates the heartbeat timer of a PCEP session on the peer end. If the two timers are different, a PCEP session fails to be established. Change the heartbeat timer in the PCE-server view so that the two ends use the same timer.If the problem persists, contact technical support personnel."
}