{
    "PageTitle": "multi-delegate enable",
    "FuncDef": "The multi-delegate enable command enables a PCE client to delegate TE LSPs to all PCE servers that have established PCEP sessions to the PCE client in geographical redundancy scenarios.\nThe undo multi-delegate enable command disables a PCE client from delegating TE LSPs to all PCE servers that have established PCEP sessions to the PCE client in geographical redundancy scenarios.\nBy default, a PCE client delegates all TE LSPs to the PCE server that forwarders select or that has the highest priority.",
    "CLIs": [
        "multi-delegate enable",
        "undo multi-delegate enable"
    ],
    "ParentView": [
        "PCE client view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] pce-client",
            "[*HUAWEI-pce-client] multi-delegate enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn a PCE+ scenario, forwarders (PCE clients) select the master and backup PCE servers. Each PCE client delegates all TE LSPs to the selected or highest-priority PCE server. The PCE server can then calculate paths for the delegated TE LSPs. In geographical redundancy, the master and backup PCE servers are configured on controllers. In this situation, the forwarders may select a master PCE server different from that configured on a controller, causing a master PCE server inconsistency. After PCE clients delegate all TE LSPs to the selected PCE server, the master PCE server configured on the controller cannot calculate paths. To prevent a path calculation failure, run the multi-delegate enable command to enable a PCE client to delegate TE LSPs to all PCE servers that have established PCEP sessions to the PCE client.\nPrerequisites\nA PCE client has been configured and the PCE client view has been displayed using the pce-client command.\nPrecautions\nAfter the multi-delegate enable command is run, the preference command run in the connect-server view cannot take effect."
}