{
    "PageTitle": "mesh-sdp",
    "FuncDef": "This command binds a VPLS service to an existing Service Distribution Point (SDP). Mesh SDPs bound to a service are logically treated like a single bridge \"port\" for flooded traffic where flooded traffic received on any mesh SDP on the service is replicated to other \"ports\" (spoke-SDPs and SAPs) and not transmitted on any mesh SDPs.",
    "CLIs": [
        "mesh-sdp sdp-id [ <:vc-id> ] [ vc-type { ether | vlan } ] [ root-leaf-tag | leaf-ac ]",
        "no mesh-sdp sdp-id [ <:vc-id> ]"
    ],
    "ParentView": [
        "config>service>vpls"
    ],
    "ParaDef": [
        {
            "Parameters": "sdp-id",
            "Info": "Specifies the SDP identifier. Values-1 to 17407."
        },
        {
            "Parameters": "vc-id",
            "Info": "Specifies the virtual circuit identifier. This value is used to validate the VC ID portion of each mesh SDP binding defined in the service. The default value of this object is equal to the service ID. Any value may be used for the vc-id when there is no existing mesh SDP within the service; if a mesh SDP exists then all other mesh SDPs in the service must be configured with the same vc-id. Values-1 to 4294967295."
        },
        {
            "Parameters": "vc-type",
            "Info": "This command overrides the default VC type signaled for the spoke or mesh binding to the far end of the SDP. The VC type is a 15 bit-quantity containing a value which represents the type of VC. The actual signaling of the VC type depends on the signaling parameter defined for the SDP. If signaling is disabled, the vc-type command can still be used to define the dot1q value expected by the far-end provider equipment. A change of the bindings VC type causes the binding to signal the new VC type to the far end when signaling is enabled. \nVC types are derived according to IETF draft-martini-l2circuit-trans-mpls."
        },
        {
            "Parameters": "ether",
            "Info": "Defines the VC type as Ethernet. The ethernet and vlan keywords are mutually exclusive. When the VC type is not defined then the default is Ethernet for spoke-SDP bindings. Defining Ethernet is the same as executing no vc-type and restores the default VC type for the spoke-SDP binding. (hex 5)."
        },
        {
            "Parameters": "vlan",
            "Info": "Defines the VC type as VLAN. The top VLAN tag, if a VLAN tag is present, is stripped from traffic received on the pseudowire, and a vlan-tag is inserted when forwarding into the pseudowire. The ethernet and vlan keywords are mutually exclusive. When the VC type is not defined then the default is Ethernet for mesh SDP bindings."
        },
        {
            "Parameters": "root-leaf-tag",
            "Info": "Specifies a tagging mesh SDP under an E-Tree VPLS. When a tag SDP binding is required, it is created with a root-leaf-tag flag. Only VLAN tag SDP bindings are supported. The VLAN type must be set to VC VLAN type. The root-leaf-tag parameter indicates this SDP binding is a tag SDP that will use a default VID 1 for root and 2 for leaf. The SDP binding tags egress E-Tree traffic with root and leaf VIDs as appropriate. Root and leaf VIDs are only significant between peering VPLS but the values must be consistent on each end. On ingress a tag SDP binding removes the VID tag on the interface between VPLS in the same E-Tree service. The tag SDP receives root tagged traffic and marks the traffic with a root indication internally. This option is not available on BGP EVPN-enabled E-Tree services."
        },
        {
            "Parameters": "leaf-ac",
            "Info": "Specifies an access (AC) mesh SDP binding under a E-Tree VPLS as a leaf access (AC) SDP. The default E-Tree SDP type is a root-ac if leaf-ac or root-leaf-tag is not specified at SDP binding creation. This option is only available when the VPLS is designated as an E-Tree VPLS. BGP EVPN-enabled E-Tree VPLS services support the leaf-ac option."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: none"
}