{
    "PageTitle": "ancp",
    "FuncDef": "This command sends an OAM request to the access node. ANCP can be used to send OAM messages to the access node. The access node must be able to accept these messages and will signal such support by the capability negotiations. If the operator attempts to send an OAM command to an access node that does not support such command the operation results in an error.",
    "CLIs": [
        "ancp { subscriber <sub-ident-string> | ancp-string <ancp-string> } loopback [ count <count> ] [ timeout <seconds> ] [ alarm ]",
        "ancp subscriber <sub-ident-string> loopback [ send-count <send-count> ] [ timeout <seconds> ] [ alarm ]"
    ],
    "ParentView": [
        "oam"
    ],
    "ParaDef": [
        {
            "Parameters": "sub-ident-string",
            "Info": "Specifies an existing subscriber-id. The node will use the ancp-string associated with the provided subscriber-id to identify the circuit."
        },
        {
            "Parameters": "ancp-string",
            "Info": "Specifies an existing ANCP string."
        },
        {
            "Parameters": "send-count",
            "Info": "Specifies the number of messages the access node will use to test the circuit. If omitted, the number will be determined by the access node via local policy. Values-1 to 32."
        },
        {
            "Parameters": "seconds",
            "Info": "Specifies how long the controlling node will wait for a result. Values-0 to 300."
        },
        {
            "Parameters": "alarm",
            "Info": "Specifies that the CLI the result will be returned to the CLI and a trap will be issued to indicate the test finished. If the flag is used through SNMP the results will be available in the results MIB and after the node sent the trap to indicate the results are ready."
        },
        {
            "Parameters": "loopback",
            "Info": "Sends an OAM loopback test request to the access node."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}