{
    "PageTitle": "atm-ping",
    "FuncDef": "This command tests ATM path connectivity and round trip time on an ATM VCC.",
    "CLIs": [
        "atm-ping <port-id:> <vpi/vci> [ end-to-end | segment ] [ dest <destination-id> ] [ send-count <send-count> ] [ timeout <timeout> ] [ interval <interval> ]"
    ],
    "ParentView": [
        "oam"
    ],
    "ParaDef": [
        {
            "Parameters": "port-id: vpi/vci",
            "Info": "Specifies the ID of the access port of the target VC. This parameter is required."
        },
        {
            "Parameters": "end-to-end | segment",
            "Info": "Specifies whether the ATM OAM loopback cell is destined to the first segment point in the line direction or the PVCC s connection endpoint. ParamDefault: Default- end-to-end"
        },
        {
            "Parameters": "destination-id",
            "Info": "Defines the LLID field in an OAM loopback cell. If set to all 1s, only the connection end (end-to-end ping) or segment end (segment ping) will respond to the ping. If the 'segment' parameter is specified and 'dest' is set to a specific destination, only the destination will respond to the ping. Values-A 16 byte octet string, with each octet separated by a colon, if not specified the value of all 0x11 will be used.."
        },
        {
            "Parameters": "send-count",
            "Info": "The number of messages to send, expressed as a decimal integer. The send-count parameter is used to override the default number of message requests sent. Each message request must either timeout or receive a reply before the next message request is sent. The message interval value must be expired before the next message request is sent. Values-1 to 100. ParamDefault: Default- 1"
        },
        {
            "Parameters": "timeout",
            "Info": "The timeout parameter in seconds, expressed as a decimal integer. This value is used to override the default timeout value and is the amount of time that the router will wait for a message reply after sending the message request. Upon the expiration of message timeout, the requesting router assumes that the message response will not be received. Any response received after the request times out will be silently discarded. Values-1 to 10. ParamDefault: Default- 5"
        },
        {
            "Parameters": "interval",
            "Info": "The interval parameter in seconds, expressed as a decimal integer. This parameter is used to override the default request message send interval and defines the minimum amount of time that must expire before the next message request is sent. Values-1 to 10. ParamDefault: Default- 1"
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}