{
    "PageTitle": "avg-flr-event",
    "FuncDef": "This command sets the frame loss ratio threshold configuration that will be applied and checked at the end of the measurement interval for the specified direction. This is a percentage based on average frame loss ratio over the entire measurement interval. If theclear-threshold-percentvalue is not specified, the traffic crossing alarm will be stateless. Stateless means the state is not carried forward to other measurement intervals. Each measurement interval is analyzed independently and without regard to any previous window. Each unique event can only be raised once within measurement interval. If the optional clear threshold is specified the traffic crossing alarm uses stateful behavior. Stateful means each unique previous event state is carried forward to following measurement intervals. If a threshold crossing event is raised another will not be raised until a measurement interval completes and the clear threshold has not been exceeded.\nA clear event will be raised under that condition.",
    "CLIs": [
        "avg-flr-event { forward | backward } threshold <raise-threshold-percentage> [ clear <clear-threshold-percentage> ]",
        "[ no ] avg-flr-event { forward | backward }"
    ],
    "ParentView": [
        "config>oam-pm>session>ethernet>slm>loss-events",
        "config>oam-pm>session>ethernet>lmm>loss-events",
        "config>oam-pm>session>ip>twamp-light>loss-events"
    ],
    "ParaDef": [
        {
            "Parameters": "forward",
            "Info": "Specifies the threshold is applied to the forward direction value."
        },
        {
            "Parameters": "backward",
            "Info": "Specifies the threshold is applied to the backward direction value."
        },
        {
            "Parameters": "raise-threshold-percentage",
            "Info": "Specifies the rising percentage that determines when the event is to be generated. Values-0.001 to 100.000."
        },
        {
            "Parameters": "clear-threshold-percentage",
            "Info": "Specifies an optional value used for stateful behavior that allows the operator to configure a percentage of loss value lower than the rising percentage to indicate when the clear event should be generated. Values-0.000 to 99.999."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: no avg-flr-event forwardno avg-flr-event backward"
}