{
    "PageTitle": "cpe-ping",
    "FuncDef": "This ping utility determines the IP connectivity to a CPE within a specified VPLS service.",
    "CLIs": [
        "cpe-ping service <service-id> destination <ip-address> source <ip-address> [ source-mac <ieee-address> ] [ fc <fc-name> [ profile { in | out } ] ] [ ttl <vc-label-ttl> ] [ count <send-count> ] [ return-control ] [ interval <interval> ]"
    ],
    "ParentView": [
        "oam",
        "config>saa>test>type"
    ],
    "ParaDef": [
        {
            "Parameters": "service-id",
            "Info": "Specifies the service ID of the service to diagnose or manage. Values-{id | svc-name}."
        },
        {
            "Parameters": "destination ip-address",
            "Info": "Specifies the IP address to be used as the destination for performing an OAM ping operations."
        },
        {
            "Parameters": "source ip-address",
            "Info": "Specifies an unused IP address in the same network that is associated with the VPLS or PBB Epipe."
        },
        {
            "Parameters": "vc-label-ttl",
            "Info": "Specifies the TTL value in the VC label for the OAM MAC request, expressed as a decimal integer. Values-1 to 255. ParamDefault: Default- 255"
        },
        {
            "Parameters": "return-control",
            "Info": "Specifies that MAC OAM replies to a data plane MAC OAM request be sent using the control plane instead of the data plane. This parameter is only valid for VPLS services. ParamDefault: Default- MAC OAM reply sent using the data plane."
        },
        {
            "Parameters": "ieee-address",
            "Info": "Specifies the source MAC address that will be sent to the CPE. If not specified or set to 0, the MAC address configured for the CPM or CFM is used. This parameter is not applicable to CPE ping on Epipes."
        },
        {
            "Parameters": "fc-name",
            "Info": "Specifies the forwarding class of the MPLS echo request encapsulation. Values-be, l2, af, l1, h2, ef, h1, nc. ParamDefault: Default- be"
        },
        {
            "Parameters": "profile {in | out}",
            "Info": "Specifies the profile state of the MPLS echo request encapsulation for VPLS and the ARP packet for PBB Epipe and Epipe VLLs. ParamDefault: Default- out"
        },
        {
            "Parameters": "interval",
            "Info": "Specifies the interval parameter in seconds, expressed as a decimal integer. This parameter is used to override the default request message send interval and defines the minimum amount of time that must expire before the next message request is sent. Values-1 to 10. ParamDefault: Default- 1"
        },
        {
            "Parameters": "send-count",
            "Info": "Specifies the number of messages to send, expressed as a decimal integer. The count parameter is used to override the default number of message requests sent. Each message request must either timeout or receive a reply before the next message request is sent. The message interval value must be expired before the next message request is sent. Values-1 to 100. ParamDefault: Default- 1"
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}