{
    "PageTitle": "delay-event",
    "FuncDef": "This command sets the bin number, the threshold and the direction that is monitored to determine if a delay metric threshold crossing event has occurred or has cleared. It requires a bin number, a rising threshold value and a direction. If theclear-thresholdvalue is not specified, the traffic crossing alarm will be stateless. Stateless means the state is not carried forward to other measurement intervals. Each measurement interval is analyzed independently and without regard to any previous window. When a raise threshold is reached, the log event is generated. Each unique threshold can only be raised once for the threshold within measurement interval. If the optional clear threshold is specified, the traffic crossing alarm uses stateful behavior. Stateful means each unique previous event state is carried forward to following measurement intervals. If a threshold crossing event is raised another will not be raised until a measurement interval\ncompletes, and the clear threshold has not been exceeded. A clear event will be raised under that condition. In general, alarms are generated when there is a state change. The thresholds configured will be applied to the count in specified bin and all higher number bins.",
    "CLIs": [
        "delay-event { forward | backward | round-trip } lowest-bin <bin-number>",
        "threshold <raise-threshold> [ clear <clear-threshold> ]",
        "[ no ] delay-event { forward | backward | round-trip }"
    ],
    "ParentView": [
        "config>oam-pm>bin-group>bin-type"
    ],
    "ParaDef": [
        {
            "Parameters": "forward",
            "Info": "The threshold is applied to the forward direction bin."
        },
        {
            "Parameters": "backward",
            "Info": "The threshold is applied to the backward direction bin."
        },
        {
            "Parameters": "round-trip",
            "Info": "The threshold is applied to the roundtrip direction bin."
        },
        {
            "Parameters": "bin-number",
            "Info": "The number of the bin that the threshold is applied to. This bin and all higher bins will be monitoring to determine if the sum total results in these bins have reached or crossed the configured threshold. Values-0 to 9."
        },
        {
            "Parameters": "raise-threshold",
            "Info": "The rising numerical value in the range that determines when the event is to be generated, when value reached. Values-1 to 864000."
        },
        {
            "Parameters": "clear-threshold",
            "Info": "An optional numerical value in the range threshold used to indicate stateful behavior that allows the operator to configure a lower value than the rising threshold that determines when the clear event should be generated. Clear is generated when the end of measurement interval count is less than or equal to the configured value. If this option is not configured the behavior is stateless. Zero means no results can exist in the lower bin or any higher. Values-0 to 863999. ParamDefault: Default- Clear threshold disabled"
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}