{
    "PageTitle": "dns",
    "FuncDef": "This command performs DNS name resolution. If ipv4-a-record is specified, dns-names are queried for A-records only. If ipv6-aaaa-record is specified, AAAA-records are queried first, and if a successful reply is not received, the dns-server is queried for A-records (applies to the 7750 SR and 7950 XRS).",
    "CLIs": [
        "dns target-addr <dns-name> name-server <ip-address> [ source <ip-address> ] [ send-count <send-count> ] [ timeout <timeout> ] [ interval <interval> ] [ record-type { ipv4-a-record | ipv6-aaaa-record } ]"
    ],
    "ParentView": [
        "oam"
    ],
    "ParaDef": [
        {
            "Parameters": "send-count",
            "Info": "The number of messages to send, expressed as a decimal integer. The send-count parameter is used to override the default number of message requests sent. Each message request must either timeout or receive a reply before the next message request is sent. The message interval value must be expired before the next message request is sent. Values-1 to 100. ParamDefault: Default- 1"
        },
        {
            "Parameters": "ip-address",
            "Info": "The IP or IPv6 address of the primary DNS server."
        },
        {
            "Parameters": "timeout",
            "Info": "The timeout parameter in seconds, expressed as a decimal integer. This value is used to override the default timeout value and is the amount of time that the router will wait for a message reply after sending the message request. Upon the expiration of message timeout, the requesting router assumes that the message response will not be received. Any response received after the request times out will be silently discarded. Values-1 to 120. ParamDefault: Default- 5"
        },
        {
            "Parameters": "interval",
            "Info": "The interval parameter in seconds, expressed as a decimal integer. This parameter is used to override the default request message send interval and defines the minimum amount of time that must expire before the next message request is sent. Values-1 to 10. ParamDefault: Default- 1"
        },
        {
            "Parameters": "record-type",
            "Info": "Specifies a record type (applies to the 7750 SR and 7950 XRS only). Values-ipv4-a-record - A record specific mapping a host name to an IPv4 address.."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}