{
    "PageTitle": "dns",
    "FuncDef": "This command configures a DNS name resolution test.",
    "CLIs": [
        "dns target-addr <dns-name> name-server <ip-address> [ source <ip-address> ] [ count <send-count> ] [ timeout <timeout> ] [ interval <interval> ] [ record-type { ipv4-a-record | ipv6-aaaa-record } ]"
    ],
    "ParentView": [
        "oam",
        "config>saa>test>type"
    ],
    "ParaDef": [
        {
            "Parameters": "dns-name",
            "Info": "Specifies the DNS name to be resolved to an IP address."
        },
        {
            "Parameters": "name-server ip-address",
            "Info": "Specifies the server connected to a network that resolves network names into network addresses."
        },
        {
            "Parameters": "source ip-address",
            "Info": "Specifies the IP address to be used as the source for performing an OAM ping operation."
        },
        {
            "Parameters": "send-count",
            "Info": "Specifies the number of messages to send, expressed as a decimal integer. The send-count parameter is used to override the default number of message requests sent. Each message request must either timeout or receive a reply before the next message request is sent. The message interval value must be expired before the next message request is sent. Values-1 to 100. ParamDefault: Default- 1"
        },
        {
            "Parameters": "timeout",
            "Info": "Specifies the timeout parameter in seconds, expressed as a decimal integer. This value is used to override the default timeout value and is the amount of time that the router will wait for a message reply after sending the message request. Upon the expiration of message timeout, the requesting router assumes that the message response will not be received. Any response received after the request times out will be silently discarded. Values-1 to 120. ParamDefault: Default- 5"
        },
        {
            "Parameters": "interval",
            "Info": "Specifies the interval parameter in seconds, expressed as a decimal integer. This parameter is used to override the default request message send interval and defines the minimum amount of time that must expire before the next message request is sent. Values-1 to 10. ParamDefault: Default- 1"
        },
        {
            "Parameters": "ipv4-a-record",
            "Info": "Specifies the record type as IPv4 A."
        },
        {
            "Parameters": "ipv6-aaaa-record",
            "Info": "Specifies the record type as IPv6 AAAA."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}