{
    "PageTitle": "eth-cfm-linktrace",
    "FuncDef": "This command configures a CFM linktrace test in SAA.",
    "CLIs": [
        "eth-cfm-linktrace { <mac-address> | remote-mepid <mep-id> } mep <mep-id> domain <md-index> association <ma-index> [ ttl <ttl-value> ] [ fc <fc-name> [ profile { in | out } ] ] [ count <send-count> ] [ timeout <timeout> ] [ interval <interval> ]"
    ],
    "ParentView": [
        "config>saa>test>type"
    ],
    "ParaDef": [
        {
            "Parameters": "mac-address",
            "Info": "Specifies the Layer 2 unicast MAC address of the destination MEP in the form xx:xx:xx:xx:xx:xx or xx-xx-xx-xx-xx-xx."
        },
        {
            "Parameters": "remote-mepid mep-id",
            "Info": "Specifies the remote MEP ID as an alternative to the static mac-address. When the remote-mepid parameter is used in place of the mac-address, the domain and association information of the source mep for the test will be used to check for a locally-stored unicast MAC address for the peer. The local MEP must be administratively enabled. Values-1 to 8191."
        },
        {
            "Parameters": "mep mep-id",
            "Info": "Specifies the local MEP ID. Values-1 to 8191."
        },
        {
            "Parameters": "md-index",
            "Info": "Specifies the MD index. Values-1 to 4294967295."
        },
        {
            "Parameters": "ma-index",
            "Info": "Specifies the MA index. Values-1 to 4294967295."
        },
        {
            "Parameters": "ttl-value",
            "Info": "Specifies the maximum number of hops traversed in the linktrace. Values-1 to 255. ParamDefault: Default- 64"
        },
        {
            "Parameters": "fc-name",
            "Info": "Specifies the forwarding class of the MPLS echo request packets. The actual forwarding class encoding is controlled by the network egress LSP-EXP mappings. Values-be, l2, af, l1, h2, ef, h1, nc. ParamDefault: Default- nc"
        },
        {
            "Parameters": "profile {in | out}",
            "Info": "Specifies the profile state of the MPLS echo request encapsulation. ParamDefault: Default- in"
        },
        {
            "Parameters": "send-count",
            "Info": "Specifies the number of messages to send, expressed as a decimal integer. The count parameter is used to override the default number of message requests sent. Each message request must either timeout or receive a reply before the next message request is sent. The message interval value must be expired before the next message request is sent. Values-1 to 10. ParamDefault: Default- 1"
        },
        {
            "Parameters": "timeout",
            "Info": "Specifies the timeout parameter in seconds, expressed as a decimal integer. This value is used to override the default timeout value and is the amount of time that the router will wait for a message reply after sending the last probe for a specific test. Upon the expiration of timeout, the test will be marked complete and no more packets will be processed for any of those request probes. Values-1 to 10. ParamDefault: Default- 5"
        },
        {
            "Parameters": "interval",
            "Info": "Specifies the interval parameter in seconds, expressed as a decimal integer. This parameter is used to override the default request message send interval and defines the minimum amount of time that must expire before the next message request is sent. Values-1 to 10. ParamDefault: Default- 5"
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}