{
    "PageTitle": "icmp-ping",
    "FuncDef": "This command configures an ICMP traceroute test.",
    "CLIs": [
        "icmp-ping { <ip-address> | <dns-name> } [ bypass-routing | { interface <interface-name> } | { next-hop <ip-address> } ] [ count <requests> ] [ do-not-fragment ] [ fc <fc-name> ] [ interval { <centisecs> | <secs> } ] [ pattern <pattern> ] [ rapid ] { [ router <router-or-service> ] | router-instance <router-instance> | service-name <service-name> } [ size <bytes> ] [ source <ip-address> ] [ timeout <timeout> ] [ tos <type-of-service> ] [ ttl <time-to-live> ]"
    ],
    "ParentView": [
        "config>saa>test>type"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address",
            "Info": "Specifies the far-end IP address to which to send the svc-ping request message in dotted decimal notation."
        },
        {
            "Parameters": "dns-name",
            "Info": "The DNS name of the far-end device to which to send the svc-ping request message, expressed as a character string up to 63 characters maximum."
        },
        {
            "Parameters": "bypass-routing",
            "Info": "Specifies whether to send the ping request to a host on a directly attached network bypassing the routing table."
        },
        {
            "Parameters": "interface-name",
            "Info": "The name used to refer to the interface. The name must already exist in the config>router>interface context."
        },
        {
            "Parameters": "next-hop ip-address",
            "Info": "Only displays static routes with the specified next hop IP address."
        },
        {
            "Parameters": "requests",
            "Info": "Specifies the number of times to perform an OAM ping probe operation. Each OAM echo message request must either timeout or receive a reply before the next message request is sent. Values-1 to 100000. ParamDefault: Default- 5"
        },
        {
            "Parameters": "do-not-fragment",
            "Info": "Sets the DF (Do Not Fragment) bit in the ICMP ping packet (does not apply to ICMPv6)."
        },
        {
            "Parameters": "fc-name",
            "Info": "Specifies the forwarding class of the SAA. Values-be, l2, af, l1, h2, ef, h1, nc. ParamDefault: Default- be"
        },
        {
            "Parameters": "interval {centisecs | secs}",
            "Info": "Specifies the minimum amount of time, in seconds, that must expire before the next message request is sent. If the rapid parameter is configured, this value is measured in centiseconds (hundredths of a second) instead of seconds. Values-1 to 10000. ParamDefault: Default- 1"
        },
        {
            "Parameters": "pattern",
            "Info": "The date portion in a ping packet will be filled with the pattern value specified. If not specified, a system-generated sequential pattern is used. Values-0 to 65535."
        },
        {
            "Parameters": "rapid",
            "Info": "Configures the interval parameter to use centiseconds (hundredths of a second) instead of seconds."
        },
        {
            "Parameters": "router router-or-service",
            "Info": "Specifies the numerical reference to the router instance or service. Well known router names \"Base\", \"management\" and \" vpls-management\" are allowed for convenience, but are mapped numerically. Values-{router-name | vprn-svc-id}. ParamDefault: Default- Base"
        },
        {
            "Parameters": "router-instance router-instance",
            "Info": "Specifies the preferred method for entering a service name. Stored as the service name. Only service linking function that is allowed for both mixed-mode and model-driven configuration modes. Values-{router-name | vprn-svc-name}."
        },
        {
            "Parameters": "service-name service-name",
            "Info": "Specifies the alias function that allows the service-name to be used, converted and stored as service ID."
        },
        {
            "Parameters": "bytes",
            "Info": "The request packet size in bytes, expressed as a decimal integer. Values-0 to 16384. ParamDefault: Default- 56"
        },
        {
            "Parameters": "source {ip-address | dns-name}",
            "Info": "Specifies the IP address to be used."
        },
        {
            "Parameters": "timeout",
            "Info": "The time-out parameter in seconds, expressed as a decimal integer. This value is used to override the default timeout value and is the amount of time that the router will wait for a message reply after sending the last probe for a specific test. Upon the expiration of timeout, the test will be marked complete and no more packets will be processed for any of those request probes. Values-1 to 10. ParamDefault: Default- 5"
        },
        {
            "Parameters": "type-of-service",
            "Info": "Specifies the service type. Values-0 to 255. ParamDefault: Default- 0"
        },
        {
            "Parameters": "time-to-live",
            "Info": "Specifies the TTL value for the MPLS label, expressed as a decimal integer. Values-1 to 128. ParamDefault: Default- 64"
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}