{
    "PageTitle": "loopback",
    "FuncDef": "The command specifies to initiate a loopback test.",
    "CLIs": [
        "loopback { <mac-address> | multicast | remote-mepid <mep-id> } mep <mep-id> domain <md-index> association <ma-index> [ send-count <send-count> ] [ size <data-size> ] [ priority <priority> ] [ lbm-padding <padding-size> ] [ timeout <timeout> ] [ interval <interval-time> ]"
    ],
    "ParentView": [
        "oam>eth-cfm"
    ],
    "ParaDef": [
        {
            "Parameters": "mac-address",
            "Info": "Specifies a unicast MAC address or multicast MAC address in the form xx:xx:xx:xx:xx:xx or xx-xx-xx-xx-xx-xx. The last nibble of the multicast address must match the level of the local MEP, or the command will fail and the test will not be instantiated."
        },
        {
            "Parameters": "multicast",
            "Info": "Builds the class one destination multicast address based on the level of the local MEP. The last nibble of the multicast address must match the level of the local MEP or the command will fail and the test will not be instantiated."
        },
        {
            "Parameters": "remote-mepid mep-id",
            "Info": "Specifies the remote MEP ID of the peer within the association. The domain and association information are derived from the source mep for the session. The Layer 2 IEEE MAC address is resolved from previously-learned remote MAC addressing, derived from the reception and processing of the ETH-CC PDU. The local MEP must be administratively enabled. Values-1 to 8191."
        },
        {
            "Parameters": "mep mep-id",
            "Info": "Specifies the local MEP ID. Values-1 to 8191."
        },
        {
            "Parameters": "md-index",
            "Info": "Specifies the MD index. Values-1 to 4294967295."
        },
        {
            "Parameters": "ma-index",
            "Info": "Specifies the MA index. Values-1 to 4294967295."
        },
        {
            "Parameters": "send-count",
            "Info": "Specifies the number of messages to send, expressed as a decimal integer. Loopback messages are sent back-to-back, with no delay between the transmissions. Values-1 to 1024. ParamDefault: Default- 1"
        },
        {
            "Parameters": "data-size",
            "Info": "Specifies the size of the data portion of the data TLV allowing for an optional octet string to be specified. If 0 is specified, no data TLV is added to the packet. This parameter and lbm-padding are mutually exclusive. Values-0 to 1500. ParamDefault: Default- 0"
        },
        {
            "Parameters": "padding-size",
            "Info": "Specifies the size of the data portion of the data TLV and does not allow for an optional octet string. MSDU will not be processed when lbm-padding is in use.   If 0 is specified, no data TLV is added to the packet. This is specified with an octet string. This parameter and size are mutually exclusive. Values-0, 3 to 9000. ParamDefault: Default- 0"
        },
        {
            "Parameters": "priority",
            "Info": "Specifies a 3-bit value to be used in the VLAN tag, if present, in the transmitted frame. Values-0 to 7. ParamDefault: Default- ccm-ltm-priority for the MEP (7)"
        },
        {
            "Parameters": "interval-time",
            "Info": "Specifies the interval parameter in increments of deciseconds (100 ms). This parameter is used to configure the spacing between probes within the test run. A value of 0 means probes will be sent with no enforced delay. This value is only applicable to tests where the send-count is 5 or less. Values-0 to 600. ParamDefault: Default- 0 or 10 depending on send-count"
        },
        {
            "Parameters": "timeout",
            "Info": "Specifies the timeout parameter in seconds, expressed as a decimal integer. This value is used to override the default timeout value and is the amount of time that the router will wait for a message reply after sending the message request. Upon the expiration of message timeout, the requesting router assumes that the message response will not be received. Any response received after the request times out will be silently discarded. Values-1 to 10. ParamDefault: Default- 5"
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}