{
    "PageTitle": "mac-ping",
    "FuncDef": "Themac-pingutility is used to determine the existence of an egress SAP binding of a given MAC within a VPLS service.",
    "CLIs": [
        "mac-ping service <service-id> destination <dst-ieee-address> [ source <src-ieee-address> ] [ fc <fc-name> [ profile { in | out } ] ] [ size <octets> ] [ ttl <vc-label-ttl> ] [ count <send-count> ] [ return-control ] [ interval <interval> ] [ timeout <timeout> ]"
    ],
    "ParentView": [
        "oam",
        "config>saa>test>type"
    ],
    "ParaDef": [
        {
            "Parameters": "service-id",
            "Info": "Specifies the service ID of the service to diagnose or manage. Values-1 to 2147483647 | service-name."
        },
        {
            "Parameters": "destination ieee-address",
            "Info": "Specifies the destination MAC address for the OAM MAC request."
        },
        {
            "Parameters": "octets",
            "Info": "Specifies the MAC OAM request packet size in octets, expressed as a decimal integer. The request payload is padded to the specified size with a 6 byte PAD header and a byte payload of 0xAA as necessary. If the octet size specified is less than the minimum packet, the minimum sized packet necessary to send the request is used. Values-1 to 9198."
        },
        {
            "Parameters": "vc-label-ttl",
            "Info": "Specifies the TTL value in the VC label for the OAM MAC request, expressed as a decimal integer. Values-1 to 255. ParamDefault: Default- 255"
        },
        {
            "Parameters": "return-control",
            "Info": "Specifies the MAC OAM reply to a data plane MAC OAM request be sent using the control plane instead of the data plane."
        },
        {
            "Parameters": "src-ieee-address",
            "Info": "Specifies the source MAC address from which the OAM MAC request originates. By default, the system MAC address for the chassis is used. Values-Any unicast MAC value.. ParamDefault: Default- The system MAC address."
        },
        {
            "Parameters": "fc-name",
            "Info": "Specifies that the fc parameter be used to test the forwarding class of the MPLS echo request packets. The actual forwarding class encoding is controlled by the network egress LSP-EXP mappings. Values-be, l2, af, l1, h2, ef, h1, nc. ParamDefault: Default- be"
        },
        {
            "Parameters": "profile {in | out}",
            "Info": "Specifies the profile state of the MPLS echo request encapsulation. ParamDefault: Default- out"
        },
        {
            "Parameters": "interval",
            "Info": "The interval parameter in seconds, expressed as a decimal integer. This parameter is used to override the default request message send interval and defines the minimum amount of time that must expire before the next message request is sent. Values-1 to 10. ParamDefault: Default- 1"
        },
        {
            "Parameters": "send-count",
            "Info": "Specifies the number of messages to send, expressed as a decimal integer. The count parameter is used to override the default number of message requests sent. Each message request must either timeout or receive a reply before the next message request is sent. The message interval value must be expired before the next message request is sent. Values-1 to 100. ParamDefault: Default- 1"
        },
        {
            "Parameters": "timeout",
            "Info": "Specifies the timeout parameter in seconds, expressed as a decimal integer. This value is used to override the default timeout value and is the amount of time that the router will wait for a message reply after sending the message request. Upon the expiration of message timeout, the requesting router assumes that the message response will not be received. Any response received after the request times out will be silently discarded. Values-1 to 10. ParamDefault: Default- 5"
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}