{
    "PageTitle": "mac-populate",
    "FuncDef": "This command populates the FDB with an OAM-type MAC entry indicating the node is the egress node for the MAC address and optionally floods the OAM MAC association throughout the service. Themac-populatecommand installs an OAM MAC into the service FDB indicating the device is the egress node for a particular MAC address. The MAC address can be bound to a particular SAP (thetarget-sap) or can be associated with the control plane in that any data destined to the MAC address is forwarded to the control plane (CPM). As a result, if the service on the node has neither a FDB nor an egress SAP, then it is not allowed to initiate amac-populate.",
    "CLIs": [
        "mac-populate { <service-id> | service <service-name> } mac <ieee-address> [ flood ] [ age <seconds> ] [ force ] [ target-sap <sap-id> ]"
    ],
    "ParentView": [
        "oam"
    ],
    "ParaDef": [
        {
            "Parameters": "service-id",
            "Info": "Specifies the service ID of the service to diagnose or manage. Values-1 to 2147483647."
        },
        {
            "Parameters": "service-name",
            "Info": "Specifies the name of the service to diagnose or manage. 64 characters maximum."
        },
        {
            "Parameters": "ieee-address",
            "Info": "Specifies the MAC address to be populated."
        },
        {
            "Parameters": "flood",
            "Info": "Sends the OAM MAC populate to all upstream nodes."
        },
        {
            "Parameters": "seconds",
            "Info": "Specifies the age for the OAM MAC, in seconds, expressed as a decimal integer. Values-1 to 65535. ParamDefault: Default- 3600"
        },
        {
            "Parameters": "force",
            "Info": "Converts the MAC to an OAM MAC."
        },
        {
            "Parameters": "sap-id",
            "Info": "Specifies the local target SAP bound to a service on which to associate the OAM MAC. By default, the OAM MAC is associated with the control place, that is, it is associated with the CPU on the router. ParamDefault: Default- Associate OAM MAC with the control plane (CPU)"
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}