{
    "PageTitle": "mfib-ping",
    "FuncDef": "The mfib-ping utility determines the list of SAPs which egress a certain IP multicast stream (identified by source unicast and destination multicast IP addresses) within a VPLS service. An mfib-ping packet is always sent via the data plane.",
    "CLIs": [
        "mfib-ping service <service-id> source <src-ip> destination <mcast-address> [ size <size> ] [ ttl <vc-label-ttl> ] [ count <send-count> ] [ return-control ] [ timeout <timeout> ] [ interval <interval> ]"
    ],
    "ParentView": [
        "oam"
    ],
    "ParaDef": [
        {
            "Parameters": "service-id",
            "Info": "Specifies the service ID of the VPLS to diagnose or manage. Values-1 to 2147483647 | service-name."
        },
        {
            "Parameters": "src-ip",
            "Info": "Specifies the source IP address for the OAM request."
        },
        {
            "Parameters": "mcast-address",
            "Info": "Specifies the destination multicast address for the OAM request."
        },
        {
            "Parameters": "size",
            "Info": "Specifies the multicast OAM request packet size, in octets, expressed as a decimal integer. The request payload is padded to the specified size with a 6-byte PAD header and a byte payload of 0xAA as necessary. Values-1 to 65535. ParamDefault: Default- No OAM packet padding"
        },
        {
            "Parameters": "vc-label-ttl",
            "Info": "Specifies the TTL value in the VC label for the OAM request, expressed as a decimal integer. Values-1 to 255. ParamDefault: Default-  255"
        },
        {
            "Parameters": "return-control",
            "Info": "Specifies the OAM reply has to be sent using the control plane instead of the data plane."
        },
        {
            "Parameters": "interval",
            "Info": "Specifies the interval parameter, in seconds, expressed as a decimal integer. This parameter is used to override the default request message send interval and defines the minimum amount of time that must expire before the next message request is sent. Values-1 to 10. ParamDefault: Default-  1"
        },
        {
            "Parameters": "send-count",
            "Info": "Specifies the number of messages to send, expressed as a decimal integer. The count parameter is used to override the default number of message requests sent. Each message request must either timeout or receive a reply before the next message request is sent. Values-1 to 100. ParamDefault: Default-  1"
        },
        {
            "Parameters": "seconds",
            "Info": "Specifies the timeout parameter in seconds, expressed as a decimal integer. This value is used to override the default timeout value and is the amount of time that the router will wait for a message reply after sending the next message request. Values-1 to 100. ParamDefault: Default-  5"
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}