{
    "PageTitle": "ping",
    "FuncDef": "This command verifies the reachability of a remote host.",
    "CLIs": [
        "ping { <ip-address> | <dns-name> } [ { next-hop <ip-address> } | { interface <interface-name> } | bypass-routing ]",
        "ping <ip-address> subscriber-id <sub-ident-string>"
    ],
    "ParentView": [
        "<global>"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address",
            "Info": "Specifies the far-end IP address to which to send the svc-ping request message in dotted decimal notation."
        },
        {
            "Parameters": "dns-name",
            "Info": "Specifies the DNS name of the far-end device to which to send the svc-ping request message, expressed as a character string."
        },
        {
            "Parameters": "rapid",
            "Info": "Specifies that packets will be generated as fast as possible instead of the default 1 per second."
        },
        {
            "Parameters": "detail",
            "Info": "Displays detailed information."
        },
        {
            "Parameters": "time-to-live",
            "Info": "Specifies the TTL value for the MPLS label, expressed as a decimal integer. Values-1 to 128."
        },
        {
            "Parameters": "type-of-service",
            "Info": "Specifies the service type. Values-0 to 255."
        },
        {
            "Parameters": "bytes",
            "Info": "Specifies the request packet size in bytes, expressed as a decimal integer. Values-0 to 16384."
        },
        {
            "Parameters": "pattern",
            "Info": "Specifies the date portion in a ping packet will be filled with the pattern value specified. If not specified, position info will be filled instead. Values-0 to 65535. ParamDefault: Default- system-generated sequential pattern."
        },
        {
            "Parameters": "source ip-address",
            "Info": "Specifies the IP address to be used."
        },
        {
            "Parameters": "router router-or-service",
            "Info": "Specifies the routing instance or service, by number. The router-instance parameter is preferred for specifying the router or service. Values-{router-name | vprn-svc-id}. ParamDefault: Default- Base"
        },
        {
            "Parameters": "service-name service-name",
            "Info": "Specifies the alias function that allows the service-name to be used, converted and stored as service ID."
        },
        {
            "Parameters": "router instance router-instance",
            "Info": "Specifies the preferred method for entering a service name. Stored as the service name. Only service linking function that is allowed for both mixed-mode and model-driven configuration modes. Values-{router-name | vprn-svc-name}."
        },
        {
            "Parameters": "bypass-routing",
            "Info": "Specifies whether to send the ping request to a host on a directly attached network bypassing the routing table."
        },
        {
            "Parameters": "interface-name",
            "Info": "Specifies the name of an IP interface. The name must already exist in the config>router>interface context."
        },
        {
            "Parameters": "next-hop ip-address",
            "Info": "Displays only static routes with the specified next hop IP address."
        },
        {
            "Parameters": "requests",
            "Info": "Specifies the number of times to perform an OAM ping probe operation. Each OAM echo message request must either timeout or receive a reply before the next message request is sent. Values-1 to 100000. ParamDefault: Default- 5"
        },
        {
            "Parameters": "do-not-fragment",
            "Info": "Sets the DF (Do Not Fragment) bit in the ICMP ping packet (does not apply to ICMPv6)."
        },
        {
            "Parameters": "seconds",
            "Info": "Overrides the default timeout value and is the amount of time that the router will wait for a message reply after sending the message request. Upon the expiration of message timeout, the requesting router assumes that the message response will not be received. A  request timeout  message is displayed by the CLI for each message request sent that expires. Any response received after the request times out will be silently discarded. Values-1 to 10. ParamDefault: Default- 5"
        },
        {
            "Parameters": "timeout",
            "Info": "Specifies the timeout, in seconds. Values-1 to 10."
        },
        {
            "Parameters": "sub-ident-string",
            "Info": "Specifies the L2-Aware NAT subscriber to which ICMP-ping is sent, up to 32 characters. The subscriber-id keyword serves as a differentiator between the subscribers with the same IP address in the same routing context (which is allowed in L2-Aware NAT). The subscriber-id keyword is mandatory for L2-Aware IPv4 ping, but optional in generic ping framework."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}