{
    "PageTitle": "sdp-mtu",
    "FuncDef": "Performs MTU Path tests on an SDP to determine the largest path-mtu supported on an SDP. Thesize-incparameter can be used to easily determine thepath-mtuof a given SDP-ID. The forwarding class is assumed to be Best-Effort Out-of-Profile. The message reply is returned with IP/GRE encapsulation from the far-end router. OAM request messages sent within an IP/GRE SDP must have the  DF  IP header bit set to 1 to prevent message fragmentation.",
    "CLIs": [
        "sdp-mtu <orig-sdp-id> size-inc <start-octets> <end-octets> [ step <step-size> ] [ timeout <seconds> ] [ interval <seconds> ]"
    ],
    "ParentView": [
        "oam"
    ],
    "ParaDef": [
        {
            "Parameters": "orig-sdp-id",
            "Info": "The sdp-id to be used by sdp-ping, expressed as a decimal integer. The far-end address of the specified sdp-id is the expected responder-id within each reply received. The specified sdp-id defines the encapsulation of the SDP tunnel encapsulation used to reach the far end. This can be IP/GRE or MPLS. If orig-sdp-id is invalid or administratively down or unavailable for some reason, the SDP echo request message is not sent and an appropriate error message is displayed (once the interval timer expires, sdp-ping will attempt to send the next request if required). Values-1 to 17407."
        },
        {
            "Parameters": "start-octets",
            "Info": "The beginning size in octets of the first message sent for an incremental MTU test, expressed as a decimal integer. Values-40 to 9198."
        },
        {
            "Parameters": "end-octets",
            "Info": "The ending size in octets of the last message sent for an incremental MTU test, expressed as a decimal integer. The specified value must be greater than start-octets. Values-40 to 9198."
        },
        {
            "Parameters": "step-size",
            "Info": "The number of octets to increment the message size request for each message sent for an incremental MTU test, expressed as a decimal integer. The next size message will not be sent until a reply is received or three messages have timed out at the current size. Values-1 to 512. ParamDefault: Default- 32"
        },
        {
            "Parameters": "timeout seconds",
            "Info": "The timeout parameter in seconds, expressed as a decimal integer. This value is used to override the default timeout value and is the amount of time that the router will wait for a message reply after sending the message request. Upon the expiration of message timeout, the requesting router assumes that the message response will not be received. A  request timeout  message is displayed by the CLI for each message request sent that expires. Any response received after the request times out will be silently discarded. Values-1 to 10. ParamDefault: Default- 5"
        },
        {
            "Parameters": "interval seconds",
            "Info": "The interval parameter in seconds, expressed as a decimal integer. This parameter is used to override the default request message send interval and defines the minimum amount of time that must expire before the next message request is sent. Values-1 to 10. ParamDefault: Default- 1"
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}