{
    "PageTitle": "timing",
    "FuncDef": "This command defines various availability parameters but not the probe interval. A single TWAMP-Light frame is used to collect both delay and loss metrics; the interval is common to both and as such not unique per metric type. Any TWAMP light test that is attempting to become active will validate the configuration of the timing parameter regardless of which statistics are being recorded.",
    "CLIs": [
        "timing frames-per-delta-t <frames> consec-delta-t <deltas> chli-threshold <threshold>",
        "no timing frames-per-delta-t <frames> consec-delta-t <deltas> chli-threshold <threshold>"
    ],
    "ParentView": [
        "config>oam-pm>session>ip>twamp-light>loss"
    ],
    "ParaDef": [
        {
            "Parameters": "frames",
            "Info": "Defines the size of the small measurement window. Each delta-t will be marked as available of unavailable based on the flr-threshold. The size of the delta-t measurement is the product of the number of frames and the interval. This value defaults to a different value thank single probe per metric approaches. Values-1 to 50. ParamDefault: Default- 1"
        },
        {
            "Parameters": "deltas",
            "Info": "The number of consecutive delta-t small measurement intervals that make up the sliding window over which availability and unavailability will be determined. Transitions from one state to another will occur when the consec-delta-t are now in a new state. The sliding window cannot exceed 100s. Values-2 to 10. ParamDefault: Default- 10"
        },
        {
            "Parameters": "threshold",
            "Info": "Number of consecutive high loss intervals (unavailable delta-t) that when equal to or exceeded will increment the CHLI counter. A CHLI counter is an indication that the sliding window is available but has crossed a threshold consecutive of unavailable delta-t intervals. A CHLI can only be incremented once during a sliding window and, by default, will only be incremented during times of availability. Values-1 to 9. ParamDefault: Default- 5"
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: timing frames-per-delta-t 1 consec-delta-t 10 chli-threshold 5"
}