{
    "PageTitle": "timing",
    "FuncDef": "This command defines various availability parameters and the probe spacing (interval) for the SLM frames. The maximum size of the availability window cannot exceed 10 s (10 000 ms).",
    "CLIs": [
        "timing frames-per-delta-t <frames> consec-delta-t <deltas> interval <milliseconds> chli-threshold <threshold>",
        "no timing"
    ],
    "ParentView": [
        "config>oam-pm>session>ethernet>slm"
    ],
    "ParaDef": [
        {
            "Parameters": "frames",
            "Info": "The number of SLM frames that define the size of the delta-t (small measurement window). Each delta-t will be marked as available or unavailable based on the flr-threshold. The size of the delta-t measurement is the product of the number of frames and the interval. Values-1 to 50. ParamDefault: Default- 10"
        },
        {
            "Parameters": "deltas",
            "Info": "The number of consecutive delta-t small measurement intervals that make up the sliding window over which availability and unavailability will be determined. Transitions from one state to another will occur when the consec-delta-t is in a new state. Values-2 to 10. ParamDefault: Default- 10"
        },
        {
            "Parameters": "milliseconds",
            "Info": "The number of milliseconds between the transmission of the SLM frames. The default value for the SLM interval is different than the default interval for DMM. This is intentional. Values-100, 1000. ParamDefault: Default- 100"
        },
        {
            "Parameters": "threshold",
            "Info": "The number of consecutive high loss intervals (unavailable delta-t) that when equal to or exceeded will increment the CHLI counter. A CHLI counter is an indication that the sliding window is available but has crossed a threshold consecutive of unavailable delta-t intervals. A CHLI can only be incremented once during a sliding window and, by default, will only be incremented during times of availability. Values-1 to 9. ParamDefault: Default- 5"
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}