{
    "PageTitle": "timing",
    "FuncDef": "This command defines various availability parameters for LMM availability testing. This command does not define the probe interval. Validation occurs when the LMM test is activated using theno shutdowncommand. The maximum size of the availability window cannot exceed 100 s (100 000 ms). LMM test activation fails if the availability window exceeds the maximum value.",
    "CLIs": [
        "timing frames-per-delta-t <frames> consec-delta-t <deltas> chli-threshold <threshold>",
        "no timing"
    ],
    "ParentView": [
        "config>oam-pm>session>ethernet>lmm>availability"
    ],
    "ParaDef": [
        {
            "Parameters": "frames",
            "Info": "the number of SLM frames that define the size of the small measurement window. Each delta-t will be marked as a high-loss interval or non-high-loss interval based on the flr-threshold. The size of the delta-t measurement is the product of the number of frames and the interval. Values-1 to 50. ParamDefault: Default- 10"
        },
        {
            "Parameters": "deltas",
            "Info": "the number of consecutive delta-t measurement intervals that make up the sliding window over which availability and unavailability will be determined. Transitions from one state to another will occur when the consec-delta-t are in a new state. The sliding window cannot exceed 100 s. Values-2 to 10. ParamDefault: Default- 10"
        },
        {
            "Parameters": "threshold",
            "Info": "the number of consecutive unavailable delta-t intervals that, when reached or exceeded, will increment the CHLI counter. A CHLI counter is an indication that the sliding window is available but has crossed a threshold of consecutive unavailable delta-t intervals. A CHLI can only be incremented once during a sliding window and, by default, will only be incremented during times of availability. Values-1 to 9. ParamDefault: Default- 5"
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}