{
    "PageTitle": "unavailability-event",
    "FuncDef": "This command sets the threshold to be applied to the overall count of the unavailability indicators, not transitions, per configured direction. This value is compared to the 32 bit unavailability counter specific to the direction which tracks the number of individual delta-ts that have been recorded as unavailable. The aggregate is a function of summing forward and backward. This value is only used as a threshold mechanism and is not part of the stored statistics. If the [clearclear-threshold] is not specified, the traffic crossing alarm will be stateless. Stateless means the state is not carried forward to other measurement intervals. Each measurement interval is analyzed independently and without regard to any previous window. Each unique event can only be raised once within measurement interval. If the optional clear threshold is specified the traffic crossing alarm uses stateful behavior. Stateful means\neach unique previous event state is carried forward to following measurement intervals. If a threshold crossing event is raised, another will not be raised until a measurement interval completes and the clear threshold has not been exceeded. A clear event will be raised under that condition.",
    "CLIs": [
        "unavailability-event { forward | backward | aggregate } threshold <raise-threshold> [ clear <clear-threshold> ]",
        "[ no ] unavailability-event { forward | backward | aggregate }"
    ],
    "ParentView": [
        "config>oam-pm>session>ethernet>slm>loss-events",
        "config>oam-pm>session>ethernet>lmm>loss-events",
        "config>oam-pm>session>ip>twamp-light>loss-events"
    ],
    "ParaDef": [
        {
            "Parameters": "forward",
            "Info": "Specifies the threshold is applied to the forward direction count."
        },
        {
            "Parameters": "backward",
            "Info": "Specifies the threshold is applied to the backward direction count."
        },
        {
            "Parameters": "aggregate",
            "Info": "Specifies the threshold is applied to the aggregate count (sum of forward and backward)."
        },
        {
            "Parameters": "raise-threshold",
            "Info": "Specifies a numerical value compared to the unavailability counter that is the rising threshold that determines when the event is to be generated, when value reached. Values-1 to 864000."
        },
        {
            "Parameters": "clear-threshold",
            "Info": "Specifies an optional value used for stateful behavior that allows the operator to configure a percentage of loss value lower than the rising percentage to indicate when the clear event should be generated. Values-0 to 863999."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: no unavailable-event forwardno unavailable-event backwardno unavailable-event aggregate"
}