{
    "PageTitle": "vprn-ping",
    "FuncDef": "This command performs a VPRN ping and applies only to the 7750 SR and 7950 XRS.",
    "CLIs": [
        "vprn-ping { <service-id> | service <service-name> } source <ip-address> destination <ip-address> [ fc <fc-name> [ profile { in | out } ] ] [ size <size> ] [ ttl <vc-label-ttl> ] [ count <send-count> ] [ return-control ] [ timeout <timeout> ] [ interval <interval> ]"
    ],
    "ParentView": [
        "oam",
        "config>saa>test>type"
    ],
    "ParaDef": [
        {
            "Parameters": "service-id",
            "Info": "Specifies the VPRN service ID to diagnose or manage. Values-1 to 2147483647."
        },
        {
            "Parameters": "service service-name",
            "Info": "Specifies the VPRN service name to diagnose or manage, up to 64 characters."
        },
        {
            "Parameters": "source ip-address",
            "Info": "Specifies an unused IP address in the same network that is associated with the VPRN."
        },
        {
            "Parameters": "destination ip-address",
            "Info": "Specifies the IP address to be used as the destination for performing a VPRN ping operation. Values-0.0.0.0 to 255.255.255.255."
        },
        {
            "Parameters": "size",
            "Info": "Specifies the OAM request packet size in bytes, expressed as a decimal integer. Values-1 to 9198. ParamDefault: Default- 72"
        },
        {
            "Parameters": "vc-label-ttl",
            "Info": "Specifies the TTL value in the VC label for the OAM request, expressed as a decimal integer. Values-1 to 255. ParamDefault: Default- 255"
        },
        {
            "Parameters": "return-control",
            "Info": "Specifies the response to come on the control plane."
        },
        {
            "Parameters": "interval",
            "Info": "The interval parameter in seconds, expressed as a decimal integer. This parameter is used to override the default request message send interval and defines the minimum amount of time that must expire before the next message request is sent. Values-1 to 10. ParamDefault: Default- 1"
        },
        {
            "Parameters": "send-count",
            "Info": "Specifies the number of messages to send, expressed as a decimal integer. The count parameter is used to override the default number of message requests sent. Each message request must either timeout or receive a reply before the next message request is sent. The message interval value must be expired before the next message request is sent. Values-1 to 100. ParamDefault: Default- 1"
        },
        {
            "Parameters": "timeout",
            "Info": "Specifies the timeout parameter in seconds, expressed as a decimal integer. This value is used to override the default timeout value and is the amount of time that the router will wait for a message reply after sending the message request. Upon the expiration of message timeout, the requesting router assumes that the message response will not be received. Any response received after the request times out will be silently discarded. Values-1 to 100. ParamDefault: Default- 5"
        },
        {
            "Parameters": "fc-name",
            "Info": "The forwarding class of the MPLS echo request encapsulation. Values-be, l2, af, l1, h2, ef, h1, nc. ParamDefault: Default- be"
        },
        {
            "Parameters": "profile {in | out}",
            "Info": "The profile state of the MPLS echo request encapsulation. ParamDefault: Default- out"
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}