{
    "PageTitle": "vxlan-ping",
    "FuncDef": "Operational command used to validate the VXLAN Tunnel Endpoint (VxLAN) connectivity between peers.",
    "CLIs": [
        "vxlan-ping test-id <test-id> service <vpls-service-id> dest-vni <vxlan-network-id> outer-ip-destination <ipv4-address> [ outer-ip-source-udp <udp-port-number> ] [ outer-ip-ttl <time-to-live> ] [ inner-l2 <ieee-address> ] [ inner-ip-source <ipv4-address> ] [ inner-ip-destination <ipv4-address> ] [ i-flag-on ] [ end-system <ieee-address> ] [ send-count <packets> ] [ interval <interval-time> ] [ timeout <timeout-time> ] [ padding <tlv-size> [ reflect-pad ] ] [ fc <fc-name> ] [ profile { in | out } ] [ reply-mode { overlay | udp } ]"
    ],
    "ParentView": [
        "oam"
    ],
    "ParaDef": [
        {
            "Parameters": "test-id",
            "Info": "Specifies a value to identify the originator handle of the specific request. Each active test requires a unique test identifier. Values-1 to 2147483647."
        },
        {
            "Parameters": "vpls-service-id",
            "Info": "Specifies the VPLS service used to launch the request and by extension pickup the source VNI information. Values-1 to 2147483647 | service-name."
        },
        {
            "Parameters": "vxlan-network-id",
            "Info": "Specifies the target Vxlan network identifier on the terminating VTEP. Values-1 to 16777215."
        },
        {
            "Parameters": "outer-ip-destination ipv4-address",
            "Info": "Specifies the IPv4 address of the terminating VTEP. Values-format a.b.c.d."
        },
        {
            "Parameters": "udp-port-number",
            "Info": "Optional Outer source UDP port number. Values-1 to 65535. ParamDefault: Default- System-generated UDP port number"
        },
        {
            "Parameters": "time-to-live",
            "Info": "Specifies the optional outer time to live. Values-1 to 255. ParamDefault: Default- 255"
        },
        {
            "Parameters": "inner-l2 ieee-address",
            "Info": "Specifies the destination MAC address used in the inner VxLAN header. Values-xx:xx:xx:xx:xx:xx or xx-xx-xx-xx-xx-xx. ParamDefault: Default- 00:00:00:00:00:00"
        },
        {
            "Parameters": "inner-ip-source ipv4-address",
            "Info": "Specifies the inner source IPv4 address. Values-format a.b.c.d. ParamDefault: Default- System IPv4 Address"
        },
        {
            "Parameters": "inner-ip-destination ipv4-address",
            "Info": "Specifies the inner destination IPv4 address. Must be in the range 127/8. Values-In the 127.0.0.0/8 range. ParamDefault: Default- 127.0.0.1"
        },
        {
            "Parameters": "reply-mode {overlay | udp}",
            "Info": "Instructs the responder how to route the VxLAN response. Values-udp: responds using UDP over the IP network. The default must be changed if the VTEP uses anything other than an IPv4 System Address as the source.. ParamDefault: Default- udp"
        },
        {
            "Parameters": "i-flag-on",
            "Info": "Sets the VNI Validation bit to 1, indicating that the OAMPDU contains a valid VNI. ParamDefault: Default- i-flag set to \"0\" which prevents the OAMPDU form being forwarded beyond the terminating VTEP."
        },
        {
            "Parameters": "end-system ieee-address",
            "Info": "Optional command to include the sub TLV to validate an end system MAC address in the FDB. Only one MAC address may be included. ParamDefault: Default- No end system TLV included"
        },
        {
            "Parameters": "packets",
            "Info": "Specifies the number of VxLAN ping requests to transmit. Values-1 to 1024. ParamDefault: Default- 1"
        },
        {
            "Parameters": "interval-time",
            "Info": "Specifies the probe interval, in seconds. Values-0.1, 1 to 10. ParamDefault: Default- 1"
        },
        {
            "Parameters": "timeout-time",
            "Info": "Specifies the packet timeout value, in seconds. Values-1 to 10. ParamDefault: Default- 5"
        },
        {
            "Parameters": "tlv-size",
            "Info": "Specifies whether to include the Pad TLV, and specifies the number of octets that defines the entire size of the pad TLV, including the type (2B), the length field (2B), the padding (variable). Values-0, 5 to 2000. ParamDefault: Default- 0 (not included)"
        },
        {
            "Parameters": "reflect-pad",
            "Info": "Instructs the responder to include the pad-tlv in the echo response. This option is not supported when the reply mode is \"UDP\". ParamDefault: Default- pad is not reflected"
        },
        {
            "Parameters": "fc-name",
            "Info": "Indicates the forwarding class that will be exposed to the QoS policy as input into generating the outer CoS. Values-be, l2, af, l1, h2, ef, h1, nc. ParamDefault: Default- be"
        },
        {
            "Parameters": "profile {in | out}",
            "Info": "Defines the frame s disposition that will be exposed to the QoS policy as input into generating the outer CoS. ParamDefault: Default- in"
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}