{
    "PageTitle": "netstream monitor (System view)",
    "FuncDef": "The ip netstream monitor command creates an IPv4 NetStream monitoring service and displays the monitoring view, or (if a monitoring service already exists) only displays an existing monitoring view.\nThe undo ip netstream monitor command deletes an IPv4 NetStream monitoring service.\nThe ipv6 netstream monitor command creates an IPv6 NetStream monitoring service and displays the monitoring view, or directly displays an existing monitoring view.\nThe undo ipv6 netstream monitor command deletes an existing IPv6 NetStream monitoring service.\nBy default, no NetStream monitoring service is configured.",
    "CLIs": [
        "ip netstream monitor <monitor-name>",
        "ipv6 netstream monitor <monitor-name>",
        "undo ip netstream monitor <monitor-name>",
        "undo ipv6 netstream monitor <monitor-name>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "monitor-name",
            "Info": "Specifies the name of a monitoring service.\nThe name is a string of 1 to 31 case-sensitive characters, spaces not supported and special characters supported.\nWhen quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "ipv6",
            "Info": "Indicates the IPv6 netstream feature.\n-"
        },
        {
            "Parameters": "ip",
            "Info": "Indicates the IPv4 netstream feature.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip netstream monitor monitora"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 netstream monitor monitora"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIncreasing types of services and applications on networks urge carriers to provide more delicate management and accounting services.\nIf NetStream is configured on multiple interfaces on an NDE, all interfaces send traffic statistics to a single NSC. The NSC cannot distinguish interfaces and therefore is unable to manage or analyze traffic statistics based on interfaces. In addition, the NSC will be overloaded due to a great amount of information.\nNetStream monitoring configured on an NDE allows the NDE to send traffic statistics collected on specified interfaces to specified NSCs for analysis, achieving more delicate service monitoring based on interfaces. Traffic statistics can be load-balanced among these NSCs.\nConfiguration Impact\nIf the destination IP address and port number for NetStream statistics have been configured in the monitoring view, and the NetStream monitoring service has been applied, NetStream statistics are output to the destination IP address specified in the monitoring view, not the system view.\nFollow-up Procedure\nRun the netstream export host command in the monitoring view to configure the destination IP address for NetStream statistics.\nPrecautions\nNetStream monitoring services are available only for original flows, not aggregated flows."
}