{
    "PageTitle": "collect",
    "FuncDef": "The collect command configures the flexible flow statistics sent to the NetStream Collector (NSC) to contain the number of bytes, number of packets, and first and last forwarding time.\nThe undo collect command configures the flexible flow statistics sent to the NSC not to contain the number of bytes, number of packets, and first and last forwarding time.\nBy default, the flexible flow statistics sent to the NSC does not contain the number of bytes, number of packets, and first and last forwarding time.",
    "CLIs": [
        "collect { first | last } switched",
        "collect input { packets | bytes } { <length> }",
        "undo collect { first | last } switched",
        "undo collect input { packets | bytes } [ <length> ]"
    ],
    "ParentView": [
        "NetStream IPv6 record view.",
        "NetStream record view"
    ],
    "ParaDef": [
        {
            "Parameters": "first",
            "Info": "Configures the flexible flow statistics sent to the NSC to contain the first forwarding time.\n-"
        },
        {
            "Parameters": "last",
            "Info": "Configures the flexible flow statistics sent to the NSC to contain the last forwarding time.\n-"
        },
        {
            "Parameters": "switched",
            "Info": "Indicates the flexible flow statistics sent to the NSC.\n-"
        },
        {
            "Parameters": "input",
            "Info": "Configures the flexible flow statistics sent to the NSC to contain the inbound interface information.\n-"
        },
        {
            "Parameters": "packets",
            "Info": "Configures the flexible flow statistics sent to the NSC to contain the number of packets.\n-"
        },
        {
            "Parameters": "bytes",
            "Info": "Configures the flexible flow statistics sent to the NSC to contain the number of bytes.\n-"
        },
        {
            "Parameters": "length",
            "Info": "Specifies the length of the packets and bytes contained in the flexible flow statistics sent to the NSC.\nThe value can be16, 32, or 64."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip netstream record tt",
            "[*HUAWEI-record-tt] collect input packets 64",
            "[*HUAWEI-record-tt] collect first switched"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo obtain more flow statistics, you can run the collect command to configure the flexible flow statistics output to contain the number of bytes, number of packets, and first and last forwarding time.\nPrerequisites\nBefore you run the collect command, run the ip netstream record or ipv6 netstream record command to create a flexible flow statistics template.\nPrecautions\nAfter you unbind a flexible flow template that is bound in the interface monitoring view during continuous traffic sending and run the match or collect command to modify the match or collect field, the sampling information is incorrectly parsed when you bind the template again, which can be automatically restored.After you cancel the application of a flexible flow template that is applied in the system view during continuous traffic sending and run the match or collect command to modify the match or collect field, the sampling information is incorrectly parsed when you apply the template again, which can be automatically restored.\nThe maximum length that the flexible flow statistics template supports is 50 bytes, including the collect and match fields.\nLengths of the collect fields:\nfirst: 4 byteslast: 4 bytespackets: 4 bytesbytes: 4 bytes\nLengths of the match fields:\naddress: 4 bytes for an IPv4 address and 16 bytes for an IPv6 addressmask: 1 byteport: 2 bytesvlan: 2 bytesas: 4 bytesmpls top-label ip-address: 4 bytesmpls label 1: 3 bytesmpls label 2: 3 bytesmpls label 3: 3 bytesprotocol: 1 bytetos: 1 bytedirection: 1 bytetcp-flag: 1 byteinput interface: 4 bytesoutput interface: 4 bytesnext-hop: 4 bytes for an IPv4 address and 16 bytes for an IPv6 addressbgp next-hop: 4 bytes for an IPv4 address and 16 bytes for an IPv6 address"
}