{
    "PageTitle": "export version",
    "FuncDef": "The export version command sets a version for outputting aggregated flows.\nThe undo export version command restores the default format version.\nBy default, IPv4 flows aggregated in mpls-label, bgp-nexthop-tos, index-tos, vlan-id, bgp-community, vni-sip-dip, or source-index-tos mode are output in V9 format, you can configure the device to output aggregated IPv4 flows in IPFIX format. IPv4 flows aggregated in any other mode are output in V8 format. You can configure the device to output aggregated IPv4 flows in IPFIX format. By default, all aggregated IPv6 flows are output in V9 format. You can also configure the device to output aggregated IPv6 flows in IPFIX format.",
    "CLIs": [
        "export version { 8 | 9 }",
        "export version ipfix",
        "undo export version"
    ],
    "ParentView": [
        "IPv6 NetStream aggregation view",
        "NetStream aggregation view"
    ],
    "ParaDef": [
        {
            "Parameters": "8",
            "Info": "Outputs aggregated flows in V8 format.\n-"
        },
        {
            "Parameters": "9",
            "Info": "Outputs aggregated flows in V9 format. V8 and V9 are incompatible with each other. In V9 format, NetStream flows are output based on templates.\n-"
        },
        {
            "Parameters": "ipfix",
            "Info": "Outputs aggregated flows in ipfix format.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip netstream aggregation as",
            "[*HUAWEI-aggregation-as] export version 9"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nNetStream IPv4 original flows can be output in V5 or V9 or IPFIX format, and NetStream aggregated flows can be output in V8 or V9 or IPFIX format. Unlike the V5 or V8 format, the V9 or IPFIX format allows the output original flows to carry more variable statistics, expand newly-defined flow elements more flexibly, and generate new records more easily. V9, or IPFIX is incompatible with V5 and V8.\nAggregated flows can be output in V5, V8, or V9 or IPFIX format as determined by the NMS configuration. In the following situation, aggregated flows must be output in V9 or IPFIX format when interface indexes carried in the output flows need to be extended from 16 bits to 32 bits.\nPrerequisites\nThe NMS is able to parse flows output in V9 or IPFIX format.\nPrecautions\nFlows aggregated in one of the following modes can be output in V9 or IPFIX format or in V8 format by default:\nasas-tosdestination-prefixdestination-prefix-tosprefixprefix-tosprotocol-portprotocol-port-tossource-prefixsource-prefix-tos\nFlows aggregated in the following aggregation modes can only be output in V9 or IPFIX format:\nmpls-labelvlan-idbgp-nexthop-tosindex-tossource-index-tosvni-sip-dipbgp-community\nAggregated IPv6 flows can only be output in V9 or IPFIX format."
}