{
    "PageTitle": "netstream export template sequence-number fixed",
    "FuncDef": "The ip netstream export template sequence-number fixed command configures a numbering mode for template packets and option template packets in IPv4 IPFIX format.\nThe undo ip netstream export template sequence-number fixed command deletes the numbering mode configured for template packets and option template packets in IPv4 IPFIX format.\nThe ipv6 netstream export template sequence-number fixed command configures a numbering mode for template packets and option template packets in IPv6 IPFIX format.\nThe undo ipv6 netstream export template sequence-number fixed command deletes the numbering mode configured for template packets and option template packets in IPv6 IPFIX format.\nBy default, template packets, option template packets, data packets, and option data packets in IPFIX format are consecutively numbered.",
    "CLIs": [
        "ip netstream export template sequence-number fixed",
        "ipv6 netstream export template sequence-number fixed",
        "undo ip netstream export template sequence-number fixed",
        "undo ipv6 netstream export template sequence-number fixed"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv6",
            "Info": "Displays the IPv6 netstream feature.\n-"
        },
        {
            "Parameters": "ip",
            "Info": "Displays the IPv4 netstream feature.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip netstream export template sequence-number fixed"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 netstream export template sequence-number fixed"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe numbering mode of packets in IPFIX format varies according to the server. Some servers require that template packets, option template packets, data packets, and option data packets in IPFIX format be consecutively numbered. However, the other servers require that the sequence numbers of template packets and option template packets in IPFIX format remain unchanged, but data packets and option data packets in IPFIX format be consecutively numbered. After you run the command, the template packet or option template packet first received after command execution inherits the sequence number of the previous data packet or option data packet, but follow-up template packets or option template packets in IPFIX format use the same sequence number as the first received template packet or option template packet.\nConfiguration Impact\nWhen the server encounters a missingflow alarm, run this command to clear the alarm.\nPrecautions\nThis command applies only to packets in IPFIX format."
}