{
    "PageTitle": "netstream as-mode",
    "FuncDef": "The ip netstream as-mode sets an autonomous system (AS) field mode supported by NetStream IPv4 sampling.\nThe undo ip netstream as-mode command restores the default AS field mode supported by NetStream IPv4 sampling.\nThe ipv6 netstream as-mode sets an autonomous system (AS) field mode supported by NetStream IPv6 sampling.\nThe undo ipv6 netstream as-mode command restores the default AS field mode supported by NetStream IPv6 sampling.\nBy default, NetStream sampling supports the 16-bit AS field mode.",
    "CLIs": [
        "ip netstream as-mode { 16 | 32 }",
        "ipv6 netstream as-mode { 16 | 32 }",
        "undo ip netstream as-mode",
        "undo ipv6 netstream as-mode"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "16",
            "Info": "Indicates a 16-bit AS number carried in an output NetStream packet.\n-"
        },
        {
            "Parameters": "32",
            "Info": "Indicates a 32-bit AS number carried in an output NetStream packet.\n-"
        },
        {
            "Parameters": "ipv6",
            "Info": "Displays the IPv6 netstream feature.\n-"
        },
        {
            "Parameters": "ip",
            "Info": "Displays the IPv4 netstream feature.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip netstream as-mode 32"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 netstream as-mode 32"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nNetStream outputs templates and samples data flows in either 16-bit or 32-bit AS field mode. To specify an AS field mode supported by NetStream sampling, run the ip netstream as-mode command or ipv6 netstream as-mode command.\nIf different AS field modes exist on a network, change them to the same AS field mode when configuring NetStream. An AS field mode inconsistency causes NetStream to fail to sample inter-AS traffic.\nPrerequisites\nOn a network with the 32-bit AS field mode used, an NMS must be able to identify the 32-bit AS field. Otherwise, the NMS fails to identify inter-AS traffic sent from devices.\nPrecautions\nWhen the message format is in Version 9, the ipv6 netstream as-mode 32 command and ip netstream as-mode 32 command should be configured at the same time."
}