{
    "PageTitle": "netstream export template option",
    "FuncDef": "The ip netstream export template option application-label command enables the device to output time, application, and label (TAL) option information to the NSC.\nThe undo ip netstream export template option application-label command disables device from outputting TAL option information to the NSC.\nBy default, the function of exporting system option packet statistics is disabled and TAL option information is not sent to the NSC.",
    "CLIs": [
        "ip netstream export template option application-label",
        "undo ip netstream export template option application-label"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip",
            "Info": "Displays the IPv4 netstream feature.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip netstream export template option application-label"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOption packets are exported in V9 or IPFIX format. Therefore, the NetStream Data Exporter (NDE) must send a matching option template to the NetStream Collector (NSC) so that the NMS can properly parse option packets. After the NetStream sends packet statistics to the NSC, the NSC must analyze and store the statistics in sampling mode. To output the TAL option information to the NSC, run the ip netstream export template option application-label command on a provider edge (PE) in a Layer 3 virtual private network (L3VPN) and based on the sampled traffic sent from the P and the TAL option information sent from the PE, the NSC locates the L3VPN to which traffic belongs.\nAt present, interface option packet statistics that can be exported are interface sampling parameters, the index of the interface where NetStream is enabled, and the interface direction.\nConfiguration Impact\nAfter ip netstream export template option application-label command is executed, application modules encapsulate the TAL option in NetStream packets and send them to the NSC when advertising labels or other application information."
}