{
    "PageTitle": "netstream apply record",
    "FuncDef": "The ip netstream apply record command applies the NetStream IPv4 flexible flow service.\nThe undo ip netstream apply record command deletes the NetStream IPv4 flexible flow service applied.\nThe ipv6 netstream apply record command applies the NetStream IPv6 flexible flow service.\nThe undo ipv6 netstream apply record command deletes the NetStream IPv6 flexible flow service applied.\nBy default, no NetStream IPv4 or IPv6 flexible flow service is applied.",
    "CLIs": [
        "{ ip | ipv6 } netstream apply record <record-name>",
        "undo { ip | ipv6 } netstream apply record [ <record-name> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip",
            "Info": "Displays the IPv4 netstream feature.\n-"
        },
        {
            "Parameters": "ipv6",
            "Info": "Displays the IPv6 netstream feature.\n-"
        },
        {
            "Parameters": "record-name",
            "Info": "Specifies the name of a NetStream flexible flow.\nThe value is a string of 1 to 32 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip netstream record rec1",
            "[*HUAWEI-record-rec1] collect input packets 64",
            "[*HUAWEI-record-rec1] commit",
            "[~HUAWEI-record-rec1] quit",
            "[~HUAWEI] ip netstream apply record rec1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 netstream record rec1",
            "[*HUAWEI-record6-rec1] collect input packets 64",
            "[*HUAWEI-record6-rec1] commit",
            "[~HUAWEI-record6-rec1] quit",
            "[~HUAWEI] ipv6 netstream apply record rec1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter you configure a flexible flow, run the ip netstream apply record command to apply the flexible flow in the system view. The destination end configured in the system or slot view then samples and outputs packets as the flexible flow.\nPrerequisites\nBefore applying a flexible flow, you must run the match or collect command to configure matching rules or collected fields. Otherwise, the flexible flow cannot be applied.\nPrecautions\nOnly one IPv4 flexible flow or one IPv6 flexible flow can be applied in the system view.\nFlexible flow packets can be output only in the V9 format. If the ip netstream export version command or ipv6 netstream export version command is run in the system view to specify the V5 or IPFIX packet output format, the ip netstream apply record command and ipv6 netstream apply record command does not take effect."
}