{
    "PageTitle": "netstream record",
    "FuncDef": "The ip netstream record command creates an IPv4 flexible flow statistic template and enters the NetStream IPv4 recording view, or enters an existing NetStream IPv4 recording view.\nThe undo ip netstream record command deletes an IPv4 flexible flow statistic template.\nThe ipv6 netstream record command creates an IPv6 flexible flow statistic template and enters the NetStream IPv6 recording view, or enter an existing NetStream IPv6 recording view.\nThe undo ipv6 netstream record command deletes an IPv6 flexible flow statistic template.\nBy default, no IPv4 or IPv6 flexible flow statistic template is created.",
    "CLIs": [
        "ip netstream record <record-name>",
        "ipv6 netstream record <record-name>",
        "undo ip netstream record <record-name>",
        "undo ipv6 netstream record <record-name>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv6",
            "Info": "Displays the IPv6 netstream feature.\n-"
        },
        {
            "Parameters": "ip",
            "Info": "Displays the IPv4 netstream feature.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip netstream record rec1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 netstream record rec1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBefore you export IPv4 flexible flow statistics, run the ip netstream record command to create an IPv4 flexible flow statistic template, configure the related matching and collected fields, and apply the template in the system or monitoring view. This template is then applied to an interface through the monitoring view.Before you export IPv6 flexible flow statistics, run the ipv6 netstream record command to create an IPv6 flexible flow statistic template, configure the related matching and collected fields, and apply the template in the system or monitoring view. This template is then applied to an interface through the monitoring view.\n\nPrecautions\nIf any flexible flow exists in the monitoring view of the interface, the interface samples and outputs packets based on this flexible flow.Each device supports a maximum of 15 IPv4 or IPv6 flexible flow statistics templates. If 15 IPv4 or IPv6 flexible flow statistics templates have been configured and you need to add a new one, run the undo ip netstream record record-name command or undo ipv6 netstream record record-name command to delete an existing template first.A flexible flow that has been applied cannot be deleted. To delete such flexible flow, remove the application relationship in the system or monitoring view first.IPv4 and IPv6 flexible flow statistics templates are independent from each other. Therefore, an IPv4 template and an IPv6 template can share the same name."
}