{
    "PageTitle": "netstream tcp-flag enable",
    "FuncDef": "The ip netstream tcp-flag enable command enables NetStream to collect statistics about TCP flags in IPv4 original flows.\nThe undo ip netstream tcp-flag enable command disables NetStream from collecting statistics about TCP flags in IPv4 original flows.\nThe ipv6 netstream tcp-flag enable command enables NetStream to collect statistics about TCP flags in IPv6 original flows.\nThe undo ipv6 netstream tcp-flag enable command disables NetStream from collecting statistics about TCP flags in IPv6 original flows.\nBy default, NetStream is disabled from collecting statistics about TCP flags in original flows.",
    "CLIs": [
        "ip netstream tcp-flag enable",
        "ipv6 netstream tcp-flag enable",
        "undo ip netstream tcp-flag enable",
        "undo ipv6 netstream tcp-flag enable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv6",
            "Info": "Displays the IPv6 netstream feature.\n-"
        },
        {
            "Parameters": "ip",
            "Info": "Displays the IPv4 netstream feature.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip netstream tcp-flag enable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 netstream tcp-flag enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nEach TCP field contains the source and destination port numbers for querying the source and destination application programs. Source and destination port numbers, together with source and destination IP addresses in the IP field, can uniquely identify a TCP connection. There are six flag bits (URG, ACK, PSH, RST, SYN, and FIN) in a TCP packet header. The flag bits, together with the destination IP address, source IP address, destination port number, and source port number of a TCP packet, identify the function and status of the TCP packet on a TCP connection. Based on the TCP packet status, the NMS determines whether the network is attacked by TCP packets.\nThe original flow statistics collection function collects statistics about TCP flags regardless of whether TCP flag statistics collection is enabled. TCP flag information is recorded in the flag field. The system does not classify traffic based on TCP flags. If TCP flag statistics collection is enabled, a new flow is created for each flag. The NMS checks the traffic volume of each flag and determines whether the network is attacked using TCP packets.\nPrecautions\nOnly original flows, not aggregated flows, support the collection of TCP flag statistics.\nA new flow is created for each flag. Therefore, when TCP flag statistics collection is enabled, the number of original flows in the system greatly increases.\nAfter enabling TCP flag statistics collection, configure sampling functions."
}