{
    "PageTitle": "netstream export template timeout-rate",
    "FuncDef": "The ip netstream export template timeout-rate command sets the IPv4 associated template update interval.\nThe undo ip netstream export template timeout-rate command restores the IPv4 default interval.\nThe ipv6 netstream export template timeout-rate command sets the IPv6 associated template update interval.\nThe undo ipv6 netstream export template timeout-rate command restores the IPv6 default interval.\nBy default, the export template updates every 30 minutes.",
    "CLIs": [
        "ipv6 netstream export template timeout-rate <timeout-interval>",
        "ip netstream export template timeout-rate <timeout-interval>",
        "undo ip netstream export template timeout-rate",
        "undo ipv6 netstream export template timeout-rate"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "timeout-interval",
            "Info": "Specifies the update interval of the template.\nThe value is an integer ranging from 1 to 3600, in minutes. The default value is 30."
        },
        {
            "Parameters": "ip",
            "Info": "Displays the IPv4 netstream feature.\n-"
        },
        {
            "Parameters": "ipv6",
            "Info": "Displays the IPv6 netstream feature.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip netstream export template timeout-rate 50"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 netstream export template timeout-rate 50"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOriginal flows can be exported in V5, IPFIX, or V9 format. Flexible flows can be exported only in V9 or IPFIX format. When original flows are exported in V9 format and flexible flows are exported in V9 format, the associated data template must also be exported so that the NDA device can parse packets. To set an update interval of the template, run the ip netstream export template timeout-rate command.\nGenerally, the more dense the network traffic is, the smaller the template update interval should be set, the higher the volume of the network traffic generated for exporting the template is, and vice versa. Therefore, you need to set a proper template update interval. Usually, you can use the default value."
}