{
    "PageTitle": "netstream mpls-aware",
    "FuncDef": "The ip netstream mpls-aware command configures the sampling mode for IPv4 Multiprotocol Label Switching (MPLS) packets.\nThe undo ip netstream mpls-aware command restores the default sampling mode for IPv4 MPLS packets.\nThe ipv6 netstream mpls-aware command configures the sampling mode for IPv6 Multiprotocol Label Switching (MPLS) packets.\nThe undo ipv6 netstream mpls-aware command restores the default sampling mode for IPv6 MPLS packets.\nBy default, only inner IP packets in MPLS packets are sampled.",
    "CLIs": [
        "ip netstream mpls-aware { label-only | ip-only | label-and-ip }",
        "ipv6 netstream mpls-aware { label-only | ip-only | label-and-ip }",
        "undo ip netstream mpls-aware",
        "undo ipv6 netstream mpls-aware"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "label-only",
            "Info": "Samples only MPLS labels, not inner IP packets.\n-"
        },
        {
            "Parameters": "ip-only",
            "Info": "Samples only inner IP packets, not MPLS labels.\n-"
        },
        {
            "Parameters": "label-and-ip",
            "Info": "Samples both inner IP packets and MPLS labels.\n-"
        },
        {
            "Parameters": "ipv6",
            "Info": "Displays the IPv6 netstream feature.\n-"
        },
        {
            "Parameters": "ip",
            "Info": "Displays the IPv4 netstream feature.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip netstream mpls-aware label-only"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 netstream mpls-aware label-only"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn an MPLS network, MPLS labels carry important information that users are concerned about. The device supports the sampling of the three outer MPLS labels. If this command is not configured, only inner IP packets carried in the MPLS packets are sampled.\nPrecautions\nWhen the sampling mode of MPLS packets is set to ip-only, you cannot configure the MPLS-label aggregation mode.\nFor flexible flows, this command takes effect only when the aggregation keywords of the flexible flow statistics template configured using the match command contain mpls top-label ip-address and mpls label.\nIf the sampling mode is set to label-only, IP packets are not collected."
}