{
    "PageTitle": "netstream",
    "FuncDef": "The ip netstream command enables NetStream IPv4 to collect statistics about incoming or outgoing data flows on an interface.\nThe undo ip netstream command disables NetStream IPv4 from collecting statistics about incoming or outgoing data flows on an interface.\nThe ipv6 netstream command enables NetStream IPv6 to collect statistics about incoming or outgoing data flows on an interface.\nThe undo ipv6 netstream command disables NetStream IPv6 from collecting statistics about incoming or outgoing data flows on an interface.\nBy default, NetStream is disabled from collecting statistics about incoming or outgoing data flows on an interface.",
    "CLIs": [
        "ipv6 netstream { inbound | outbound }",
        "ip netstream { inbound | outbound }",
        "undo ipv6 netstream { inbound | outbound }",
        "undo ip netstream { inbound | outbound }"
    ],
    "ParentView": [
        "100GE interface view",
        "400GE interface view",
        "40GE interface view",
        "50GE sub-interface view",
        "50GE interface view",
        "50|100GE sub-interface view",
        "50|100GE interface view",
        "Eth-Trunk interface view",
        "FlexE interface view",
        "GE electrical interface view",
        "Global VE sub-interface view",
        "IP-Trunk interface view",
        "MP-group interface view",
        "POS interface view",
        "VE sub-interface view",
        "VLANIF interface view",
        "Serial interface view",
        "Sub-interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "inbound",
            "Info": "Enables NetStream to collect statistics about incoming data flows on an interface.\n-"
        },
        {
            "Parameters": "outbound",
            "Info": "Enables NetStream to collect statistics about outgoing data flows on an interface.\n-"
        },
        {
            "Parameters": "ip",
            "Info": "Displays the IPv4 netstream feature.\n-"
        },
        {
            "Parameters": "ipv6",
            "Info": "Displays the IPv6 netstream feature.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] ip netstream inbound",
            "[*HUAWEI-GigabitEthernet1/0/0] ip netstream outbound"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface virtual-ethernet 1/0/0.1",
            "[~HUAWEI-Virtual-Ethernet1/0/0.1] ip netstream inbound",
            "[*HUAWEI-Virtual-Ethernet1/0/0.1] ip netstream outbound"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] ipv6 netstream inbound",
            "[*HUAWEI-GigabitEthernet1/0/0] ipv6 netstream outbound"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen a specified interface needs to monitor or analyze features of incoming or outgoing data flows, and statistics collected by NetStream are output in original flows or aggregated flows, the command can be used to enable NetStream to collect statistics about incoming or outgoing data flows on the interface.\nConfiguration Impact\nAfter NetStream is enabled to collect statistics about incoming or outgoing data flows, statistics about unicast and multicast packets are collected.\nPrecautions\nInterfaces and sub-interfaces, both of which are configured with BAS services, still support Netstream sampling configurations. Interfaces and sub-interfaces, both of which are configured with L2TP LAC services, Netstream sampling configurations do not take effect.\nInterfaces and sub-interfaces, both of which are configured with DS-LITE services, Netstream sampling configurations do not take effect.\nThis command is not supported by the management network port."
}