{
    "PageTitle": "netstream aggregation",
    "FuncDef": "The ip netstream aggregation command displays the NetStream IPv4 aggregation mode.\nThe ipv6 netstream aggregation command displays the NetStream IPv6 aggregation mode.\nBy default, no aggregation mode is set.",
    "CLIs": [
        "ipv6 netstream aggregation { as | as-tos | destination-prefix | destination-prefix-tos | prefix | prefix-tos | protocol-port | protocol-port-tos | source-prefix | source-prefix-tos | mpls-label | index-tos | vlan-id | bgp-nexthop-tos }",
        "ip netstream aggregation { as | as-tos | destination-prefix | destination-prefix-tos | prefix | prefix-tos | protocol-port | protocol-port-tos | source-prefix | source-prefix-tos | mpls-label | index-tos | vlan-id | bgp-nexthop-tos | source-index-tos }",
        "ip netstream aggregation { as | as-tos | destination-prefix | destination-prefix-tos | prefix | prefix-tos | protocol-port | protocol-port-tos | source-prefix | source-prefix-tos | mpls-label | index-tos | vlan-id | bgp-nexthop-tos | source-index-tos | bgp-community }",
        "ip netstream aggregation { as | as-tos | destination-prefix | destination-prefix-tos | prefix | prefix-tos | protocol-port | protocol-port-tos | source-prefix | source-prefix-tos | mpls-label | index-tos | vlan-id | bgp-nexthop-tos | source-index-tos | vni-sip-dip }",
        "undo ipv6 netstream aggregation { as | as-tos | destination-prefix | destination-prefix-tos | prefix | prefix-tos | protocol-port | protocol-port-tos | source-prefix | source-prefix-tos | mpls-label | index-tos | vlan-id | bgp-nexthop-tos }",
        "undo ip netstream aggregation { as | as-tos | destination-prefix | destination-prefix-tos | prefix | prefix-tos | protocol-port | protocol-port-tos | source-prefix | source-prefix-tos | mpls-label | index-tos | vlan-id | bgp-nexthop-tos | source-index-tos }",
        "undo ip netstream aggregation { as | as-tos | destination-prefix | destination-prefix-tos | prefix | prefix-tos | protocol-port | protocol-port-tos | source-prefix | source-prefix-tos | mpls-label | index-tos | vlan-id | bgp-nexthop-tos | source-index-tos | bgp-community }",
        "undo ip netstream aggregation { as | as-tos | destination-prefix | destination-prefix-tos | prefix | prefix-tos | protocol-port | protocol-port-tos | source-prefix | source-prefix-tos | mpls-label | index-tos | vlan-id | bgp-nexthop-tos | source-index-tos | vni-sip-dip }"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "as",
            "Info": "Indicates the autonomous system (AS) aggregation, which aggregates flows with the same source AS number, destination AS number, inbound interface index, and outbound interface index.\n-"
        },
        {
            "Parameters": "as-tos",
            "Info": "Indicates the AS-ToS aggregation, which aggregates flows with the same source AS number, destination AS number, inbound interface index, outbound interface index, and type of service (ToS).\n-"
        },
        {
            "Parameters": "destination-prefix",
            "Info": "Indicates the destination-prefix aggregation, which aggregates flows with the same destination AS number, destination mask length, destination prefix, and outbound interface index.\n-"
        },
        {
            "Parameters": "destination-prefix-tos",
            "Info": "Indicates the destination-prefix-ToS aggregation, which aggregates flows with the same destination AS number, destination mask length, destination prefix, outbound interface index and ToS.\n-"
        },
        {
            "Parameters": "prefix",
            "Info": "Indicates the prefix aggregation, which aggregates flows with the same source AS number, destination AS number, source mask length, destination mask length, source prefix, destination prefix, inbound interface index, and outbound interface index.\n-"
        },
        {
            "Parameters": "prefix-tos",
            "Info": "Indicates the prefix-ToS aggregation, which aggregates flows with the same source AS number, destination AS number, source mask length, destination mask length, source prefix, destination prefix, inbound interface index, outbound interface index, and ToS.\n-"
        },
        {
            "Parameters": "protocol-port",
            "Info": "Indicates the protocol-port aggregation, which aggregates flows with the same protocol number, source port, and destination port.\n-"
        },
        {
            "Parameters": "protocol-port-tos",
            "Info": "Indicates the protocol-port-ToS aggregation, which aggregates flows with the same protocol number, source port, destination port, ToS, inbound interface index, and outbound interface index.\n-"
        },
        {
            "Parameters": "source-prefix",
            "Info": "Indicates the source-prefix aggregation, which aggregates flows with the same source AS number, source mask length, source prefix, and inbound interface index.\n-"
        },
        {
            "Parameters": "source-prefix-tos",
            "Info": "Indicates the source-prefix-ToS aggregation, which aggregates flows with the same source AS number, source mask length, source prefix, ToS, and inbound interface index.\n-"
        },
        {
            "Parameters": "mpls-label",
            "Info": "Indicates the MPLS label aggregation, which aggregates flows with the same first layer label, second layer label, third layer label, TopLabelIpAddress, stack bottom symbol of the first layer label, and the EXP value of the first layer label.\n-"
        },
        {
            "Parameters": "index-tos",
            "Info": "Indicates the index-ToS aggregation, which aggregates flows with the same inbound interface index, outbound interface index, and ToS.\n-"
        },
        {
            "Parameters": "vlan-id",
            "Info": "Indicates the VNI aggregation, which aggregates flows with the same VNI ID and the same source and destination IP addresses of tenants.\n-"
        },
        {
            "Parameters": "bgp-nexthop-tos",
            "Info": "Indicates the BGP-nexthop-ToS aggregation, which aggregates flows with the same Border Gateway Protocol (BGP) next hop, source AS number, destination AS number, inbound interface index, and outbound interface index.\n-"
        },
        {
            "Parameters": "ip",
            "Info": "Displays the IPv4 netstream feature.\n-"
        },
        {
            "Parameters": "source-index-tos",
            "Info": "Indicates the source interface index-ToS aggregation, which aggregates flows with the same source interface index, ToS and BGP next hop.\n-"
        },
        {
            "Parameters": "bgp-community",
            "Info": "Indicates the BGP community aggregation, which aggregates flows with the same inbound and outbound interface indexes and BGP community.\n-"
        },
        {
            "Parameters": "vni-sip-dip",
            "Info": "Indicates the VNI aggregation, which aggregates flows with the same VNI ID and the same source and destination IP addresses of tenants.\n-"
        },
        {
            "Parameters": "ipv6",
            "Info": "Displays the IPv6 netstream feature.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip netstream aggregation as"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 netstream aggregation as"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nNetStream aggregation indicates that the original flows with the same attributes are considered as a single flow. The aggregated flow statistics function and original flow statistics function use the same statistics collection process but collect statistics about different packets. The original flow statistics function collects statistics about the sampled packets, whereas the aggregated flow statistics function collects statistics about original flows and generates less data.\nThe advantages of netstream aggregation are as follows:\nFor users who are only concerned about some attributes of network traffic, configure the output of aggregated flows.NetStream aggregation reduces the number of statistics sent to the NMS and therefore relieves the network load.NetStream aggregation reduces resources consumed by the NMS to process original flows. The NMS can display traffic classification by parsing aggregated flows based on the aggregation template.\n\nFollow-up Procedure\nAfter entering the NetStream aggregation view, to enable the NetStream aggregation mode, run the enable (Aggregation view) command in the NetStream aggregation view.\nWhen configuring the MPLS-label aggregation mode, run the ip netstream mpls-aware command or ipv6 netstream mpls-aware command to set the sampling mode of MPLS packets to label-and-ip or label-only."
}