{
    "PageTitle": "netstream statistics enable",
    "FuncDef": "The ip netstream statistics enable command enables the function of collecting IPv4 NetStream interface statistics.\nThe undo ip netstream statistics enable command disables the function of collecting IPv4 NetStream interface statistics.\nThe ipv6 netstream statistics enable command enables the function of collecting IPv6 NetStream interface statistics.\nThe undo ipv6 netstream statistics enable command disables the function of collecting IPv6 NetStream interface statistics.\nBy default, the function of collecting IPv4 and IPv6 NetStream interface statistics is disabled.",
    "CLIs": [
        "{ ip | ipv6 } netstream statistics enable",
        "undo { ip | ipv6 } netstream statistics enable"
    ],
    "ParentView": [
        "100GE interface view",
        "400GE interface view",
        "40GE interface view",
        "50GE sub-interface view",
        "50GE interface view",
        "50|100GE sub-interface view",
        "50|100GE interface view",
        "DCN-CPOS interface view",
        "DCN-E1 interface view",
        "FlexE interface view",
        "GE sub-interface view",
        "GE electrical interface view",
        "T1 interface view",
        "VBDIF interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip",
            "Info": "Displays the IPv4 netstream feature.\n-"
        },
        {
            "Parameters": "ipv6",
            "Info": "Displays the IPv6 netstream feature.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] ip netstream statistics enable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] ipv6 netstream statistics enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nDue to a device, intermediate link, or server fault in network maintenance, the traffic restored by the NMS based on NetStream sampling packets is usually lighter than actual traffic. As a result, the sampling result is incorrect, causing inaccurate NetStream statistics. At present, however, it is hard to determine whether the problem results from the device fault.\nIn this situation, enable the function of collecting interface sampling packet statistics for both incoming and outgoing traffic. Then run the display ip netstream statistics interface command to view the traffic of sampled packets on the interface. The traffic can be compared with that restored on the NMS. If they are the same, the sampling incorrectness may be caused by a device fault. Otherwise, the sampling incorrectness may be caused by other reasons, such as a server or intermediate link fault.\nPrerequisites\nThe NetStream sampling function has been enabled using the ip netstream command or ipv6 netstream command.\nConfiguration Impact\nRunning this command causes the Y.1731 function to be invalid.\nPrecautions\nInterfaces and sub-interfaces, both of which are configured with BAS services, still support Netstream sampling configurations."
}