{
    "PageTitle": "netstream export source",
    "FuncDef": "The ip netstream export source command specifies a source IP address and a source port for the output NetStream IPv4 flows.\nThe undo ip netstream export source command deletes the source IP address and source port configured for the output NetStream IPv4 flows.\nThe ipv6 netstream export source command specifies a source IPv6 address and a source port for the output NetStream IPv6 flows.\nThe undo ipv6 netstream export source command deletes the source IPv6 address and source port configured for the output NetStream IPv6 flows.\nBy default, no source address or source port from which NetStream statistics are output is configured.",
    "CLIs": [
        "ip netstream export source ipv6 <ipv6-address> [ <port> ]",
        "ip netstream export source <ip-address> [ <port> ]",
        "ipv6 netstream export source ipv6 <ipv6-address> [ <port> ]",
        "ipv6 netstream export source <ip-address> [ <port> ]",
        "undo ip netstream export source [ ipv6 ]",
        "undo ip netstream export source { [ <ip-address> [ <port> ] ] | ipv6 | ipv6 <ipv6-address> [ <port> ] }",
        "undo ipv6 netstream export source [ ipv6 ]",
        "undo ipv6 netstream export source { [ <ip-address> [ <port> ] ] | ipv6 | ipv6 <ipv6-address> [ <port> ] }"
    ],
    "ParentView": [
        "IPv6 NetStream aggregation view",
        "NetStream IPv6 monitoring view",
        "NetStream monitoring view",
        "NetStream aggregation view",
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "port",
            "Info": "Specifies the source port of the output NetStream flows.\nThe value is an integer that ranges from 1 to 65535.\nThe default value is 40000."
        },
        {
            "Parameters": "ip",
            "Info": "Displays the IPv4 netstream feature.\n-"
        },
        {
            "Parameters": "ip-address",
            "Info": "Specifies the source IP address of the output NetStream flows.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "ipv6",
            "Info": "Displays the IPv6 netstream feature.\n-"
        },
        {
            "Parameters": "ipv6 ipv6-address",
            "Info": "Specifies the source IPv6 address of the output NetStream flows.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip netstream export source 10.1.1.1 1000"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 netstream export source 10.1.1.1 1000"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip netstream aggregation as",
            "[*HUAWEI-aggregation-as] ip netstream export source 1.1.1.2 1000"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 netstream aggregation as",
            "[*HUAWEI-aggregation-ipv6-as] ipv6 netstream export source 1.1.1.2 1000"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip netstream monitor 1",
            "[*HUAWEI-monitor-1] ip netstream export source 1.1.1.3 1000"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 netstream monitor 1",
            "[*HUAWEI-monitor6-1] ipv6 netstream export source 1.1.1.3 1000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA NetStream-enabled NMS identifies the NetStream data source based on the source IP address and the source port carried in NetStream flows. To configure the source IP address and the source port for the output NetStream flows, run the command. The type of the source IP address configured for output NetStream flows must be the same as the NMS address type. The address type can be either IPv4 or IPv6.\nPrecautions\nThe source IP address and the source port configured in the aggregation view take precedence over that configured in the system view. If no source IP address and source port are configured in the aggregation view, the source IP address and the source port configured in the system view are used.\nIf the source IP address is not configured, no NetStream flow will be output.\nTwo source IP addresses (one IPv4 address and one IPv6 address) can be configured in the system, monitor or NetStream aggregation view. The two source IP addresses are independent of each other, without causing any conflict.\nIn the system view, you can configure a source address for original, aggregated, and flexible flows. In the aggregation view, you can configure a source address for aggregated flows. In the monitoring view, you can configure a source address for flexible and original flows.\nThe specified source address and source port of exported NetStream packets can be precisely deleted only in the monitoring view.\nIn actual applications, it is recommended that you use the public IP address to configure the source address."
}