{
    "PageTitle": "netstream export template option (System view)",
    "FuncDef": "The ip netstream export template option refresh-rate command sets the packet interval and time interval at which the IPv4 option template is refreshed.\nThe undo ip netstream export template option refresh-rate command restores the IPv4 default packet interval and time interval.\nThe ipv6 netstream export template option refresh-rate command sets the packet interval and time interval at which the IPv6 option template is refreshed.\nThe undo ipv6 netstream export template option refresh-rate command restores the IPv6 default packet interval and time interval.\nBy default, the option template is refreshed every 30 minutes and every 20 packets.",
    "CLIs": [
        "ip netstream export template option { refresh-rate <packet-number> | timeout-rate <timeout-interval> }",
        "ipv6 netstream export template option { refresh-rate <packet-number> | timeout-rate <timeout-interval> }",
        "undo ip netstream export template option { refresh-rate | timeout-rate }",
        "undo ipv6 netstream export template option { refresh-rate | timeout-rate }"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "refresh-rate packet-number",
            "Info": "Specifies the packet interval at which the option template is refreshed.\nThe value is an integer ranging from 1 to 600. The default value is 20."
        },
        {
            "Parameters": "timeout-rate timeout-interval",
            "Info": "Specifies the time interval at which the option template is refreshed.\nThe value is an integer ranging from 1 to 3600, in minutes. The default value is 30."
        },
        {
            "Parameters": "ipv6",
            "Info": "Displays the IPv6 netstream feature.\n-"
        },
        {
            "Parameters": "ip",
            "Info": "Displays the IPv4 netstream feature.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip netstream export template option timeout-rate 50",
            "[*HUAWEI] ip netstream export template option refresh-rate 30"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 netstream export template option timeout-rate 50",
            "[*HUAWEI] ipv6 netstream export template option refresh-rate 30"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOption packets are output in V9 or IPFIX format. Therefore, the NDE must send the corresponding option template to the NSC to parse packets. To set the packet interval and time interval at which the option template is refreshed, run the ip netstream export template option refresh-rate command.\nGenerally, the higher the network traffic volume is, the smaller the template refresh interval should be set, but the volume of network traffic generated to send the template also increases. Therefore, set a proper template refresh interval using the ip netstream export template option refresh-rate command. The default value is recommended.\nIn the case of burst network traffic, configure both the time interval and the packet interval to ensure that statistics about burst network traffic can be parsed.\nThe packet interval and time interval are independent of each other and take effect simultaneously."
}