{
    "PageTitle": "netstream export index-switch",
    "FuncDef": "The ip netstream export index-switch command converts the interface index type carried in the output NetStream IPv4 flows.\nThe undo ip netstream export index-switch  command restores the default interface index type carried in the output NetStream IPv4 flows.\nThe ipv6 netstream export index-switch command converts the interface index type carried in the output NetStream IPv6 flows.\nThe undo ipv6 netstream export index-switch command restores the interface index type carried in the output NetStream IPv6 flows to the default value.\nBy default, the interface index carried in the output NetStream flows is a 16-bit value.",
    "CLIs": [
        "ip netstream export index-switch { 16 | 32 }",
        "ipv6 netstream export index-switch { 16 | 32 }",
        "undo ip netstream export index-switch",
        "undo ipv6 netstream export index-switch"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "16",
            "Info": "Indicates the 16-bit interface index carried in the output NetStream flows.\n-"
        },
        {
            "Parameters": "32",
            "Info": "Indicates the 32-bit interface index carried in the output NetStream flows.\n-"
        },
        {
            "Parameters": "ipv6",
            "Info": "Displays the IPv6 netstream feature.\n-"
        },
        {
            "Parameters": "ip",
            "Info": "Displays the IPv4 netstream feature.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip netstream export index-switch 32"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 netstream export index-switch 32"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe interface index type carried in the output NetStream flows is determined based on the number of interfaces and the parsing capability of the NMS. For example, if the number of interfaces is over 64 x 1024, the 16-bit interface index cannot represent all interfaces. The command can be used to convert the 16-bit interface index to the 32-bit interface index with the precondition that the NMS can parse the 32-bit interface index.\nPrerequisites\nThe NMS can parse the 32-bit interface index. Otherwise, the NMS is unable to identify NetStream flows sent from devices.\nThe command takes effect only on NetStream flows output in V9 or IPFIX format. When converting the interface index from a 16-bit value to a 32-bit value, ensure that the following conditions are met:\nOriginal flows are output in V9 or IPFIX format.All aggregated flows are output in V9 or IPFIX format.\nAt present, IPv6 flows can be output only in V9 or IPFIX format.\n\nPrecautions\nIf the interface index is a 32-bit value, you cannot change the output format of original flows from V9 or IPFIX to V5. You cannot change the output format of aggregated flows from V9 or IPFIX to V8.\n32-bit interface indexes, compared with the default 16-bit interface indexes, can be more easily identified by third-party NMSs."
}