{
    "PageTitle": "mask",
    "FuncDef": "The mask command sets the aggregate mask length.\nThe undo mask command deletes the aggregate mask length.\nBy default, masks of entries in a FIB table are used for stream aggregation.",
    "CLIs": [
        "mask { source | destination } minimum <mask-length>",
        "undo mask { source | destination }"
    ],
    "ParentView": [
        "IPv6 NetStream aggregation view",
        "NetStream aggregation view"
    ],
    "ParaDef": [
        {
            "Parameters": "source",
            "Info": "Indicates the source mask, which is used in prefix, prefix-ToS, source-prefix, or source-prefix-ToS aggregation mode.\n-"
        },
        {
            "Parameters": "destination",
            "Info": "Indicates the destination mask, which is used in prefix, prefix-ToS, destination-prefix, or destination-prefix-ToS aggregation mode.\n-"
        },
        {
            "Parameters": "minimum mask-length",
            "Info": "Specifies the aggregate mask length.\nThe value is an integer.\nFor statistics about IPv4 aggregated flows, the value ranges from 1 to 32. The default value is 24.For statistics about IPv6 aggregated flows, the value ranges from 1 to 128. The default value is 64."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip netstream aggregation source-prefix",
            "[*HUAWEI-aggregation-srcpre] mask source minimum 25"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe aggregate mask can be configured only in the destination-prefix, destination-prefix-ToS, prefix, prefix-ToS, source-prefix, and source-prefix-ToS aggregation modes.\nA higher mask between the mask in the FIB table and the configured mask takes effect. If no aggregate mask is set, you can aggregate flows based on the mask in the FIB table.\nConfiguration Impact\nSetting the aggregate mask defines the granularity for collected NetStream statistics:\nIncreasing an aggregate mask length enables a device to collect refined NetStream statistics.Decreasing an aggregate mask length enables a device to collect summary NetStream statistics."
}