{
    "PageTitle": "apply record",
    "FuncDef": "The apply record command applies the NetStream flexible flow service in the monitoring view.\nThe undo apply record command cancels the NetStream flexible flow service in the monitoring view.\nBy default, the NetStream flexible flow service is not applied in the monitoring view.",
    "CLIs": [
        "apply record <record-name>",
        "undo apply record [ <record-name> ]"
    ],
    "ParentView": [
        "NetStream IPv6 monitoring view",
        "NetStream monitoring view"
    ],
    "ParaDef": [
        {
            "Parameters": "record-name",
            "Info": "Specifies the name of a NetStream flexible flow.\nThe value is a string of 1 to 32 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip netstream record tt",
            "[*HUAWEI-record-tt] collect input packets 64",
            "[*HUAWEI-record-tt] commit",
            "[~HUAWEI-record-tt] quit",
            "[~HUAWEI] ip netstream monitor aaa",
            "[*HUAWEI-monitor-aaa] apply record tt"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter you configure a flexible flow, run the apply record command to apply the flexible flow service to the monitoring view. Then, this service is applied to an interface through the monitoring view. Packets on this interface are sampled and output as the flexible flow.\nPrerequisites\nBefore applying a flexible flow, you must run the match or collect command to configure matching rules or collected fields. Otherwise, the flexible flow cannot be applied.\nPrecautions\nOnly one flexible flow cannot be applied in the IPv4 or IPv6 monitoring view.\nFlexible flow packets can be output only in the V9 format.\nIf the ip netstream export version command is run in the system view to specify the V5 or IPFIX packet output format and the V5 or IPFIX format is also specified in the NetStream monitoring service view, the apply record command does not take effect.If the ipv6 netstream export version command is run in the system view to specify the IPFIX format and the IPFIX format is also specified in the NetStream monitoring service view, the apply record command does not take effect."
}