{
    "PageTitle": "reset netstream cache slot",
    "FuncDef": "The reset ip netstream cache slot command forcibly ages IPv4 original flows cached in the buffer.\nThe reset ipv6 netstream cache slot command forcibly ages IPv6 original flows cached in the buffer.",
    "CLIs": [
        "reset { ip | ipv6 } netstream cache slot <slot-id>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip",
            "Info": "Displays the IPv4 netstream feature.\n-"
        },
        {
            "Parameters": "ipv6",
            "Info": "Displays the IPv6 netstream feature.\n-"
        },
        {
            "Parameters": "slot-id",
            "Info": "Specifies the name of a flexible flow statistics template.\nThe value is a string of 1 to 32 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] reset ip netstream cache slot 1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] reset ipv6 netstream cache slot 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe reset ip netstream cache slot command and reset ipv6 netstream cache slot command can age all original flows cached in the buffer in a specified slot, and output original flows or generate aggregated flows. The flows will be aged immediately and sent to the NMS.\nThe command can be configured only on a physical system (PS).\nPrerequisites\nThe undo ip netstream command or undo ipv6 netstream command has been run on the interface to temporarily disable the sampling function. Otherwise, within 30 seconds after the reset ip netstream cache slot command or reset ipv6 netstream cache slot command is run, sampled original flows are forcibly output with aggregation.\nPrecautions\nThe sampling function can be re-enabled 30 seconds after the reset ip netstream cache slot command or reset ipv6 netstream cache slot command is run.\nAfter this command is configured, information about original flows in the buffer will be lost."
}