{
    "PageTitle": "direct-route track pw-state",
    "FuncDef": "The direct-route track pw-state command associates the IPv4 direct route on an interface with the PW status.\nThe direct-route track pw-state command dissociates the IPv4 direct route on an interface from the PW status.\nBy default, the IPv4 direct route on an interface is not associated with the PW status.",
    "CLIs": [
        "direct-route track pw-state degrade-cost <cost>",
        "undo direct-route track pw-state"
    ],
    "ParentView": [
        "Global VE sub-interface view",
        "Remote-AP interface view",
        "Vbridge interface view",
        "VE sub-interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "degrade-cost cost",
            "Info": "Specifies the cost of the IPv4 direct route on a specified interface.\nThe value is an integer ranging from 1 to 4294967295."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface virtual-ethernet2/0/0",
            "[~HUAWEI-Virtual-Ethernet2/0/0] ve-group 2 l3-access",
            "[*HUAWEI-Virtual-Ethernet2/0/0] interface virtual-ethernet2/0/0.1",
            "[*HUAWEI-Virtual-Ethernet2/0/0.1] direct-route track pw-state degrade-cost 30"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo adjust the cost of the direct route on an interface based on the PW status, run the direct-route track pw-state command. When the PW status is backup, the cost of the direct route is changed to the configured; when the PW status is active, the cost of the direct route is changed to default value 0. For configurations details, see Configuration-IP Routing Basis Configuration-Configuring an Direct Route to Respond to L3VE Interface Status Changes After a Delay.\nPrerequisites\nThe main VE interface of the sub-interface has been configured as an L3VE interface.\nPrecautions\nThe direct-route track pw-state and direct-route track vrrp commands cannot be configured on one L3VE interface. If you run the two commands on one L3VE interface, the latest configuration overrides the previous one."
}