{
    "PageTitle": "direct-route ipv6 degrade-delay",
    "FuncDef": "The direct-route ipv6 degrade-delay command sets the delay time after which the original cost of the IPv6 direct route is restored on a specified interface that changes from Down to Up.\nThe undo direct-route ipv6 degrade-delay command restores the default configurations.\nBy default, there is no such configuration on the interface.",
    "CLIs": [
        "direct-route ipv6 degrade-delay <delay-time> degrade-cost <cost>",
        "undo direct-route ipv6 degrade-delay"
    ],
    "ParentView": [
        "Eth-Trunk sub-interface view",
        "Global VE sub-interface view",
        "VE sub-interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "delay-time",
            "Info": "Specifies the delay after which the original cost of the IPv6 direct route is restored on a specified interface.\nThe value is an integer ranging from 1 to 3600, in seconds."
        },
        {
            "Parameters": "degrade-cost cost",
            "Info": "Specifies the cost of the IPv6 direct route on a specified interface.\nThe value is an integer ranging from 1 to 4294967295."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface eth-trunk 10",
            "[*HUAWEI-Eth-Trunk10] e-trunk 1",
            "[*HUAWEI-Eth-Trunk10] e-trunk mode force-master",
            "[*HUAWEI-Eth-Trunk10] quit",
            "[*HUAWEI] interface eth-trunk 10.1",
            "[*HUAWEI-Eth-Trunk10.1] direct-route ipv6 degrade-delay 10 degrade-cost 30"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter the direct-route ipv6 degrade-delay command is configured on an interface and the interface changes from Down to Up, the cost of the IPv6 direct route changes to the configured value. After the configuration of delay-time times out, the cost of the IPv6 direct route is restored to the default value 0.\nPrecautions\nThe direct-route ipv6 degrade-delay and direct-route ipv6 track pw-state commands are mutually exclusive. If both them are run simultaneously, the latest configuration overrides the previous one."
}