{
    "PageTitle": "direct-route track vrrp",
    "FuncDef": "The direct-route track vrrp command associates direct routes with a Virtual Router Redundancy Protocol (VRRP) backup group.\nThe undo direct-route track vrrp command dissociates direct routes from a VRRP backup group.\n\nBy default, no direct routes are associated with a VRRP backup group.",
    "CLIs": [
        "direct-route track vrrp vrid <virtual-router-id> degrade-cost <cost-value>",
        "undo direct-route track vrrp"
    ],
    "ParentView": [
        "PW-VE sub-interface view",
        "40GE interface view",
        "Port extension interface view",
        "GE electrical interface view",
        "Eth-Trunk sub-interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "GE sub-interface view",
        "VBDIF interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "GE interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "100ge sub-interface view",
        "25GE interface view",
        "40GE sub-interface view",
        "Eth-Trunk interface view",
        "10GE sub-interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "degrade-cost cost-value",
            "Info": "Specifies the cost of a direct route that the virtual IP network segment generates when the VRRP status is Backup or Initialize.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "vrid virtual-router-id",
            "Info": "Specifies the ID of a VRRP backup group.\nThe value is an integer ranging from 1 to 255."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] vrrp vrid 1",
            "[*HUAWEI-GigabitEthernet1/0/0] direct-route track vrrp vrid 1 degrade-cost 300"
        ]
    ],
    "ExtraInfo": "Usage Scenario\n\nIf a VRRP backup group functions as a user gateway, user-to-network traffic and network-to-user traffic may travel through different paths. This case occurs because user-to-network traffic traverses the master device in the VRRP backup group, but network-to-user traffic is transmitted through a path that a dynamic routing protocol selects. When a firewall is configured for the VRRP backup group to improve network security, path inconsistency causes the firewall to block both user-to-network and network-to-user traffic. Additionally, path inconsistency increases the difficulty and cost in traffic policing and accounting. To resolve problems caused by path inconsistency, run the direct-route track vrrp command to associate direct routes with a VRRP backup group. The association allows devices to modify their direct route costs based on the VRRP status. To change the path that a dynamic routing protocol selects based on the VRRP status, configure a dynamic routing protocol to import direct routes.\n\nPrerequisites\n\nVRRP has been configured on the interface.\n\nConfiguration Impact\n\nAfter the direct-route track vrrp command is run, the VRRP-enabled device modifies the cost of direct routes that the virtual IP network segment generates based on the VRRP status:\n\nWhen the VRRP status is Master, the direct route cost is set to the default value 0. The IP direct routes have the highest priority.\nWhen the VRRP status is Backup or Initialize, the value specified in cost-value is used as the direct route cost.\n\n\nFollow-up Procedure\n\nConfigure a dynamic routing protocol to import direct routes.\n\nPrecautions\n\nDirect routes on an interface can be associated with only one VRRP backup group. To associate the direct routes with another VRRP backup group, delete the original direct-route track vrrp configuration."
}