{
    "PageTitle": "display ipv6 routing-table vpn-instance (All views)",
    "FuncDef": "The display ipv6 routing-table vpn-instance command displays the routing table of an IPv6 address family-enabled VPN instance.",
    "CLIs": [
        "display ipv6 routing-table vpn-instance <vpn-instance-name> <ipv6-address> [ <prefix-length> ] <ipv6-address> <prefix-length> [ verbose ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance-name",
            "Info": "Specifies the name of an IPv6 address family-enabled VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "ipv6-address",
            "Info": "Specifies the IPv6 address prefix.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "prefix-length",
            "Info": "Specifies the length of the IPv6 address prefix.\nThe value is an integer ranging from 0 to 128."
        },
        {
            "Parameters": "verbose",
            "Info": "Displays detailed information about active and inactive routes in the routing table of the IPv6 address family-enabled VPN instance.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] display ipv6 routing-table vpn-instance vrf1 2001:db8:1::1 verbose",
            "Route Flags: R - relay, D - download to fib, T - to vpn-instance, B - black hole route",
            "------------------------------------------------------------------------------",
            "Routing Table : vrf1",
            "Summary Count : 1",
            "",
            "Destination  : 2001:db8::                              PrefixLength : 64",
            "NextHop      : ::                                      Preference   : 60",
            "Neighbour    : ::                                      ProcessID    : 0",
            "Label        : NULL                                    Protocol     : Static",
            "State        : Active Adv                              Cost         : 0",
            "Entry ID     : 0                                       EntryFlags   : 0x00000000",
            "Reference Cnt: 0                                       Tag          : 0",
            "Priority     : low                                     Age          : 135sec",
            "IndirectID   : 0x10000CD                               Instance     : ",
            "RelayNextHop : ::                                      TunnelID     : 0x0",
            "Interface    : NULL0                                   Flags        : DB"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo check the routing table of the IPv6 address family-enabled VPN instance, run the display ipv6 routing-table vpn-instance command. The command output includes the destination address, prefix length, protocol type, priority, cost, next hop, and outbound interface.\na recursive route is counted as one route no matter how many outbound interfaces and next hops the route finds.\nThis command without verbose specified displays preferred routes only.\nPrecautions\nIf the specified ipv6-prefix ipv6-prefix-name does not exist, the command displays all preferred routes."
}