{
    "PageTitle": "arp vlink-direct-route preference",
    "FuncDef": "The arp vlink-direct-route preference command configures a priority for ARP Vlink direct routes on an interface.\nThe undo arp vlink-direct-route preference command restores the default priority of ARP Vlink direct routes on an interface.\n\nBy default, the priority of ARP Vlink direct routes on an interface is 0.",
    "CLIs": [
        "arp vlink-direct-route preference <preference-value>",
        "undo arp vlink-direct-route preference [ <preference-value> ]"
    ],
    "ParentView": [
        "GE sub-interface view",
        "PW-VE sub-interface view",
        "VBDIF interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "Eth-Trunk sub-interface view",
        "400GE sub-interface view",
        "50GE sub-interface view",
        "100ge sub-interface view",
        "40GE sub-interface view",
        "10GE sub-interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "preference-value",
            "Info": "Specifies a priority for ARP Vlink direct routes on an interface.\nThe value is an integer ranging from 0 to 255."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] vlan 200",
            "[*HUAWEI-Vlan200] quit",
            "[*HUAWEI] bridge-domain 200",
            "[*HUAWEI-bd200] quit",
            "[*HUAWEI] interface vbdif 200",
            "[*HUAWEI-Vbdif200] arp vlink-direct-route preference 100"
        ]
    ],
    "ExtraInfo": "Usage Scenario\n\nTo enable local and remote PEs to communicate with each other, the local PE needs to advertise the CE's route to the remote PE through BGP. After the local PE learns the address of the CE, it generates a direct route. By default, ARP Vlink direct routes are not advertised. If the remote PE needs to access the sites connected to the local PE, the local PE needs to be configured to advertise ARP Vlink direct routes.\nIf advertisement of ARP Vlink direct routes is enabled in the system view or VPN view and the command is run on an interface that has been added to a VPN, the priority of the ARP Vlink direct routes on the interface is changed. ARP Vlink direct routes can be advertised through different routing protocols. If ARP Vlink direct routes advertised by different routing protocols exist, you can run this command to change the priority for route selection.\n\nPrecautions\n\nBefore running this command in the GE sub-interface view, Eth-Trunk sub-interface view, or VE sub-interface view, you need to configure the termination encapsulation mode of the sub-interface as dot1q termination or QinQ termination. Alternatively, configure a QinQ stacking, dot1q, VLAN type, or untagged matching policy on the sub-interface."
}