{
    "PageTitle": "ipv6 nd vlink-direct-route advertise",
    "FuncDef": "The ipv6 nd vlink-direct-route advertise command advertises Neighbor Discovery Protocol (NDP) Vlink direct routes on the public network.\nThe undo ipv6 nd vlink-direct-route advertise command restores the default setting.\nBy default, NDP Vlink direct routes are not advertised on the public network.",
    "CLIs": [
        "ipv6 nd vlink-direct-route advertise [ route-policy <route-policy-name> | route-filter <route-filter-name> ]",
        "undo ipv6 nd vlink-direct-route advertise"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "route-policy route-policy-name",
            "Info": "Specifies the name of a route-policy that is used to filter NDP Vlink direct routes on the public network.\nThe name is a string of 1 to 200 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "route-filter route-filter-name",
            "Info": "Specifies the name of a route-filter used to filter public network NDP Vlink direct routes.\nThe value is a string of 1 to 200 case-sensitive characters, spaces not supported. If parameters are included in the referenced route-filter, specify values for them in the format of (var1, var2, ...var8) behind the route-filter name. A maximum of eight parameters can be specified, and each value ranges from 1 to 200 characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] route-policy rp1 permit node 10",
            "[*HUAWEI-route-policy] quit",
            "[*HUAWEI] ipv6 nd vlink-direct-route advertise route-policy rp1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, IPv6 NDP Vlink direct routes are only used for packet forwarding in the same VLAN and cannot be imported to dynamic routing protocols. This is because importing Vlink direct routes to dynamic routing protocols will increase the number of routing entries and affect routing table stability. In some cases, some operations need to be performed based on Vlink direct routes of VLAN users. For example, different VLAN users use different route exporting policies to guide traffic from the remote device. In this scenario, IPv6 NDP Vlink direct routes are needed to be imported by a dynamic routing protocol and advertised to the remote device. After advertisement of IPv6 NDP Vlink direct routes is enabled, these direct routes can be imported by a dynamic routing protocol (IGP or BGP) and advertised to the remote device.\nIf NDP Vlink direct routes to a few VLAN users of a VLAN need to be advertised, run the ipv6 nd vlink-direct-route advertise command with route-policy or route-filter specified. This configuration ensures that only desired NDP Vlink direct routes are advertised, the scale of the routing table is controlled, and the security of other sites in the VLAN is guaranteed.\nConfiguration Impact\nAfter route-policy or route-filter is specified in the ipv6 nd vlink-direct-route advertise command, only desired NDP Vlink direct routes are advertised.\nFollow-up Procedure\nAdvertised NDP Vlink direct routes also need to be imported to the routing table of each dynamic routing protocol on the Router. In this manner, NDP Vlink direct routes can be advertised by each dynamic routing protocol module.\nPrecautions\nRoute-policies and route-filters can filter NDP Vlink direct routes only based on IPv4 or IPv6 route prefixes.\nroute-policy must be specified using the route-policy command. If the parameter is not specified, NDP Vlink direct routes cannot be filtered.\nThe specified route-filter must have been configured; otherwise, it cannot be used to filter NDP Vlink direct routes."
}