{
    "PageTitle": "ip static-routing-table",
    "FuncDef": "The ip static-routing-table command applies a route-policy to static routes on the public network.\nThe undo ip static-routing-table command cancels the route-policy that is applied to static routes on the public network.\nBy default, no route-policy is applied to static routes on the public network.",
    "CLIs": [
        "ip static-routing-table route-policy <route-policy-name>",
        "undo ip static-routing-table",
        "undo ip static-routing-table all"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "static-routing-table",
            "Info": "Applies a route-policy to static routes.\n-"
        },
        {
            "Parameters": "all",
            "Info": "Cancels the route-policy that is applied to direct or static routes on the public network and all VPN instances.\n-"
        },
        {
            "Parameters": "route-policy route-policy-name",
            "Info": "Specifies the name of a route-policy.\nThe name is a string of 1 to 200 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip ip-prefix pr1 index 10 permit 1.1.1.1 32",
            "[*HUAWEI] route-policy ip_qos_rp permit node 10",
            "[*HUAWEI-route-policy] if-match ip-prefix pr1",
            "[*HUAWEI-route-policy] apply qos-local-id 123",
            "[*HUAWEI-route-policy] commit",
            "[~HUAWEI-route-policy] quit",
            "[~HUAWEI] ip static-routing-table route-policy ip_qos_rp"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo perform traffic statistics collection, authentication, and accounting based on static routes, run the ip route-policy command to apply a route-policy to public network static routes so that QoS information, such as the traffic behavior or local ID that is associated with the static routes can be set for QoS information management.\nPrerequisites\n The route-policy has been configured using the route-policy command. Routes have been categorized based on specific conditions.For direct routes, they are categorized based on the ACL and IP prefix list.For static routes, they are categorized based on the ACL, IP prefix list, and route tag."
}