{
    "PageTitle": "reset ip routing-table statistics protocol",
    "FuncDef": "The reset ip routing-table statistics protocol command clears statistics in the IPv4 routing table.",
    "CLIs": [
        "reset ip routing-table statistics protocol [ vpn-instance <vpn-instance-name> ] { all | bgp | direct | isis | ospf | rip | static | unr | op-route }",
        "reset ip routing-table all-vpn-instance statistics protocol { all | bgp | direct | isis | ospf | rip | static | unr | op-route }",
        "reset ip routing-table all-routes statistics protocol { all | bgp | direct | isis | ospf | rip | static | unr | op-route }"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "all",
            "Info": "Clears the statistics of all routing protocols in the routing table.\n-"
        },
        {
            "Parameters": "bgp",
            "Info": "Clears the statistics about the bgp route.\n-"
        },
        {
            "Parameters": "direct",
            "Info": "Clears the statistics about the direct route.\n-"
        },
        {
            "Parameters": "isis",
            "Info": "Clears the statistics about the isis route.\n-"
        },
        {
            "Parameters": "ospf",
            "Info": "Clears the statistics about the ospf route.\n-"
        },
        {
            "Parameters": "rip",
            "Info": "Clears the statistics about the RIP route.\n-"
        },
        {
            "Parameters": "static",
            "Info": "Clears the statistics about the static route.\n-"
        },
        {
            "Parameters": "unr",
            "Info": "Clears the statistics of the unr route.\n-"
        },
        {
            "Parameters": "op-route",
            "Info": "Deletes the statistics about open programming (OP)-routes.\n-"
        },
        {
            "Parameters": "all-vpn-instance",
            "Info": "Clears the statistics in the IPv4 routing tables of all VPN instances.\n-"
        },
        {
            "Parameters": "all-routes",
            "Info": "Clears the statistics of all IPv4 routes.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset ip routing-table statistics protocol all"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe reset ip routing-table statistics protocol command clears historical statistics about protocol routes in the IPv4 routing table. This command enables the router to re-collect statistics about protocol routes, facilitating route monitoring and fault location.\nPrecautions\nStatistics in the IPv4 routing table cannot be restored after you clear them. Therefore, exercise caution when running the command."
}