{
    "PageTitle": "condition snmp-notification",
    "FuncDef": "The condition snmp-notification command configures an SNMP trap OID as the triggering condition of a maintenance assistant.\nThe undo condition command cancels the configuration.\nBy default, no triggering condition is configured for a maintenance assistant.",
    "CLIs": [
        "condition snmp-notification oid <oid-string> [ <optype> <oid-value> ]"
    ],
    "ParentView": [
        "Maintenance assistant task view"
    ],
    "ParaDef": [
        {
            "Parameters": "optype",
            "Info": "Specifies the type of the comparison between the OID of the generated SNMP trap and the configured SNMP trap OID.\nThe value can be:\neq: equal tone: not equal toIt: less thanle: less than or equal togt: greater thange: greater than or equal to"
        },
        {
            "Parameters": "oid-value",
            "Info": "Specifies an OID expressed in numbers.\nThe value is an integer ranging from -2147483648 to 2147483647."
        },
        {
            "Parameters": "oid oid-string",
            "Info": "Specifies the OID of an SNMP trap.\nThe value is an integer ranging from 1 to 127."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ops",
            "[~HUAWEI-ops] assistant task",
            "[*HUAWEI-ops-assistant-task] condition snmp-notification oid 1.3.6.1.4.1.2011.5.25.136.1.6.8 eq 222"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter a maintenance assistant is created, a triggering condition must be specified so that the maintenance assistant can be automatically operated as long as the triggering condition is met.\nAn OPS maintenance assistant can be triggered upon an alarm or event. The commands for configuring different triggering conditions for an OPS maintenance assistant vary.\nTo configure an SNMP trap OID as the triggering condition of a maintenance assistant, run the condition snmp-notification command.\nPrerequisites\nThe assistant command has been run in the system view to create a maintenance assistant.\nPrecautions\nA maintenance assistant can be configured with only one triggering condition."
}