{
    "PageTitle": "condition timer (Maintenance assistant task view)",
    "FuncDef": "The condition timer command configures the specific time when a maintenance assistant is executed.\nThe undo condition command cancels the configuration.\nBy default, the time when a maintenance assistant is executed is not configured.",
    "CLIs": [
        "condition timer <cron> <minutes> <hours> <daysOfMonth> <months> <daysOfWeek> [ <years> ]"
    ],
    "ParentView": [
        "Maintenance assistant task view"
    ],
    "ParaDef": [
        {
            "Parameters": "cron",
            "Info": "Specifies the format of cron time.\n-"
        },
        {
            "Parameters": "minutes",
            "Info": "Specifies the minute information.\nThe value is a string of characters in the format of cron time. The value ranges from 0 to 59."
        },
        {
            "Parameters": "hours",
            "Info": "Specifies the hour information.\nThe value is a string of characters in the format of cron time. The value ranges from 0 to 23."
        },
        {
            "Parameters": "daysOfMonth",
            "Info": "Specifies the day of a month.\nThe value is a string of characters in the format of cron time. The value ranges from 1 to 28, 29, 30, or 31 based on the specific month. The value and daysOfWeek are mutually exclusive. Either of them must be configured as *."
        },
        {
            "Parameters": "months",
            "Info": "Specifies the month information.\nThe value is a string of characters in the format of cron time. The value ranges from 1 to 12."
        },
        {
            "Parameters": "daysOfWeek",
            "Info": "Specifies the day of a week.\nThe value is a string of characters in the format of cron time. The value ranges from 0 to 7. Both 0 and 7 indicate Sunday. The value 1 to 6 indicate Monday to Saturday. The value and daysOfMonth are mutually exclusive. Either of them must be configured as *."
        },
        {
            "Parameters": "years",
            "Info": "Specifies the year information.\nThe value is a string of characters in the format of cron time. The value ranges from 2000 to 2099. This parameter is optional. If this parameter is not specified, all years from 2000 to 2099 are covered."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ops",
            "[~HUAWEI-ops] assistant task",
            "[*HUAWEI-ops-assistant-task] condition timer cron 0 20 4 5 * 2020"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ops",
            "[~HUAWEI-ops] assistant task",
            "[*HUAWEI-ops-assistant-task] condition timer cron * * * * * *"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure the time when a maintenance assistant is executed, run the condition timer cron command.\nAfter an alarm is generated, an event occurs, or a timer expires, the maintenance assistant can be executed.\nTo trigger a maintenance assistant based on a timer, run this command. The time is expressed using the syntax in Unix or Linux cron program.\nThe common time format hh:mm:ss dd-mm-yyyy usually represents a fixed moment. The time in the cron format is more flexible and can represent a single moment, multiple moments, time range, or interval in a simplified manner. The value can contain 10 numbers (0 to 9) and four special characters (*, -, / and ,).\nPrerequisites\nThe assistant command has been run in the system view to create a maintenance assistant.\nPrecautions\nIf both days-of-month and days-of-week are configured as *, all days are covered.The tasks are executed in sequence, and the period that each task lasts is not fixed and may be longer than the period during which the subsequent task instance is generated. Therefore, the time when a task instance is executed may vary from the time when a task instance is generated. The condition timer cron command configures the time when a task instance is generated but not the time when the task instance is executed.A maintenance assistant can be configured with only one condition."
}