{
    "PageTitle": "ops run python",
    "FuncDef": "The ops run python command executes a script.\nThe ops stop process command stops a running OPS process.",
    "CLIs": [
        "ops run python <script-name> [ <arguments> ]",
        "ops stop process <process-id>",
        "ops run python background <script-name> [ <arguments> ]"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "script-name",
            "Info": "Specifies the name of a script.\nThe value is a string of 1 to 127 characters."
        },
        {
            "Parameters": "arguments",
            "Info": "Specifies the script parameter, which is parsed by the script.\nThe value is a string of 1 to 383 characters."
        },
        {
            "Parameters": "process-id",
            "Info": "Process ID.\nIDs are automatically allocated by the system. You can run the display ops process state command to query the process ID."
        },
        {
            "Parameters": "background",
            "Info": "Executes the script in the background.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> ops stop process 2002",
            "Warning: This operation maybe lost some data, are you sure stop the process? [Y/N]Y"
        ],
        [
            "<HUAWEI> ops run python config.py \"1 2 3\""
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo execute a script, run the ops run python command. Scripts can be executed in the foreground or background in the OPS.\nWhen scripts are executed in the foreground, users can view the script execution output and interoperate with scripts. In addition, users can press Ctrl+C to end the script execution, but scripts may keep being executed if codes do not cover the Ctrl+C operation.\nUser input is transparently transmitted to scripts, and the OPS does not proactively perform timeout tests.\nIf a script is executed in the foreground and a user closes the window, the script execution will be ended.\nWhen scripts are executed in the background, users cannot view the script execution output. Users receive only a null character string in any interaction operation.\nTo stop a running process, run the ops stop process command.\n\nPrerequisites\nA script has been installed on the device.\nThe Python script has been uploaded to the device.The ops install file command is run in the system view to install the script.\nThe display ops process current command has been run to query the process ID.\n\nConfiguration Impact\nIf a script contains configuration delivering operations, the system configuration will be affected.\nAfter a process is stopped, subsequent operations are no longer performed, and all resources applied for this process will be released.\nFollow-up Procedure\nRun the display ops process history command to view information about the stopped process. Information shows that a user cancels this process.\nPrecautions\nThe running process will be stopped suddenly. Therefore, exercise caution when running this command."
}