{
    "PageTitle": "display rrpp snooping enable",
    "FuncDef": "The display rrpp snooping enable command displays RRPP snooping-enabled interfaces.",
    "CLIs": [
        "display rrpp snooping enable { all | interface { <interface-name> | <interface-type> <interface-number> } }"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "all",
            "Info": "Indicates all RRPP snooping-enabled interfaces.\n-"
        },
        {
            "Parameters": "interface interface-type interface-number",
            "Info": "Specifies the type and number of an interface.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display rrpp snooping enable all",
            "Port                 VsiName           Vlan     ",
            "-------------------------------------------------------- ",
            "GE1/0/1.1            name1             100 ",
            "GE2/0/1.1            name2             200"
        ],
        [
            "<HUAWEI> display rrpp snooping enable interface gigabitethernet1/0/1.1",
            "Port                 VsiName           Vlan     ",
            "-------------------------------------------------------- ",
            "GE1/0/1.1            name1             100"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen an RRPP ring accesses the virtual private LAN service (VPLS) network in which devices are connected using pseudo wires (PWs), the device cannot respond RRPP protocol packets directly. Therefore, the VPLS network cannot sense the status change of the RRPP ring. When the RRPP ring topology changes, each node in the VPLS network forwards downstream data according to the MAC address table generated before the RRPP ring topology changes. As a result, the downstream traffic cannot be forwarded. When RRPP snooping is configured on sub-interfaces or VLANIF interfaces, the VPLS network can transparently transmit RRPP protocol packets, detect the changes on the RRPP rings, and upgrade the forwarding entries to ensure that traffic is switched in time to a congestion-free path.\nYou can run the display rrpp snooping enable command to view the interfaces that are enabled with RRPP snooping."
}