{
    "PageTitle": "dhcp option82 insert enable (interface view)",
    "FuncDef": "The dhcp option82 insert enable command enables Option 82 insertion.\nThe undo dhcp option82 insert enable command disables Option 82 insertion.\nBy default, Option 82 insertion is disabled.",
    "CLIs": [
        "dhcp option82 insert enable",
        "undo dhcp option82 insert enable"
    ],
    "ParentView": [
        "50GE Layer 2 sub-interface view",
        "40GE interface view",
        "Eth-Trunk Layer 2 sub-interface view",
        "GE Layer 2 sub-interface view",
        "Port extension interface view",
        "GE electrical interface view",
        "400GE interface view",
        "10GE interface view",
        "MP-group interface view",
        "Layer 2 sub-interface view",
        "VE sub-interface view",
        "GE interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "Sub-interface view",
        "50GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Eth-Trunk interface view",
        "400GE Layer 2 sub-interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dhcp enable",
            "[~HUAWEI] interface GigabitEthernet 1/0/6",
            "[*HUAWEI-GigabitEthernet1/0/6] dhcp option82 insert enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe option fields in a DHCP packet store some control information and parameters that are not defined in common protocols. An option field consists of the Code, Length, and Value. The Option 82 field refers to the option field in which the value of Code is 82.\nThe Option 82 field contains the location information of DHCP hosts, such as information about login interface, VLAN, and address. The Option 82 field helps create DHCP snooping binding entries with accurate interface information. DHCP relays specify clients and policies for IP address assignment based on the Option 82 field. For example, the DHCP server assigns IP addresses in a network segment for the clients that logs in from Gigabitethernet 1/0/1. The DHCP server assigns IP addresses in another network segment for the clients that logs in from Gigabitethernet 1/0/2.\nConfiguration Impact\nAfter the dhcp option82 insert enable command is run, the device inserts the option 82 field into a DHCP packet if no Option 82 field exists in the packet. If the Option 82 field exists in a DHCP packet, the device checks whether the Option 82 field contains suboptions. If the Option 82 field contains suboptions, the device does not change the suboptions. If the Option 82 field does not contain suboptions and the suboption format is configured, the device inserts suboptions into the Option 82 field.\nIf the dhcp option82 insert enable command and the dhcp option82 rebuild enable (interface view) command are run in the same view, the last configuration takes effect."
}