{
    "PageTitle": "dhcp option82 rebuild enable (Bridge domain view)",
    "FuncDef": "The dhcp option82 rebuild enable command enables a device to forcibly insert Option 82 into DHCP packets.\nThe undo dhcp option82 rebuild enable command disables a device from forcibly inserting Option 82 into DHCP packets.\nBy default, a device is disabled from forcibly inserting Option 82 into DHCP packets.",
    "CLIs": [
        "dhcp option82 rebuild enable",
        "undo dhcp option82 rebuild enable"
    ],
    "ParentView": [
        "Bridge domain view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bridge-domain 10",
            "[*HUAWEI-bd10] dhcp option82 rebuild enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe Option field in a DHCP packet carries control information and parameters that are not defined in certain common protocols. The Option field consists of the Code, Length, and Value fields. The Option 82 field is an Option field with the Code value 82.\nThe Option 82 field contains the location information of DHCP hosts, such as information about login interface, VLAN, and address. The Option 82 field helps create DHCP snooping binding entries with accurate interface information. Based on the Option 82 field, the DHCP server assigns IP addresses and policies for DHCP clients. For example, the DHCP server assigns IP addresses in a network segment for the clients that log in from GE 1/0/1. The DHCP server assigns IP addresses in another network segment for the clients that log in from GE 1/0/2.\nConfiguration Impact\nAfter the dhcp option82 rebuild enable command is run, the device inserts the Option 82 field into a DHCP packet if no Option 82 field exists in the packet. If the Option 82 field exists in a DHCP packet, the device deletes the Option 82 field and inserts a new Option 82 field into the packet.If the dhcp option82 rebuild enable command and the dhcp option82 insert enable (BD view) command are run in the BD view, the later configuration takes effect.\n\nPrecautions\nOnly the device on which DHCP snooping or DHCP relay is configured can be enabled to forcibly insert Option 82 into DHCP packets."
}