{
    "PageTitle": "dhcp relay reply broadcast-always",
    "FuncDef": "The dhcp relay reply broadcast-always command configure the DHCP relay to broadcast response packets.\nThe undo dhcp relay reply broadcast-always command restores the default configuration.\nBy default, the DHCP relay replies with broadcast or unicast packets based on the broadcast flag in request packets.",
    "CLIs": [
        "dhcp relay reply broadcast-always",
        "undo dhcp relay reply broadcast-always"
    ],
    "ParentView": [
        "PW-VE sub-interface view",
        "40GE interface view",
        "Port extension interface view",
        "GE electrical interface view",
        "Global MP-group interface view",
        "Remote-AP interface view",
        "Serial interface view",
        "Eth-Trunk sub-interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "MP-group interface view",
        "Trunk serial interface view",
        "GE sub-interface view",
        "VBDIF interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "GE interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Vbridge interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "100ge sub-interface view",
        "25GE interface view",
        "40GE sub-interface view",
        "Eth-Trunk interface view",
        "10GE sub-interface view",
        "POS interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet3/0/0",
            "[~HUAWEI-GigabitEthernet3/0/0] dhcp relay reply broadcast-always"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAccording to standard protocols, when the DHCP relay and a DHCP client are on the same network segment, the DHCP relay checks whether client requests carry the broadcast flag. If so, the DHCP relay replies with broadcast packets. If not, the DHCP relay replies with unicast packets.\nA DHCP client sends Discover packets, which are broadcast packets, when submitting an online request. The DHCP relay then forwards the Offer packets sent by the DHCP server. Whether the Offer packets are unicast or broadcast depends on the broadcast flag in the Discover packets.The DHCP client sends Request packets, which are also broadcast packets, upon receipt of Offer packets. The DHCP relay then forwards the Ack or Nak packets sent as a reply by the DHCP server.In the case of Ack packets, the DHCP relay determines whether to broadcast or unicast packets to the DHCP client based on the broadcast flag in the Request packets.In the case of Nak packets, the DHCP relay replies with broadcast packets to the DHCP client.\nIf the DHCP client does not receive a response to a lease extension request until 87.5% of the lease time goes by, the DHCP server is considered useless, and the DHCP client broadcasts Request packets. The DHCP relay then forwards the Ack or Nak packets sent as a reply by the DHCP server.In the case of Ack packets, the DHCP relay determines whether to broadcast or unicast packets based on the broadcast flag in the Request packets.In the case of Nak packets, the DHCP relay replies with broadcast packets to the DHCP client.\n\nIn any of the preceding situations, if the dhcp relay reply broadcast-always command has been run on the DHCP relay, the DHCP relay ignores the broadcast flag in client requests and simply broadcasts packets."
}