{
    "PageTitle": "whitelist session-car dhcp",
    "FuncDef": "The whitelist session-car dhcp command configures bandwidth parameters for CAR for whitelisted DHCP sessions.\nThe undo whitelist session-car dhcp command restores the default bandwidth parameter values for CAR for whitelisted DHCP sessions.\nThe default CIR, CBS, PIR, and PBS of CAR for whitelisted DHCP sessions are 512 kbit/s, 64000 bytes, 1200 kbit/s, and 150000 bytes, respectively.",
    "CLIs": [
        "whitelist session-car dhcp { cir <cir-value> | cbs <cbs-value> | pir <pir-value> | pbs <pbs-value> } *",
        "undo whitelist session-car dhcp [ { cir <cir-value> | cbs <cbs-value> | pir <pir-value> | pbs <pbs-value> } * ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "cir cir-value",
            "Info": "Specifies a committed information rate (CIR), that is, the average rate at which packets can be transmitted or forwarded.\nThe value is an integer ranging from 0 to 1000000, in kbit/s. The default value is 512."
        },
        {
            "Parameters": "cbs cbs-value",
            "Info": "Specifies a committed burst size (CBS), that is, the committed burst traffic that can instantaneously pass through.\nThe value is an integer ranging from 0 to 9000000, in bytes. The default value is 64000."
        },
        {
            "Parameters": "pir pir-value",
            "Info": "Specifies a peak information rate (PIR), that is, the highest rate at which packets can be transmitted or forwarded.\nThe value is an integer ranging from 0 to 1000000, in kbit/s. The default value is 1200. It is recommended that pir-value be greater than or equal to cir-value."
        },
        {
            "Parameters": "pbs pbs-value",
            "Info": "Specifies a peak burst size (PBS), that is, the peak burst traffic that can instantaneously pass through.\nThe value is an integer ranging from 0 to 9000000, in bytes. The default value is 150000. It is recommended that pbs-value be greater than or equal to cbs-value."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] whitelist session-car dhcp cir 100 cbs 200 pir 300 pbs 400"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a device receives a large number of DHCP packets from different DHCP servers, you can run the whitelist session-car dhcp command to modify bandwidth parameters for the packets. This ensures that DHCP packets can be sent to the CPU properly.\nPrecautions\nIn normal cases, adjusting this parameter is not recommended. Use the default value for this parameter instead."
}