{
    "PageTitle": "dhcp option82 format (interface view)",
    "FuncDef": "The dhcp option82 format command configures the format of Option 82 in DHCP packets.\nThe undo dhcp option82 format command restores the default format of Option 82 in DHCP packets.\nBy default, Option 82 in DHCP packets is in the type1 format.",
    "CLIs": [
        "dhcp option82 format { self-define <extendText> | type1 | type2 | cn-telecom }",
        "undo dhcp option82 format"
    ],
    "ParentView": [
        "50GE Layer 2 sub-interface view",
        "40GE interface view",
        "Eth-Trunk Layer 2 sub-interface view",
        "GE Layer 2 sub-interface view",
        "GE electrical interface view",
        "Port extension interface view",
        "400GE interface view",
        "10GE interface view",
        "MP-group interface view",
        "Layer 2 sub-interface view",
        "VE sub-interface view",
        "GE interface view",
        "100GE interface view",
        "Global VE sub-interface view",
        "Sub-interface view",
        "50GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Eth-Trunk interface view",
        "400GE Layer 2 sub-interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "self-define extendText",
            "Info": "Specifies a user-defined DHCP Option 82 format.\nThe value is a string of 1 to 255 case-insensitive characters that can contain letters, numbers, and special characters."
        },
        {
            "Parameters": "type1",
            "Info": "Indicates the Telecom format of Option 82.\nCID format: interface name:outer VLAN ID.inner VLAN ID system name/0/0/0/0/0, in ASCII encapsulation mode.\n-"
        },
        {
            "Parameters": "type2",
            "Info": "Indicates the NMS format of Option 82.\nCID format: interface name:outer VLAN ID.inner VLAN ID system name, in ASCII encapsulation mode.\n-"
        },
        {
            "Parameters": "cn-telecom",
            "Info": "Indicates the Option 82 format defined by China Telecom.\nCID format: interface name:outer VLAN ID.inner VLAN ID /0/0/0/0/0/0, in ASCII encapsulation mode.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dhcp enable",
            "[~HUAWEI] interface GigabitEthernet 1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] dhcp option82 insert enable",
            "[*HUAWEI-GigabitEthernet1/0/1] dhcp option82 format type1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dhcp enable",
            "[~HUAWEI] interface GigabitEthernet 1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] dhcp option82 insert enable",
            "[*HUAWEI-GigabitEthernet1/0/1] dhcp option82 format self-define testCase"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe option 82 contains the location information of DHCP clients, such as information about login interface, VLAN, and address. After the option 82 field is configured, the device can set up dynamic binding entries with accurate interface information. Based on the option 82 field, the DHCP server assigns IP addresses and policies for DHCP clients.\nAfter a user-defined Option 82 format is configured, the device encapsulates the user-defined Option 82 format into packets.\nPrerequisites\nPerform the following operations before running the command:\n Globally enable DHCP using the dhcp enable command. Enable the Option 82 inserting function as required.\nRun the dhcp option82 insert enable (interface view) command to enable a device to insert Option 82 into DHCP packets. If no Option 82 field exists in a received DHCP packet, the device inserts the Option 82 field into the packet. If the Option 82 field exists in a received DHCP packet, the device checks whether the Option 82 field contains sub-options. If the Option 82 field contains sub-options, the device does not change the sub-options. If the Option 82 field does not contain sub-options and the sub-option format is configured, the device inserts sub-options into the Option 82 field.Run the dhcp option82 rebuild enable (interface view) command to enable a device to forcibly insert Option 82 into DHCP packets. If no Option 82 field exists in a received DHCP packet, the device inserts the Option 82 field into the packet. If the Option 82 field exists in a DHCP packet, the device deletes the Option 82 field and inserts a new Option 82 field into the packet."
}