{
    "PageTitle": "dhcp option82 vendor-specific insert enable",
    "FuncDef": "The dhcp option82 vendor-specific insert enable command enables a DHCP relay-enabled gateway to insert the Vendor-Specific suboption (suboption 9) of Option 82 into a DHCP packet.\nThe undo dhcp option82 vendor-specific insert enable command disables a DHCP relay-enabled gateway from inserting the Vendor-Specific suboption (suboption 9) of Option 82 into a DHCP packet.\nBy default, the Vendor-Specific suboption (suboption 9) of Option 82 is not inserted into a DHCP packet.",
    "CLIs": [
        "dhcp option82 vendor-specific insert enable",
        "undo dhcp option82 vendor-specific insert enable"
    ],
    "ParentView": [
        "Global VE sub-interface view",
        "VBDIF interface view",
        "VE sub-interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bridge-domain 10",
            "[*HUAWEI-bd10] quit",
            "[*HUAWEI] interface vbdif 10",
            "[*HUAWEI-Vbdif10] dhcp option82 vendor-specific insert enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn EVPN active-active scenarios, DHCP users obtain IP addresses from DHCP servers in different subnets through DHCP relay-enabled gateways. Users in a subnet use the same gateway address. If the gateway address is carried as the destination IP address in a response packet from the DHCP server, the packet may not be sent to the gateway of the user. As a result, the user fails to go online. To resolve this problem, run the dhcp option82 vendor-specific insert enable command to enable a DHCP relay-enabled gateway to insert the Vendor-Specific suboption (suboption 9) of Option 82 into a DHCP packet. Then, run the dhcp option82 vendor-specific format command to configure a format for the Option 82 suboption 9 and encapsulate the IP address that uniquely identifies the gateway location into a DHCP request packet to be sent to the DHCP server. The DHCP server that supports the Option 82 reserves this suboption in the response packet. If the response packet is sent to a wrong gateway, the DHCP relay-enabled gateway forwards the packet to the correct gateway based on the IP address carried in the suboption 9.\nFollow-up Procedure\nRun the dhcp option82 vendor-specific format command to configure a format for the Option 82 suboption 9."
}