{
    "PageTitle": "display dhcp option82",
    "FuncDef": "The display dhcp option82 command displays the configuration of option 82 insertion.",
    "CLIs": [
        "display dhcp option82 { interface { <interface-type> <interface-number> | <interface-name> } | vlan <vlan-id> interface { <interface-type> <interface-number> | <interface-name> } | bridge-domain <bd-id> }"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "interface interface-type interface-number",
            "Info": "Specifies the type and number of an interface.\n-"
        },
        {
            "Parameters": "vlan vlan-id",
            "Info": "Specifies a VLAN ID.\nThe value is an integer ranging from 1 to 4094."
        },
        {
            "Parameters": "bridge-domain bd-id",
            "Info": "Specifies the BD ID.\nThe value is an integer ranging from 1 to 16777215."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display dhcp option82 configuration interface Gigabitethernet 1/0/0",
            "#",
            "interface Gigabitethernet1/0/0",
            " dhcp option82 insert enable",
            "#"
        ],
        [
            "<HUAWEI> display dhcp option82 configuration bridge-domain 10",
            "#",
            "bridge-domain 10",
            " dhcp option82 rebuild enable",
            "#"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe Option field in a DHCP packet carries control information and parameters that are not defined in certain common protocols. The Option field consists of the Code, Length, and Value fields. The Option 82 field is an Option field with the Code value 82.\nThe Option 82 field contains the location information of DHCP hosts, such as information about login interface, VLAN, and address. The Option 82 field helps create DHCP snooping binding entries with accurate interface information. Based on the Option 82 field, the DHCP server assigns IP addresses and policies for DHCP clients. For example, the DHCP server assigns IP addresses in a network segment for the clients that log in from GE 1/0/1. The DHCP server assigns IP addresses in another network segment for the clients that log in from GE 1/0/2.\nIf you want to check the configuration of option 82 insertion, run the display dhcp option82 command."
}