{
    "PageTitle": "acl ip-pool",
    "FuncDef": "The acl ip-pool command creates an ACL IP address pool and displays the ACL address pool view.\nThe undo acl ip-pool command deletes an ACL IP address pool.\nBy default, no ACL IP address pool is configured.",
    "CLIs": [
        "acl ip-pool <pool-name>",
        "undo acl ip-pool <pool-name>",
        "undo acl ip-pool"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "pool-name",
            "Info": "Specifies the name of an ACL IP address pool.\nThe value is a string of 1 to 32 case-sensitive characters, spaces not supported. The name can be a combination of letters, numbers, symbols dot (.), and underline (_)."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl ip-pool test"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn typical ACL usage scenarios, for example, in the policy-based routing scenario, both the source and destination IP addresses need to be matched. To implement policy-based routing using ACL rules to match both source and destination IP addresses carried in packets, specify all possible combinations of source and destination IP addresses when configuring ACL rules. However, these combinations are over 10 thousands on a large-scale network. It is unreasonable to manually configure all ACL rules that match both source and destination IP addresses carried in packets.\nTo reduce the configuration workload, run the acl ip-pool command to create an ACL IP address pool. You only need to configure an ACL rule with a specified IP address pool name (pool-name) to match multiple IP addresses carried in packets. In scenarios in which ACL rules are used to match both source and destination IP addresses carried in packets, run the acl ip-pool command to create an ACL source IP address pool (which includes all needed source IP addresses) and an ACL destination IP address pool (which includes all needed destination IP addresses), respectively.\nFollow-up Procedure\nRun the ip address command to add an IP address to an ACL IP address pool.\nPrecautions\nThe device can only create an advanced ACL IP address pool."
}