{
    "PageTitle": "acl name (interface ACL)",
    "FuncDef": "The acl name command creates an interface ACL and displays the ACL view. If the interface ACL already exists, this command directly displays the ACL view.\nThe undo acl name command deletes a created interface ACL.\nBy default, no interface ACL is created.",
    "CLIs": [
        "acl name <interface-based-acl-name> interface [ match-order { config | auto } ]",
        "acl name <interface-based-acl-name> [ interface ] number <interface-based-acl-number> [ match-order { config | auto } ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "interface-based-acl-name",
            "Info": "Creates an interface ACL with a name.\nThe value is a string of 1 to 64 case-sensitive characters, spaces not supported. The name must start with a letter or digit, and cannot contain only digits."
        },
        {
            "Parameters": "interface",
            "Info": "Creates an interface ACL with a keyword.\n-"
        },
        {
            "Parameters": "match-order",
            "Info": "Indicates the order in which interface ACL rules are matched.\n-"
        },
        {
            "Parameters": "config",
            "Info": "Indicates the configuration order, meaning that ACL rules are matched in the order they are configured.This mechanism applies only when rule numbers are not specified. If rule numbers are specified, the ACL rules are matched based on the numbers in ascending order.\n-"
        },
        {
            "Parameters": "auto",
            "Info": "Indicates the automatic order, meaning that ACL rules are matched based on the depth-first principle.\nThe depth-first principle matches ACL rules based on how precise the rules are. The more matching criteria an ACL rule contains, the more precise the rule is.If two rules have the same precision, they are matched in the order they are configured.\n-"
        },
        {
            "Parameters": "number interface-based-acl-number",
            "Info": "Creates an interface ACL with a number.\nThe value is an integer ranging from 1000 to 1999."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl name interface-based-acl interface"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAn interface ACL defines rules for filtering packets based on the inbound interfaces of packets. To create an interface ACL, run the acl command.\nConfiguration Impact\nThe undo acl all command deletes all types of ACLs on a device. If the ACLs being deleted are applied to services, these services are interrupted. Before deleting an ACL, ensure that the ACL is not referenced by services.\nFollow-up Procedure\nRun the rule command to configure a rule for a created interface ACL. Then the ACL rule can be applied to match packets.\nRun the description command to configure a description for a created interface ACL. The description can contain the functions of the interface ACL, facilitating applications."
}