{
    "PageTitle": "acl name (MPLS-based ACL)",
    "FuncDef": "The acl name command creates an MPLS-based ACL and displays the ACL view. If the MPLS-based ACL already exists, this command directly displays the ACL view.\nThe undo acl name command deletes a created MPLS-based ACL.\nBy default, no MPLS-based ACL is created.",
    "CLIs": [
        "acl name <mpls-acl-name> mpls",
        "acl name <mpls-acl-name> [ mpls ] number <mpls-acl-number>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "mpls-acl-name",
            "Info": "Creates an MPLS-based ACL with a name.\nThe value is a string of 1 to 64 case-sensitive characters, spaces not supported. The name must start with a letter or digit, and cannot contain only digits."
        },
        {
            "Parameters": "mpls",
            "Info": "Creates an MPLS-based ACL with a keyword.\n-"
        },
        {
            "Parameters": "number mpls-acl-number",
            "Info": "Creates an MPLS-based ACL with a number.\nThe value is an integer ranging from 10000 to 10999."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl name mpls-acl mpls"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAn MPLS-based ACL defines rules for filtering packets based on the EXP, label, and TTL values of MPLS packets. To create an MPLS-based ACL, run the acl\nConfiguration Impact\nThe undo acl all command deletes all types of ACLs on a device. If the ACLs being deleted are applied to services, these services are interrupted. Before deleting an ACL, ensure that the ACL is not referenced by services.\nFollow-up Procedure\nRun the rule command to configure a rule for a created MPLS-based ACL. Then the ACL rule can be applied to match packets.\nRun the description command to configure a description for a created MPLS-based ACL. The description can contain the functions of the MPLS-based ACL, facilitating applications."
}