{
    "PageTitle": "acl number",
    "FuncDef": "The acl number command creates an ACL and displays the ACL view. If an ACL already exists, this command directly displays the ACL view.\nThe undo acl number command deletes a created ACL.\nBy default, no ACL has been created.",
    "CLIs": [
        "acl [ number ] <basic-acl-number> [ match-order { config | auto } ]",
        "acl [ number ] <interface-based-acl-number> [ match-order { config | auto } ]",
        "acl [ number ] <advance-acl-number> [ match-order { config | auto } ]",
        "acl [ number ] <link-acl-number> [ match-order { config | auto } ]",
        "acl [ number ] <mpls-acl-number>",
        "acl [ number ] <ucl-acl-number> [ match-order { auto | config } ]",
        "undo acl [ number ] <basic-acl-number>",
        "undo acl [ number ] <interface-based-acl-number>",
        "undo acl [ number ] <advance-acl-number>",
        "undo acl [ number ] <link-acl-number>",
        "undo acl [ number ] <mpls-acl-number>",
        "undo acl all",
        "undo acl [ number ] <ucl-acl-number>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "basic-acl-number",
            "Info": "Creates a basic ACL with a number.\nThe value is an integer ranging from 2000 to 2999."
        },
        {
            "Parameters": "match-order",
            "Info": "Indicates the order in which ACL rules are matched.\n-"
        },
        {
            "Parameters": "config",
            "Info": "Indicates the configuration order, meaning that ACL rules are matched in the order they are configured.This mechanism applies only when rule numbers are not specified. If rule numbers are specified, the ACL rules are matched based on the numbers in ascending order.\n-"
        },
        {
            "Parameters": "auto",
            "Info": "Indicates the automatic order, meaning that ACL rules are matched based on the depth-first principle.The depth-first principle matches ACL rules based on how precise the rules are.The more matching criteria an ACL rule contains, the more precise the rule is.If two rules have the same precision, they are matched in the order they are configured.\n-"
        },
        {
            "Parameters": "interface-based-acl-number",
            "Info": "Creates an interface ACL with a number.\nThe value is an integer ranging from 1000 to 1999."
        },
        {
            "Parameters": "advance-acl-number",
            "Info": "Creates an advanced ACL with a number.\nThe value is an integer ranging from 3000 to 3999."
        },
        {
            "Parameters": "link-acl-number",
            "Info": "Creates a Layer 2 ACL with a number.\nThe value is an integer ranging from 4000 to 4999."
        },
        {
            "Parameters": "mpls-acl-number",
            "Info": "Creates an MPLS-based ACL with a number.\nThe value is an integer ranging from 10000 to 10999."
        },
        {
            "Parameters": "ucl-acl-number",
            "Info": "Creates a user ACL with a number.\nThe value is an integer ranging from 6000 to 9999."
        },
        {
            "Parameters": "all",
            "Info": "All the ACLs.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl number 1999"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl number 2999"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl number 3999"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl number 4999"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl number 6999"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl number 10999"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAn interface ACL defines rules for filtering packets based on the inbound interfaces of packets. To create an interface ACL, run the acl command.\nAdvanced ACLs match packets based on the source IP address, destination IP address, IP protocol type, and protocol-specific configurations (for example, source and destination TCP ports and ICMP protocol type and code) of the packets. To create an advanced ACL, run the acl command.\nA Layer 2 ACL defines rules for filtering packets based on Layer 2 information, such as the source MAC addresses, destination MAC addresses, and Layer 2 protocol types of packets. To create a Layer 2 ACL, run the acl command.\nPackets can be matched based on the source/destination IP address, source/destination service group, source/destination user group, source/destination port number, and protocol type. To create a user ACL, run the acl command.\nAn MPLS-based ACL defines rules for filtering packets based on the EXP, label, and TTL values of MPLS packets. To create an MPLS-based ACL, run the acl\nConfiguration Impact\nThe undo acl all command deletes all types of ACLs on a device. If the ACLs being deleted are applied to services, these services are interrupted. Before deleting an ACL, ensure that the ACL is not referenced by services.\nFollow-up Procedure\nRun the rule command to configure a rule for a created ACL. Then the ACL rule can be applied to match packets.\nRun the description command to configure a description for a created user ACL. The description can contain the functions of the user ACL, facilitating applications."
}