{
    "PageTitle": "display acl",
    "FuncDef": "The display acl command displays information about rules of a specified or all ACLs and packet matching statistics.",
    "CLIs": [
        "display acl { name <acl-name> | all }",
        "display acl <basic-acl-number>",
        "display acl <advance-acl-number>",
        "display acl <interface-based-acl-number>",
        "display acl <ucl-acl-number>",
        "display acl <mpls-acl-number>",
        "display acl <numberLink>"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "name acl-name",
            "Info": "Specifies the name of an ACL.\nThe value is a string of 1 to 64 case-sensitive characters, spaces not supported. The name must start with a letter or digit, and cannot contain only digits."
        },
        {
            "Parameters": "all",
            "Info": "Displays information about all ACLs.\n-"
        },
        {
            "Parameters": "basic-acl-number",
            "Info": "Specifies the number of an ACL.\nThe value is an integer ranging from 2000 to 2999, the number of a basic ACL ranges from 2000 to 2999."
        },
        {
            "Parameters": "advance-acl-number",
            "Info": "Specifies the number of an ACL.\nThe value is an integer ranging from 3000 to 3999, the number of an advanced ACL ranges from 3000 to 3999."
        },
        {
            "Parameters": "interface-based-acl-number",
            "Info": "Specifies the number of an ACL.\nThe value is an integer ranging from 1000 to 1999, the number of an interface ACL ranges from 1000 to 1999."
        },
        {
            "Parameters": "ucl-acl-number",
            "Info": "Specifies the number of an ACL.\nThe value is an integer ranging from 6000 to 9999, the number of a user ACL ranges from 6000 to 9999."
        },
        {
            "Parameters": "mpls-acl-number",
            "Info": "Specifies the number of an ACL.\nThe value is an integer ranging from 10000 to 10999, the number of an MPLS-based ACL ranges from 10000 to 10999."
        },
        {
            "Parameters": "numberLink",
            "Info": "Specifies the number of an ACL.\nThe value is an integer ranging from 4000 to 4999, the number of a Layer 2 ACL ranges from 4000 to 4999."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display acl 2001",
            "Basic ACL 2001, 2 rules, match-order is auto ",
            "ACL's step is 5",
            " rule 5 permit source 10.1.1.1 0 (2 times matched)",
            " rule 10 permit source 10.2.1.1 0 (3 times matched)"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nYou can run the display acl command for the following purposes:\nTo check details about a configured ACL.To check whether an ACL is deleted using the undo acl command.To check whether an ACL is referenced by a service and packet matching statistics.\n\nPrecautions\nBefore collecting ACL statistics in a certain period, run the reset acl counter command to clear historical statistics.\nRules of an ACL are displayed by rule number.\nThis command displays packet matching statistics of control packets that have been processed by the CPU, but not packet matching statistics of forwarded packets."
}