{
    "PageTitle": "reset acl counter",
    "FuncDef": "The reset acl counter command clears statistics about a specified or all ACLs.",
    "CLIs": [
        "reset acl counter all",
        "reset acl counter name <acl-name>",
        "reset acl counter <basic-acl-number>",
        "reset acl counter <interface-based-acl-number>",
        "reset acl counter <advance-acl-number>",
        "reset acl counter <mpls-acl-number>",
        "reset acl counter <numberLink>"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "name acl-name",
            "Info": "Specifies the name of an ACL.\nThe value is a string of 1 to 64 case-sensitive characters, spaces not supported. The name must start with a letter or digit, and cannot contain only digits."
        },
        {
            "Parameters": "basic-acl-number",
            "Info": "Specifies the number of an ACL.\nThe value is an integer ranging from 2000 to 2999, the number of a basic ACL ranges from 2000 to 2999."
        },
        {
            "Parameters": "interface-based-acl-number",
            "Info": "Specifies the number of an ACL.\nThe value is an integer ranging from 1000 to 1999, the number of an interface ACL ranges from 1000 to 1999."
        },
        {
            "Parameters": "advance-acl-number",
            "Info": "Specifies the number of an ACL.\nThe value is an integer ranging from 3000 to 3999, the number of an advanced ACL ranges from 3000 to 3999."
        },
        {
            "Parameters": "mpls-acl-number",
            "Info": "Specifies the number of an ACL.\nThe value is an integer ranging from 10000 to 10999, the number of an MPLS-based ACL ranges from 10000 to 10999."
        },
        {
            "Parameters": "numberLink",
            "Info": "Specifies the number of an ACL.\nThe value is an integer ranging from 4000 to 4999, the number of a Layer 2 ACL ranges from 4000 to 4999."
        },
        {
            "Parameters": "all",
            "Info": "Clears statistics about all ACLs.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset acl counter 2001"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo clear statistics about a specified or all ACLs, run the reset acl counter command. Before collecting ACL statistics in a specified period, run this command to clear the original statistics.\nConfiguration Impact\nNo message is displayed when statistics about ACLs are cleared using the reset acl counter command. Exercise caution when running this command.\nFollow-up Procedure\nRun the display acl command to check the current rule information and packet matching statistics about ACLs."
}