{
    "PageTitle": "undo rule (Interface-based ACL view)",
    "FuncDef": "The undo rule command deletes an ACL rule in the interface ACL view.\nBy default, no interface ACL rule is created.",
    "CLIs": [
        "undo rule <rule-id> [ to <to-rule-id> ]"
    ],
    "ParentView": [
        "Interface-based ACL view"
    ],
    "ParaDef": [
        {
            "Parameters": "rule-id",
            "Info": "Specifies the ID of an ACL rule.\nThe value is an integer ranging from 0 to 4294967294."
        },
        {
            "Parameters": "to to-rule-id",
            "Info": "Specifies an end rule ID for user-defined ACL rules to be deleted in batches.to-rule-id must be greater than rule-id.\nThe value is an integer ranging from 0 to 4294967294."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl number 1999",
            "[*HUAWEI-acl-if-1999] rule 1 deny interface GigabitEthernet1/0/0",
            "[*HUAWEI-acl-if-1999] commit",
            "[~HUAWEI-acl-if-1999] undo rule 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo delete an ACL rule in the interface ACL view, run the undo rule command.\nPrerequisites\nAn interface ACL has been created using the acl command in the system view.\nA time range has been configured using the time-range command in the system view if you want to specify a validity period when creating an interface ACL rule.\nConfiguration Impact\nWhen specifying an ACL rule ID, note the following:\nIf a rule with a specified rule ID already exists, and the new rule conflicts with the existing one, the conflicting part in the new rule overwrites that in the existing rule.If no rule with the specified rule ID exists, a rule with the specified rule ID is created.\nWhen an ACL rule ID is not specified and a rule is added, the system automatically allocates an ID to this rule. ACL rules are arranged in ascending order of rule IDs, with the difference between two adjacent rules as an ACL increment.\nThe rule IDs automatically generated by the system start from the ACL increment. For example, if the ACL increment is 5, the rule ID starts from 5; if the ACL increment is 2, the rule ID starts from 2. This allows you to add rules before the first rule.\n\nPrecautions\nIf auto is configured when you run the acl command to create an ACL, you cannot specify a rule ID when creating a rule. The system automatically uses the ACL increment as the start rule ID, and the subsequent rules are numbered by an ACL increment in ascending order.\nIf rule-id is not specified when you run the rule command to create an ACL, the system automatically assigns an ID to the ACL rule. You can run the display acl command to check the rule ID automatically assigned to an ACL.\nIf name rule-name is not specified when you run the rule command to create an ACL, the system automatically generates a name for the ACL in the format of \"rule\"+\"_\"+rule ID. Rule ID is the ID of an ACL rule that can be specified using the rule-id parameter or automatically assigned by the system. You can check the automatically generated name of an ACL rule through the NMS.\nYou must specify the rule ID when deleting a rule. To check rule IDs, run the display acl command.\nBefore deleting an ACL rule, run the display acl command to check whether the ACL rule has been applied to other services. Delete the rule only when it is not applied to other services."
}