{
    "PageTitle": "e-trunk (Eth-Trunk interface view)",
    "FuncDef": "The e-trunk command adds an Eth-Trunk interface to a specified E-Trunk.\nThe undo e-trunk command removes an Eth-Trunk interface from an E-Trunk.\nBy default, an E-Trunk does not have any Eth-Trunk interfaces.",
    "CLIs": [
        "e-trunk <e-trunk-id> [ remote-eth-trunk <eth-trunk-id> ]",
        "undo e-trunk"
    ],
    "ParentView": [
        "Eth-Trunk interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "remote-eth-trunk eth-trunk-id",
            "Info": "Specifies the ID of the remote Eth-Trunk interface.\nIf you want to add Eth-Trunk interfaces with different IDs on two devices to the same E-Trunk, you must specify remote Eth-Trunk IDs for the E-Trunk to work properly.\nThe value is an integer ranging from 0 to 4294967295."
        },
        {
            "Parameters": "e-trunk e-trunk-id",
            "Info": "Specifies an E-Trunk ID and ID range is customized by product.\nThe value is an integer ranging from 1 to 128."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] e-trunk 3",
            "[*HUAWEI-e-trunk-3] quit",
            "[*HUAWEI] interface Eth-Trunk 30",
            "[*HUAWEI-Eth-Trunk30] mode manual load-balance",
            "[*HUAWEI-Eth-Trunk30] e-trunk 3"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] e-trunk 4",
            "[*HUAWEI-e-trunk-4] quit",
            "[*HUAWEI] interface Eth-Trunk 40",
            "[*HUAWEI-Eth-Trunk40] mode lacp-static",
            "[*HUAWEI-Eth-Trunk40] e-trunk 4"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter an E-Trunk is created, run the e-trunk command in the Eth-Trunk interface view to add an Eth-Trunk interface to the E-Trunk so that the E-Trunk takes effect.\nPrecautions\nOnly Eth-Trunk interfaces in manual load balancing mode and static Link Aggregation Control Protocol (LACP) mode can be added to an E-Trunk.\nIn an interface extension scenario, if an existing extension interface has been added to an Eth-Trunk interface, the e-trunk command fails to be run in the Eth-Trunk interface view. To run this command in the interface view, delete the extension interface from the Eth-Trunk interface first."
}