{
    "PageTitle": "e-trunk (Global VE interface view)",
    "FuncDef": "The e-trunk command adds a global VE interface to an E-Trunk.\nThe undo e-trunk command removes a global VE interface from an E-Trunk.\nBy default, no global VE interface is added to any E-Trunk.",
    "CLIs": [
        "e-trunk <e-trunk-id> [ remote-global-ve <global-ve-id> ]",
        "undo e-trunk"
    ],
    "ParentView": [
        "Global VE interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "remote-global-ve global-ve-id",
            "Info": "Specifies the ID of a remote global VE interface.If you want to add global VE interfaces with different IDs on two devices to the same E-Trunk, you must specify remote global VE interface IDs for the E-Trunk to work properly.\nThe value is an integer ranging from 0 to 4294967295."
        },
        {
            "Parameters": "e-trunk e-trunk-id",
            "Info": "Specifies an E-Trunk ID and ID range is customized by product.\nThe value is an integer ranging from 1 to 128."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] e-trunk 1",
            "[*HUAWEI-e-trunk-1] quit",
            "[*HUAWEI] interface Global-VE 11",
            "[*HUAWEI-Global-VE11] ve-group 2 l2-terminate",
            "[*HUAWEI-Global-VE11] e-trunk 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo add a global VE or Eth-Trunk interface to an E-Trunk to forward packets, run the e-trunk command in the global VE or Eth-Trunk view.\nTo add an Eth-Trunk interface to an E-Trunk, run the e-trunk (Eth-Trunk view) command.\nAdding a global VE interface to an E-Trunk applies to the scenario where an L2VPN accesses a L3VPN over primary and secondary PWs.\nPrerequisites\nAn E-Trunk has been created using the e-trunk e-trunk-id command in the system view.A global VE interface has been created using the interface global-ve ve-number command in the system view.An L2VE interface has been created using the ve-group ve-group-id l2-terminate command in the global VE interface view.\n\nPrecautions\nA global VE interface can be added only to one E-Trunk. A global VE interface must be removed from an E-Trunk before it is added to another one, and an E-Trunk can have only one member global VE interface.\nAfter the undo e-trunk command is run, all Eth-Trunk interfaces are removed from an E-Trunk, and the function is disabled."
}