{
    "PageTitle": "display trunkfwdtbl eth-trunk",
    "FuncDef": "The display trunkfwdtbl eth-trunk command displays information about an Eth-Trunk forwarding table.",
    "CLIs": [
        "display trunkfwdtbl eth-trunk <trunk-id> [ slot <slot-id> ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "trunk-id",
            "Info": "Displays information about a forwarding table of a specified Eth-Trunk interface.\nThe value is a string of 0 to 65535 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "slot slot-id",
            "Info": "Specifies the slot ID of an Eth-Trunk interface whose forwarding table is displayed.\nIn VS mode, this parameter is supported only by the admin VS.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display trunkfwdtbl eth-trunk 1",
            " Eth-Trunk1's forwarding table is:",
            "  MASTER                        SLAVE",
            "GigabitEthernet1/0/1          GigabitEthernet1/0/2",
            "GigabitEthernet1/0/2          GigabitEthernet1/0/1",
            "GigabitEthernet1/0/1          GigabitEthernet1/0/2",
            "GigabitEthernet1/0/1          GigabitEthernet1/0/2",
            "GigabitEthernet1/0/2          GigabitEthernet1/0/1",
            "GigabitEthernet1/0/1          GigabitEthernet1/0/2",
            "GigabitEthernet1/0/1          GigabitEthernet1/0/2",
            "GigabitEthernet1/0/2          GigabitEthernet1/0/1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter an Eth-Trunk interface is configured, you can run the display trunkfwdtbl eth-trunk command to view information about the Eth-Trunk forwarding table.\nThe Eth-Trunk forwarding table shows the forwarding status of the Eth-Trunk interface. The forwarding table is divided into two columns:\nMASTER: master member interfacesSLAVE: backup member interfacesIf no backup interfaces are configured but there are other Up Eth-Trunk member interfaces, these member interfaces are used as backup interfaces shown in the SLAVE column.If no backup interfaces are configured and no other Eth-Trunk member interfaces are Up, interfaces displayed in SLAVE column are the same as those displayed in MASTER column, that is, interfaces back up themselves.\n\nPrerequisites\nAn Eth-Trunk interface has been created.\nPrecautions\nA maximum of 64 physical interfaces can be added to the same Eth-Trunk interface. In this case, the forwarding table contains 64 forwarding entries."
}