{
    "PageTitle": "inactive-port shutdown enable",
    "FuncDef": "The inactive-port shutdown enable command forcibly sets the backup member interface in an Eth-Trunk interface in manual 1:1 master/backup mode to the Down state.\nThe undo inactive-port shutdown enable command restores the default configuration.\nBy default, the backup member interface in an Eth-Trunk interface in manual 1:1 master/backup mode is not forcibly set to the Down state.",
    "CLIs": [
        "inactive-port shutdown enable",
        "undo inactive-port shutdown enable"
    ],
    "ParentView": [
        "Eth-Trunk interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface eth-trunk 10",
            "[*HUAWEI-Eth-Trunk10] portswitch",
            "[*HUAWEI-Eth-Trunk10] mode manual backup",
            "[*HUAWEI-Eth-Trunk10] inactive-port shutdown enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo allow a Huawei device to communicate with a non-Huawei device that uses master and backup interfaces (both in the Up state), configure an Eth-Trunk interface in manual 1:1 master/backup mode on the Huawei device.\nHowever, communication may fail because the network administrator cannot identify the master and backup interfaces on the non-Huawei device during network planning or maintenance and therefore cannot correctly specify the master and backup interfaces when configuring the Eth-Trunk interface in manual 1:1 master/backup mode. To address this problem, run the inactive-port shutdown enable command on the Huawei device to forcibly set the backup member interface in the Eth-Trunk interface in manual 1:1 master/backup mode to the Down state. This configuration allows the non-Huawei device to communicate with the Huawei device both through the master interfaces, ensuring communication.\nPrerequisites\nAn Eth-Trunk interface has been configured to work in manual 1:1 master/backup mode using the mode manual backup command.\nConfiguration Impact\nAfter the inactive-port shutdown enable command is run, if the master member interface for forwarding traffic fails, the system automatically disables the forcible Down state of the backup member interface and restores the backup member interface to the Up state so that it can communicate with the non-Huawei device."
}