{
    "PageTitle": "lacp force-up",
    "FuncDef": "The lacp force-up command forcibly configures an interface to stay in the force-up state.\nThe undo lacp force-up command cancels the force-up state configured for an interface.\nBy default, an interface does not have the force-up state configured.",
    "CLIs": [
        "lacp force-up",
        "undo lacp force-up"
    ],
    "ParentView": [
        "Layer 2 40GE interface view",
        "40GE interface view",
        "GE interface view",
        "Layer 2 50GE interface view",
        "100GE interface view",
        "GE electrical interface view",
        "Layer 2 10GE interface view",
        "50GE interface view",
        "Layer 2 GE interface view",
        "400GE interface view",
        "10GE interface view",
        "GE optical interface view",
        "Layer 2 100GE interface view",
        "25GE interface view",
        "Layer 2 50|100GE interface view",
        "25GE-L2 view",
        "400GE-L2 view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface eth-trunk 1",
            "[*HUAWEI-Eth-Trunk1] mode lacp-static",
            "[*HUAWEI-Eth-Trunk1] quit",
            "[*HUAWEI] interface GigabitEthernet 1/0/1",
            "[*HUAWEI-GigabitEthernet1/0/1] eth-trunk 1",
            "[*HUAWEI-GigabitEthernet1/0/1] lacp force-up"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn a scenario where a device directly connects to a server through an interface that has been added as a member of an Eth-Trunk interface in static LACP mode, if the server restarts or goes online and the Eth-Trunk member interface does not receive any LACPDU within the specified timeout period, the interface goes down. To enable the interface to continue to forward service traffic, run the lacp force-up command to forcibly set the interface state to force-up.\nPrecautions\nThe lacp force-up command is used when a Huawei device interconnects to a server.\nAfter this lacp force-up command is run, the force-up state takes effect only when all the member interfaces of the Eth-Trunk interface in static LACP mode time out in receipt of LACPDUs.\nWhen all the Eth-Trunk member interfaces' force-up state takes effect, the minimum number of active member links configured using the least active-linknumber link-number command still takes effect, but the maximum number of active member links configured using the max active-linknumber link-number command stops taking effect."
}