{
    "PageTitle": "peer-address source-address",
    "FuncDef": "The peer-address source-address command configures the peer and local IP addresses of an E-Trunk.\nThe undo peer-address source-address command deletes the peer and local IP addresses of an E-Trunk.\nBy default, no peer or local IP address of an E-Trunk is configured.",
    "CLIs": [
        "peer-address <peer-ip-address> source-address <source-ip-address> [ vpn-instance <vpn-instance-name> ]",
        "undo peer-address"
    ],
    "ParentView": [
        "E-Trunk view"
    ],
    "ParaDef": [
        {
            "Parameters": "peer-ip-address",
            "Info": "Specifies the peer IP address.\nThe value is in the dotted decimal format."
        },
        {
            "Parameters": "source-ip-address",
            "Info": "Specifies the local IP address.\nThe value is in the dotted decimal format."
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies the name of a VPN instance.\nSpecify this parameter when an E-Trunk is required for a VPN.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] e-trunk 1",
            "[*HUAWEI-e-trunk-1] peer-address 2.2.2.2 source-address 1.1.1.1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ipv4-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv4] quit",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[*HUAWEI] e-trunk 1",
            "[*HUAWEI-e-trunk-1] peer-address 2.2.2.2 source-address 1.1.1.1 vpn-instance vpn1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTwo devices in an E-Trunk exchange E-Trunk packets to negotiate their master/slave status. To allow the devices to exchange negotiation packets, run the peer-address source-address command to configure the IP addresses for the local and peer devices in an E-Trunk. The two IP addresses are peers for each other. For example, if an E-Trunk is created between Device A with IP address 1.1.1.1 and Device B with IP address 2.2.2.2, the peer IP address of Device A is 2.2.2.2, and the peer IP address of Device B is 1.1.1.1.\nPrecautions\nChange the local and peer IP addresses, neither or both. Otherwise, E-Trunk packets are discarded.\nIt is recommended that you configure the IP addresses for the local and peer devices in an E-Trunk as loopback interface addresses."
}