{
    "PageTitle": "peer-ipv6 source-ipv6",
    "FuncDef": "The peer-ipv6 source-ipv6 command configures local and peer IPv6 addresses for an E-Trunk.\nThe undo peer-ipv6 command deletes the local and peer IPv6 addresses of an E-Trunk.\nBy default, no local or peer IPv6 address is configured for an E-Trunk.",
    "CLIs": [
        "peer-ipv6 <peer-ipv6-address> source-ipv6 <source-ipv6-address> [ vpn-instance <vpn-instance-name> ]",
        "undo peer-ipv6 [ <peer-ipv6-address> source-ipv6 <source-ipv6-address> ]"
    ],
    "ParentView": [
        "E-Trunk view"
    ],
    "ParaDef": [
        {
            "Parameters": "peer-ipv6-address",
            "Info": "Specifies a peer IPv6 address.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "source-ipv6-address",
            "Info": "Specifies a local IPv6 address.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies the name of a VPN instance.\nSpecify this parameter when an E-Trunk is required for a VPN.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] e-trunk 1",
            "[*HUAWEI-e-trunk-1] peer-ipv6 2001:db8::1 source-ipv6 2001:db8::2"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ipv6-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv6] quit",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[*HUAWEI] e-trunk 1",
            "[*HUAWEI-e-trunk-1] peer-ipv6 2001:db8::1 source-ipv6 2001:db8::2 vpn-instance vpn1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo allow two devices (for example, Device A and Device B) to exchange E-Trunk packets for master/slave status negotiation, run the peer-ipv6 source-ipv6 command to configure local and peer IPv6 addresses for an E-Trunk, allowing the devices to set up an E-Trunk connection. For example, E-Trunk needs to be set up for device A and device B,source-ipv6-address for Device A must be the same as peer-ipv6-address for Device B. peer-ipv6-address for Device A must be the same as source-ipv6-address for Device B.\nPrecautions\nIf the local or peer IP address of an E-Trunk needs to be changed, change it on both the local and peer devices. Otherwise, E-Trunk packets are discarded.\nUsing the IP addresses of loopback interfaces as the local and peer devices of an E-Trunk is recommended."
}