{
    "PageTitle": "preempt enable",
    "FuncDef": "The preempt enable command enables delayed switchback and also specifies a switchback delay for the master member interface in an Eth-Trunk interface in manual 1:1 master/backup mode.\nThe undo preempt enable command disables delayed switchback of the master member interface in an Eth-Trunk interface in manual 1:1 master/backup mode.\nBy default, delayed switchback of the master member interface in an Eth-Trunk interface in manual 1:1 master/backup mode is disabled.",
    "CLIs": [
        "preempt enable [ delay <delay-time> | delay <delay-time> <seconds> | delay <delay-time> <seconds> <milliseconds> ]",
        "undo preempt enable [ delay <delay-time> | delay <delay-time> <seconds> | delay <delay-time> <seconds> <milliseconds> ]"
    ],
    "ParentView": [
        "Eth-Trunk interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "delay delay-time",
            "Info": "Specifies a switchback delay for the master member interface in an Eth-Trunk interface in manual 1:1 master/backup mode.\nThe value is an integer ranging from 0 to 30, in minutes.The default value is 0, indicating that the master member interface becomes active immediately after it recovers."
        },
        {
            "Parameters": "seconds",
            "Info": "Specifies a switchback delay for the master member interface.\nThe value is an integer ranging from 0 to 59, in seconds.\nThe default value is 0."
        },
        {
            "Parameters": "milliseconds",
            "Info": "Specifies a switchback delay for the master member interface.\nThe value is an integer ranging from 0 to 999, in milliseconds.\nThe default value is 0."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface eth-trunk 10",
            "[*HUAWEI-Eth-Trunk10] portswitch",
            "[*HUAWEI-Eth-Trunk10] mode manual backup",
            "[*HUAWEI-Eth-Trunk10] preempt enable delay 5"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the master member interface in an Eth-Trunk interface in manual 1:1 master/backup mode fails, it becomes inactive. If the master member interface recovers, it needs to become active again. To enable delayed switchback for the master member interface, run the preempt enable command.\nIf you want the master member interface to become active immediately after it recovers, you do not need to specify a switchback delay.If you want the recovered master member interface to become active after a delay, run the preempt enable delay delay-time command to specify a switchback delay.\nThis command applies only to Eth-Trunk interfaces in manual 1:1 master/backup mode that are connected through intermediate devices.\n\nPrerequisites\nAn Eth-Trunk interface has been configured to work in manual 1:1 master/backup mode using the mode manual backup command, and an Eth-Trunk member interface has been configured as the master interface using the port-master command.\nPrecautions\nThe preempt enable and inactive-port shutdown enable commands are mutually exclusive."
}