{
    "PageTitle": "reset lacp statistics eth-trunk",
    "FuncDef": "The reset lacp statistics eth-trunk command clears statistics about LACPDUs on all Eth-Trunk interfaces in static LACP mode, on a specified Eth-Trunk interface in static LACP mode, or on a specified member interface.",
    "CLIs": [
        "reset lacp statistics eth-trunk [ <trunk-id> [ interface { <interface-type> <interface-number> | <interface-name> } ] ]"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "interface interface-type interface-number interface-name",
            "Info": "Specifies a type, number or name of an interface.\n-"
        },
        {
            "Parameters": "eth-trunk trunk-id",
            "Info": "Specifies the ID of an Eth-Trunk interface.\nThe value is an integer ranging from 0 to 65535."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset lacp statistics eth-trunk"
        ],
        [
            "<HUAWEI> reset lacp statistics eth-trunk 1 interface GigabitEthernet 1/0/1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBefore collecting statistics about LACPDUs on a specific interface within a period, you need to run the reset lacp statistics eth-trunk command to clear the existing statistics about LACPDUs on the interface.\nWhen using the reset lacp statistics eth-trunk command, note that:\nIf no optional parameter is specified, statistics about LACPDUs on all Eth-Trunk interfaces in static LACP mode are cleared.If trunk-id is specified only, statistics about LACPDUs on a specified Eth-Trunk interface in static LACP mode are cleared.If both trunk-id and interface portType portNum are specified, statistics about LACPDUs on the specified member interface of the specified Eth-Trunk interface in static LACP mode are cleared.\n\nPrerequisites\nBefore clearing the statistics about LACPDUs on a specified Eth-Trunk interface, ensure that the Eth-Trunk interface exists and works in static LACP mode.Before clearing the statistics about LACPDUs on a specified member interface of an Eth-Trunk interface, ensure that the Eth-Trunk interface and its member interface exist and the Eth-Trunk interface works in static LACP mode.\n\nConfiguration Impact\nThe reset lacp statistics eth-trunk command clears the statistics about sent and received LACPDUs on all Eth-Trunk interfaces in static LACP mode, on a specified Eth-Trunk interface in static LACP mode, or on a specified member interface are cleared and cannot be restored. Therefore, exercise caution when you run the command."
}