{
    "PageTitle": "security-key",
    "FuncDef": "The security-key command configures a password for encrypting packets.\nThe undo security-key command restores the default password.\nThe default password is 00E0FC0000000000 in simple mode.",
    "CLIs": [
        "security-key { simple <simple-key> | cipher <cipher-key> }",
        "undo security-key"
    ],
    "ParentView": [
        "E-Trunk view"
    ],
    "ParaDef": [
        {
            "Parameters": "simple simple-key",
            "Info": "Specifies that the password is saved in simple text.\nThe value is a string of 1 to 255 case-sensitive characters, spaces not supported.\nIf the password is entered in simple text, it is saved in simple text in the configuration file.When quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "cipher cipher-key",
            "Info": "Specifies that the password is saved in cipher text.\nSupported types:\ncipher-key1: If the password is entered in ciphertext, the value is a string of 32 to 432 characters.cipher-key2: A 24-character ciphertext password configured in an earlier version is also supported in this version.cipher-key3: If the password is entered in simple text, the value is a string of 1 to 255 case-sensitive characters, spaces not supported.\nNo matter whether a password is entered in simple text or ciphertext, it is stored in ciphertext in the configuration file.\nWhen quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] e-trunk 1",
            "[*HUAWEI-e-trunk-1] security-key cipher 00E0FC000000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo improve system security after an E-Trunk is configured, run the security-key command to configure a password for encrypting E-Trunk packets.\nPrecautions\nTwo devices in the same E-Trunk must have the same password for encrypting E-Trunk packets.\nIf simple is configured, the password is saved in the configuration file in simple text. The users with the least privilege of viewing the configuration file will be able to obtain the password. This causes a network security risk. Therefore, it is recommended that you configure cipher to encrypt the password in cipher text."
}