{
    "PageTitle": "e-trunk ipv6 port",
    "FuncDef": "The e-trunk ipv6 port command configures a UDP6 port number used to send and receive E-Trunk packets.\nThe undo e-trunk ipv6 port command restores the default value.\nBy default, the UDP6 port number 1025 is used to send and receive E-Trunk packets.",
    "CLIs": [
        "e-trunk ipv6 port <port-number>",
        "undo e-trunk ipv6 port",
        "undo e-trunk ipv6 port <port-number>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "port port-number",
            "Info": "Specifies a UDP6 port number used to send and receive E-Trunk packets.\nThe UDP6 port numbers 49152 to 65535 are allocated randomly by socket. Do not configure the UDP6 port number in this range in case that it cannot be used by the E-Trunk.\nThe value is an integer ranging from 1025 to 65535.\nIf the UDP6 port number in the range of 1025 to 65535 is used by another protocol, the port number cannot be used to send or receive E-Trunk packets."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] e-trunk ipv6 port 1026"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAn E-Trunk is Huawei-specific. The default UDP6 port number 1025 used to send and receive E-Trunk packets may conflict with the UDP6 port number used by another protocol. To ensure the forwarding of E-Trunk packets, run the e-trunk ipv6 port command to change the UDP6 port number used to send and receive E-Trunk packets.\nConfiguration Impact\nIf you change the UDP6 port number when E-Trunk is running, the two devices in the E-Trunk may not be able to communicate. If E-Trunk negotiation times out, both devices in the E-Trunk may become master devices.\nPrecautions\nThe two devices in an E-Trunk must have the same UDP6 port number. If you change the UDP6 port number when E-Trunk is running, complete the change before E-Trunk negotiation times out. After the e-trunk ipv6 port command is run, the interface number of the E-Trunk is changed, causing E-Trunk re-negotiation.\nStatistics about E-Trunk packets sent and received by a UDP6 port are cleared when its port number is changed."
}