{
    "PageTitle": "e-trunk mode",
    "FuncDef": "The e-trunk mode command configures a working mode for an Eth-Trunk interface in an E-Trunk.\nThe undo e-trunk mode command restores the working mode of an Eth-Trunk interface in an E-Trunk.\nBy default, an Eth-Trunk interface works in automatic mode in an E-Trunk.",
    "CLIs": [
        "e-trunk mode <mode-type>",
        "undo e-trunk mode"
    ],
    "ParentView": [
        "Eth-Trunk interface view",
        "Global VE interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "mode-type",
            "Info": "Indicates the mode.\nauto:Indicates the automatic mode.\nforce-master:Indicates the master mode.\nforce-backup:Indicates the backup mode."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] e-trunk 1",
            "[*HUAWEI-e-trunk-1] quit",
            "[*HUAWEI] interface Eth-Trunk 1",
            "[*HUAWEI-Eth-Trunk1] e-trunk 1",
            "[*HUAWEI-Eth-Trunk1] e-trunk mode force-master"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf an Eth-Trunk interface in an E-Trunk works in automatic mode or is switched to the automatic mode from the forcible master or backup mode, the master/backup status of the Eth-Trunk interface is determined by the master/backup status of the local E-Trunk and the peer member interface status.\nIf the local E-Trunk works in master mode, the local Eth-Trunk interface also works in master mode.If the local E-Trunk works in backup mode and the peer Eth-Trunk interface is faulty, the local Eth-Trunk interface works in master mode. When the local Eth-Trunk interface receives a message indicating recovery of the peer Eth-Trunk interface, the local Eth-Trunk interface works in backup mode.\n\nPrecautions\nThe e-trunk mode command can only be run on an Eth-Trunk interface added to an E-Trunk. If the Eth-Trunk interface is deleted from the E-Trunk, the command configuration is cleared automatically.\nWhen Eth-Trunk interfaces in an E-Trunk work in automatic mode, a change in the interval at which Hello packets are sent will result in the master/backup status flapping. Configure the Eth-Trunk interfaces to work in master/backup mode before changing the interval at which Hello packets are sent. Restore the Eth-Trunk interfaces to the automatic mode after the negotiation is completed.\nIn an interface extension scenario, if an existing extension interface has been added to an Eth-Trunk interface, the e-trunk mode command fails to be run in the Eth-Trunk interface view. To run this command in the interface view, delete the extension interface from the Eth-Trunk interface first."
}