{
    "PageTitle": "max bandwidth-affected-linknumber",
    "FuncDef": "The max bandwidth-affected-linknumber command sets the maximum number of links that affect the actual bandwidth of a Layer 2 Eth-Trunk interface.\nThe undo max bandwidth-affected-linknumber command deletes the maximum number of links that affect the actual bandwidth of a Layer 2 Eth-Trunk interface.\nBy default, a maximum of 32 links affects the actual bandwidth of a Layer 2 Eth-Trunk interface.",
    "CLIs": [
        "max bandwidth-affected-linknumber <link-number>",
        "undo max bandwidth-affected-linknumber"
    ],
    "ParentView": [
        "Eth-Trunk interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "link-number",
            "Info": "Specifies the maximum number of links that affect the actual bandwidth of a Layer 2 Eth-Trunk interface.\nThe value is an integer ranging from 1 to 32."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface eth-trunk 1",
            "[*HUAWEI-Eth-Trunk1] portswitch",
            "[*HUAWEI-Eth-Trunk1] max bandwidth-affected-linknumber 5"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe maximum number of links that affect the actual bandwidth of a Layer 2 Eth-Trunk interface directly affects the available bandwidth. If the Layer 2 Eth-Trunk interface works in autonegotiation mode, the interface bandwidth change affects the interface cost.\nFor example, device A and device B are connected through two Eth-Trunk interfaces. Eth-Trunk 1 has 6 active member links, and Eth-Trunk 2 has 4 active member links. If the bandwidth of each member link is 1 Gbit/s, the total bandwidth of Eth-Trunk 1 is 6 Gbit/s and that of Eth-Trunk 2 is 4 Gbit/s. If device A is the root bridge, Eth-Trunk 1 on device B is the root interface, and Eth-Trunk 2 on device B is the alternate interface. If you run the max bandwidth-affected-linknumber command to set the maximum number of links that affect the actual bandwidth of Eth-Trunk 1 to 3, the available bandwidth of Eth-Trunk 1 decreases from 6 Gbit/s to 3 Gbit/s. If Eth-Trunk 1 works in autonegotiation mode, the available bandwidth decrease affects the interface cost and accordingly affects STP recalculation. However, the bandwidth change does not affect traffic on Eth-Trunk 1 that is still forwarded at a rate of 6 Gbit/s. After the number of Up member links that determine the Eth-Trunk link bandwidth reaches the upper limit, the STP calculation is not affected even if more member links go Up.\nPrecautions\nThe max bandwidth-affected-linknumber command is applicable to only Eth-Trunk interfaces in Layer 2 mode."
}