{
    "PageTitle": "distribute-weight",
    "FuncDef": "The distribute-weight command configures the weight of load balancing for a member interface.\nThe undo distribute-weight command deletes the configured weight of load balancing of a member interface.\n\nBy default, the weight of load balancing on a member interface is 1.",
    "CLIs": [
        "distribute-weight <weight-value>",
        "undo distribute-weight"
    ],
    "ParentView": [
        "100GE interface view",
        "10GE interface view",
        "400GE interface view",
        "40GE interface view",
        "50GE interface view",
        "Eth-Trunk member interface view",
        "FlexE interface view",
        "GE optical interface view",
        "GE electrical interface view",
        "FlexE interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "weight-value",
            "Info": "Specifies the weight of an Eth-Trunk member interface.\nThe value is an integer ranging from 1 to 64."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface eth-trunk1",
            "[*HUAWEI-Eth-Trunk1] trunkport GigabitEthernet 1/0/1",
            "[*HUAWEI-Eth-Trunk1] quit",
            "[*HUAWEI] interface GigabitEthernet 1/0/1",
            "[*HUAWEI-GigabitEthernet1/0/1] distribute-weight 3"
        ]
    ],
    "ExtraInfo": "Usage Scenario\n\nOn an Eth-Trunk interface, you can load balance traffic among member interfaces according to the weights configured for the member interfaces.\nThe higher the weight of a member interface, the heavier the load over the member link. Therefore, you can run the distribute-weight command to configure a higher weight for a member interface so that the member link can carry a heavier load.\nTo restore the weight of a member interface to the default value, you can run either of the following commands in the Ethernet interface view:\nundo distribute-weight, which restores the weight of a member interface to the default value\ndistribute-weight 1, which forcibly sets the weight of a member interface to the default value 1.\n\nPrerequisites\n\nAn Eth-Trunk interface has been correctly configured, and interfaces have been added to the Eth-Trunk interface.\n\nConfiguration Impact\n\nThe higher the weight of a member interface, the heavier the load over the member link.\n\nPrecautions\n\nIf the distribute-weight command is run more than once, the latest configuration overrides the previous one.\nThe number of member interfaces of an Eth-Trunk interfaces cannot exceed the maximum number of member interfaces allowed."
}