{
    "PageTitle": "least active-bandwidth",
    "FuncDef": "The least active-bandwidth command configures the minimum bandwidth for the member links that are Up on an Eth-Trunk interface.\nThe undo least active-bandwidth command restores the default minimum bandwidth configured for the member links that are Up on an Eth-Trunk interface.\nBy default, no minimum bandwidth is configured for the member links that are Up on an Eth-Trunk interface.",
    "CLIs": [
        "least active-bandwidth <bandwidth>",
        "undo least active-bandwidth",
        "undo least active-bandwidth <bandwidth>"
    ],
    "ParentView": [
        "Eth-Trunk interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "bandwidth",
            "Info": "Specifies the minimum bandwidth of the member links that are Up on an Eth-Trunk interface.\nThe value is an integer ranging from 1 to 4294967295, in Mbit/s."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface eth-trunk 1",
            "[*HUAWEI-Eth-Trunk1] least active-bandwidth 3"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe bandwidth of an Eth-Trunk interface equals the total bandwidth of all member links that are Up. To ensure proper traffic forwarding, you can run the least active-bandwidth bandwidth command to configure the minimum bandwidth for the member links that are Up on an Eth-Trunk interface. After the minimum bandwidth is configured, the Eth-Trunk interface is Up only when the total bandwidth of all member links that are Up is greater than or equal to the minimum bandwidth.\nPrerequisites\nAn Eth-Trunk interface has been correctly configured.\nThe least active-linknumber link-number command has not been run because it is mutually exclusive with the least active-bandwidth bandwidth command.\nConfiguration Impact\nAfter the minimum bandwidth for the member links that are Up on an Eth-Trunk interface is configured:\nThe Eth-Trunk interface is Down when the total bandwidth of all member links that are Up is less than the minimum bandwidth.The Eth-Trunk interface is Up when the total bandwidth of all member links that are Up is greater than or equal to the minimum bandwidth.\n\nPrecautions\nThe minimum bandwidth configured for both ends of an Eth-Trunk must be the same to prevent the Eth-Trunk interface from flapping.After the minimum bandwidth is configured for the member links that are Up on an Eth-Trunk interface, do not run the max active-linknumber link-number command to configure the maximum number of active links. That is because the Eth-Trunk interface will go Down if the total bandwidth of the maximum number of active links is less than the minimum bandwidth."
}