{
    "PageTitle": "lacp e-trunk priority",
    "FuncDef": "The lacp e-trunk priority command configures a Link Aggregation Control Protocol (LACP) priority for a member Eth-Trunk interface in an E-Trunk (LACP E-Trunk system priority for short).\nThe undo lacp e-trunk priority command restores the default LACP E-Trunk system priority.\nBy default, the LACP E-Trunk system priority is 32768 in the system view.",
    "CLIs": [
        "lacp e-trunk priority <priority>",
        "undo lacp e-trunk priority"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "priority priority",
            "Info": "Specifies an LACP E-Trunk system priority.\nA smaller value indicates a higher LACP E-Trunk system priority.\nThe value is an integer ranging from 0 to 65535."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] lacp e-trunk priority 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen an E-Trunk consists of Eth-Trunk interfaces working in static LACP mode, each member Eth-Trunk interface and the connected peer Eth-Trunk interface use LACP E-Trunk system priorities to determine the priority of the device at either end of the Eth-Trunk link. The device with the higher priority functions as the LACP Actor and determines which member interfaces in its Eth-Trunk interface are active based on the interface priorities. The other device selects the member interfaces connected to the active member interfaces on the Actor as active member interfaces. You can run the lacp e-trunk priority command to configure the LACP priority of the member Eth-Trunk interface in the E-Trunk. In this situation, LACP priorities determine the priorities of devices on both ends of the Eth-Trunk link, and the device with the higher priority selects active member interfaces in its Eth-Trunk interface based on interface priorities.\nPrerequisites\nhe working mode of an Eth-Trunk interface has been set to the static LACP mode using the mode lacp-static command in the Eth-Trunk interface view .\nPrecautions\nThe member Eth-Trunk interfaces in an E-Trunk must have the same LACP E-Trunk system priority.\nThe LACP E-Trunk system priority configured in the system view takes effect on all Eth-Trunk interfaces. The LACP E-Trunk system priority configured in the Eth-Trunk interface view takes effect only on the Eth-Trunk interface. If the lacp e-trunk priority command is configured both in the system view and the Eth-Trunk interface view, the LACP E-Trunk system priority configured in the Eth-Trunk interface view takes precedence.\nIf multiple E-Trunks are configured on a device, member Eth-Trunk interfaces in different E-Trunks may have different LACP E-Trunk system priorities. In this situation, run the lacp e-trunk priority command in the Eth-Trunk interface view to configure the LACP E-Trunk system priority.\nThe LACP E-Trunk system priority applies to the E-Trunk consisting of Eth-Trunk interfaces working in static LACP mode and is configured using the lacp e-trunk priority command, whereas the LACP system priority applies to the Eth-Trunk interfaces working in static LACP mode and is configured using the lacp priority command.\nIf the LACP E-Trunk system priority and LACP system priority are both configured, after an Eth-Trunk interface working in static LACP mode is added to an E-Trunk, only the LACP E-Trunk system priority takes effect for the Eth-Trunk interface."
}