{
    "PageTitle": "port-master",
    "FuncDef": "The port-master command configures an interface as the master interface in an Eth-Trunk interface in manual 1:1 master/backup mode.\nThe undo port-master command deletes the configuration of the master interface in an Eth-Trunk interface in manual 1:1 master/backup mode.\nBy default, the member interface that is first added to the Eth-Trunk interface in manual 1:1 master/backup mode will automatically become the master one.",
    "CLIs": [
        "port-master",
        "undo port-master"
    ],
    "ParentView": [
        "100GE interface view",
        "10GE interface view",
        "400GE interface view",
        "40GE interface view",
        "50GE interface view",
        "Eth-Trunk member interface view",
        "GE optical interface view",
        "GE electrical interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface eth-trunk 1",
            "[*HUAWEI-Eth-Trunk1] portswitch",
            "[*HUAWEI-Eth-Trunk1] mode manual backup",
            "[*HUAWEI-Eth-Trunk1] quit",
            "[*HUAWEI] interface GigabitEthernet 1/0/1",
            "[*HUAWEI-GigabitEthernet1/0/1] eth-trunk 1",
            "[*HUAWEI-GigabitEthernet1/0/1] port-master"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nEth-Trunk is a technique that bundles Ethernet interfaces into a logical interface (called an Eth-Trunk interface) to increase bandwidth, balance traffic, and improve network reliability. If intermediate devices exist between Eth-Trunk interfaces at both ends of an Eth-Trunk link, configure the Eth-Trunk interfaces to work in manual 1:1 master/backup mode.\nOnly the master interface is in the active state and can forward data. To ensure a reliable communication, running the port-master command is recommended to specify a master interface.\nPrerequisites\nThe Eth-Trunk interface must work in manual 1:1 master/backup mode.\nPrecautions\nIn normal situations, the master member interface in an Eth-Trunk interface in manual 1:1 master/backup mode is active and can forward data. The backup member interface is inactive and cannot forward data. To change the backup interface to the master interface, perform either of the following operations:\nRun the undo port-master command in the master interface view to delete the master interface configuration, and run the port-master command in the backup interface view to specify the interface as the master interface. Specifying a new master interface causes a short data interruption.Run the protect-switch command in the view of the Eth-Trunk interface in manual 1:1 master/backup mode to manually switch the active and inactive interfaces. Each time the protect-switch command is run, the active and inactive interfaces are switched once. This switching does not cause any data interruption."
}