{
    "PageTitle": "e-trunk select",
    "FuncDef": "The e-trunk select link-number command configures an E-Trunk to determine the master/backup status of devices based on the number of available Eth-Trunk member links or the available Eth-Trunk bandwidth.\nThe undo e-trunk select link-number command restores the default configuration.\nBy default, an E-Trunk does not determine the master/backup status of Eth-Trunk devices based on the number of available Eth-Trunk member links or the available Eth-Trunk bandwidth.",
    "CLIs": [
        "e-trunk select { link-number | bandwidth }",
        "undo e-trunk select [ link-number | bandwidth ]"
    ],
    "ParentView": [
        "E-Trunk view"
    ],
    "ParaDef": [
        {
            "Parameters": "link-number",
            "Info": "Configures an E-Trunk to determine the master/backup status of devices based on the number of available Eth-Trunk member links.\n-"
        },
        {
            "Parameters": "bandwidth",
            "Info": "Configures an E-Trunk to determine the master/backup status of devices based on the available Eth-Trunk bandwidth.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] e-trunk 1",
            "[*HUAWEI-e-trunk-1] quit",
            "[*HUAWEI] interface eth-trunk 1",
            "[*HUAWEI-Eth-Trunk1] mode lacp-static",
            "[*HUAWEI-Eth-Trunk1] e-trunk 1",
            "[*HUAWEI-Eth-Trunk1] e-trunk mode auto",
            "[*HUAWEI-Eth-Trunk1] quit",
            "[*HUAWEI] e-trunk 1",
            "[*HUAWEI-e-trunk-1] e-trunk select link-number"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen E-Trunk member interfaces work in automatic mode, the E-Trunk determines the master/backup status of devices based on their E-Trunk priorities. If the E-Trunk priorities are the same, the E-Trunk determines the master/backup status of devices based on their system IDs. When devices added to an E-Trunk greatly differ in their available Eth-Trunk member links, to maximize link bandwidth utilization, you can run the e-trunk select link-number command to configure the E-Trunk to determine the master/backup status of the devices based on the number of available Eth-Trunk member links. The device with a larger number of available Eth-Trunk member links is determined as the master, and the other device is then determined as the backup. You can also run the e-trunk select bandwidth command to configure the E-Trunk to determine the master/backup status of the devices based on the available Eth-Trunk bandwidth. The device with a higher available Eth-Trunk bandwidth is determined as the master, and the other device is then determined as the backup.\nPrecautions\nThe e-trunk select link-number command takes effect when the following conditions are met:\nThe Eth-Trunk interfaces added to the E-Trunk are configured to work in static LACP mode using the mode lacp-static command in the Eth-Trunk interface view.The Eth-Trunk interfaces added to the E-Trunk are configured to work in automatic mode using the e-trunk mode auto command in the Eth-Trunk interface view."
}