{
    "PageTitle": "lacp mixed-rate link enable",
    "FuncDef": "The lacp mixed-rate link enable command enables interfaces operating at different rates to forward packets after the interfaces are added to an Eth-Trunk interface in static LACP mode.\nThe undo lacp mixed-rate link enable command disables interfaces operating at different rates from forwarding packets after the interfaces join an Eth-Trunk interface in static LACP mode.\nBy default, after interfaces operating at different rates are added to an Eth-Trunk interface in static LACP mode, traffic is forwarded at one of the rates.",
    "CLIs": [
        "lacp mixed-rate link enable",
        "undo lacp mixed-rate link enable"
    ],
    "ParentView": [
        "Eth-Trunk interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface eth-trunk 1",
            "[*HUAWEI-Eth-Trunk1] mode lacp-static",
            "[*HUAWEI-Eth-Trunk1] lacp mixed-rate link enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, after interfaces operating at different rates are added to an Eth-Trunk interface in static LACP mode, traffic is forwarded at only one of the rates through the corresponding interfaces. This operation cannot implement load balancing on the Eth-Trunk interface.\nTo implement load balancing, run the lacp mixed-rate link enable command to enable the Eth-Trunk interface's member interfaces operating at different rates to share packets.\nPrerequisites\nThe Eth-Trunk interface has been configured to work in static LACP mode using the mode lacp-static command in the Eth-Trunk interface view.\nThe rate of the interface added to the Eth-Trunk interface is not limited. For example, 10G and 100G interfaces can be added to the same Eth-Trunk interface. The maximum forwarding rate of an Eth-Trunk interface is the sum of rates of the Eth-Trunk interface's member interfaces.\nFollow-up Procedure\nSet the distribute-weight of the member interface with different rates. By default, the weight of an Eth-Trunk member interface is 1."
}