{
    "PageTitle": "lacp preempt enable",
    "FuncDef": "The lacp preempt enable command enables Link Aggregation Control Protocol (LACP) priority preemption on Eth-Trunk interfaces in static LACP mode.\nThe undo lacp preempt enable command disables LACP priority preemption from Eth-Trunk interfaces in static LACP mode.\nBy default, Eth-Trunk interfaces in static LACP mode are not enabled with LACP priority preemption.",
    "CLIs": [
        "lacp preempt enable",
        "undo lacp preempt enable"
    ],
    "ParentView": [
        "Eth-Trunk interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface eth-trunk 1",
            "[*HUAWEI-Eth-Trunk1] mode lacp-static",
            "[*HUAWEI-Eth-Trunk1] lacp preempt enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter LACP priority preemption is enabled on Eth-Trunk interfaces in static LACP mode, Eth-Trunk interfaces always use interfaces with high priorities as active interfaces. For example, two devices are connected through three GE interfaces on each side. After the three GE interfaces are bundled into an Eth-Trunk interface, the mode lacp-static command is used to configure the Eth-Trunk interface to work in static LACP mode. If the maximum number of Up member interfaces is 2, the lacp priority command can be used in the interface view to set the LACP priorities of two member interfaces to 9 and 10, and the remaining interface uses the default LACP priority value 32768. Through LACP negotiation, the member interfaces with higher LACP priorities are selected as active interfaces, and the member interfaces with the default LACP priority are backup interfaces.\nPrerequisites\nThe mode lacp-static command has been run in the Eth-Trunk interface view to configure the Eth-Trunk interface to work in static LACP mode.\nConfiguration Impact\nAfter LACP priority preemption is enabled on an Eth-Trunk interface in static LACP mode, the system re-selects active member interfaces according to LACP system priorities and interface priorities.\nPrecautions\nIt is recommended that both ends of an Eth-Trunk link be enabled with LACP priority preemption or both ends be disabled from LACP priority preemption to ensure that the Eth-Trunk link works normally."
}