{
    "PageTitle": "lacp port-role",
    "FuncDef": "The lacp port-role command sets a role for a member interface of an Eth-Trunk interface in static LACP mode.\nThe undo lacp port-role command restores the default setting.\nBy default, the role is set to none for the member interfaces of an Eth-Trunk interface in static LACP mode, indicating that no role is set.",
    "CLIs": [
        "lacp port-role { master | slave | none }",
        "undo lacp port-role [ master | slave | none ]"
    ],
    "ParentView": [
        "40GE interface view",
        "Interface group view",
        "GE interface view",
        "100GE interface view",
        "GE electrical interface view",
        "Port extension interface view",
        "Port extension Layer 2 interface view",
        "50GE interface view",
        "Layer 2 GE interface view",
        "400GE interface view",
        "10GE interface view",
        "GE optical interface view",
        "25GE interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "master",
            "Info": "Sets the master role for a member interface of an Eth-Trunk interface in static LACP mode.\n-"
        },
        {
            "Parameters": "slave",
            "Info": "Sets the backup role for a member interface of an Eth-Trunk interface in static LACP mode.\n-"
        },
        {
            "Parameters": "none",
            "Info": "Sets no role for a member interface of an Eth-Trunk interface in static LACP mode.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface eth-trunk 10",
            "[*HUAWEI-Eth-Trunk10] mode lacp-static",
            "[*HUAWEI-Eth-Trunk10] lacp backup-mode enable",
            "[*HUAWEI-Eth-Trunk10] quit",
            "[*HUAWEI] interface GigabitEthernet 1/0/1",
            "[*HUAWEI-GigabitEthernet1/0/1] eth-trunk 10",
            "[*HUAWEI-GigabitEthernet1/0/1] lacp port-role master"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen member interfaces of an Eth-Trunk interface in static LACP mode do not all reside on the same traffic manager (TM) but you want those on the same TM to negotiate first, run the lacp port-role master command in the views of the member interfaces on the same TM to set the master role for them. These member interfaces then negotiate first.If the member interfaces with the master role fail to meet the condition for the Eth-Trunk interface to go Up, the member interfaces with the backup role begin to negotiate. Those without any role do not participate in LACP negotiation.\nPrerequisites\nAn Eth-Trunk interface has been enabled to work in static LACP master/backup negotiation mode using the lacp backup-mode enable command."
}