{
    "PageTitle": "lacp ignore aggregation delay",
    "FuncDef": "The lacp ignore aggregation delay command enables a device to ignore the value of the Reserved field in received LACPDUs.\nThe undo lacp ignore aggregation delay command restores the function of identifying the value of the Reserved field in received LACPDUs on a device.\nBy default, a device identifies the value of the Reserved field in received LACPDUs.",
    "CLIs": [
        "lacp ignore aggregation delay",
        "undo lacp ignore aggregation delay"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] lacp ignore aggregation delay"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA member interface of an Eth-Trunk interface in static LACP mode fails and thus is in the standby state. When the member interface recovers, it switches to the forwarding state. To avoid unstable data transmission on the Eth-Trunk link due to the member interface's alternating between Up and Down, you can run the lacp preempt delay command to configure a preemption delay. In this manner, the member interface switches to the forwarding state only after the preemption delay expires. If two Huawei devices are connected and the preemption delays configured on the two devices are different, the two devices negotiate the preemption delay using the Reserved field in LACPDUs. The system selects the longer preemption delay as the valid preemption delay. When a Huawei device is connected to a non-Huawei device, if the Reserved field defined by the non-Huawei vendor is different from that defined by Huawei, LACP flapping occurs, and services are interrupted. In this case, you can run the lacp ignore aggregation delay command to enable the device to ignore the value of the Reserved field in LACPDUs.\nPrecautions\nAfter the lacp ignore aggregation delay command is run, the LACP negotiation status may be different if the preemption delays on both ends are different. In this case, you need to set the same LACP negotiation delay on both ends. If both ends are Huawei devices, you do not need to run the lacp ignore aggregation delay command."
}