{
    "PageTitle": "lacp priority-command-mode",
    "FuncDef": "The lacp priority-command-mode command sets a Link Aggregation Control Protocol (LACP) system priority configuration mode.\nThe undo lacp priority-command-mode command restores the default LACP system priority configuration mode.\nBy default, the LACP system priority configuration mode is default.",
    "CLIs": [
        "lacp priority-command-mode { default | system-priority }",
        "undo lacp priority-command-mode"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "default",
            "Info": "Sets the LACP system priority configuration mode to default.\nIn default mode, the LACP system priority is configured using the lacp priority command in the system view.\n-"
        },
        {
            "Parameters": "system-priority",
            "Info": "Sets the LACP system priority configuration mode to system-priority.\nIn system-priority mode, the LACP system priority is configured using the lacp system-priority command in the system view.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] lacp priority-command-mode system-priority"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe LACP system priority is configured using the lacp priority command in the system view, and the LACP interface priority is configured using the same command but in the interface view.\nA change in the LACP system priority will cause LACP renegotiation. If an Eth-Trunk interface working in LACP mode has multiple member interfaces, it will go Down until the renegotiation succeeds, which may interrupt services. If a maintenance engineer who wants to configure an LACP interface priority runs the lacp priority command in the system view by mistake, an LACP system priority is configured, which may cause Eth-Trunk interface flapping. To address this problem, run the lacp priority-command-mode command so that the LACP system priority and LACP interface priority configurations require different commands.\nPrecautions\nWhen running the lacp priority-command-mode command, note the following points:If you specify default in the command, the LACP system priority and LACP interface priority configurations still use the same command (lacp priority priority).If you specify system-priority in the command, run the lacp system-priority priority command to configure the LACP system priority and run the lacp priority priority command to configure the LACP interface priority."
}