{
    "PageTitle": "lacp selected",
    "FuncDef": "The lacp select command configures the mode for selecting active interfaces of an Eth-Trunk interface in static Link Aggregation Control Protocol (LACP) mode.\nBy default, active interfaces are selected according to the interface priority.",
    "CLIs": [
        "lacp selected speed",
        "lacp selected priority"
    ],
    "ParentView": [
        "Eth-Trunk interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "priority",
            "Info": "Indicates that active interfaces are selected according to the interface priority. The interfaces with high priorities are preferentially selected as active interfaces.\n-"
        },
        {
            "Parameters": "speed",
            "Info": "Indicates that active interfaces are selected according to the interface speed. High-speed interfaces are preferentially selected as active interfaces.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Eth-Trunk 1",
            "[*HUAWEI-Eth-Trunk1] mode lacp-static",
            "[*HUAWEI-Eth-Trunk1] lacp selected speed"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAs defined in LACP, active interfaces are selected according to the interface priority by default. If member interfaces of an Eth-Trunk interface in static LACP mode are of different rates, such as 100 Mbit/s and 1 Gbit/s, low-speed member interfaces may be selected as active interfaces because of their high priorities. If you intend to select high-speed interfaces to be active interfaces, you can run the lacp selected command to set the mode for selecting active interfaces to speed.\nIf you intend to select active interface according to the interface priority, you can run the lacp selected priority command.\nPrerequisites\nThe mode lacp-static command has been run in the Eth-Trunk interface view to configure the Eth-Trunk interface to work in static LACP mode.\nConfiguration Impact\nBy default, Eth-Trunk active member interfaces are selected according to the interface priority. Changing the mode for selecting active interfaces causes short-term service interruption. Therefore, it is not recommended that you change the mode for selecting active interfaces during service transmission.\nPrecautions\nBundling interfaces working at different rates into an Eth-Trunk interfaces in static LACP mode is not recommended. Otherwise, the preemption function cannot take effect."
}