{
    "PageTitle": "lacp priority",
    "FuncDef": "The lacp priority command sets a Link Aggregation Control Protocol (LACP) system priority.\nThe undo lacp priority command restores the default LACP system priority.\nThe default LACP priority is 32768.",
    "CLIs": [
        "lacp priority <priority>",
        "undo lacp priority"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "priority priority",
            "Info": "Specifies an LACP priority.\nThe value is an integer ranging from 0 to 65535. The smaller the priority value, the higher the priority."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] lacp priority 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nLACP system priorities are set to prioritize the device at either end of an Eth-Trunk link. The device with a higher system priority is selected as the Actor, and then active member interfaces are selected according to the configuration of the Eth-Trunk interface on the Actor.\nIf neither of the device at either end of an Eth-Trunk link is configured with a system priority, the devices use the default value 32768. In this case, the Actor is selected based on the system ID. That is, the device with the smaller system ID becomes the Actor. You can run the lacp priority command in the system view to change the Actor of an Eth-Trunk link\nPrerequisites\nThe mode lacp-static command has been run in the Eth-Trunk interface view to configure the Eth-Trunk interface to work in static LACP mode.\nConfiguration Impact\nIn static LACP mode, active interfaces selected by devices at both ends of an Eth-Trunk link must be the same; otherwise, the link aggregation group cannot be set up.\nIf the max active-linknumber (Eth-Trunk interface view) command is run on an Eth-Trunk interface in static LACP mode to set the maximum number of active member links, when the number of Up Ethernet interfaces that are manually added to the Eth-Trunk interface exceeds the maximum value, you need to select active interfaces from the Up member interfaces. Running the lacp priority command to set LACP interface priorities ensures that interfaces with high priorities become active in static LACP mode.\nIf the max active-linknumber (Eth-Trunk interface view) command is not used, if the number of manually added member interfaces is smaller than the default value, you do not need to select active interfaces and all member interfaces are active."
}