{
    "PageTitle": "lacp system-id",
    "FuncDef": "The lacp system-id command configures an LACP system ID for an Eth-Trunk interface.\nThe undo lacp system-id command restores the default LACP system ID of an Eth-Trunk interface.\nBy default, an LACP system ID of an Eth-Trunk interface is the system bridge MAC address.",
    "CLIs": [
        "lacp system-id <mac-address>",
        "undo lacp system-id",
        "undo lacp system-id <mac-address>"
    ],
    "ParentView": [
        "Eth-Trunk interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "system-id mac-address",
            "Info": "Specifies the LACP system ID of an Eth-Trunk interface.\nThe value is a 12-digit hexadecimal number, in the format of H-H-H. Each H is 4 digits. If an H contains fewer than 4 digits, the left-most digits are padded with zeros. For example, e0 is displayed as 00e0.An LACP system ID cannot be all 0s.\nIf the value is all Fs, the LACP system ID is restored to the default."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface eth-trunk 10",
            "[*HUAWEI-Eth-Trunk10] mode lacp-static",
            "[*HUAWEI-Eth-Trunk10] lacp system-id 00e0-fc12-3456"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen devices are connected through Eth-Trunk interfaces in LACP mode, the device with a higher LACP system priority functions as the LACP Actor. The other device then selects active member interfaces based on the interface priorities of the LACP Actor. If the two connected devices have the same LACP system priority, the LACP system IDs determine the device priorities. To configure an LACP system ID, run the lacp system-id command. The device with a higher priority then becomes the LACP Actor. The other device then selects active member interfaces based on the interface priorities of the LACP Actor.\nWhen Eth-Trunk interfaces in static LACP mode are associated with the same VRRP backup group, you must run the lacp system-id command to configure the same LACP system ID for the Eth-Trunk interfaces so that the VRRP backup group takes effect.\nPrecautions\nThe LACP E-Trunk system ID configured in the system view takes effect on all Eth-Trunk interfaces that are added to the E-Trunk. The LACP E-Trunk system ID configured in an Eth-Trunk interface view takes effect only on the Eth-Trunk interface. If the lacp e-trunk system-id command is run in the system view and the lacp system-id command is in run in an Eth-Trunk interface view, the LACP system ID configured in the Eth-Trunk interface view takes precedence."
}