{
    "PageTitle": "detect-active-link enable",
    "FuncDef": "The detect-active-link enable command enables interface status monitoring on a device, so that when the interface is Down, the Eth-Trunk interface that shares the same VLAN with the interface will send a Flush packet to instruct the peer device to update its ARP entries.\nThe undo detect-active-link enable command restores the default configuration.\nBy default, interface status monitoring is not configured, and therefore, when the interface is Down, the Eth-Trunk interface that shares the same VLAN with the interface cannot send a Flush packet to instruct the peer device to update its ARP entries.",
    "CLIs": [
        "detect-active-link enable",
        "undo detect-active-link enable"
    ],
    "ParentView": [
        "Layer 2 40GE interface view",
        "Layer 2 50GE interface view",
        "Port extension Layer 2 interface view",
        "Layer 2 10GE interface view",
        "Layer 2 GE interface view",
        "Layer 2 100GE interface view",
        "Layer 2 50|100GE interface view",
        "Eth-Trunk interface view",
        "25GE-L2 view",
        "400GE-L2 view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] portswitch",
            "[*HUAWEI-GigabitEthernet1/0/1] detect-active-link enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo ensure traffic proper transmission, run the detect-active-link enable command on a PE interface connecting to CE1 to enable interface status monitoring on the PE, so that when the interface is Down, the Eth-Trunk interface that shares the same VLAN with the interface will send a Flush packet to instruct the peer device to update its ARP entries.\nPrerequisites\nThe interface on which the detect-active-link enable command is to be run must be a Layer 2 interface. If the interface is a Layer 3 interface, run the portswitch command to switch the Layer 3 interface to a Layer 2 interface.\nPrecautions\nThe detect-active-link enable command monitors the status of a Layer 2 interface based on the interface's traffic statistics. To help obtain the real-time traffic statistics, run the set flow-stat interval interval command to set the interval at which traffic statistics are collected to a small value (10s is the lower threshold).\nBy default, the interval at which traffic statistics are collected is 5 minutes. On the network, if an interface connecting a PE to CE1 alternates between Up and Down, traffic statistics on the interface cannot be updated in time. As a result, the Eth-Trunk interface that shares the same VLAN with the interface cannot promptly be aware of the interface status changes and may incorrectly send or send fewer Flush packets than expected."
}