{
    "PageTitle": "smart-link flush send",
    "FuncDef": "The smart-link flush send vlan command enables the active interface in an Eth-Trunk interface in manual 1:1 master/backup mode to send Smart Link Flush packets.\nThe undo smart-link flush send command disables the active interface in an Eth-Trunk interface in manual 1:1 master/backup mode from sending Smart Link Flush packets.\nBy default, the active interface in an Eth-Trunk interface in manual 1:1 master/backup mode is disabled from sending Smart Link Flush packets.",
    "CLIs": [
        "smart-link flush send vlan <vlan-id>",
        "undo smart-link flush send"
    ],
    "ParentView": [
        "Eth-Trunk interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "vlan vlan-id",
            "Info": "Specifies the VLAN ID of Smart Link Flush packets to be forwarded.\nThe value is an integer ranging from 1 to 4094."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface eth-trunk 1",
            "[*HUAWEI-Eth-Trunk1] portswitch",
            "[*HUAWEI-Eth-Trunk1] mode manual backup",
            "[*HUAWEI-Eth-Trunk1] smart-link flush send vlan 1000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen intermediate devices exist between Eth-Trunk interfaces in manual 1:1 master/backup mode at both ends of an Eth-Trunk link and the active and inactive interfaces are switched in one Eth-Trunk interface, to allow the other Eth-Trunk interface to detect the switching, you must run the smart-link flush send command on the Eth-Trunk interfaces at both ends to enable the active interfaces to send Smart Link Flush packets, and run the smart-link flush enable control-vlan vlan-id command in the view of the intermediate devices' interfaces that connect to the Eth-Trunk interfaces at both ends of the Eth-Trunk link as well as the intermediate devices' interfaces that connect each other to enable the interfaces to receive Smart Link Flush packets. The exchange of Smart Link Flush packets helps update MAC and ARP entries.\nPrerequisites\nAn Eth-Trunk interface in manual 1:1 master/backup mode has been created.\nConfiguration Impact\nWhen the active and inactive interfaces are switched, the new active interface will send Smart Link Flush packets to instruct the peer end to age MAC addresses. This function prevents a data interruption caused by asynchronous MAC addresses."
}