{
    "PageTitle": "ip urpf peer-based",
    "FuncDef": "The ip urpf peer-based command configures peer-based URPF on an interface.\nThe undo ip urpf command cancels peer-based URPF on an interface.\nBy default, peer-based URPF is not configured on an interface.",
    "CLIs": [
        "ip urpf peer-based peer-id <peer-id> [ statistics enable ]",
        "undo ip urpf [ peer-based peer-id <peer-id> [ statistics enable ] ]"
    ],
    "ParentView": [
        "Eth-Trunk sub-interface view",
        "Eth-Trunk interface view",
        "GE optical interface view",
        "GE electrical interface view",
        "IP-Trunk interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "peer-id peer-id",
            "Info": "Specifies a peer group ID.\nThe value is an integer ranging from 1 to 255."
        },
        {
            "Parameters": "statistics",
            "Info": "Indicates the statistics collecting function for peer-based URPF.\n-"
        },
        {
            "Parameters": "enable",
            "Info": "Enables the statistics collecting function for peer-based URPF.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] ip urpf peer-based peer-id 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nMany attacks on the network are initiated by virtual source addresses. You can configure peer-based URPF on the interfaces connected to the network border to effectively prevent source IP address spoofing attacks.\nAfter a peer group is bound to an interface and an IPv4/IPv6 data packet enters the device through the interface, the source IPv4/IPv6 address of the packet is matched against the routing table. If the source IPv4/IPv6 address matches a routing entry and the peer group ID in the routing entry is the same as that in the interface table, the packet passes the peer-based URPF check and is forwarded normally. Otherwise, the system considers the packet invalid and a source address spoofing attack occurs. In this case, the packet is discarded."
}