{
    "PageTitle": "ipv6 urpf peer-based",
    "FuncDef": "The ipv6 urpf peer-based command configures IPv6 peer-based URPF on an interface.\nThe undo ipv6 urpf command cancels IPv6 peer-based URPF on an interface.\nBy default, IPv6 peer-based URPF is not configured on an interface.",
    "CLIs": [
        "ipv6 urpf peer-based peer-id <peer-id> [ statistics enable ]",
        "undo ipv6 urpf [ peer-based peer-id <peer-id> [ statistics enable ] ]"
    ],
    "ParentView": [
        "Eth-Trunk sub-interface view",
        "Eth-Trunk interface view",
        "GE optical interface view",
        "GE electrical interface view",
        "IP-Trunk interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "peer-id peer-id",
            "Info": "Specifies an IPv6 peer group ID.\nThe value is an integer ranging from 1 to 255."
        },
        {
            "Parameters": "statistics",
            "Info": "Indicates the statistics collecting function for IPv6 peer-based URPF.\n-"
        },
        {
            "Parameters": "enable",
            "Info": "Enables the statistics collecting function for IPv6 peer-based URPF.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] ipv6 urpf peer-based peer-id 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nMany attacks on the network are initiated by virtual source IPv6 addresses. You can configure IPv6 peer-based URPF on the interfaces connected to the network border to effectively prevent source IPv6 address spoofing attacks.\nAfter a peer group is bound to an interface and an IPv6 data packet enters the device through the interface, the source IPv6 address of the packet is matched against the routing table. If the source IPv6 address matches a routing entry and the peer group ID in the routing entry is the same as that in the interface table, the packet passes the IPv6 peer-based URPF check and is forwarded normally. Otherwise, the system considers the packet invalid and that a source address spoofing attack occurs and discards the packet."
}