{
    "PageTitle": "policy-based-route",
    "FuncDef": "The policy-based-route command creates or modifies a PBR policy or node and displays the policy-based-route view.\nThe undo policy-based-route command deletes a PBR policy or node.\nBy default, no PBR policy or node is created.",
    "CLIs": [
        "policy-based-route <policy-name> permit node <node-id> [ map-instance <map-instance-id> ]",
        "undo policy-based-route <policy-name> permit node <node-id> [ map-instance <map-instance-id> ]",
        "undo policy-based-route <policy-name> permit"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "policy-name",
            "Info": "Specifies the name of a PBR policy.\nThe value is a string of 1 to 31 characters.\nA maximum of 100 policy-name can be configured."
        },
        {
            "Parameters": "permit",
            "Info": "Indicates the mode of a PBR node. This mode applies PBR to matching packets.\n-"
        },
        {
            "Parameters": "node node-id",
            "Info": "Specifies the ID of a PBR node. A smaller node-id indicates a higher PBR priority. The PBR policy with a higher priority is implemented preferentially.\nThe value is an integer ranging from 1 to 65534.A maximum of 200 PBR nodes can be configured."
        },
        {
            "Parameters": "map-instance map-instance-id",
            "Info": "Specifies the MIB object ID.\nThe value is an integer ranging from 1 to 65534.\nThe map-instance-id value must be the same as the node-id value, and they are the same by default."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] policy-based-route pbr1 permit node 1 map-instance 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nPBR is deployed in the scenario where users want specific traffic to be forwarded to a desired next hop. Each node in each traffic policy for PBR is configured with rules and an action. The action is redirecting matching IP packets to an outbound interface.\nIf the PBR policy or node specified in the policy-based-route command does not exist, the policy-based-route command creates it. If the PBR policy and node specified in the policy-based-route command exist, the policy-based-route command modifies them."
}