{
    "PageTitle": "loop-detect eth-loop alarm disable",
    "FuncDef": "The loop-detect eth-loop alarm disable command disables the global MAC hopping-based loop detection alarm function.\nThe undo loop-detect eth-loop alarm disable command restores the default configuration.\nBy default, the global MAC hopping-based loop detection alarm function is enabled.",
    "CLIs": [
        "loop-detect eth-loop alarm disable",
        "undo loop-detect eth-loop alarm disable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] loop-detect eth-loop alarm disable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nGenerally, redundant links are used on an Ethernet switching network to provide link backup and enhance network reliability. The use of redundant links, however, may produce loops and cause broadcast storms and MAC address hopping. As a result, the communication quality deteriorates, and communication may even be interrupted. To resolve the loop problem, the global MAC hopping-based loop detection alarm function must be configured.\nBy default, the global MAC hopping-based loop detection alarm function is enabled. You can run the loop-detect eth-loop loop-times detect-cycle cycles alarm-only command to configure loop detection alarm parameters and run the loop-detect eth-loop alarm disable command to disable the global MAC hopping-based loop detection alarm function.\nConfiguration Impact\nThe loop-detect eth-loop alarm disable command takes effect on all forwarding domains. However, if a forwarding domain has had the MAC flapping-based loop detection alarm function configured, this configuration takes precedence over that configured in the system view. For example, if the MAC flapping-based loop detection alarm function has been configured in the VSI view, this function takes effect, irrespective of whether this function is configured in the system view.\nPrecautions\nThis command is supported only on the admin VS."
}