{
    "PageTitle": "mac-address",
    "FuncDef": "The mac-address command configures a MAC address for an interface.\nThe undo mac-address command restores the default MAC address of an interface.\n\nBy default, the MAC address of the interface is the system MAC address.",
    "CLIs": [
        "mac-address <mac-address>",
        "undo mac-address"
    ],
    "ParentView": [
        "PW-VE interface view",
        "PW-VE sub-interface view",
        "40GE interface view",
        "Port extension interface view",
        "GE electrical interface view",
        "Eth-Trunk sub-interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "VE interface view",
        "Global VE interface view",
        "GE sub-interface view",
        "VBDIF interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "GE interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "100ge sub-interface view",
        "25GE interface view",
        "40GE sub-interface view",
        "Eth-Trunk interface view",
        "10GE sub-interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "mac-address",
            "Info": "Specifies the MAC address of the interface.\nThe value is in the format of H-H-H. Each H is a 4-digit hexadecimal number, such as 00e0 or fc01. If an H contains less than four bits, 0 is padded ahead. For example, if e0 is entered, it is equal to 00e0. A MAC address cannot be set to all 0s or all 1s."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface eth-trunk 1",
            "[*HUAWEI-Eth-Trunk1] mac-address 00e0-fc12-3456"
        ]
    ],
    "ExtraInfo": "Usage Scenario\n\nTo ensure the normal transmission of service data flows, run the mac-address command to configure the MAC address of the interface based on users' requirements.\n\nPrerequisites\n\nRun either of the following commands to configure the Ethernet sub-interface before running the mac-address command.\n\nTo configure the Ethernet sub-interface as a Dot1q sub-interface, run the vlan-type dot1q command.\nTo configure the Ethernet sub-interface as a Dot1q VLAN tag termination sub-interface, run the dot1q termination vid command.\nTo configure the Ethernet sub-interface as a QinQ VLAN tag termination sub-interface, run the qinq termination pe-vid ce-vid command.\n\n\nConfiguration Impact\n\nAfter the MAC address of an interface is changed, the device sends gratuitous ARP packets to update the mapping relationship between MAC addresses and interfaces."
}