{
    "PageTitle": "mac-limit vlan rule-name",
    "FuncDef": "The mac-limit vlan rule-name command applies a global MAC address learning limit rule to a VLAN to which the specified interface belongs.\nThe undo mac-limit vlan rule-name command deletes a global MAC address learning limit rule applied to a VLAN to which the specified interface belongs.\nBy default, no global MAC address learning limit rule is applied to any VLAN to which the specified interface belongs.",
    "CLIs": [
        "mac-limit vlan <vlan-id1> [ to <vlan-id2> ] rule-name <rule-name>"
    ],
    "ParentView": [
        "Layer 2 40GE interface view",
        "Layer 2 10GE interface view",
        "Layer 2 GE interface view",
        "Layer 2 100GE interface view",
        "Layer 2 50|100GE interface view",
        "Layer 2 50GE interface view",
        "Eth-Trunk interface view",
        "25GE-L2 view",
        "Port extension Layer 2 interface view",
        "400GE-L2 view"
    ],
    "ParaDef": [
        {
            "Parameters": "vlan-id1",
            "Info": "Specifies the VLAN ID associated with an Ethernet sub-interface.\nIf the vlanBegin [ to vlanEnd ] parameters are run more than once, all configurations take effect.\nThis parameter is only supported on Layer 2 interfaces.\nThe value is an integer ranging from 1 to 4094."
        },
        {
            "Parameters": "to vlan-id2",
            "Info": "Specifies the VLAN ID associated with an Ethernet sub-interface.\nIf the vlanBegin [ to vlanEnd ] parameters are run more than once, all configurations take effect.\nThis parameter is only supported on Layer 2 interfaces.\nThe value is an integer ranging from 1 to 4094."
        },
        {
            "Parameters": "rule-name",
            "Info": "Specifies the name of a global MAC address learning limit rule.\nThe value is a string of 1 to 31 characters. It does not support space, question mark, or subtraction sign."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mac-limit rule-name name1 maximum 10000 rate 100 alarm enable",
            "[*HUAWEI] interface GigabitEthernet2/0/1",
            "[*HUAWEI-GigabitEthernet2/0/1] portswitch",
            "[*HUAWEI-GigabitEthernet2/0/1] port trunk allow-pass vlan 10",
            "[*HUAWEI-GigabitEthernet2/0/1] mac-limit vlan 10 rule-name name1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo control the number of users and protect a MAC address table against attacks, you can limit the number of MAC addresses that a device can learn. You can also configure the system to discard packets or generate an alarm to improve network security.\nTo apply a global MAC address learning limit rule to a VLAN to which the specified interface belongs, you can use the mac-limit vlan rule-name command in the interface view.\nPrecautions\nEthernet interfaces, GE interfaces, and Eth-Trunk interfaces must be Layer 2 interfaces."
}