{
    "PageTitle": "mac-limit (VSI-LDP-PW view)",
    "FuncDef": "The mac-limit command configures a MAC address learning limit rule for the current VSI.\nThe undo mac-limit command deletes a MAC address learning limit rule configured for the current VSI.\nBy default, no MAC address learning limit rule is configured for the current VSI.",
    "CLIs": [
        "mac-limit { maximum <maxValue> [ rate <interval> ] | action { discard | forward } | alarm { enable | disable } } *",
        "undo mac-limit"
    ],
    "ParentView": [
        "VSI-LDP-PW view"
    ],
    "ParaDef": [
        {
            "Parameters": "maximum maxValue",
            "Info": "Specifies the maximum number of MAC address that can be learned.\nThe value is an integer ranging from 0 to 130048.\nWhen the value is 0, no limitation is set on the address learning number."
        },
        {
            "Parameters": "rate interval",
            "Info": "Indicates the interval at which MAC addresses are learned.\nThe parameter must be configured when configuring the global MAC address learning limit rule.\nThe value is an integer ranging from 0 to 1000, in milliseconds.\nWhen the value is 0, no limitation is set on the address learning interval."
        },
        {
            "Parameters": "action",
            "Info": "Specifies an action to be taken when the number of MAC address entries in the MAC address table reaches the limit.\n-"
        },
        {
            "Parameters": "discard",
            "Info": "The packet with the source MAC address not contained in the MAC address table is discarded.\n-"
        },
        {
            "Parameters": "forward",
            "Info": "The packet with the source MAC address not contained in the MAC address table is forwarded but its MAC address is not recorded.\n-"
        },
        {
            "Parameters": "alarm",
            "Info": "Specifies whether an alarm is generated when the number of the MAC address entries in the MAC address table reaches the limit.\n-"
        },
        {
            "Parameters": "enable",
            "Info": "An alarm is generated.\n-"
        },
        {
            "Parameters": "disable",
            "Info": "No alarm is generated.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] vsi huawei",
            "[*HUAWEI-vsi-huawei] pwsignal ldp",
            "[*HUAWEI-vsi-huawei-ldp] vsi-id 100",
            "[*HUAWEI-vsi-huawei-ldp] peer 192.168.1.1",
            "[*HUAWEI-vsi-huawei-ldp] peer 192.168.1.1 pw pw1",
            "[*HUAWEI-vsi-huawei-ldp-pw-pw1] mac-limit action forward maximum 500"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo control the number of users and protect the MAC address table against attacks, you can limit the number of MAC addresses that can be learned by a device. You can also configure the system to discard packets to improve network security.\nConfiguring a MAC address learning limit rule for the current VSI controls the number of users in the current VSI. When the number of MAC addresses learned in the current VSI reaches the limit, no new MAC addresses can be learned. You can also configure the system to discard packets to prevent MAC address attacks to improve network security.\nConfiguration Impact\nTrustworthy MAC addresses may not be recorded after the number of learned MAC addresses reaches the limit. If an enterprise or a family is attacked by different source MAC addresses, only the network of the enterprise or family, not the whole network is affected.\nPrecautions\nMAC address limitation is not supported on VE interfaces.\nBefore configuring a MAC address learning limit rule, run the reset mac-address command to clear the learned MAC addresses to ensure that the number of MAC addresses that can be learned is limited accurately."
}