{
    "PageTitle": "mac-limit rule-name",
    "FuncDef": "The mac-limit rule-name command applies a global MAC address learning limit rule on an interface.\nThe undo mac-limit rule-name command deletes a global MAC address learning limit rule applied on an interface.\nBy default, no global MAC address learning limit rule is applied on an interface.",
    "CLIs": [
        "mac-limit rule-name <rule-name>"
    ],
    "ParentView": [
        "Layer 2 40GE interface view",
        "Layer 2 10GE interface view",
        "Layer 2 GE interface view",
        "Layer 2 100GE interface view",
        "Layer 2 50|100GE interface view",
        "Layer 2 50GE interface view",
        "Eth-Trunk interface view",
        "25GE-L2 view",
        "Port extension Layer 2 interface view",
        "400GE-L2 view"
    ],
    "ParaDef": [
        {
            "Parameters": "rule-name",
            "Info": "Specifies the name of a global MAC address learning limit rule.\nThe value is a string of 1 to 31 characters. It does not support space, question mark, or subtraction sign."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mac-limit rule-name name1 maximum 10000 rate 100 alarm enable",
            "[*HUAWEI] interface GigabitEthernet2/0/1",
            "[*HUAWEI-GigabitEthernet2/0/1] portswitch",
            "[*HUAWEI-GigabitEthernet2/0/1] mac-limit rule-name name1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo control the number of users and protect a MAC address table against attacks, you can limit the number of MAC addresses that a device can learn. You can also configure the system to discard packets or generate an alarm to improve network security.\nTo apply a global MAC address learning limit rule on an interface, run the mac-limit rule-name command in the interface view.\nPrerequisites\nThe specified global MAC address learning limit rule must have been configured using the mac-limit rule-name (system view) command.\nConfiguration Impact\nIf a global MAC address learning limit rule has been applied on an interface, another MAC address learning rule cannot be configured on the interface using the mac-limit command.\nPrecautions\nGE interface, and Eth-Trunk interface must be Layer 2 interfaces."
}