{
    "PageTitle": "display mac-limit rule-name",
    "FuncDef": "The display mac-limit rule-name command displays detailed information about a global MAC address learning limit rule.",
    "CLIs": [
        "display mac-limit rule-name [ rule-name ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "rule-name",
            "Info": "Displays detailed information about the specified global MAC address learning limit rule.\nThe value is a string of 1 to 31 characters.It does not support space, question mark, or subtraction sign."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display mac-limit rule-name name1",
            "Total Global MAC Limit rule count : 1 ",
            "RuleName      Maximum  Rate(ms)  Action    Alarm   PortNum  Port          Vlan ",
            "-------------------------------------------------------------------------------",
            "name1         100      21        discard   enable  6      ",
            "                                                           Eth-Trunk2.1   -    ",
            "                                                           GE1/0/1.1      -    ",
            "                                                           GE1/0/2.1      -    ",
            "                                                           GE1/0/3.1      -    ",
            "                                                           GE1/0/4.1      -    ",
            "                                                           GE1/0/5.1      -"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter a global MAC address learning limit rule is created using the mac-limit rule-name (system view) command, you can use the display mac-limit rule-name command to view detailed information about the global MAC address learning limit rule.After a global MAC address learning limit rule is applied on an interface using the mac-limit rule-name(interface view) or the mac-limit vlan rule-name command, you can run the display mac-limit rule-name command to view detailed information about the global MAC address learning limit rule which has taken effect on the interface.\n\nPrecautions\nIf a global MAC address learning limit rule is not applied on an interface, no content is displayed in the Port and VLAN fields when the display mac-limit rule-name command is run.\nThe MAC address learning limit rule configured by the mac-limit (interface view) command in the interface view or the mac-limit (VLAN view) command in the VLAN view will not be displayed when the display mac-limit rule-name command is run."
}