{
    "PageTitle": "display mac-address dynamic",
    "FuncDef": "The display mac-address dynamic command displays information about dynamic MAC address entries.",
    "CLIs": [
        "display mac-address dynamic [ ineffective ] { [ source-slot <slot-id2> ] | [ slot <slot-id1> ] [ interface { <interface-type> <interface-number> | <interface-name> } ] [ ce-vlan ] } [ verbose | last-change ]",
        "display mac-address dynamic [ ineffective ] ap-id <ap-id> [ last-change ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "ineffective",
            "Info": "Displays information about dynamic MAC address entries of ineffective.\n-"
        },
        {
            "Parameters": "source-slot slot-id2",
            "Info": "Displays dynamic MAC address entries on the board on which the specified outbound interface resides.\n-"
        },
        {
            "Parameters": "slot slot-id1",
            "Info": "Displays dynamic MAC address entries on a specified board.\nIf no slot is specified, dynamic MAC address entries on all boards are displayed.\n-"
        },
        {
            "Parameters": "interface interface-name",
            "Info": "Specifies the interface name.\n-"
        },
        {
            "Parameters": "interface-type",
            "Info": "Specifies the interface type.\n-"
        },
        {
            "Parameters": "interface-number",
            "Info": "Specifies the interface number.\n-"
        },
        {
            "Parameters": "ce-vlan",
            "Info": "Displays the inner tag carried in the packets received by the QinQ stacking sub-interface.\n-"
        },
        {
            "Parameters": "verbose",
            "Info": "Displays detailed information about dynamic MAC address entries.\n-"
        },
        {
            "Parameters": "last-change",
            "Info": "Displays the date and time when MAC address entries are last updated.\n-"
        },
        {
            "Parameters": "ap-id ap-id",
            "Info": "Displays dynamic MAC address entries of a specified AP.\nThe value is an integer ranging from 1024 to 8191."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display mac-address dynamic interface GigabitEthernet3/0/1",
            "MAC address table of slot GigabitEthernet3/0/1:",
            "-------------------------------------------------------------------------------",
            "MAC Address    VLAN/       PEVLAN CEVLAN Port/Peerip     Type      LSP/LSR-ID",
            "               VSI/SI/EVPN                                         MAC-Tunnel",
            "-------------------------------------------------------------------------------",
            "00e0-fc12-3460 1           -      -      GE3/0/1         dynamic   -",
            "-------------------------------------------------------------------------------",
            "Total matching items on slot 1 displayed = 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA MAC address table is an interface-based Layer 2 forwarding table. It stores information about MAC addresses learned by a device. A MAC address entry contains a MAC address, an interface on which a packet is forwarded to this MAC address, and a VLAN to which the specified interface belongs or a VSI to which the specified interface is bound. Before forwarding a packet, the device searches the MAC address table based on the destination MAC address of the packet and locate the outbound interface quickly. This facilitates packet forwarding and reduces broadcast traffic.\nDynamic MAC address entries: obtained by a device through source MAC address learning and will be aged based on the aging time.\nA MAC address table needs to be updated constantly to meet requirements for network changes. To view information about dynamic MAC address entries learned by a device, run the display mac-address dynamic command.\nPrerequisites\nMAC address learning has been enabled on a device.\nIf MAC address learning is disabled on a device, run the undo mac-address learning disable command in the VLAN view to enable MAC address learning.\nPrecautions\nIf a device has learned a large number of dynamic MAC addresses, specifying parameters, such as interface, in the display mac-address dynamic command is recommended; otherwise, excessive output information causes the following problems:\nThe displayed information is repeatedly refreshed, and required information cannot be obtained.The system does not respond because of long-time information traversing and searching.\n\nIf the outbound interface is a port extension interface, a user can not run the display mac-address dynamic slot slot-id command to view dynamic MAC address entries on the board on which the specified outbound interface resides."
}