{
    "PageTitle": "display mac-address dynamic vsi interface pe-vlan ce-vlan",
    "FuncDef": "The display mac-address command displays address entries.\nIf no parameter is specified, all MAC address entries on the interface board are displayed.\nThe display mac-address pbb command displays the relationship between the backbone MAC address and user MAC address.",
    "CLIs": [
        "display mac-address dynamic [ ineffective ] vsi <vsi-name> interface { <interface-type> <interface-number> | <interface-name> } pe-vlan <pe-vid> ce-vlan <ce-id> [ last-change ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "ineffective",
            "Info": "Specifies a MAC address.\n-"
        },
        {
            "Parameters": "vsi vsi-name",
            "Info": "Displays the MAC address entries in a specified Virtual Switching Instance (VSI).\nThe value is a string of 1 to 31 case-sensitive characters, spaces and question marks are not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "interface interface-type interface-number",
            "Info": "Displays the MAC address entries on a specified interface.\nIf no interface is specified, the MAC address entries on all interfaces in this VLAN are displayed.\n-"
        },
        {
            "Parameters": "pe-vlan pe-vid",
            "Info": "Displays the outer tag carried in the packets received by the QinQ stacking sub-interface.\nThe value is an integer ranging from 1 to 4094."
        },
        {
            "Parameters": "ce-vlan ce-id",
            "Info": "Displays the inner tag carried in the packets received by the QinQ stacking sub-interface.\nThe value is an integer ranging from 1 to 4094."
        },
        {
            "Parameters": "last-change",
            "Info": "Indicates the time when dynamic black-hole MAC entries were last updated.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display mac-address dynamic vsi v interface GigabitEthernet 1/0/0.2 pe-vlan 88 ce-vlan 100",
            "MAC address table of slot 1:",
            "-------------------------------------------------------------------------------",
            "MAC Address    VLAN/BD/    PEVLAN CEVLAN Port            Type      LSP/LSR-ID",
            "               VSI/SI                                              MAC-Tunnel",
            "-------------------------------------------------------------------------------",
            "0010-9400-0002 v           *88    100    GE1/0/0.2       dynamic   16/16448    ",
            "-------------------------------------------------------------------------------",
            "Total matching items on slot 1 displayed = 1"
        ]
    ],
    "ExtraInfo": "The MAC address table is a Port-based Layer 2 forwarding table. It stores the MAC addresses of other devices learned by the device, including: Mac address, port associated with the MAC address, VLAN ID to which the specified port belongs, or bound VSI. When forwarding data, the device queries the MAC address table based on the destination MAC address in the packet to quickly locate the outbound interface, reducing broadcast traffic."
}