{
    "PageTitle": "mac-address phy-port synchronize (slot view)",
    "FuncDef": "The mac-address phy-port synchronize enable command enables immediate MAC address synchronization on physical interfaces.\nThe undo mac-address phy-port synchronize command disables this function.\nBy default, immediate MAC address synchronization is disabled on physical interfaces.",
    "CLIs": [
        "mac-address phy-port synchronize enable",
        "undo mac-address phy-port synchronize"
    ],
    "ParentView": [
        "Slot view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] slot 1",
            "[~HUAWEI-slot-1] mac-address phy-port synchronize enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, MAC addresses are not synchronized on physical interfaces. If a device has both logical and physical interfaces and the outbound interface for uplink traffic with the same source MAC address alternates between an Eth-Trunk interface (a logical interface) and a physical interface, the physical interface cannot learn correct MAC address entries, resulting in a traffic forwarding failure. To resolve this problem, run the mac-address phy-port synchronize enable command to enable immediate MAC address synchronization on physical interfaces.\nThe mac-address phy-port synchronize enable command configuration in the slot view and system view function the same, but the mac-address phy-port synchronize enable configuration in the slot view can resolve the broadcast packet loss problem when MAC flapping is configured.\nIn the slot view, the mac-address phy-port synchronize enable command can be run only in admin VS and takes effect for both admin VS and other VSs.\nConfiguration Impact\nAfter this command is configured, if a Layer 2 loop occurs, there is a possibility that CPU usage is high. You can enable MAC flapping-based loop detection to prevent high CPU usage.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}