{
    "PageTitle": "vxlan vni",
    "FuncDef": "The vxlan vni command creates a VXLAN network identifier (VNI) and binds it to a BD.\nThe undo vxlan vni command unbinds a VNI from a BD.\nBy default, no VNI is created.",
    "CLIs": [
        "vxlan vni <vni-id> [ split-horizon-mode ]",
        "undo vxlan vni <vni-id> [ split-horizon-mode ]"
    ],
    "ParentView": [
        "Bridge domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "vni-id",
            "Info": "Specifies a VNI ID.\nThe value is an integer ranging from 1 to 16777215."
        },
        {
            "Parameters": "split-horizon-mode",
            "Info": "Specifies split horizon for packet forwarding.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bridge-domain 10",
            "[*HUAWEI-bd10] vxlan vni 5000 split-horizon-mode"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA virtual network (VN) on a VXLAN is a virtual broadcast domain. To allow a BD to function as a VXLAN network entity to transmit VXLAN traffic, run the vxlan vni command to map a VNI to a BD.\nWhen a VXLAN network and a VPLS network intersect, to allow internetworking, run the vxlan vni split-horizon-mode command on the edge devices at the intersection of the two networks to create a VNI and bind it to a BD, and configure split horizon for packet forwarding.\nPrecautions\nRestrictions for connection between the VXLAN and EVPN MPLS are as follows:\nIn a BD, the BD can be bound to the VNI and BD EVPN at the same time.Each VNI can be added to only one BD, and each BD can be associated with only one VNI.Only 1:1 non BD Tag mode is supported to access the EVPN.EVC sub-interfaces are not supported to access the VXLAN or EVPN.VXLAN tunnels and EVPNs do not support dynamic MAC address learning. They advertise and receive MAC address routes through BGP.Tunnel-side broadcast, multicast, and unknown unicast are supported for VXLANs. The device replicates packets based on VNI+peer statistics."
}