{
    "PageTitle": "display vxlan statistics l3-mode",
    "FuncDef": "The display vxlan statistics l3-mode command displays Layer 3 VXLAN traffic statistics.",
    "CLIs": [
        "display vxlan statistics l3-mode source <source-ip> peer <peer-ip> local-vni <vni-id>",
        "display vxlan statistics l3-mode source <source-ip> peer <peer-ip> remote-vni <vni-id>"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "peer peer-ip",
            "Info": "Displays statistics about Layer 3 VXLAN traffic with a specified peer VTEP IP address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "local-vni",
            "Info": "Displays statistics about Layer 3 VXLAN traffic with a local VNI.\n-"
        },
        {
            "Parameters": "vni-id",
            "Info": "Specifies the value of VNI ID.\nThe value is an integer ranging from 1 to 16777215."
        },
        {
            "Parameters": "source source-ip",
            "Info": "Displays statistics about Layer 3 VXLAN traffic with a specified source VTEP IP address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "remote-vni",
            "Info": "Displays statistics about Layer 3 VXLAN traffic with a remote VNI.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display vxlan statistics l3-mode source 1.1.1.1 peer 2.2.2.2 local-vni 1",
            "1195 packets input, 121890 bytes ",
            "Input:0 unicast, 0 multicast ",
            "1195 broadcast ",
            "0 unknown-unicast-drops ",
            "0 unknown-multicast-drops ",
            "0 broadcast-drops"
        ],
        [
            "<HUAWEI> display vxlan statistics l3-mode source 1.1.1.1 peer 1.1.1.2 remote-vni 1",
            "6948 packets output, 708696 bytes ",
            "Output:0 unicast, 0 multicast ",
            "6948 broadcast"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter Layer 3 VXLAN statistics collection is enabled using the vxlan statistics l3-mode enable command run in the NVE interface view, you can run the display vxlan statistics l3-mode command to check the statistics collected by VNI and VXLAN tunnel.\nIf you want to check the upstream traffic statistics, specify local-vni. If you want to check the downstream traffic statistics, specify remote-vni."
}