{
    "PageTitle": "peer advertise encap-type (BGP-EVPN address family view)",
    "FuncDef": "The peer advertise encap-type command configures the encapsulation attribute carried by EVPN routes advertised to peer group.\nThe undo peer advertise encap-type command restores the default configuration.\nBy default, a device advertises EVPN routes that carry the MPLS encapsulation attribute to the peer group.",
    "CLIs": [
        "peer <group-name> advertise encap-type { vxlan | srv6 }",
        "undo peer <group-name> advertise encap-type { vxlan | srv6 }"
    ],
    "ParentView": [
        "BGP-EVPN address family view"
    ],
    "ParaDef": [
        {
            "Parameters": "group-name",
            "Info": "Specifies the name of a peer group.\nThe name is a string of 1 to 47 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "vxlan",
            "Info": "Specifies EVPN routes carrying the VXLAN encapsulation attribute.\n-"
        },
        {
            "Parameters": "srv6",
            "Info": "Specifies EVPN routes carrying the SRv6 encapsulation attribute.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] group gp1",
            "[*HUAWEI-bgp] peer 1.1.1.1 group gp1",
            "[*HUAWEI-bgp] peer 2.2.2.2 group gp1",
            "[*HUAWEI-bgp] l2vpn-family evpn",
            "[*HUAWEI-bgp-af-evpn] peer gp1 enable",
            "[*HUAWEI-bgp-af-evpn] peer gp1 advertise encap-type vxlan"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bgp 100",
            "[*HUAWEI-bgp] group gp1",
            "[*HUAWEI-bgp] peer 2001:db8:1::1 group gp1",
            "[*HUAWEI-bgp] peer 2001:db8:2::2 group gp1",
            "[*HUAWEI-bgp] l2vpn-family evpn",
            "[*HUAWEI-bgp-af-evpn] peer gp1 enable",
            "[*HUAWEI-bgp-af-evpn] peer gp1 advertise encap-type srv6"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, BGP EVPN peers advertise the EVPN routes carrying the MPLS encapsulation attribute to each other. To allow EVPN peers to advertise EVPN routes carrying the SRv6 encapsulation attribute to each other in EVPN VPWS over SRv6 scenarios, run the peer advertise encap-type srv6 command.\nOn a BGP EVPN, a device can advertise EVPN routes that carry the VXLAN or MPLS encapsulation attribute to its peers. To enable a device to advertise EVPN routes that carry the VXLAN encapsulation attribute to its peers in distributed or centralized VXLAN gateway scenarios, run the peer advertise encap-type vxlan command."
}