{
    "PageTitle": "vni head-end peer-list (NVE interface view) (ipv6)",
    "FuncDef": "The vni head-end peer-list command configures an ingress replication list that contains the IP addresses of those remote VTEPs for a VXLAN network identifier (VNI).\nThe undo vni head-end peer-list command deletes the ingress replication list of a VNI.\nBy default, no ingress replication list is configured for any VNI.",
    "CLIs": [
        "vni <vni-id> head-end peer-list { <ipv6-address> } &<1-10>",
        "undo vni <vni-id> head-end peer-list { <ipv6-address> } &<1-10>"
    ],
    "ParentView": [
        "NVE interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "vni-id",
            "Info": "Specifies a VNI ID.\nThe value is an integer ranging from 1 to 16777215."
        },
        {
            "Parameters": "ipv6-address",
            "Info": "Specifies an IPv6 address for a remote VTEP.\nThe address is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface nve 1",
            "[*HUAWEI-Nve1] vni 5020 head-end peer-list 2001:db8:1::1 2001:db8:1::2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter the ingress of a VXLAN tunnel receives broadcast, unknown unicast, and multicast (BUM) packets, it replicates these packets and sends a copy to each VTEP in the ingress replication list. The ingress replication list is a collection of remote VTEP IP addresses to which the ingress of a VXLAN tunnel should send replicated BUM packets.\nIf an underlay network is an IPv6 network, run the vni head-end peer-list (IPv6) command to configure an ingress replication list that contains IPv6 addresses of remote VTEPs, which is used to forward BUM traffic.\nConfiguration Impact\nIngress replication allows BUM packets to be transmitted in broadcast mode, independent of multicast routing protocols.\nPrecautions\nEven if a source VTEP connects only to one remote IPv6 VTEP, you still need to run the vni head-end peer-list (IPv6) command to configure an ingress replication list with the remote VTEP's IP address specified."
}