{
    "PageTitle": "vni head-end peer-list protocol bgp",
    "FuncDef": "The vni head-end peer-list protocol bgp command configures a dynamic ingress replication list generated by the BGP protocol that contains the IP addresses of those remote VTEPs for a VXLAN network identifier (VNI).\nThe undo vni head-end peer-list protocol bgp command cancels the configuration.\nBy default, no ingress replication list is configured for any VNI.",
    "CLIs": [
        "vni <vni-id> head-end peer-list protocol bgp",
        "undo vni <vni-id> head-end peer-list protocol bgp"
    ],
    "ParentView": [
        "NVE interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "vni-id",
            "Info": "Specifies a VNI ID.\nThe value is an integer ranging from 1 to 16777215."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface nve 1",
            "[*HUAWEI-Nve1] vni 5010 head-end peer-list protocol bgp"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter the ingress of a VXLAN tunnel receives broadcast, unknown unicast, and multicast (BUM) packets, it replicates these packets and sends a copy to each VTEP in the ingress replication list. The ingress replication list is a collection of remote VTEP IP addresses to which the ingress of a VXLAN tunnel should send replicated BUM packets.\nIf a source VTEP on a VXLAN connects to multiple remote VTEPs on the same VXLAN segment, run the vni head-end peer-list command to configure an ingress replication list that contains the IP addresses of those remote VTEPs. After the source NVE receives BUM packets, the local VTEP sends a copy of the BUM packets to every VTEP in the list. To use BGP to dynamically establish Layer 2 VXLAN tunnels, run the vni head-end peer-list protocol bgp command.\nConfiguration Impact\nIngress replication allows BUM packets to be transmitted in broadcast mode, independent of multicast routing protocols.\nPrecautions\nIf other configurations are performed for the same VNI on the current NVE interface, the command configuration will be overwritten.\nBUM packet forwarding is implemented only using ingress replication. To establish a VXLAN tunnel between a Huawei device and a non-Huawei device, ensure that the non-Huawei device also has ingress replication configured. Otherwise, communication fails."
}