{
    "PageTitle": "vxlan statistics l3-mode enable",
    "FuncDef": "The vxlan statistics l3-mode enable command enables Layer 3 traffic statistics collection by VNI and VXLAN tunnel.\nThe undo vxlan statistics l3-mode enable command disables Layer 3 traffic statistics collection by VNI and VXLAN tunnel.\nBy default, Layer 3 traffic statistics collection by VNI and VXLAN tunnel is disabled.",
    "CLIs": [
        "vxlan statistics l3-mode peer <peer-ip> vni <vni-id> inbound enable",
        "vxlan statistics l3-mode peer <peer-ip> [ vni <vni-id> ] outbound enable",
        "undo vxlan statistics l3-mode peer <peer-ip> vni <vni-id> inbound enable",
        "undo vxlan statistics l3-mode peer <peer-ip> [ vni <vni-id> ] outbound enable"
    ],
    "ParentView": [
        "NVE interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "vni vni-id",
            "Info": "Specifies a VNI for which Layer 3 VXLAN traffic statistics collection is enabled or disabled.\nThe value is an integer ranging from 1 to 16777215."
        },
        {
            "Parameters": "inbound",
            "Info": "Enables or disables Layer 3 upstream traffic statistics collection by VNI and VXLAN tunnel.\n-"
        },
        {
            "Parameters": "peer peer-ip",
            "Info": "Specifies the IP address of a peer VTEP for which Layer 3 VXLAN traffic statistics collection is enabled or disabled.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "outbound",
            "Info": "Enables or disables Layer 3 downstream traffic statistics collection by VNI and VXLAN tunnel.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface nve 1",
            "[*HUAWEI-Nve1] source 1.1.1.1",
            "[*HUAWEI-Nve1] vni 1 head-end peer-list 1.1.1.2",
            "[*HUAWEI-Nve1] vxlan statistics l3-mode peer 1.1.1.2 vni 1 inbound enable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface nve 1",
            "[*HUAWEI-Nve1] source 1.1.1.1",
            "[*HUAWEI-Nve1] vni 1 head-end peer-list 2.2.2.2",
            "[*HUAWEI-Nve1] vxlan statistics l3-mode peer 2.2.2.2 outbound enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBefore checking the statistics about sent or received Layer 3 traffic collected by VNI and VXLAN tunnel for problem locating, run the vxlan statistics l3-mode enable command in the NVE interface view to enable upstream and downstream Layer 3 traffic statistics collection by VNI and VXLAN tunnel. If you do not run the vxlan statistics l3-mode enable command, VXLAN statistics cannot be obtained.\nPrecautions\nThe vxlan statistics l3-mode enable and statistic enable (VNI view) commands are mutually exclusive.\nIf you run the undo vxlan statistics l3-mode enable command, Layer 3 VXLAN traffic statistics will be cleared and cannot restore. Therefore, exercise caution when running this command."
}