{
    "PageTitle": "vxlan statistics enable",
    "FuncDef": "The vxlan statistics enable command enables the function of collecting VXLAN packet statistics based on the VNI and VXLAN tunnel.\nThe undo vxlan statistics enable command disables the function of collecting VXLAN packet statistics based on the VNI and VXLAN tunnel.\nBy default, the function of collecting VXLAN packet statistics based on the VNI and VXLAN tunnel is disabled.",
    "CLIs": [
        "vxlan statistics peer <peer-ip> vni <vni-id> inbound enable",
        "vxlan statistics peer <peer-ip> vni <vni-id> outbound enable",
        "vxlan statistics peer <peer-ip> vni <vni-id> enable",
        "undo vxlan statistics peer <peer-ip> vni <vni-id> inbound enable",
        "undo vxlan statistics peer <peer-ip> vni <vni-id> outbound enable",
        "undo vxlan statistics peer <peer-ip> vni <vni-id> enable"
    ],
    "ParentView": [
        "NVE interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "vni vni-id",
            "Info": "Enables VXLAN packets statistics collection based on a specified VNI ID.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "inbound",
            "Info": "Collects VXLAN packet statistics for upstream traffic.\n-"
        },
        {
            "Parameters": "peer peer-ip",
            "Info": "Enables VXLAN packet statistics collection based on the IP address of the peer VTEP.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "outbound",
            "Info": "Collects VXLAN packet statistics for downstream traffic.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface nve 1",
            "[*HUAWEI-Nve1] source 1.1.1.1",
            "[*HUAWEI-Nve1] vni 1 head-end peer-list 1.1.1.2",
            "[*HUAWEI-Nve1] vxlan statistics peer 1.1.1.2 vni 1 enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, VXLAN traffic statistics collection is disabled. To enable the VXLAN traffic statistics collection function based on a VNI ID and VXLAN tunnel, run the vxlan statistics enable command. If the function of collecting VXLAN packet statistics is disabled, you cannot obtain the statistics."
}