{
    "PageTitle": "import route-policy evpn",
    "FuncDef": "The import route-policy evpn command associates the VPN instance IPv4/IPv6 address family of a VPN instance with an import routing policy to filter routes imported from the EVPN.\nThe undo import route-policy evpn command dissociates the VPN instance IPv4/IPv6 address family of a VPN instance with an import routing policy.\nBy default, the VPN instance IPv4/IPv6 address family of a VPN instance is not associated with any import routing policy.",
    "CLIs": [
        "import route-policy <policy-name> evpn",
        "undo import route-policy <policy-name> evpn"
    ],
    "ParentView": [
        "VPN instance IPv4 address family view",
        "VPN instance IPv6 address family view",
        "VPN instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "policy-name",
            "Info": "Specifies the name of a routing policy.\nThe name is a string of 1 to 200 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] route-policy policy-1 permit node 10",
            "[*HUAWEI-route-policy] apply extcommunity color 0:100",
            "[*HUAWEI-route-policy] quit",
            "[*HUAWEI] ip vpn-instance vrf1",
            "[*HUAWEI-vpn-instance-vrf1] ipv4-family",
            "[*HUAWEI-vpn-instance-vrf1-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-vrf1-af-ipv4] import route-policy policy-1 evpn"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, the VPN instance IPv4/IPv6 address family of a VPN instance matches the export VPN targets of received routes against its import VPN targets to determine whether to import these routes. To control route import more precisely, run the import route-policy evpn command to associate the VPN IPv4/IPv6 address family with an import routing policy and set attributes for eligible routes.\nPrerequisites\nAn RD has been configured for the VPN instance IPv4/IPv6 address family using the route-distinguisher command.\nConfiguration Impact\nIf the command is run more than once, the latest configuration overrides the previous one.\nThe import routing policy configured using the import route-policy evpn command does not affect the import routing policy applied to the VPN instance using the import route-policy command.\nPrecautions\nIf the specified routing policy does not exist, run the route-policy command to create the routing policy."
}