{
    "PageTitle": "display fib slot statistics",
    "FuncDef": "The display fib slot statistics command displays IPv4 FIB statistics on a specified interface board.",
    "CLIs": [
        "display fib slot <slotid> [ vpn-instance <vpnname> ] statistics",
        "display fib slot <slotid> statistics all"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "slotid",
            "Info": "Displays IPv4 FIB entries based on the slot ID.\nThe maximum number of IPv4 FIB entries that can be displayed using this command depends on board specifications. Given that the maximum number of IPv4 FIB entries displayed is within board specifications, the number of IPv4 FIB entries displayed on the interface board on each slot is the same.\n-"
        },
        {
            "Parameters": "vpn-instance vpnname",
            "Info": "Displays private IPv4 FIB statistics based on the VPN.\nIf no VPN instance name is specified, public IPv4 FIB entries are displayed.\nThe value is a string of 1 to 31 case-sensitive characters."
        },
        {
            "Parameters": "all",
            "Info": "Displays IPv4 FIB entries on all interface boards.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display fib slot 1 statistics",
            "Route Entry Count : 6"
        ],
        [
            "<HUAWEI> display fib slot 1 vpn-instance vpna statistics",
            "Route Entry Count : 2",
            "Route Prefix Count : 6"
        ],
        [
            "<HUAWEI> display fib slot 1 statistics all",
            "IPv4 FIB Route Prefix Capacity : 1048576",
            "IPv4 FIB Total Route Prefix Count : 29",
            " ",
            "IPv4 FIB Public Route Prefix Count : 26",
            "IPv4 VPN-instance VPN1 Route Prefix Count : 1",
            "IPv4 FIB Public Other Route Prefix Count : 1",
            "IPv4 VPN-instance VPN1 Other Route Prefix Count : 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe display fib slot statistics command is used to troubleshoot a routing module. If the routing module is working properly, the number of FIB entries displayed in the display fib slot statistics command output is the same as the number of routes displayed in the Summary Prefixes field in the display ip routing-table statistics command output."
}