{
    "PageTitle": "lldp message-transmission interval",
    "FuncDef": "The lldp message-transmission interval command configures a global interval for a device to send Link Layer Discovery Protocol (LLDP) packets.\nThe undo lldp message-transmission interval command restores the default interval.\nBy default, the global interval for a device to send LLDP packets is 30 seconds.",
    "CLIs": [
        "lldp message-transmission interval <interval>",
        "undo lldp message-transmission interval"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "interval",
            "Info": "Specifies a global interval for a device to send LLDP packets.\nThe value is an integer ranging from 5 to 32768, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] lldp enable",
            "[*HUAWEI] lldp message-transmission interval 60"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy periodically exchanging LLDP packets with neighbors, a device can notify neighbors of its own status to ensure the accuracy and timely discovery of network topology and communication stability.\nTo configure a global interval for a device to send LLDP packets, run the lldp message-transmission interval command. This command helps adjust the frequency of network topology discovery.\nPrerequisites\nLLDP has been enabled globally using the lldp enable command in the system view.\nConfiguration Impact\nThe interval value must be appropriate. You can flexibly adjust this parameter based on the network load:\nThe greater the value, the lower the frequency of LLDP packets being exchanged. This saves resources of the system. However, if the value is too large, the local device cannot immediately notify neighbors of its status. As a result, the NMS cannot dynamically detect network topology changes.The smaller the value, the higher the frequency of LLDP packets being exchanged. This ensures timely network topology discovery. However, if the delay is too short, LLDP packets are exchanged too frequently. This increases the system burden and wastes resources.The default interval is recommended.\n\nPrecautions\nThe delay value configured using the lldp message-transmission delay command is closely related to the interval value configured using the lldp message-transmission interval command:\nIf you increase the interval value, the target interval value is not restricted by the delay value, but and ensure that the target interval value is greater than or equal to 32768.If you increase the interval value, ensure that the target interval value is greater than or equal to four times the delay value.If the target interval value is smaller than four times the delay value, you must adjust the delay value to be smaller than or equal to a quarter of the target interval value before setting the target interval value.If the delay value is greater than a quarter of the default interval value, you must adjust the delay value to be smaller than or equal to a quarter of the default interval value before running the undo lldp message-transmission interval command to restore the default interval value."
}