{
    "PageTitle": "lldp trap-interval",
    "FuncDef": "The lldp trap-interval command sets the delay time for a device to send alarms about Link Layer Discovery Protocol (LLDP) neighbor information changes to a network management system (NMS).\nThe undo lldp trap-interval command restores the default delay time.\nThe default delay time is 5 seconds.",
    "CLIs": [
        "lldp trap-interval <interval>",
        "undo lldp trap-interval"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "interval",
            "Info": "Specifies the delay time for a device to send alarms about LLDP neighbor information changes to an NMS.\nThe value is an integer ranging from 5 to 3600, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] lldp enable",
            "[*HUAWEI] lldp trap-interval 6"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter the LLDP alarm function is enabled for a device, the device sends alarms to the NMS if LLDP neighbor information changes. If LLDP neighbor information changes frequently, the device frequently sends alarms to an NMS, causing network flapping.\nSetting a delay effectively prevents network flapping caused by alarms being frequently sent to the NMS. To set a delay for the device to send alarms about LLDP neighbor information changes to the NMS, run the lldp trap-interval command.\nConfiguration Impact\nThe delay time for sending alarms about LLDP neighbor information changes must be appropriate. You can flexibly adjust this parameter based on the network load:\nThe longer the delay, the lower the frequency of network flapping. However, if the delay is too long, the NMS cannot dynamically trace neighbor status changes. As a result, the NMS cannot immediately refresh the network topology.The shorter the delay, the higher the frequency of sending local status information to neighbors. This helps the neighbors dynamically refresh the network topology. However, if the delay is too short, the device refreshes status information about neighbors frequently. This causes network topology flapping, increases the system load, and wastes resources.\nThe default delay time is recommended."
}