{
    "PageTitle": "lldp vlan-mode(Interface view)",
    "FuncDef": "The lldp vlan-mode enable command is used to enable the VLAN mode on an interface. After LLDP is enabled on an interface, the searches for the LLDP interface according to the VLAN ID of the received LLDP packet. If LLDP is not enabled on the interface, the discards the LLDP packet.\nThe undo lldp vlan-mode enable command is used to disable the VLAN mode on an interface. After LLDP receives a packet carrying a VLAN ID, the packet is sent to the main interface for learning.\nBy default, the VLAN mode is disabled on an interface.",
    "CLIs": [
        "lldp vlan-mode enable",
        "undo lldp vlan-mode enable"
    ],
    "ParentView": [
        "Layer 2 40GE interface view",
        "40GE interface view",
        "GE interface view",
        "Layer 2 50GE interface view",
        "100GE interface view",
        "GE electrical interface view",
        "Port extension Layer 2 interface view",
        "Layer 2 10GE interface view",
        "50GE interface view",
        "Layer 2 GE interface view",
        "400GE interface view",
        "10GE interface view",
        "GE optical interface view",
        "Layer 2 100GE interface view",
        "25GE interface view",
        "Layer 2 50|100GE interface view",
        "25GE-L2 view",
        "400GE-L2 view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[*HUAWEI] interface GigabitEthernet 1/0/1",
            "[*HUAWEI-GigabitEthernet1/0/1] lldp vlan-mode enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nUsing the lldp vlan-mode enable command, you can enable the VLAN mode on an interface. After LLDP is enabled on an interface, the searches for the LLDP interface according to the VLAN ID of the received LLDP packet. If LLDP is not enabled on the interface, the discards the LLDP packet.\nIf the lldp vlan-mode enable command is not run and LLDP receives a packet carrying a VLAN ID, the packet is sent to the main interface for learning.\nPrerequisites\nEnable LLDP on the interface.\nPrecautions\nFor sub-interfaces, only Ethernet and FlexE sub-interfaces support LLDP."
}