{
    "PageTitle": "lldp fast-count",
    "FuncDef": "The lldp fast-count command sets the number of Link Layer Discovery Protocol (LLDP) packets to be quickly sent to neighbors.\nThe undo lldp fast-count command restores the default number of LLDP packets to be sent to neighbors.\nA device by default quickly sends four LLDP packets to its neighbors.",
    "CLIs": [
        "lldp fast-count <count>",
        "undo lldp fast-count"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "count",
            "Info": "Specifies the number of LLDP packets to be quickly sent to neighbors.\nThe value is an integer ranging from 1 to 8."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] lldp enable",
            "[*HUAWEI] lldp fast-count 5"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo help neighbors quickly obtain information about a local device, the local device sends a number of LLDP packets to neighbors when the local device discovers a new neighbor (that is, when the device receives an LLDP packet from a transmit device for which it has no information), or when LLDP is enabled for the device that previously had LLDP disabled, or the interface connected to a neighbor goes Up.\nYou can run the lldp fast-count command to set the number of LLDP packets to be quickly sent to neighbors to help neighbors quickly obtain information about the local device, and help the NMS quickly detect network topology.\nPrerequisites\nLLDP has been enabled globally using the lldp enable command in the system view.\nPrecautions\nThe interval at which LLDP packets are quickly sent to neighbors is 1 second. A device sends LLDP packets to neighbors every second when LLDP packets are being quickly sent, not restricted by the delay time. After quickly sending the specified number of LLDP packets, the device sends LLDP packets to neighbors based on the interval configured using the lldp message-transmission interval command.\nThe delay for sending LLDP packets is configured using the lldp message-transmission delay command. An appropriate delay prevents devices from frequently sending LLDP packets to neighbors, suppressing network flapping."
}