{
    "PageTitle": "lldp enable (Interface view)",
    "FuncDef": "The lldp enable command run in the interface view enables Link Layer Discovery Protocol (LLDP) on an interface.\nThe undo lldp enable command run in the interface view disables LLDP on an interface.\nIf LLDP is enabled globally, LLDP by default takes effect on all main interfaces on the device,LLDP is not enabled on the sub-interface. You need to enable LLDP manually.If LLDP is disabled globally, LLDP does not take effect on any interface.",
    "CLIs": [
        "lldp enable",
        "undo lldp enable"
    ],
    "ParentView": [
        "PW-VE sub-interface view",
        "Layer 2 40GE interface view",
        "40GE interface view",
        "GE electrical interface view",
        "Port extension interface view",
        "Port extension Layer 2 interface view",
        "Layer 2 10GE interface view",
        "Layer 2 GE interface view",
        "Eth-Trunk sub-interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "Layer 2 100GE interface view",
        "Layer 2 50|100GE interface view",
        "FlexE-100G interface view",
        "25GE-L2 view",
        "FlexE-50G interface view",
        "400GE-L2 view",
        "FlexE-50|100G interface view",
        "GE sub-interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "GE interface view",
        "Layer 2 50GE interface view",
        "100GE interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "100ge sub-interface view",
        "25GE interface view",
        "40GE sub-interface view",
        "10GE sub-interface view",
        "POS interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] lldp enable",
            "[*HUAWEI] interface GigabitEthernet 1/0/1",
            "[*HUAWEI-GigabitEthernet1/0/1] lldp enable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] lldp enable",
            "[*HUAWEI] interface GigabitEthernet 1/0/1",
            "[*HUAWEI-GigabitEthernet1/0/1] lldp enable",
            "[*HUAWEI-GigabitEthernet1/0/1] lldp vlan-mode enable",
            "[*HUAWEI-GigabitEthernet1/0/1.1] vlan-type dot1q 1",
            "[*HUAWEI-GigabitEthernet1/0/1.1] lldp enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf LLDP is enabled on a device, the device can use specified interfaces to exchange LLDP packets with neighbors, learning neighbor status information while sending local status information to neighbors. By collecting status information stored on each network device, the NMS can discover the overall network topology.\nNote that LLDP takes effect on a device only after LLDP is enabled globally and on specified interfaces. If LLDP is disabled on an interface, the device cannot use this interface to exchange LLDP packets with neighbors. The lldp enable command allows you to enable LLDP on a specific interface.\nPrerequisites\nLLDP has been enabled globally using the lldp enable command in the system view.\nPrecautions\nLLDP can be enabled globally or on an interface. The relationships are as follows:\nBy default, LLDP is enabled on all interfaces after LLDP is enabled globally, LLDP is disabled on the sub-interface.LLDP is disabled on all interfaces after LLDP is disabled globally.Disabling LLDP globally does not affect the LLDP alarm function.\nAn interface can send and receive LLDP packets only after LLDP is enabled globally and on the interface.The command to enable or disable LLDP on an interface is invalid after LLDP is disabled globally.\nIf the device supports the POS interface, the lldp function of the interface will be invalid if the link protocol fr command is configured on a POS interface.\nIf the sub-interfaces supported by the device contain Ethernet, Flex-eth types, the LLDP functionality can be configured on the sub-interfaces, and the other sub-interfaces do not support LLDP."
}