{
    "PageTitle": "lldp management-address",
    "FuncDef": "The lldp management-address command enables Link Layer Discovery Protocol (LLDP) packets to be advertised to neighbors to carry the management IP address of the local device.\nThe undo lldp management-address command disables LLDP packets from carrying the management IP address of the sender device.\nBy default, the NMS automatically obtains the management IP addresses of managed devices.",
    "CLIs": [
        "lldp management-address <ip-address>",
        "undo lldp management-address"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address",
            "Info": "Specifies the management IP address to be carried in LLDP packets.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] lldp management-address 10.111.148.25"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe management IP address is carried in the Management Address TLV in an LLDP packet. The management IP address is used by the NMS to identify devices and implement network management. A management IP address uniquely identifies a device, helping the NMS to determine the network topology and management devices. You can run the lldp management-address command to enable LLDP packets to be advertised to neighbors to carry the management IP address of the local device.\nPrerequisites\nLLDP has been enabled globally using the lldp enable command in the system view.\nPrecautions\nIf the management IP address is not specified or the specified management IP address is invalid, the system automatically selects an IP address from the list of interface IP addresses as the management IP address.\nThe system preferentially selects the IP address of a loopback interface, followed by the IP address of a management interface\nand the IP address of a VLANIF interface in turn. If there are multiple IP addresses for the same type of interface, the system uses the smallest IP address as the LLDP management IP address.\nIf the system fails to find a default IP address, the system uses the bridge MAC address as the LLDP management address.\nIf you run the lldp management-address command more than once on the same interface, the latest configuration overrides the previous one."
}