{
    "PageTitle": "lldp enable",
    "FuncDef": "The lldp enable command enables Link Layer Discovery Protocol (LLDP) globally.\nThe undo lldp enable command disables LLDP globally.\nBy default, LLDP is enabled globally.",
    "CLIs": [
        "lldp enable",
        "undo lldp enable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] lldp enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nLLDP is a Layer 2 discovery protocol defined in IEEE 802.1ab. LLDP enables the NMS to learn Layer 2 information about managed devices. The information includes names of interfaces used by one device to connect to other devices and connections between devices. LLDP enables the NMS to learn and analyze Layer 2 topology information. With LLDP, the NMS can manage networks of larger scales and obtain more specific information about network topology and interface changes.\nBefore you view the status of specific Layer 2 links between devices and analyze network topology, run the lldp enable command in the system view to enable LLDP globally.\nConfiguration Impact\nAfter LLDP is enabled globally, LLDP is enabled on all interfaces by default. Specifically, all interfaces can exchange LLDP packets with neighboring nodes. Exchange of mass LLDP packets will consume many system resources and may affect user services.\nFollow-up Procedure\nRun the undo lldp enable command in the interface view to disable LLDP on specified interfaces if required, so that less system resources are consumed and user services can be properly handled.\nPrecautions\nLLDP can be enabled globally or on an interface. The relationships are as follows:\nBy default, LLDP is enabled on all interfaces after LLDP is enabled globally.LLDP is disabled on all interfaces after LLDP is disabled globally.\nDisabling LLDP globally does not affect the LLDP alarm function:\nAn interface can send and receive LLDP packets only after LLDP is enabled globally and on the interface.The command to enable or disable LLDP on an interface is invalid after LLDP is disabled globally."
}