{
    "PageTitle": "display lldp statistics",
    "FuncDef": "The display lldp statistics command displays statistics about Link Layer Discovery Protocol (LLDP) packets that all interfaces send and receive or LLDP packets that a specified interface sends and receives.",
    "CLIs": [
        "display lldp statistics [ interface { <interface-type> <interface-number> | <interface-name> } ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "interface interface-type interface-number",
            "Info": "Display statistics about LLDP packets that a specified interface sends and receives.\nIf this parameter is not specified, statistics about LLDP packets that all interface send and receive will be displayed.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display lldp statistics",
            "LLDP statistics global Information:",
            "Statistics for Gigabitethernet3/0/0:",
            "Transmitted Frames Total:    28         ",
            "Received Frames Total:       25              Frames Discarded Total:   0         ",
            "Frames Error Total:          0               TLVs Discarded Total:     0         ",
            "TLVs Unrecognized Total:     0               Neighbors Expired Total:  0          ",
            "DCBX TLVs Transmitted Total: 0               DCBX TLVs Received Total: 0          ",
            "Last cleared Time:           never",
            "",
            "Statistics for Gigabitethernet3/0/1:",
            "Transmitted Frames Total:    28         ",
            "Received Frames Total:       25              Frames Discarded Total:   0         ",
            "Frames Error Total:          0               TLVs Discarded Total:     0         ",
            "TLVs Unrecognized Total:     0               Neighbors Expired Total:  0          ",
            "DCBX TLVs Transmitted Total: 0               DCBX TLVs Received Total: 0          ",
            "Last cleared Time:           never"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo view statistics about LLDP packets that a device sends and receives, run the display lldp statistics command. The command output helps diagnose faults.\nBefore you view statistics about LLDP packets that a device sends and receives for a specified period of time, run the reset lldp statistics command to delete all existing statistics.\nPrerequisites\nLLDP has been globally enabled using the lldp enable command in the system view, and LLDP has also been enabled on interfaces using the lldp enable command in the interface view.\nPrecautions\nIf you want to use the\ndisplay lldp statistics command to locate faults, note that:\nIf two directly connected devices have LLDP enabled at different time, the number of LLDP packets sent or received by one device may be different from the number of LLDP packets received or sent by the other device.In a specific period of time, if the number of LLDP packets sent by a local device increases but the number of LLDP packets received by a remote device remains unchanged, the link between the local and remote devices may be faulty.In a specific period of time, if the number of LLDP packets sent by a local device is the same as the number of LLDP packets received by a remote device but the local device cannot learn the remote device status, the local device cannot identify the type-length-value (TLV) information encapsulated in LLDP packets sent by the remote device."
}