{
    "PageTitle": "lldp tlv-enable basic-tlv (Interface view)",
    "FuncDef": "The lldp tlv-enable command configures time-length-values (TLVs) that can be advertised by an interface.\nThe undo lldp tlv-enable command configures TLVs that cannot be advertised by an interface.\nBy default, lldp publishes TLVs of all basic types, LLDP is not enabled on sub-interfaces. Therefore, LLDP does not take effect on sub-interfaces.",
    "CLIs": [
        "lldp tlv-enable basic-tlv { all | management-address | port-description | system-capability | system-description | system-name }",
        "undo lldp tlv-enable basic-tlv { all | management-address | port-description | system-capability | system-description | system-name }"
    ],
    "ParentView": [
        "GE sub-interface view",
        "FlexE-50|100G interface view",
        "PW-VE sub-interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "Global VE sub-interface view",
        "Eth-Trunk sub-interface view",
        "400GE sub-interface view",
        "50GE sub-interface view",
        "100ge sub-interface view",
        "40GE sub-interface view",
        "10GE sub-interface view",
        "FlexE-100G interface view",
        "FlexE-50G interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "all",
            "Info": "Indicates all optional TLVs contained in basic- TLVs.\n-"
        },
        {
            "Parameters": "management-address",
            "Info": "Indicates Management-address TLVs.\n-"
        },
        {
            "Parameters": "port-description",
            "Info": "Indicates Port Description TLVs.\n-"
        },
        {
            "Parameters": "system-capability",
            "Info": "Indicates System Capabilities TLVs.\n-"
        },
        {
            "Parameters": "system-description",
            "Info": "Indicates System Description TLVs.\n-"
        },
        {
            "Parameters": "system-name",
            "Info": "Indicates System Name TLVs.\n-"
        },
        {
            "Parameters": "basic-tlv",
            "Info": "Indicates types of basic TLVs that can be advertised:\nManagement-address TLV.Port Description TLV.System Capabilities TLV.System Description TLV.System Name TLV.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] lldp tlv-enable basic-tlv port-description"
        ],
        [
            "[~HUAWEI] interface",
            "[~HUAWEI-GE1/0/0.1] lldp enable",
            "[*HUAWEI-GE1/0/0.1] lldp tlv-enable basic-tlv port-description"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA TLV is the basic information unit of an LLDPDU. A device encapsulates information about its main capabilities, management address, device ID, and interface ID into TLVs, encapsulates multiple TLVs into an LLDPDU, and encapsulates an LLDPDU into an LLDP packet. A device exchanges information with neighbors using LLDP packets. During the process of exchanging LLDP packets between devices, the LLDPDU encapsulated in an LLDP packet carries various TLVs as needed. A device sends its status information and receives neighbor status information based on these different TLVs.\nTLVs that can be encapsulated into an LLDPDU include basic TLVs, TLVs defined by IEEE 802.1, TLVs defined by IEEE 802.3.\nBasic TLVs implement basic LLDP functions. In addition to optional management-address, port-description, system-capability, system-description, and system-name TLVs, basic TLVs include four mandatory TLVs that must be encapsulated into an LLDPDU to be advertised. For details, see \"LLDP Feature Description\" in \"VRP Feature Description - System Management\".TLVs defined by IEEE 802.1, TLVs defined by IEEE 802.3 are optional TLVs used to enhance the LLDP function. Determine whether to encapsulate these TLVs into LLDPDUs for advertisement as needed.\n\nPrerequisites\nLLDP has been enabled globally using the lldp enable command in the system view.\nFor sub-interfaces, run the lldp enable command in the sub-interface view to enable LLDP.\nPrecautions\nIf the sub-interfaces supported by the device contain Ethernet, Flex-eth types, the LLDP functionality can be configured on the sub-interfaces, and the other sub-interfaces do not support LLDP."
}