{
    "PageTitle": "lldp message-transmission delay",
    "FuncDef": "The lldp message-transmission delay command sets the delay time for a device to send Link Layer Discovery Protocol (LLDP) packets.\nThe undo lldp message-transmission delay command restores the default delay time.\nThe default delay time is 2 seconds.",
    "CLIs": [
        "lldp message-transmission delay <delay>",
        "undo lldp message-transmission delay"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "delay",
            "Info": "Specifies the delay time for sending LLDP packets.\nThe value is an integer ranging from 1 to 8192, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] lldp enable",
            "[*HUAWEI] lldp message-transmission delay 3"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the device status changes, a device sends LLDP packets to neighbors to notify the neighbors of its status change. If the device status changes frequently, the device will frequently send LLDP packets to its neighbors, causing network flapping.\nTo prevent network flapping caused by LLDP packets frequently sent to neighbors, set a delay time. To set the delay time for sending LLDP packets on a device, run the lldp message-transmission delay command.\nConfiguration Impact\nThe delay time for sending LLDP packets must be properly set. You can flexibly adjust this parameter based on the network load.\nThe longer the delay, the lower the frequency of network flapping. However, if the delay is too long, the neighbors cannot dynamically trace local device status changes. As a result, the neighbors cannot immediately refresh the network topology.The shorter the delay, the higher the frequency of sending local status information to neighbors. This helps the neighbors dynamically refresh the network topology. However, if the delay is too short, the neighbors refresh status information about the local device frequently. This increases the possibility of network flapping and system load and wastes resources.\nThe default delay time for sending LLDP packets is recommended.\n\nPrecautions\nThe delay value configured using the lldp message-transmission delay command is closely related to the interval value configured using the lldp message-transmission interval command:\nIf you reduce the delay value, the target delay value is not restricted by the interval value, but and ensure that the target delay value is greater than or equal to 1.If you increase the delay value, ensure that the target delay value is less than or equal to a quarter of the interval value.If the target delay value is greater than a quarter of the interval value, adjust the interval value to be not less than four times the target delay value before setting the target delay value.If the interval value is less than four times the default delay value, you must adjust the interval value to be greater than or equal to four times the default delay value before running the undo lldp message-transmission delay command to restore the default delay value."
}