{
    "PageTitle": "dns server ipv6",
    "FuncDef": "The dns server ipv6 command specifies a DNS server IPv6 address.\nThe undo dns server ipv6 command deletes a DNS server IPv6 address.\nBy default, no DNS server IPv6 address is specified.",
    "CLIs": [
        "dns server ipv6 <ipv6-address> [ <interface-type> <interface-number> | <interface-name> ] [ vpn-instance <vpn-name> ]",
        "undo dns server ipv6 <ipv6-address> [ <interface-type> <interface-number> | <interface-name> ] [ vpn-instance <vpn-name> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv6-address",
            "Info": "Specifies the IPv6 address of a DNS server.\nThe address is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "interface-type interface-number",
            "Info": "Specifies the type of an outbound interface when the link-local IPv6 address of a DNS server is specified.\n-"
        },
        {
            "Parameters": "vpn-instance vpn-name",
            "Info": "Specifies the VPN to be displayed.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dns server ipv6 2001:db8::1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] ipv6-family",
            "[*HUAWEI-vpn-instance-vpn1-af-ipv6] quit",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[*HUAWEI] dns server ipv6 2001:db8::2 vpn-instance vpn1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen the IPv6 address of the destination end is searched based on its host name in ping6 or tracert6 operations, dynamic DNS can be used for domain name resolution. After you run the dns resolve command to enable dynamic DNS, run the dns server ipv6 command to specify a DNS server IPv6 address.\nPrecautions\nDuring dynamic DNS, the system sends query packets to DNS servers in the order their IPv6 addresses are specified on the system. If domain name resolution times out on the first DNS server, the system sends a query request to the next DNS server.\nA DNS server IPv6 address must be a global unicast or link-local address."
}