{
    "PageTitle": "accounting-scheme(Prepaid profile view)",
    "FuncDef": "The accounting-scheme command configures the accounting scheme for the current pre-paid profile. The scheme must be a configured accounting scheme.\nThe undo accounting-scheme command restores the default accounting scheme of the pre-paid profile.\nBy default, the accounting scheme adopted by the service policy is default1.",
    "CLIs": [
        "accounting-scheme <string-value>",
        "undo accounting-scheme [ <string-value> ]"
    ],
    "ParentView": [
        "Prepaid profile view"
    ],
    "ParaDef": [
        {
            "Parameters": "string-value",
            "Info": "Specifies the name of the accounting scheme adopted by the pre-paid profile.\nThe value is a string of 1 to 32 characters and case insensitive. It should not contain slash (\\), anti-slash (/), colon (:), asterisk (*), question mask (?), quotation mask (\"),(|), and angle brackets (< >)."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] accounting-scheme radius",
            "[*HUAWEI-aaa-accounting-radius] commit",
            "[~HUAWEI-aaa-accounting-radius] quit",
            "[~HUAWEI-aaa] quit",
            "[~HUAWEI] prepaid-profile test",
            "[~HUAWEI-prepaid-profile-test] accounting-scheme radius"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe prepaid function allows such an accounting mode that the RADIUS server to deliver session-time or traffic quotas to users beforehand. When the users or services use up their quotas, they will begin to applicate for quotas until the server replies that the quotas are used up.\nPrerequisites\nThe pre-paid profile and the accounting scheme template have been configured before you use the accounting-scheme command.\nConfiguration Impact\nIf the accounting scheme template is imported to the pre-paid profile template. The service is charged according to the accounting mode in the accounting scheme template.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}