{
    "PageTitle": "authentication-scheme(Prepaid profile view)",
    "FuncDef": "The authentication-scheme command configures the authentication scheme for the current pre-paid profile. The scheme must be a configured authentication scheme.\nThe undo authentication-scheme command restores the default authentication scheme of the pre-paid profile.\nBy default, the authentication scheme adopted by the service policy is default1 and the authentication method is RADIUS.",
    "CLIs": [
        "authentication-scheme <authentication-scheme-name>",
        "undo authentication-scheme [ <authentication-scheme-name> ]"
    ],
    "ParentView": [
        "Prepaid profile view"
    ],
    "ParaDef": [
        {
            "Parameters": "authentication-scheme-name",
            "Info": "Specifies the name of an authorization scheme.\nThe value is a string of 1 to 32 case-insensitive characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] authentication-scheme radius",
            "[*HUAWEI-aaa-authentication-radius] commit",
            "[~HUAWEI-aaa-accounting-radius] quit",
            "[~HUAWEI-aaa] quit",
            "[~HUAWEI] prepaid-profile test",
            "[~HUAWEI-prepaid-profile-test] authentication-scheme radius"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe prepaid function allows such an accounting mode that the RADIUS server to deliver session-time or traffic quotas to users beforehand. When the users or services use up their quotas, they will begin to apply for quotas until the server replies that the quotas are used up.\nCurrently only RADIUS is supported to be the authentication and accounting mode.\nPrerequisites\nThe pre-paid profile and the authentication scheme template have been configured before you use the authentication-scheme command.\nConfiguration Impact\nIf the authentication scheme template is imported to the pre-paid profile template, the corresponding prepaid service will aplly this authentication scheme.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}