{
    "PageTitle": "radius-server accounting-merge max-length",
    "FuncDef": "The radius-server accounting-merge max-length command sets the maximum length for a post-merging accounting packet for value-added services.\nThe undo radius-server accounting-merge max-length command deletes the maximum length set for a post-merging accounting packet for value-added services.\nBy default, no maximum length is set for a post-merging accounting packet for value-added services.",
    "CLIs": [
        "radius-server accounting-merge max-length <length>",
        "undo radius-server accounting-merge max-length [ <length> ]"
    ],
    "ParentView": [
        "RADIUS server group view"
    ],
    "ParaDef": [
        {
            "Parameters": "length",
            "Info": "Specifies the maximum length for a post-merging accounting packet.The maximum length contains a RADIUS packet's header but does not contain the IP or UDP header.\nThe value is an integer ranging from 500 to 4096, in bytes."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] radius-server group huawei",
            "[*HUAWEI-radius-huawei] commit",
            "[~HUAWEI-radius-huawei] radius-server accounting-merge max-length 1480"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe length of a post-merging accounting packet for value-added services may exceed the MTU of an intermediate device. If an intermediate device does not have packet fragmentation, a post-merging accounting packet is discarded. To resolve this issue, run the radius-server accounting-merge max-length command to set the maximum length for a post-merging accounting packet for value-added services.\nPrecautions\nThe maximum length set using this command takes effect only for a post-merging accounting packet that contains two or more value-added services. If a post-merging accounting packet contains only one value-added service, the packet is considered a non-merging packet.\nBy default, the maximum length of a post-merging accounting packet is the same as that of a non-merging packet, which is controlled using the radius-server packet send max-length enhance command in the system view.\nIf the radius-server accounting-merge max-length command is run in the RADIUS server group view to set the maximum length for a post-merging accounting packet for value-added services and the radius-server packet send max-length enhance command is run in the system view to specify the maximum length (2048 bytes by default) for a RADIUS packet, the smaller value between the two maximum lengths is used as the maximum length for a post-merging accounting packet for value-added services.\nIn VS mode, this command is supported only by the admin VS."
}