{
    "PageTitle": "service-policy radius-server-group no-config-policy",
    "FuncDef": "The service-policy radius-server-group no-config-policy command configures an activation policy for RADIUS servers when an EDSG service policy is not bound to any RADIUS server group.\nThe undo service-policy radius-server-group no-config-policy online command restores the default configuration.\nBy default, when an EDSG service policy is not bound to any RADIUS server group, services do not use the RADIUS server in a user domain.",
    "CLIs": [
        "service-policy radius-server-group no-config-policy { online | offline }",
        "undo service-policy radius-server-group no-config-policy online"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "online",
            "Info": "Enables a device to use the RADIUS server in a user domain when an EDSG service policy is not bound to any RADIUS server group.\n-"
        },
        {
            "Parameters": "offline",
            "Info": "Disables a device from using the RADIUS server in a user domain when an EDSG service policy is not bound to any RADIUS server group.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] service-policy radius-server-group no-config-policy online"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA RADIUS server is used to provide authentication and accounting for EDSG services. When an EDSG service policy is not bound to any RADIUS server group, run the service-policy radius-server-group no-config-policy command to enable a device to use the RADIUS server in a user domain to implement the EDSG service policy's authentication and accounting functions.\nPrecautions\nThis command is supported only on the admin VS.\nWhen an EDSG service policy is not bound to any RADIUS server group and a RADIUS server is bound to a user domain, a device obtains the RADIUS server from the user domain after the service-policy radius-server-group no-config-policy online command is run.\nWhen an EDSG service policy is bound to a RADIUS server, a device still preferentially obtains the RADIUS server from the EDSG service policy after the service-policy radius-server-group no-config-policy online command is run."
}