{
    "PageTitle": "service-group(Service policy view)",
    "FuncDef": "The service-group command specifies a service group for a service policy.\nThe undo service-group command deletes a service group for a service policy.\nBy default, no service group for a service policy is specified.",
    "CLIs": [
        "service-group <service-group-name> [ inbound | outbound ] [ priority <priority> ]",
        "undo service-group [ <service-group-name> [ [ inbound | outbound ] [ priority <priority> ] ] ]"
    ],
    "ParentView": [
        "Service policy view"
    ],
    "ParaDef": [
        {
            "Parameters": "inbound",
            "Info": "Indicates the upstream direction for a service group.\n-"
        },
        {
            "Parameters": "outbound",
            "Info": "Indicates the downstream direction for a service group.\n-"
        },
        {
            "Parameters": "priority priority",
            "Info": "Specifies a priority value that a service matches.\nThe value is an integer ranging from 0 to 1000."
        },
        {
            "Parameters": "service-group service-group-name",
            "Info": "Specifies the name of a service group.\nThe name is a string of 1 to 31 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] service-group 123",
            "[~HUAWEI] service-policy name test edsg",
            "[~HUAWEI-service-policy-test] service-group 123 priority 0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThis command sets a service group for an EDSG service policy template. The EDSG service will serve the users in different ways according to the service group.\nTo change traffic priorities for a service group, run the service-group command for the user-to-network and network-to-user traffic in a service group with an EDSG service policy.\nPrerequisites\nA service group has been configured using the service-group command in the system view.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nWhen service groups with the same destination IP address exist, the smaller value indicates a higher priority.Only a single service group can be added in the portal service policy, and priority values for user-to-network and network-to-user services cannot be changed.If priority values for user-to-network and network-to-user services are not set, both services in the EDSG service policy view take effect and the priority values for user-to-network and network-to-user services are 0.In the EDSG service policy view, only a single service can be specified, and the service groups for both the user-to-network and network-to-user traffic cannot be simultaneously configured.Only a service group can be added in the mirror service policy, and priority values for user-to-network and network-to-user services cannot be changed."
}