{
    "PageTitle": "service force redirect",
    "FuncDef": "The service force redirect command configures a forcible redirection profile for a service policy.\nThe undo service force redirect command restores the default configuration.\nBy default, no forcible redirection profile is configured for a service policy.",
    "CLIs": [
        "service force redirect <redirect-profile-name>",
        "undo service force redirect [ <redirect-profile-name> ]"
    ],
    "ParentView": [
        "Service policy view"
    ],
    "ParaDef": [
        {
            "Parameters": "redirect-profile-name",
            "Info": "Specifies the name of a forcible redirection profile.\nThe value is a string of 1 to 31 characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] http-redirect-profile redirectprofile1",
            "[~HUAWEI-redirect-profile-redirectprofile1] quit",
            "[~HUAWEI] service-policy name edsg1 edsg",
            "[*HUAWEI-service-policy-edsg1] service force redirect redirectprofile1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, the device redirects a user to a quota notification page only when receiving a zero quota from a policy server. To enable the device to perform the redirection when the quota usage reaches a specified threshold, run the service force redirect command. Then, the device redirects a user immediately when the quota usage threshold is reached, without waiting for a zero quota from the policy server.\nPrerequisites\nA redirection profile has been configured using the http-redirect-profile <redirect-profile-name> command.\nConfiguration Impact\nAfter the service force redirect command is run, the prepaid function of the service policy becomes ineffective.\nPrecautions\nThe HTTP redirection profile bound to the service policy template can be deleted only after the binding relationship has been canceled.\nThe service force redirect command is mutually exclusive with the http-redirect-profile <profile-name> command."
}