{
    "PageTitle": "service-policy accounting-copy",
    "FuncDef": "The service-policy accounting-copy command enables EDSG service accounting copy and configures a RADIUS copy server group.\nThe undo service-policy accounting-copy command disables EDSG service accounting copy.\nBy default, EDSG service accounting copy is disabled.",
    "CLIs": [
        "service-policy accounting-copy radius-server <group-name>",
        "undo service-policy accounting-copy [ radius-server <group-name> ]"
    ],
    "ParentView": [
        "AAA domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "radius-server group-name",
            "Info": "Specifies the name of a RADIUS copy server group.\nThe value is a string of 1 to 32 characters, which can be uppercase letters A to Z, lowercase letters a to z, digits 0 to 9, periods (.), hyphens (-), or underscores (_)."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] radius-server group group1",
            "Info: Create a new server group",
            "[*HUAWEI-radius-group1] commit",
            "[~HUAWEI-radius-group1] quit",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] domain isp1",
            "[*HUAWEI-aaa-domain-isp1] commit",
            "[~HUAWEI-aaa-domain-isp1] service-policy accounting-copy radius-server group1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the original accounting packet information of EDSG services is required, run the service-policy accounting-copy command to enable EDSG service accounting copy and configure a RADIUS copy server group. After the command is run, the device sends EDSG service accounting packets to the RADIUS copy server group as the original accounting information in subsequent settlement.\nPrecaution\nEDSG accounting copy supports accounting start, real-time accounting, and accounting stop. If accounting packets fail to be copied to the accounting copy server, EDSG service activation is not affected.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nEDSG accounting copy supports accounting start, real-time accounting, and accounting stop. If accounting packets fail to be copied to the accounting copy server, EDSG service activation is not affected."
}