{
    "PageTitle": "service-class(Service policy view)",
    "FuncDef": "The service-class command specifies an upstream or downstream service class.\nThe undo service-class command restores the default configuration.\nBy default, no upstream or downstream service class is specified, and flow queue (FQ) resources are automatically allocated to services. The default sequence is CS7, CS6, EF, AF4, AF3, AF2, AF1, and BE.",
    "CLIs": [
        "service-class { cs7 | cs6 | ef | af4 | af3 | af2 | af1 | be } inbound",
        "service-class { cs7 | cs6 | ef | af4 | af3 | af2 | af1 | be } outbound",
        "undo service-class [ cs7 | cs6 | ef | af4 | af3 | af2 | af1 | be ] inbound",
        "undo service-class [ cs7 | cs6 | ef | af4 | af3 | af2 | af1 | be ] outbound"
    ],
    "ParentView": [
        "Service policy view"
    ],
    "ParaDef": [
        {
            "Parameters": "cs7",
            "Info": "Indicates that the service class is CS7.\n-"
        },
        {
            "Parameters": "cs6",
            "Info": "Indicates that the service class is CS6.\n-"
        },
        {
            "Parameters": "ef",
            "Info": "Indicates that the service class is EF.\n-"
        },
        {
            "Parameters": "af4",
            "Info": "Indicates that the service class is AF4.\n-"
        },
        {
            "Parameters": "af3",
            "Info": "Indicates that the service class is AF3.\n-"
        },
        {
            "Parameters": "af2",
            "Info": "Indicates that the service class is AF2.\n-"
        },
        {
            "Parameters": "af1",
            "Info": "Indicates that the service class is AF1.\n-"
        },
        {
            "Parameters": "be",
            "Info": "Indicates that the service class is BE.\n-"
        },
        {
            "Parameters": "inbound",
            "Info": "Indicates the upstream direction.\n-"
        },
        {
            "Parameters": "outbound",
            "Info": "Indicates the downstream direction.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] service-policy name service_edsg1 edsg",
            "[~HUAWEI-service-policy-service_edsg1] service-class ef inbound"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBefore planning service priorities during congestion, you can run the service-class command to plan an FQ that an EDSG service enters and then configure each FQ's priority during congestion.\nConfiguration Impact\nWhen service 1 that has a service class specified is successfully activated, service 2 fails to be activated if the same service class is specified for service 2.When service 1 that has a service class automatically allocated is successfully activated, another service class is re-allocated to service 1 if the same service class is specified for service 2. Service 2 uses the specified service class and is successfully activated.\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}