{
    "PageTitle": "traffic match user-group(AAA domain view)",
    "FuncDef": "The traffic match user-group command configures EDSG service traffic to match a user group.\nThe undo traffic match user-group command disables EDSG service traffic from matching a user group.\nBy default, no EDSG service traffic is configured to match a user group.",
    "CLIs": [
        "traffic match user-group [ inbound | outbound ]",
        "undo traffic match user-group [ inbound | outbound ]"
    ],
    "ParentView": [
        "AAA domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "inbound",
            "Info": "Indicates upstream EDSG service traffic.\n-"
        },
        {
            "Parameters": "outbound",
            "Info": "Indicates downstream EDSG service traffic.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] domain domain1",
            "[*HUAWEI-aaa-domain-domain1] commit",
            "[~HUAWEI-aaa-domain-domain1] traffic match user-group inbound"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn NAT/DS-Lite load-balancing scenarios, different user groups are mapped to different NAT/DS-Lite services and user traffic is load-balanced based on multiple user groups. In NAT/DS-Lite load-balancing scenarios, after user traffic matches EDSG services, it must continue to match a user group for NAT/DS-Lite service selection. If an EDSG service policy is delivered by a remote server or obtained from the local configurations, you can run the traffic match user-group command to configure upstream and downstream EDSG service traffic to match a user group in NAT/DS-Lite load-balancing scenarios.\nConfiguration Impact\nAfter the traffic match user-group command is run, a device continues to query the user group's UCL for traffic matching EDSG services. If traffic matches the UCL, the device performs an action configured in the UCL on the traffic.\nIf the action configured in the UCL conflicts with the action for EDSG services, the traffic behavior for EDSG services changes. For example, if the action for EDSG services is permit and the action configured in the UCL is deny, EDSG service traffic matching the UCL fails to be forwarded after the command is run.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}