{
    "PageTitle": "traffic match user-group",
    "FuncDef": "The traffic match user-group command configures EDSG service traffic to match a user group.\nThe undo traffic match user-group command disables EDSG service traffic from matching a user group.\nBy default, no EDSG service traffic is configured to match a user group.",
    "CLIs": [
        "traffic match user-group [ inbound | outbound ]",
        "undo traffic match user-group [ inbound | outbound ]"
    ],
    "ParentView": [
        "Service policy view"
    ],
    "ParaDef": [
        {
            "Parameters": "inbound",
            "Info": "Indicates upstream EDSG service traffic.\n-"
        },
        {
            "Parameters": "outbound",
            "Info": "Indicates downstream EDSG service traffic.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] service-policy name test edsg",
            "[~HUAWEI-service-policy-test] traffic match user-group inbound"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn NAT/DS-Lite load-balancing scenarios, different user groups are mapped to different NAT/DS-Lite services and user traffic is load-balanced based on multiple user groups. In NAT/DS-Lite load-balancing scenarios, after user traffic matches EDSG services, it must continue to match a user group for NAT/DS-Lite service selection. To match upstream or downstream EDSG service traffic to a user group, run the traffic match user-group command.\nConfiguration Impact\nAfter the traffic match user-group command is run, user traffic is load-balanced to the corresponding NAT/DS-Lite service if it matches the UCL of the user group.\nAfter the traffic match user-group command is run in the EDSG service policy view, EDSG service traffic is enabled to match a user group. If the EDSG service's traffic policy is consistent with the traffic direction for the service traffic to match a user group and the traffic behavior applied in the EDSG service's traffic policy is bound to a NAT instance (the nat bind instance command is run in the traffic behavior view), the service traffic is redirected to the NAT/DS-Lite service board and the service group does not match a user group.\nPrecautions\nThe traffic match user-group command can be locally configured but cannot be delivered using RADIUS.\nIn VS mode, this command is supported only by the admin VS."
}