{
    "PageTitle": "value-added-service edsg modify-synchronous",
    "FuncDef": "The value-added-service edsg modify-synchronous command enables a specified attribute to take effect upon delivery in EDSG service scenarios.\nThe undo value-added-service edsg modify-synchronous command disables a specified attribute from taking effect upon delivery in EDSG service scenarios.\nBy default, only EDSG service activation or deactivation is processed.",
    "CLIs": [
        "value-added-service edsg modify-synchronous <attribute-name>",
        "undo value-added-service edsg modify-synchronous [ <attribute-name> ]"
    ],
    "ParentView": [
        "AAA view"
    ],
    "ParaDef": [
        {
            "Parameters": "attribute-name",
            "Info": "Specifies an attribute name.\nThe value is a string of 1 to 64 case-insensitive characters. The available options are filter-id, hw-data-filter, traffic-policy, and class."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[*HUAWEI-aaa] value-added-service edsg modify-synchronous filter-id",
            "[*HUAWEI-aaa] value-added-service edsg modify-synchronous hw-data-filter"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nDuring activation or deactivation of EDSG services, if the user group or UCL access policy needs to be modified , you can enable the traffic-policy attribute to take effect upon delivery. To enable such function, run the value-added-service edsg modify-synchronous command.\nDuring activation or deactivation of EDSG services, if the user class needs to be changed, enable the class attribute to take effect upon delivery.\nImplementation Procedure\nIf the value-added-service edsg modify-synchronous command is run more than once, all configurations take effect, but the command configuration takes effect for users that go online after a command instance is run.\nConfiguration Impact\nAfter this command is run and EDSG services are activated or deactivated, if the filter-id, traffic-policy, hw-data-filter, class attributes are all delivered, all of the attributes take effect.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}