{
    "PageTitle": "value-added-service accounting-merge cache enable",
    "FuncDef": "The value-added-service accounting-merge cache enable command enables a post-merging accounting packet that fails to be sent for value-added services to enter the accounting packet cache.\nThe undo value-added-service accounting-merge cache enable command disables a post-merging accounting packet that fails to be sent for value-added services from entering the accounting packet cache.\nBy default, a post-merging accounting packet that fails to be sent for value-added services is disabled from entering the accounting packet cache.",
    "CLIs": [
        "value-added-service accounting-merge cache enable",
        "undo value-added-service accounting-merge cache enable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] value-added-service accounting-merge cache enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the communication between a device and RADIUS server fails and the RADIUS server is in the Down state, a post-merging accounting packet for value-added services fails to be sent, which affects carriers' subsequent settlement. You can run the value-added-service accounting-merge cache enable command to enable a post-merging accounting packet that fails to be sent for value-added services to enter the accounting packet cache. After the command is run, a post-merging accounting packet that fails to be sent is cached locally. After the communication with the RADIUS server recovers and the RADIUS server goes Up, the device sends the locally cached post-merging accounting packet to the RADIUS server.\nPrecautions\nThe value-added-service accounting-merge cache enable command must work with the radius-server accounting-start-packet resend, radius-server accounting-interim-packet resend, and radius-server accounting-stop-packet resend commands.\nIn VS mode, this command is supported only by the admin VS."
}