{
    "PageTitle": "value-added-service accounting-merge",
    "FuncDef": "The value-added-service accounting-merge command enables accounting packet merging for value-added services.\nThe undo value-added-service accounting-merge command disables accounting packet merging for value-added services.\nBy default, accounting packet merging is disabled for value-added services.",
    "CLIs": [
        "value-added-service accounting-merge edsg { stop | interim interval <interval> [ hash ] }",
        "value-added-service accounting-merge edsg { stop | interim interval <interval> [ hash ] } report-dropped-flowqueue { inbound | outbound | both }",
        "value-added-service accounting-merge daa { start | stop | interim interval <interval> [ hash ] }",
        "undo value-added-service accounting-merge edsg [ stop | interim [ interval ] [ hash ] ] [ report-dropped-flowqueue [ inbound | outbound | both ] ]",
        "undo value-added-service accounting-merge",
        "undo value-added-service accounting-merge daa [ start | stop | interim [ interval <interval> ] [ hash ] ]"
    ],
    "ParentView": [
        "AAA domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "stop",
            "Info": "Indicates an accounting stop packet.\n-"
        },
        {
            "Parameters": "interim",
            "Info": "Indicates a real-time accounting packet.\n-"
        },
        {
            "Parameters": "interval interval",
            "Info": "Specifies an interval at which real-time accounting packets are merged.\nThe value is an integer ranging from 30 to 65535, in minutes."
        },
        {
            "Parameters": "hash",
            "Info": "Enables the hash function for post-merging real-time accounting packets for value-added services.\n-"
        },
        {
            "Parameters": "edsg",
            "Info": "Indicates an EDSG service.\n-"
        },
        {
            "Parameters": "report-dropped-flowqueue",
            "Info": "Enable the function of reporting dropped SQ traffic.\n-"
        },
        {
            "Parameters": "inbound",
            "Info": "Specifies inbound direction.\n-"
        },
        {
            "Parameters": "outbound",
            "Info": "Specifies outbound direction.\n-"
        },
        {
            "Parameters": "both",
            "Info": "Specifies inbound and outbound direction.\n-"
        },
        {
            "Parameters": "daa",
            "Info": "Indicates DAA services.\n-"
        },
        {
            "Parameters": "start",
            "Info": "Indicates accounting start packets.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] domain isp1",
            "[*HUAWEI-aaa-domain-isp1] commit",
            "[~HUAWEI-aaa-domain-isp1] value-added-service accounting-merge edsg stop report-dropped-flowqueue inbound"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen a large number of users go online and each user applies for many value-added services, a large number of accounting packets are generated. The processing capability of a RADIUS accounting server is limited. To prevent the number of accounting packets from exceeding the processing capability of a RADIUS accounting server, the number of accounting packets sent by a device to a RADIUS accounting server must be reduced. You can run the value-added-service accounting-merge command to enable accounting packet merging for value-added services to relieve the pressure on the RADIUS accounting server.You can specify the report-dropped-flowqueue keyword in the command to enable the function of reporting dropped SQ traffic, preventing incorrect EDSG accounting.\nWhen enabling real-time accounting packet merging for value-added services, specify the hash parameter to implement the hash function for post-merging real-time accounting packets, further relieving the pressure on the RADIUS accounting server.\nConfiguration Impact\nAfter real-time accounting packet merging is enabled for value-added services, the real-time accounting interval in a value-added service policy's accounting scheme does not take effect. The value specified by <interval> in the value-added-service accounting-merge command is used as the real-time accounting interval. If both <interval> and hash are specified, the time for sending a real-time accounting packet for the first time is random and the random time ranges from <interval> to 2 x <interval>.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nWhen dual-device backup is deployed for EDSG services, the configurations for accounting packet merging must be the same on the master and backup devices to ensure that the merging behaviors remain unchanged after a master/backup device switchover."
}