{
    "PageTitle": "value-added-service update-online-edsg rate-limit service-policy",
    "FuncDef": "The value-added-service update-online-edsg rate-limit service-policy command updates the rate limit of online EDSG services.",
    "CLIs": [
        "value-added-service update-online-edsg rate-limit service-policy [ cache [ <cache-policy-name> ] | configuration [ configuration ] ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "cache cache-policy-name",
            "Info": "Specifies the name of a cached service policy.\nThe value is a string of 1 to 200 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "configuration configuration",
            "Info": "Specifies the name of a locally configured service policy.\nThe value is a string of 1 to 64 case-insensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] value-added-service update-online-edsg rate-limit service-policy cache",
            "Warning : The online EDSG service will adjust the rate limit in the existing ser",
            "vice policy. Continue? [Y/N]:y                                                  ",
            "Info: Run the display value-added-service update-online-edsg process-information",
            " command to view the process information."
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter an EDSG service policy is downloaded from a remote server, you can configure a cached policy update period to synchronize the policy configuration on the BRAS and remote server if the rate limit in the policy changes. The updated EDSG service policy is used for subsequently activated services. The rate limit in the cached policy after update must be used for services that have been activated. To update the rate limit in the policy, run the value-added-service update-online-edsg rate-limit service-policy command.\nImplementation Procedure\nAfter the value-added-service update-online-edsg rate-limit service-policy command is run, the system displays a message. You can enter y or n as prompted.\nConfiguration Impact\nWhen the update operation is performed, CPU usage on the interface board and main control board rises instantaneously. After the update operation is complete, CPU usage on the interface board and main control board recovers.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nIf a master/slave switchover occurs during the update operation, the new master main control board performs the update operation again after the smoothing process is complete."
}