{
    "PageTitle": "value-added-service edsg family-schedule",
    "FuncDef": "The value-added-service edsg family-schedule command enables EDSG services to support HQoS scheduling for home users.\nThe undo value-added-service edsg family-schedule command restores the default configuration.\nBy default, EDSG services do not support HQoS scheduling for home users.",
    "CLIs": [
        "value-added-service edsg family-schedule { inbound | outbound }",
        "undo value-added-service edsg family-schedule { inbound | outbound }"
    ],
    "ParentView": [
        "AAA domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "inbound",
            "Info": "Indicates upstream traffic for home users.\n-"
        },
        {
            "Parameters": "outbound",
            "Info": "Indicates downstream traffic for home users.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[*HUAWEI-aaa] domain ppp",
            "[*HUAWEI-aaa-domain-ppp] value-added-service edsg family-schedule outbound"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[*HUAWEI-aaa] domain ppp",
            "[*HUAWEI-aaa-domain-ppp] value-added-service edsg family-schedule outbound"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nHQoS guarantees the bandwidth of many users' services in the DiffServ model. Home users support HQoS, but differentiated traffic statistics and accounting cannot be performed. To resolve this issue, run the value-added-service edsg family-schedule command to enable EDSG services to support HQoS scheduling for home users. After the command is run and HQoS scheduling is performed for all services of home users, rate limit separation is performed for EDSG service traffic. Services are distinguished based on UCLs and enter a home queue for rate limit and statistics collection.\nConfiguration Impact\nEDSG accounting is implemented based on HQoS not CAR.\nPrecautions\nAfter EDSG services are enabled to support uniform HQoS scheduling for home users, downstream traffic from the network side to the user side takes effect only on boards with ETM subcards. For boards without ETM subcards, CAR rate limit is performed for home users. User traffic is uniformly scheduled based on a home SQ and then CAR rate limit is performed during service differentiation. In this situation, uniform HQoS scheduling cannot be performed for home users.\nETM subcards in product forms are named as follows: P480-A/P101-A/P51-E/LPUI-51-E/P101-E/P240-E/LPUI-480-B/P52-E"
}