{
    "PageTitle": "value-added-service edsg accounting",
    "FuncDef": "The value-added-service edsg accounting command enables a device to send a real-time accounting packet carrying the HW-Acct-Update-Address (26-159) attribute with a value of 1 for EDSG services when the user address changes.\nThe undo value-added-service edsg accounting command restores the default configuration.\nBy default, when the user address changes, a device does not send a real-time accounting packet carrying the HW-Acct-Update-Address (26-159) attribute with a value of 1 for EDSG services.",
    "CLIs": [
        "value-added-service edsg accounting interim send-update user-ip enable",
        "undo value-added-service edsg accounting interim send-update user-ip enable"
    ],
    "ParentView": [
        "AAA view"
    ],
    "ParaDef": [
        {
            "Parameters": "interim",
            "Info": "Indicates real-time accounting.\n-"
        },
        {
            "Parameters": "send-update",
            "Info": "Indicates that a real-time accounting packet for EDSG services is sent when the user address changes.\n-"
        },
        {
            "Parameters": "user-ip",
            "Info": "Indicates the user IP address.\n-"
        },
        {
            "Parameters": "enable",
            "Info": "Indicates that real-time accounting packets are sent for EDSG services.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[*HUAWEI-aaa] value-added-service edsg accounting interim send-update user-ip enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nUser address changes involve the following scenarios:\nWhen a single-stack user changes to a dual-stack user, the user address changes to two addresses.When a dual-stack user changes to a single-stack user, the user addresses change to one address.\nIf a device is performing accounting on EDSG services during a user address change, the device must notify the accounting server of the change. To enable a device to send a real-time accounting packet carrying the HW-Acct-Update-Address (26-159) attribute with a value of 1 for EDSG services, run the value-added-service edsg accounting command.\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}