{
    "PageTitle": "web-server redirect-limit",
    "FuncDef": "The web-server redirect-limit command configures the maximum number of times that advertisements are forcibly pushed for an HTTP redirection profile.\nThe web-server redirect-limit infinite command sets no limit on the maximum number of times that advertisements are forcibly pushed for an HTTP redirection profile.\nThe undo web-server redirect-limit command deletes the maximum number of times that advertisements are forcibly pushed configured for an HTTP redirection profile.After the command is run, the maximum number of times that advertisements are forcibly pushed for an HTTP redirection profile is restored to the default value (2).\nThe default maximum number of times that advertisements are forcibly pushed is 2 for an HTTP redirection profile.",
    "CLIs": [
        "web-server redirect-limit <limit-value>",
        "web-server redirect-limit infinite",
        "undo web-server redirect-limit <limit-value>",
        "undo web-server redirect-limit infinite"
    ],
    "ParentView": [
        "HTTP redirection profile view"
    ],
    "ParaDef": [
        {
            "Parameters": "redirect-limit limit-value",
            "Info": "Specifies the maximum number of times that advertisements are forcibly pushed.\nThe value is an integer ranging from 1 to 5."
        },
        {
            "Parameters": "infinite",
            "Info": "Sets no limit on the maximum number of times that advertisements are forcibly pushed for an HTTP redirection profile.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] http-redirect-profile http2",
            "[~HUAWEI-redirect-profile-http2] web-server redirect-limit 3"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] http-redirect-profile http2",
            "[~HUAWEI-redirect-profile-http2] web-server redirect-limit  infinite"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter an HTTP redirection profile is bound to a service policy, the captive portal function based on EDSG services is enabled. To configure the maximum number of times that advertisements are forcibly pushed for an HTTP redirection profile, run the web-server redirect-limit command.If command web-server redirect-limit infinite is configured, it indicates that there is no limit on the maximum number.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nAn HTTP redirection profile bound to a prepaid profile is used for redirection after service quotas are exhausted. Therefore, the configured maximum number of times that advertisements are forcibly pushed does not take effect for a prepaid profile."
}