{
    "PageTitle": "flexe config-mode",
    "FuncDef": "The flexe config-mode command sets a bandwidth configuration mode of a FlexE interface to the bandwidth mode or timeslot mode.\nThe undo flexe config-mode command restores the default bandwidth configuration mode of a FlexE interface.\nBy default, the bandwidth configuration mode of a FlexE client is the bandwidth mode.",
    "CLIs": [
        "flexe config-mode card <card-id> { bandwidth | timeslot }",
        "undo flexe config-mode card <card-id> [ bandwidth | timeslot ]"
    ],
    "ParentView": [
        "Slot view"
    ],
    "ParaDef": [
        {
            "Parameters": "bandwidth",
            "Info": "Specifies the bandwidth configuration mode of a FlexE client is the bandwidth mode.\n-"
        },
        {
            "Parameters": "timeslot",
            "Info": "Specifies the bandwidth configuration mode of a FlexE client is the timeslot mode.\n-"
        },
        {
            "Parameters": "card card-id",
            "Info": "Specifies the subcard ID.\nThe value is an integer."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] slot 1",
            "[~HUAWEI-slot-1] flexe config-mode card 1 timeslot"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] slot 1",
            "[~HUAWEI-slot-1] undo flexe config-mode card 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen the configuration mode of the FlexE client bandwidth is bandwidth mode, you can run the flexe-bandwidth { 1 | 2 | 3| 4 | bandwidth-value } command to configure the bandwidth for the FlexE client.\nWhen the configuration mode of the FlexE client bandwidth is the timeslot mode, run the bingding bingding interface time-slot command to bind one or more 5G granularity timeslots of the flexible Ethernet mode physical interface in the FlexE group or any one or more sub-timeslots of the same 5G timeslot granularity to the FlexE client, the bound timeslots constitute the bandwidth of the FlexE client.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}