{
    "PageTitle": "flexe-bandwidth",
    "FuncDef": "The flexe-bandwidth command sets a bandwidth value for a FlexE client.\nThe undo flexe-bandwidth command restores the default value.\nBy default, no bandwidth is bound to a FlexE client.",
    "CLIs": [
        "flexe-bandwidth { 1 | 2 | 3 | 4 | <bandwidth> }",
        "flexe-bandwidth { 1.25 | <2.5> | 3.75 | <bandwidth> }",
        "flexe-bandwidth <bandwidth>",
        "undo flexe-bandwidth [ 1 | 2 | 3 | 4 | <bandwidth> ]",
        "undo flexe-bandwidth [ 1.25 | <2.5> | 3.75 | <bandwidth> ]",
        "undo flexe-bandwidth [ <bandwidth> ]"
    ],
    "ParentView": [
        "FlexE Client View"
    ],
    "ParaDef": [
        {
            "Parameters": "bandwidth",
            "Info": "Specifies a bandwidth value for a FlexE client.\nThe value is an integer ranging from 5 to 4294967295."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] flexe client-instance 1",
            "[~HUAWEI-flexe-client-1] flexe-bandwidth 4"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the sub-timeslot granularity of a subcard uses the default value, run the flexeth group group-id bandwidth bandwidth-value command to configure a bandwidth value for the interface.\nIf the sub-timeslot granularity of a subcard is 1 Gbit/s, run the flexeth group group-id bandwidth { 1 | 2 | 3 | 4 | bandwidth-value } command to configure a bandwidth value for the interface.\nIf the sub-timeslot granularity of a subcard is 1.25 Gbit/s, run the flexeth group group-id bandwidth { 1.25 | 2.5 | 3.75 | bandwidth-value } command to configure a bandwidth value for the interface.\nIf the sub-timeslot granularity of a subcard is set to 1 Gbit/s or 1.25 Gbit/s, some FlexE interfaces are not allocated with timeslots or allocated with insufficient timeslots. After flexible Ethernet mode is enabled on an interface, the interface bandwidth can be flexibly configured.\nIf the sub-timeslot granularity of a subcard uses the default value, run the flexeth group group-id bandwidth bandwidth-value command to configure a bandwidth value for the interface.\nIf the sub-timeslot granularity of a subcard is 1 Gbit/s, run the flexeth group group-id bandwidth { 1 | 2 | 3 | 4 | bandwidth-value } command to configure a bandwidth value for the interface.\nIf the sub-timeslot granularity of a subcard is set to 1 Gbit/s, some FlexE interfaces are not allocated with timeslots or allocated with insufficient timeslots.\nPrerequisites\nWhen the bandwidth value set for a FlexE client on a subcard is less than 5 Gbit/s, run the set flexe sub-time-slot granula command to configure a sub-timeslot granularity for the subcard.\nPrecautions\nIn VS mode, this command is supported only by the admin VS. After a bandwidth value is configured for a FlexE logical interface in admin VS and then the FlexE logical interface is added to VSn, the bandwidth value is retained.\nTo ensure proper communication, the bandwidth values must be consistent between FlexE interfaces.\nIf a FlexE interface has services configured, the undo flexe-bandwidth command can be run only after the services are removed."
}