{
    "PageTitle": "force-physical-mode ethernet",
    "FuncDef": "The force-physical-mode ethernet command enables forcible FlexE-to-Ethernet mode switchover for a physical interface in FlexE mode.\nThe undo force-physical-mode command restores the default working mode (FlexE) for a physical interface in FlexE mode.",
    "CLIs": [
        "force-physical-mode ethernet",
        "undo force-physical-mode [ ethernet ]"
    ],
    "ParentView": [
        "FlexE-100G interface view",
        "FlexE-50G interface view",
        "FlexE-50|100G interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface FlexE-50G 1/1/1",
            "[~HUAWEI-FlexE-50G 1/1/1] force-physical-mode ethernet",
            "Warning: This operation may cause services on the port to be interrupted. Are you sure you want to continue? [Y/N]:Y"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the local interface works in FlexE mode and the connected interface works in Ethernet mode, DCN communication between the two interfaces fails, causing downstream devices to fail to be managed by the NMS. To address this problem, run the force-physical-mode Ethernet command to enable forcible FlexE-to-Ethernet mode switchover for the local interface.\nFollow-up Procedure\nAfter running this command to forcibly switch the working mode of an interface to Ethernet, the working mode is switched back to FlexE 20 minutes later if no other operations are performed. You can perform the following operations as required:\nRun the phyautoclear forcephysicalmode enable command to change the working time of the Ethernet mode. After the time elapses, the working mode automatically switches back to FlexE.If the interface needs to stay in Ethernet mode, run the phyautoclear forcephysicalmode disable command to disable the switchback from Ethernet mode to FlexE mode.\n\nPrecautions\nAfter the command is run, the interface works in Ethernet mode temporarily, but the interface type is still FlexE."
}