{
    "PageTitle": "phyautoclear forcephysicalmode",
    "FuncDef": "The phyautoclear forcephysicalmode enable command sets the time for switching the underlying working mode of an interface from Ethernet back to FlexE.\nThe phyautoclear forcephysicalmode disable command disables the switchback of the underlying working mode of an interface from Ethernet to FlexE.\nThe undo phyautoclear forcephysicalmode command restores the default configuration.\nBy default, the time for switching the underlying working mode of an interface from Ethernet back to FlexE is 20 minutes.",
    "CLIs": [
        "phyautoclear forcephysicalmode { enable <cleartime> | disable }",
        "undo phyautoclear forcephysicalmode"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "cleartime",
            "Info": "Specifies the time for switching the underlying working mode of an interface from Ethernet back to FlexE, in minutes.\nThe value is an integer that ranges from 1 to 2880."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "Enter system view, return user view with return command.",
            "[~HUAWEI] phyautoclear forcephysicalmode enable 30"
        ],
        [
            "<HUAWEI> system-view",
            "Enter system view, return user view with return command.",
            "[~HUAWEI] phyautoclear forcephysicalmode disable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo interconnect an interface in FlexE mode on a device to an interface in Ethernet mode on another device, you can run the force-physical-mode ethernet command to forcibly change the working mode of the local interface to Ethernet. The default working time of the Ethernet mode is 20 minutes. After 20 minutes, the working mode of the local interface automatically switches back to FlexE. In this case, you can perform the following operations as required:\nRun the phyautoclear forcephysicalmode enable command to change the working time of the Ethernet mode. After the time elapses, the working mode automatically switches back to FlexE.If the interface needs to stay in Ethernet mode, run the phyautoclear forcephysicalmode disable command to disable the switchback from Ethernet mode to FlexE mode.\n\nPrerequisites\nThe underlying working mode of the interface has been changed from FlexE to Ethernet using the force-physical-mode ethernet command.\nPrecautions\nThe interface type is still FlexE even when the underlying working mode is Ethernet."
}