{
    "PageTitle": "port-speed",
    "FuncDef": "The port-speed command switches an interface between 50GE mode and 100GE mode.\nThe undo port-speed command cancels the configuration for the interface rate.\nBy default, the interface rate is 50GE.",
    "CLIs": [
        "port-speed { 50ge | 100ge }",
        "undo port-speed [ 50ge | 100ge ]"
    ],
    "ParentView": [
        "50|100GE interface view",
        "FlexE-50|100G interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "50ge",
            "Info": "50GE.\n-"
        },
        {
            "Parameters": "100ge",
            "Info": "100GE.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~",
            "\t\t\t\t\tHUAWEI] interface 50|100GE 1/0/0",
            "\t\t\t\t\t",
            "[~",
            "\t\t\t\t\tHUAWEI-50|100GE 1/0/0] port-speed 50GE"
        ]
    ],
    "ExtraInfo": "Usage Scenario\n\n\nTo switch an interface's bandwidth according to service requirements, run the port-speed command.\n\nConfiguration Impact\n\n\nIf port 0 and port 1 on a subcard are both in 50GE mode, port 1 will be deleted after you run the port-speed 100GE command on port 0 to switch 50GE to 100GE.\nIf port 0 on a subcard is in 100GE mode, port 1 will be created and work in 50GE mode after you run the port-speed 50GE command to switch 100GE to 50GE.\n\nPrecautions\n\n\n\nIn VS mode, this command is supported only by the admin VS.\nThe port-speed command can be run only on port 0 of a 2x50GE subcard.\nIf an interface has been configured to work in manual mode using the switch-mode manual command, the interface rate can be switched accordingly after the port-speed command is run.\nIf an interface has been configured to work in optical module auto-negotiation mode using the switch-mode auto command, the port-speed command configuration is displayed but does not take effect, and the interface rate is not switched.\nIf port 0 on a subcard is a 100GE FlexE interface in a FlexE group, the interface can be switched to 50GE mode only after being removed from the FlexE group.\nIf port 1 on a subcard is a 50GE FlexE interface in a FlexE group, port 0 can be switched to 100GE mode only after being removed from the FlexE group."
}