{
    "PageTitle": "set flexe sub-time-slot granula",
    "FuncDef": "The set flexe sub-time-slot granula command sets a sub-timeslot granularity for a subcard.\nThe undo set flexe sub-time-slot granula command deletes the sub-timeslot granularity configured for a subcard.\nBy default, the sub-timeslot granularity for a subcard is 5 Gbit/s.",
    "CLIs": [
        "set flexe sub-time-slot granula slot <slot-id> card <card-id> { 1g | 1.25g | 5g }",
        "undo set flexe sub-time-slot granula slot <slot-id> card <card-id> [ 1g | 1.25g | 5g ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "card card-id",
            "Info": "Specifies the subcard ID.\nThe value is an integer that ranges from 0 to 4294967295."
        },
        {
            "Parameters": "1g",
            "Info": "Sets the sub-timeslot granularity to 1 Gbit/s.\n-"
        },
        {
            "Parameters": "1.25g",
            "Info": "Sets the sub-timeslot granularity to 1.25 Gbit/s.\n-"
        },
        {
            "Parameters": "5g",
            "Info": "Retains the default sub-timeslot granularity of 5 Gbit/s.\n-"
        },
        {
            "Parameters": "slot slot-id",
            "Info": "Specifies the slot ID of a board.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] set flexe sub-time-slot granula slot 1 card 2 1G"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] undo set flexe sub-time-slot granula slot 1 card 2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen the bandwidth value set for a FlexE client on a subcard is less than 5 Gbit/s, run the set flexe sub-time-slot granula command to configure a sub-timeslot granularity for the subcard.A sub-timeslot granularity is planned as needed:\nIf the sub-timeslot granularity uses the default value of 5 Gbit/s, the bandwidth value of a FlexE client is an integer multiple of 5 Gbit/s, such as 5 Gbit/s, 10 Gbit/s, 15 Gbit/s, and so on.If the sub-timeslot granularity is set to 1 Gbit/s, the bandwidth value of a FlexE client is 1 Gbit/s, 2 Gbit/s, 3 Gbit/s, 4 Gbit/s, or an integer multiple of 5 Gbit/s.If the sub-timeslot granularity is set to 1 Gbit/s, the bandwidth value of a FlexE client is 1.25 Gbit/s, 2.5 Gbit/s, 3.75 Gbit/s, or an integer multiple of 5 Gbit/s.\n\nPrecautions\nIf the FlexE client has been bound bandwidth, the undo set flexe sub-time-slot granula command cannot be executed on the subcard."
}