{
    "PageTitle": "switch-mode",
    "FuncDef": "The switch-mode command switches an interface between manual mode and optical module auto-negotiation mode.\nThe undo switch-mode command restores the default configuration.\nBy default,a subcard's interface rate configuration mode is manual mode.",
    "CLIs": [
        "switch-mode { manual | auto }",
        "undo switch-mode [ manual | auto ]"
    ],
    "ParentView": [
        "50|100GE interface view",
        "FlexE-50|100G interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "manual",
            "Info": "Sets the interface rate configuration mode to manual mode.\n-"
        },
        {
            "Parameters": "auto",
            "Info": "Sets the interface rate configuration mode to auto-negotiation mode.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface 50|100GE 2/0/0",
            "[~HUAWEI-50|100GE2/0/0] switch-mode manual"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo switch the interface rate configuration mode between manual mode and optical module auto-negotiation mode, run the switch-mode command.\nAfter the switch-mode auto command is run, the interface rate is automatically negotiated based on the optical module type. If an interface has a 50GE optical module inserted, the interface rate is automatically negotiated to 50GE mode. If an interface has a 100GE optical module inserted, the interface rate is automatically negotiated to 100GE mode. If an interface has an optical module other than the preceding two types inserted, auto-negotiation is not performed, and the interface rate remains unchanged.When you run the switch-mode manual command to switch the auto-negotiation mode of a 50GE or 100GE interface to manual mode, if the default interface rate configuration is used (that is, no configuration is displayed in the display this command output), the interface works in forcible 50GE mode. If the port-speed 100GE command configuration exists on the interface (that is, configuration is displayed in the display this command output), the interface works in 100GE mode.\n\nPrecautions\nThe switch-mode command can be run only on port 0 of a 2 x 50GE subcard.\nIf port 0 on a subcard is added to a VS, the auto-negotiation 50GE or 100GE mode is not supported.\nIf port 1 on a subcard is added to a VS, port 0 cannot be auto-negotiated to 100GE.\nIf port 0 or port 1 on a subcard functions as an interconnected interface for a virtual cluster, auto-negotiation is not supported.\nDuring an ISSU of a device, auto-negotiation is not supported."
}