{
    "PageTitle": "timeslot-negotiation mode disable",
    "FuncDef": "The timeslot-negotiation mode disable command disables timeslot negotiation.\nThe undo negotiate-negotiation mode command enables timeslot negotiation.\nBy default, the timeslot negotiation mode is enabled.",
    "CLIs": [
        "timeslot-negotiation mode disable",
        "undo timeslot-negotiation mode disable"
    ],
    "ParentView": [
        "FlexE Group View"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] flexe group 1",
            "[*HUAWEI-flexe-group-1] timeslot-negotiation mode disable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] flexe group 1",
            "[*HUAWEI-flexe-group-1] undo timeslot-negotiation mode disable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\n-When the docking device does not support the dynamic negotiation capability, you need to configure time slot negotiation to disable it in the local FlexE Group view.-The groups at both ends of the interconnection must be configured with the same time slot negotiation mode. Otherwise, after performing reliability operations (such as active/standby switchover, resetting of subcards, shut down/undo shut down ports, etc.), the FlexE port may not be up or flow. Nowhere.-After the group at both ends of the interconnection is configured with time slot negotiation and disabled, the corresponding client at both ends need to be configured with exactly the same time slot number, otherwise the FlexE port may not be up or the traffic may not be connected.\nPrerequisites\nBefore running the timeslot-negotiation mode disable command to disable timeslot negotiation for a FlexE group, ensure that the timeslot mode is configured on the subcard where the PHY bound to the group resides.\nBefore running the timeslot-negotiation mode disable command to disable timeslot negotiation for a FlexE group, ensure that clients in the group are not bound to any sub-timeslots."
}