{
    "PageTitle": "protection",
    "FuncDef": "This command specifies the format of the Python script file(s) in this python-script. Unintentional changing of Python script file could be prevented by using protected format.",
    "CLIs": [
        "protection none",
        "protection hmac-sha256 key <key> [ hash | hash2 ]",
        "no protection"
    ],
    "ParentView": [
        "config>python>py-script"
    ],
    "ParaDef": [
        {
            "Parameters": "none",
            "Info": "Indicates the Python script is stored in plain-text, without any mechanism in place to ensure the integrity nor the confidentiality of the content of the Python script."
        },
        {
            "Parameters": "hmac-sha256",
            "Info": "Indicates the first line of the Python script must consist of the hash value obtained by hashing the rest of the Python script using the hmac-sha256 hashing algorithm given the key specified in tmnxPythonScriptProtectionKey."
        },
        {
            "Parameters": "key key",
            "Info": "The specified key along with original Python script file content are used to compute the hash. The computed hash will be compared to the hash in the Python script file. If there is no match, then system will fail to load the script."
        },
        {
            "Parameters": "hash",
            "Info": "Specifies the key is entered in an encrypted form. If the hash or hash2 parameter is not used, the key is assumed to be in an unencrypted, clear text form. For security, all keys are stored in encrypted form in the configuration file with the hash or hash2 parameter specified."
        },
        {
            "Parameters": "hash2",
            "Info": "Specifies the key is entered in a more complex encrypted form that involves more variables than the key value alone, meaning that the hash2 encrypted variable cannot be copied and pasted. If the hash or hash2 parameter is not used, the key is assumed to be in an unencrypted, clear text form. For security, all keys are stored in encrypted form in the configuration file with the hash or hash2 parameter specified."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}