{
    "PageTitle": "display ip route-monitor-group track-route",
    "FuncDef": "The display ip route-monitor-group track-route command displays information about all route monitoring groups to which routes are added.",
    "CLIs": [
        "display ip route-monitor-group track-route [ vpn-instance <vpn-instance-name> ] <destination> { <mask> | <mask-length> }"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Displays information about all route monitoring groups to which routes in the specified VPN instance are added; if vpn-instance vpn-instance-name is not specified, information about all route monitoring groups to which public routes are added is displayed.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "destination",
            "Info": "Specifies the destination IP address of a route.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "mask",
            "Info": "Specifies the mask of the destination IP address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "mask-length",
            "Info": "Specifies the mask length.\nThe value is an integer ranging from 0 to 32."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display ip route-monitor-group track-route 192.168.1.0 24",
            " Route monitor group      Total weight     Down weight    State",
            " uplink                   600              100            Enabled",
            " downlink                 500              20             Enabled"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter a route monitoring group is configured using the ip route-monitor-group command, you can run the track ip route command to add all monitored network-side routes of the same type to the route monitoring group. One route can be added to multiple route monitoring groups. You can run the display ip route-monitor-group track-route command to check the following information:\nInformation about all route monitoring groups to which a route has been addedWhether a route has been added to a route monitoring groupWhether a route has been deleted from a route monitoring group"
}