{
    "PageTitle": "ip route-monitor-group",
    "FuncDef": "The ip route-monitor-group command creates a route monitoring group and displays the route monitoring group view or directly displays the route monitoring group view if the route monitoring group has been created.\nThe undo ip route-monitor-group command deletes a route monitoring group.\nBy default, no route monitoring groups are created.",
    "CLIs": [
        "ip route-monitor-group <group-name>",
        "undo ip route-monitor-group <group-name>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "group-name",
            "Info": "Specifies the name of a route monitoring group.\nThe name is a string of 1 to 31 case-sensitive characters, spaces not supported. The string can contain spaces if it is enclosed with double quotation marks (\" \")."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip route-monitor-group uplink"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAll monitored network-side routes of the same type can be added to a group called a route monitoring group. Each route monitoring group is identified by a unique name. To create a route monitoring group, run the ip route-monitor-group command.A route monitoring group monitors the status of its member routes, each of which has a down-weight. The down-weight indicates the link quality. The larger the down-weight value, the more important the route. The down-weight can be set based on parameters, such as the link bandwidth, rate, and cost.- If a route in the route monitoring group goes Down, its down-weight is added to the down-weight sum of the route monitoring group.- If a route in the route monitoring group goes Up again, its down-weight is subtracted from the down-weight sum of the route monitoring group.\nFollow-up Procedure\nRun the track ip route command to add routes to the route monitoring group. After routes are added to the route monitoring group, run the monitor enable command in the route monitoring group view to enable the route monitoring group.\nIn a dual-device hot backup scenario, you can associate specified service modules with a route monitoring group to protect specified services.\nPrecautions\nA maximum of 32 route monitoring groups can be created.\nRoute monitoring groups that are being used cannot be deleted."
}