{
    "PageTitle": "fr dlci",
    "FuncDef": "The fr dlci command configures a VC for an FR interface.\nThe undo fr dlci command deletes a VC configured on an FR interface.\nBy default, no VC is configured for an FR interface.",
    "CLIs": [
        "fr dlci <dlci-value>",
        "undo fr dlci [ <dlci-value> ]"
    ],
    "ParentView": [
        "POS sub-interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "dlci-value",
            "Info": "Specifies the number of a DLCI.\nThe value is an integer ranging from 16 to 1007."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Pos 1/0/0.1",
            "[~HUAWEI-Pos1/0/0.1] fr dlci 100"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nFR is a statistics multiplexing protocol that provides multiple virtual circuits (VC) on a single physical link. Each VC is identified by a data link connection identifier (DLCI). As VCs are connection-oriented, it ensures that user frames can be transmitted to the destination in sequence. To configure a VC, run the fr dlci command.\nVCs can be PVCs or switched virtual circuits (SVCs).\nPVCs are manually configured.SVCs are automatically created and deleted through protocol negotiations. When a local device needs to be connected to the remote device, the local device sends a request for VC connection to the FR switch. If the request is granted, the FR switch assigns a VC. The VC can be deleted by the local device or FR switch after the communication between the local and remote devices is complete.\nCurrently, PVCs are more common than SVCs on FR-capable networks.\n\nPrerequisites\nThe link layer protocol of the interface has been set to FR using the link-protocol fr command.\nConfiguration Impact\nA DLCI has only local significance. The same DLCI on different physical interfaces identify different VCs on an FR network.\nIf the fr dlci command is run more than once, the latest configuration overrides the previous one.\nPrecautions\nThe DLCI on the DTE must be the same as that on the DCE.The DLCI is unique on a physical interface.If no DLCI is specified in the undo fr dlci command, all the DLCIs on the interface are deleted. If the undo fr dlci command is run on an FR interface, DLCIs on its sub-interfaces are not deleted.When all DLCIs on an interface are deleted, all VCs on the interface are also deleted, affecting FR services."
}