{
    "PageTitle": "fr lmi type",
    "FuncDef": "The fr lmi type command configures an LMI protocol type.\nThe undo fr lmi type command restores the default configuration.\nBy default, the LMI protocol type is q933a on interfaces.",
    "CLIs": [
        "fr lmi type { ansi | nonstandard | q933a }",
        "undo fr lmi type"
    ],
    "ParentView": [
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "ansi",
            "Info": "Sets the LMI protocol type to ANSI T1.617 Appendix D.\n-"
        },
        {
            "Parameters": "nonstandard",
            "Info": "Sets the LMI protocol type to non-standard compatibility.\n-"
        },
        {
            "Parameters": "q933a",
            "Info": "Sets the LMI protocol type to Q.933 Appendix A.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Pos 1/0/0",
            "[~HUAWEI-Pos1/0/0] link-protocol fr",
            "[*HUAWEI-Pos1/0/0] fr lmi type nonstandard"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter a PVC is set up, both the DCE and DTE use LMI to learn the PVC status.\nLocal Management Interface (LMI) is a protocol that uses status enquiry messages and state messages to maintain link and PVC status, including adding PVC status information, deleting information about disconnected PVCs, monitoring PVC status changes, and checking link integrity.\nA device supports three LMI protocol types: ANSI T1.617 Appendix D, non-standard compatibility, and Q.933 Appendix A. To configure an LMI protocol type, run the fr lmi type command.\nPrerequisites\nThe link type has been set to FR using the link-protocol fr command.\nConfiguration Impact\nIf the fr lmi type command is run more than once, the latest configuration overrides the previous one, and LMI is renegotiated based on the new configuration.\nPrecautions\nRunning the fr lmi type command affects the LMI negotiation process. Therefore, exercise caution when running this command."
}