{
    "PageTitle": "fr lmi n391dte",
    "FuncDef": "The fr lmi n391dte command configures the full status polling counter (N391) for the DTE during LMI negotiation.\nThe undo fr lmi n391dte command restores the default setting.\nBy default, the N391 value is 6 on the DTE.",
    "CLIs": [
        "fr lmi n391dte <n391value>",
        "undo fr lmi n391dte"
    ],
    "ParentView": [
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "n391value",
            "Info": "Specifies the full status polling counter (N391) on the DTE.\nThe value is an integer ranging from 1 to 255."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Pos 1/0/0",
            "[~HUAWEI-Pos1/0/0] link-protocol fr",
            "[*HUAWEI-Pos1/0/0] fr interface-type dte",
            "[*HUAWEI-Pos1/0/0] fr lmi n391dte 10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nLocal Management Interface (LMI) is a protocol that uses status enquiry messages and state messages to maintain link and PVC status, and its working process is as follows:\nThe DTE sends a status enquiry message (full status report or a link integrity verification only report) at an interval specified by T391 to request the PVC status. Upon receipt of the report, the DCE replies with a status message to notify the DTE of the link integrity. After sending a specified number (N391 - 1) of status enquiry messages, the DTE sends a full status report to the DCE, and the DCE then notifies the DTE of the status of all PVCs.\nThe number of full status reports and link integrity verification only reports to be sent is determined using the formula: Number of link integrity verification only reports/Number of full status reports = (N391 - 1)/1.\nPrerequisites\nThe FR interface type has been set to DTE using the fr interface-type command.\nConfiguration Impact\nIf the fr lmi n391dte command is run more than once, the latest configuration overrides the previous one."
}