{
    "PageTitle": "fr lmi n392dte",
    "FuncDef": "The fr lmi n392dte command configures an error threshold (N392) used for LMI negotiation on a DTE.\nThe undo fr lmi n392dte command restores the default configuration.\nBy default, the N392 value is 3 on a DTE.",
    "CLIs": [
        "fr lmi n392dte <n392dtevalue>",
        "undo fr lmi n392dte"
    ],
    "ParentView": [
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "n392dtevalue",
            "Info": "Specifies an error threshold used for LMI negotiation on a DTE.\nThe value is an integer ranging from 1 to 10."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Pos 1/0/0",
            "[~HUAWEI-Pos1/0/0] link-protocol fr",
            "[*HUAWEI-Pos1/0/0] fr interface-type dte",
            "[*HUAWEI-Pos1/0/0] fr lmi n392dte 5",
            "[*HUAWEI-Pos1/0/0] fr lmi n393dte 6"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nLocal Management Interface (LMI) is a protocol that uses status enquiry messages and state messages to maintain link and PVC status, and its working process is as follows:\nTo request the PVC status, a DTE sends a status enquiry message at an interval specified by T391 to a DCE. Upon receipt of the message, the DCE replies with a status message that carries the requested status information. If the DTE does not receive such a status message during the specified period, the DTE records the error and increases the number of error events by 1. If the number of error events reaches the error threshold (N392), the DTE considers the physical link and all VCs unavailable. To configure an error threshold on a DTE, run the fr lmi n392dte command.\nPrerequisites\nThe FR interface type has been set to DTE using the fr interface-type command.\nConfiguration Impact\nRunning the fr lmi n392dte command changes the error threshold, which affects the LMI negotiation rate.\nIf the fr lmi n392dte command is run more than once, the latest configuration overrides the previous one.\nPrecautions\nN393 indicates the total number of monitored events. N392 indicates the error threshold. N392 and N393 work together to determine the error threshold.\nThe value of N392 must be smaller than that of N393 on a DTE."
}