{
    "PageTitle": "fr lmi n392dce",
    "FuncDef": "The fr lmi n392dce command configures an error threshold (N392) used for LMI negotiation on a DCE.\nThe undo fr lmi n392dce command restores the default configuration.\nBy default, the N392 value is 3 on a DCE.",
    "CLIs": [
        "fr lmi n392dce <n392dcevalue>",
        "undo fr lmi n392dce"
    ],
    "ParentView": [
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "n392dcevalue",
            "Info": "Specifies an error threshold used for LMI negotiation on a DCE.\nThe value is an integer ranging from 1 to 10."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Pos 1/0/0",
            "[~HUAWEI-Pos1/0/0] link-protocol fr",
            "[*HUAWEI-Pos1/0/0] fr interface-type dce",
            "[*HUAWEI-Pos1/0/0] fr lmi n392dce 5",
            "[*HUAWEI-Pos1/0/0] fr lmi n393dce 6"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nLocal Management Interface (LMI) is a protocol that uses status enquiry messages and state messages to maintain link and PVC status, and its working process is as follows:\nA DCE requests a status enquiry message from a DTE at an interval specified by T392. If the DCE does not receive a status enquiry message during this interval, the DCE records the error and increases the number of error events by 1. If the number of error events is greater than the error threshold, the DCE considers the physical link and all VCs unavailable.\nTo configure an error threshold, run the fr lmi n392dce command.\nPrerequisites\nThe FR interface type has been set to DCE using the fr interface-type command.\nConfiguration Impact\nRunning the fr lmi n392dce command changes the error threshold, which affects the LMI negotiation rate.\nIf the fr lmi n392dce command is run more than once, the latest configuration overrides the previous one.\nPrecautions\nN393 indicates the total number of monitored events. N392 indicates the threshold of error events in the monitored events. N392 and N393 work together to determine the error threshold.\nThe value of N392 must be smaller than that of N393 on a DCE."
}