{
    "PageTitle": "fr lmi n393dce",
    "FuncDef": "The fr lmi n393dce command configures the total number of monitored events (N393) used for LMI negotiation on a DCE.\nThe undo fr lmi n393dce command restores the default configuration.\nBy default, the N393 value is 4 on the DCE.",
    "CLIs": [
        "fr lmi n393dce <n393dcevalue>",
        "undo fr lmi n393dce"
    ],
    "ParentView": [
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "n393dcevalue",
            "Info": "Specifies the total number of monitored events (N393) used for LMI negotiation on a DCE.\nThe value is an integer ranging from 1 to 10."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Pos 1/0/0",
            "[~HUAWEI-Pos1/0/0] link-protocol fr",
            "[*HUAWEI-Pos1/0/0] fr interface-type dce",
            "[*HUAWEI-Pos1/0/0] fr lmi n392dce 5",
            "[*HUAWEI-Pos1/0/0] fr lmi n393dce 6"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nLocal Management Interface (LMI) is a protocol that uses status enquiry messages and state messages to maintain link and PVC status, and its working process is as follows:\nA DCE requests a status enquiry message from a DTE at an interval specified by T392. If the DCE does not receive a status enquiry message during this interval, the DCE records the error and increases the number of error events by 1. If the total number of error events in the monitored events (N393) reaches the error threshold N392, the DCE considers the physical link and all VCs unavailable. To configure the total number of monitored events (N393) on a DCE, run the fr lmi n393dce command.\nPrerequisites\nThe FR interface type has been set to DCE using the fr interface-type command.\nConfiguration Impact\nRunning the fr lmi n393dce command changes the N393 value and affects the error threshold, which in turn affects the LMI negotiation rate.\nIf the fr lmi n393dce command is run more than once, the latest configuration overrides the previous one.\nPrecautions\nThe value of N392 must be smaller than that of N393 on a DCE."
}