{
    "PageTitle": "fr lmi n393dte",
    "FuncDef": "The fr lmi n393dte command configures the total number of monitored events (N393) used for LMI negotiation on a DTE.\nThe undo fr lmi n393dte command restores the default configuration.\nBy default, the N393 value is 4 on the DTE.",
    "CLIs": [
        "fr lmi n393dte <n393dtevalue>",
        "undo fr lmi n393dte"
    ],
    "ParentView": [
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "n393dtevalue",
            "Info": "Specifies the total number of monitored events (N393) used for LMI negotiation on a DTE.\nThe value is an integer ranging from 1 to 10."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Pos 1/0/0",
            "[~HUAWEI-Pos1/0/0] link-protocol fr",
            "[*HUAWEI-Pos1/0/0] fr interface-type dte",
            "[*HUAWEI-Pos1/0/0] fr lmi n392dte 5",
            "[*HUAWEI-Pos1/0/0] fr lmi n393dte 6"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nLocal Management Interface (LMI) is a protocol that uses status enquiry messages and state messages to maintain link and PVC status, and its working process is as follows:\nA DTE sends a status enquiry message to a DCE at a specified interval (T391). Upon receipt of the message, the DCE replies with a status message that carries the requested status information. If the DTE does not receive the status message within the specified interval, it records the error and increases the number of error events by 1. If the total number of error events in the monitored events (N393) reaches the error threshold N392, the DTE considers the physical link and all VCs unavailable. To configure the total number of monitored events (N393) on a DTE, run the fr lmi n393dte command.\nPrerequisites\nThe FR interface type has been set to DTE using the fr interface-type command.\nConfiguration Impact\nRunning the fr lmi n393dte command changes the N393 value and affects the error threshold, which in turn affects the LMI negotiation rate.\nIf the fr lmi n393dte command is run more than once, the latest configuration overrides the previous one.\nPrecautions\nThe value of N392 must be smaller than that of N393 on a DTE."
}