{
    "PageTitle": "fr lmi t392dce",
    "FuncDef": "The fr lmi t392dce command configures a period (T392) during which a DCE waits for a status enquiry message from a DTE.\nThe undo fr lmi t392dce command restores the default configuration.\nBy default, the T392 value is 15s on the DCE.",
    "CLIs": [
        "fr lmi t392dce <t392dcevalue>",
        "undo fr lmi t392dce"
    ],
    "ParentView": [
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "t392dcevalue",
            "Info": "Specifies a period (T392) during which a DCE waits for a status enquiry message from a DTE.\nThe value is an integer ranging from 5 to 30, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Pos 1/0/0",
            "[~HUAWEI-Pos1/0/0] link-protocol fr",
            "[*HUAWEI-Pos1/0/0] fr interface-type dce",
            "[*HUAWEI-Pos1/0/0] fr lmi t392dce 10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nLocal Management Interface (LMI) is a protocol that uses status enquiry messages and state messages to maintain link and PVC status, and its working process is as follows:\nA DCE requests a status enquiry message from a DTE at an interval specified by T392. If the DCE does not receive a status enquiry message during this interval, the DCE records the error and increases the number of error events by 1. If the number of error events is greater than the error threshold, the DCE considers the physical link and all VCs unavailable.\nThe value of T392 must be greater than that of T391.\nPrerequisites\nThe FR interface type has been set to DCE using the fr interface-type command.\nConfiguration Impact\nRunning the fr lmi t392dce command changes the period during which a DCE waits for a status enquiry message from a DTE. The period affects the error threshold, which in turn affects the LMI negotiation rate.\nIf the fr lmi t392dce command is run more than once, the latest configuration overrides the previous one."
}