{
    "PageTitle": "preference (OSPFv3 view)",
    "FuncDef": "The preference command sets a priority for OSPFv3 routes.\nThe undo preference command restores the default value.\nBy default, the priority of OSPF routes is 10. When ASE is specified, the default value is 150.",
    "CLIs": [
        "preference { preference | { route-policy <route-policy-name> | route-filter <route-filter-name> } } *",
        "preference ase { preference | { route-policy <route-policy-name> | route-filter <route-filter-name> } } *",
        "undo preference",
        "undo preference ase"
    ],
    "ParentView": [
        "OSPFv3 view"
    ],
    "ParaDef": [
        {
            "Parameters": "preference",
            "Info": "Specifies a priority for OSPFv3 routes.\nThe value is an integer ranging from 1 to 255."
        },
        {
            "Parameters": "route-policy route-policy-name",
            "Info": "Specifies the name of a route-policy.\nThe name is a string of 1 to 200 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "route-filter route-filter-name",
            "Info": "Specifies the name of a route-filter used to filter routes.\nThe value is a string of 1 to 200 case-sensitive characters, spaces not supported. If parameters are included in the referenced route-filter, specify values for them in the format of (var1, var2, ...var8) behind the route-filter name. A maximum of eight parameters can be specified, and each value ranges from 1 to 200 characters."
        },
        {
            "Parameters": "ase",
            "Info": "Sets a priority for AS external routes or NSSA routes.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospfv3 1",
            "[*HUAWEI-ospfv3-1] preference 5"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nMultiple dynamic routing protocols may be run on the Router. The system needs to set a default priority for each routing protocol. If different protocols have routes to the same destination, the protocol with the higher priority is selected to forward IP packets. To set a priority for OSPFv3 routes, run the preference command.\nThe smaller the priority value, the higher the priority."
}