{
    "PageTitle": "reset ospfv3 suppress-flapping peer",
    "FuncDef": "The reset ospfv3 suppress-flapping peer command forces an interface to exit from OSPFv3 neighbor relationship flapping suppression.",
    "CLIs": [
        "reset ospfv3 <process-id> suppress-flapping peer [ <interface-name> | <interface-type> <interface-number> ]",
        "reset ospfv3 <process-id> suppress-flapping peer [ <interface-name> | <interface-type> <interface-number> ] notify-peer"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "process-id",
            "Info": "Specifies the ID of an OSPFv3 process.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "interface-name",
            "Info": "Specifies an interface name.\n-"
        },
        {
            "Parameters": "interface-type",
            "Info": "Specifies an interface type.\n-"
        },
        {
            "Parameters": "interface-number",
            "Info": "Specifies the interface number.\n-"
        },
        {
            "Parameters": "notify-peer",
            "Info": "Instructs neighbors to exit from OSPFv3 neighbor relationship flapping suppression too.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset ospfv3 1 suppress-flapping peer"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nInterfaces exit from flapping suppression in the following scenarios:\nThe suppression timer expires.The corresponding OSPFv3 process is reset.The reset ospfv3 suppress-flapping peer command is run.An OSPFv3 neighbor is reset using the reset ospfv3 peer command.OSPFv3 neighbor relationship flapping suppression is disabled globally using the suppress-flapping peer disable (OSPFv3) command in the OSPFv3 view.\nIf notify-peer is specified when the reset ospfv3 suppress-flapping peer command is run on a device, the device sends Hello packets in which HelloInterval and RouterDeadInterval are 0s to its neighbors to instruct the neighbors to exit from OSPFv3 neighbor relationship flapping suppression too. If the neighbors fail to receive such Hello packets, the function of notify-peer does not take effect. To force the neighbors to exit from OSPFv3 neighbor relationship flapping suppression, run the reset ospfv3 suppress-flapping peer command on them."
}