{
    "PageTitle": "whitelist session-car ospfv3",
    "FuncDef": "The whitelist session-car ospfv3 command sets parameters for OSPFv3 whitelist Session-CAR.\nThe undo whitelist session-car ospfv3 command restores the parameters for OSPFv3 whitelist Session-CAR to the default values.\nBy default, the OSPFv3 whitelist Session-CAR function is enabled.",
    "CLIs": [
        "whitelist session-car ospfv3 { cir <cir-value> | cbs <cbs-value> | pir <pir-value> | pbs <pbs-value> } *",
        "undo whitelist session-car ospfv3 [ { cir <cir-value> | cbs <cbs-value> | pir <pir-value> | pbs <pbs-value> } * ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "cir cir-value",
            "Info": "Specifies a committed information rate (CIR), that is, the average rate at which packets can be transmitted or forwarded.\nThe value ranges from 0 to 1000000, in kbit/s. The default value is 8."
        },
        {
            "Parameters": "cbs cbs-value",
            "Info": "Specifies a committed burst size (CBS), that is, the committed volume of burst traffic that can pass instantly.\nThe value ranges from 0 to 1000000, in bytes. The default value is 100000."
        },
        {
            "Parameters": "pir pir-value",
            "Info": "Specifies a peak information rate (PIR), that is, the peak rate at which packets can be transmitted or forwarded.\nThe value ranges from 0 to 1000000, in kbit/s. The default value is 16000."
        },
        {
            "Parameters": "pbs pbs-value",
            "Info": "Specifies a peak burst size (PBS), that is, the peak volume of burst traffic that can pass instantly.\nThe value ranges from 0 to 10000000, in bytes. The default value is 9000000."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] whitelist session-car ospfv3 cir 100 cbs 500000 pir 2000 pbs 900000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo adjust the packet channel bandwidth for OSPFv3 Session-CAR on a device, run the whitelist session-car ospfv3 command. If the device receives a large number of OSPFv3 packets, this configuration ensures that the packets can be properly sent.\nImplementation Procedure\nIf a Session-CAR parameter in an OSPFv3 whitelist is set to an excessively large or small value, the involved OSPFv3 neighbor relationships may be disconnected or flap.\nPrecautions\nIn normal cases, you are advised not to change the values of the Session-CAR parameters in an OSPF whitelist. Use the default values of these parameters instead.The PIR must be greater than or equal to the CIR, and the PBS must be greater than or equal to the CBS."
}