{
    "PageTitle": "lsa-arrival-interval (OSPFv3 view)",
    "FuncDef": "The lsa-arrival-interval command sets the interval at which OSPFv3 LSAs are received.\nThe undo lsa-arrival-interval command restores the default setting.\nBy default, an intelligent timer is enabled. The maximum interval at which OSPFv3 LSAs are received is 1000 ms, the initial interval is 500 ms, and the Holdtime interval is 500 ms.",
    "CLIs": [
        "lsa-arrival-interval <interval>",
        "lsa-arrival-interval intelligent-timer <max-interval> <start-interval> <hold-interval>",
        "undo lsa-arrival-interval"
    ],
    "ParentView": [
        "OSPFv3 view"
    ],
    "ParaDef": [
        {
            "Parameters": "interval",
            "Info": "Specifies the interval at which OSPFv3 LSAs are received.\nThe value is an integer ranging from 0 to 10000, in milliseconds."
        },
        {
            "Parameters": "intelligent-timer",
            "Info": "Sets the interval at which OSPFv3 LSAs are received through an intelligent timer.\n-"
        },
        {
            "Parameters": "max-interval",
            "Info": "Specifies the maximum interval at which OSPFv3 LSAs are received.\nThe value is an integer ranging from 1 to 120000, in milliseconds."
        },
        {
            "Parameters": "start-interval",
            "Info": "Specifies the initial interval at which OSPFv3 LSAs are received.\nThe value is an integer ranging from 0 to 60000, in milliseconds."
        },
        {
            "Parameters": "hold-interval",
            "Info": "Specifies the Holdtime interval at which OSPFv3 LSAs are received.\nThe value is an integer ranging from 1 to 60000, in milliseconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospfv3 1",
            "[*HUAWEI-ospfv3-1] lsa-arrival-interval intelligent-timer 1000 400 800"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo prevent excessive network resource consumption due to frequent network changes, you can run the lsa-arrival-interval command to configure an interval at which OSPFv3 LSAs are received.\nOn a stable network that requires fast route convergence, you can change the interval at which OSPFv3 LSAs are received to 0s. In this manner, the device can fast respond to topology or route changes, which speeds up route convergence."
}