{
    "PageTitle": "helper-role",
    "FuncDef": "The helper-role command configures the Router to support the helper mode.\nThe undo helper-role command disables the helper mode on the Router.\nBy default, the helper mode is disabled on the Router.",
    "CLIs": [
        "helper-role [ { acl-name <acl-name> | acl-number <acl-number> | ip-prefix <ip-prefix-name> } | max-grace-period <period> | planned-only | lsa-checking-ignore ] *",
        "undo helper-role [ { [ acl-name [ acl-name ] ] | [ acl-number [ acl-number ] ] | [ ip-prefix [ <ip-prefix-name> ] ] } | [ max-grace-period [ <period> ] ] | [ planned-only ] | [ lsa-checking-ignore ] ] *"
    ],
    "ParentView": [
        "OSPFv3 view"
    ],
    "ParaDef": [
        {
            "Parameters": "acl-name acl-name",
            "Info": "Specifies the name of a named basic ACL.\nThe value is a string of 1 to 64 case-sensitive characters without spaces. The value must start with a letter (a to z or A to Z, case sensitive)."
        },
        {
            "Parameters": "acl-number acl-number",
            "Info": "Specifies the number of a basic ACL.\nThe value is an integer that ranges from 2000 to 2999."
        },
        {
            "Parameters": "ip-prefix ip-prefix-name",
            "Info": "Specifies the name of an IP prefix list.\nThe name is a string of 1 to 169 case-sensitive characters, with spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "max-grace-period period",
            "Info": "Specifies the permitted maximum restart period.\nThe value is an integer ranging from 1 to 1800, expressed in seconds. The default value is 120 seconds."
        },
        {
            "Parameters": "planned-only",
            "Info": "Indicates that Routers support planned-GR only. By default, Routers support planned-GR and unplanned-GR.\n-"
        },
        {
            "Parameters": "lsa-checking-ignore",
            "Info": "Indicates that the strict check is not performed on LSAs. By default, Routers perform strict check on received LSAs.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl ipv6 2001",
            "[*HUAWEI-acl6-basic-2001] quit",
            "[*HUAWEI] ospfv3 1",
            "[*HUAWEI-ospfv3-1] helper-role acl-number 2001 max-grace-period 250 planned-only lsa-checking-ignore"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nDevices cannot use the helper mode during the GR process.\nWhen the rule (basic ACL6 view) command is used to configure a filtering rule for a named ACL, only the source address range that is specified in source and the time period that is specified in time-range take effect on the filtering rule."
}