{
    "PageTitle": "lsa-originate-interval (OSPFv3 view)",
    "FuncDef": "The lsa-originate-interval command sets the interval at which OSPFv3 LSAs are updated.\nThe undo lsa-originate-interval command restores the default setting.\nBy default, the intelligent timer is enabled; the maximum interval at which LSAs are updated is 5000 ms, the initial interval is 500 ms, and the holding interval is 1000 ms.",
    "CLIs": [
        "lsa-originate-interval { 0 | intelligent-timer <max-interval> <start-interval> <hold-interval> [ other-type <interval> ] | other-type <interval> [ intelligent-timer <max-interval> <start-interval> <hold-interval> ] }",
        "undo lsa-originate-interval"
    ],
    "ParentView": [
        "OSPFv3 view"
    ],
    "ParaDef": [
        {
            "Parameters": "0",
            "Info": "Set the interval at which OSPFv3 LSAs are updated to 0 ms.\n-"
        },
        {
            "Parameters": "intelligent-timer",
            "Info": "Enables an intelligent timer to update OSPFv3 Type 1 Router-LSAs, Tpe 2 Network-LSAs, Type5 AS-external-LSAs, Type7 NSSA LSAs, and Type 8 Link-LSAs.\n-"
        },
        {
            "Parameters": "max-interval",
            "Info": "Specifies the maximum interval at which OSPFv3 LSAs are updated.\nThe value ranges from 1 to 120000, in milliseconds."
        },
        {
            "Parameters": "start-interval",
            "Info": "Specifies the initial interval at which OSPFv3 LSAs are updated.\nThe value ranges from 0 to 60000, in milliseconds."
        },
        {
            "Parameters": "hold-interval",
            "Info": "Specifies the holding interval at which OSPFv3 LSAs are updated.\nThe value ranges from 1 to 60000, in milliseconds."
        },
        {
            "Parameters": "other-type interval",
            "Info": "Specify an interval for Type-3, Type-4 and Type-9 LSAs.\nThe value is an integer ranging from 0 to 10, in seconds. The default value is 5."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospfv3 1",
            "[*HUAWEI-ospfv3-1] lsa-originate-interval intelligent-timer 10000 700 4000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn a stable network that requires fast route convergence, intelligent-timer needs to be specified in the lsa-originate-interval command to enable an intelligent timer to update OSPFv3 LSAs so that topology changes or route changes can be immediately advertised to the network through LSAs, which speeds up route convergence. This prevents too many network bandwidth and device resources from being consumed due to network connection changes or frequent route flapping."
}