{
    "PageTitle": "authentication-mode (OSPFv3 view)",
    "FuncDef": "The authentication-mode command configures an authentication mode and a password for an OSPFv3 process or area.\nThe undo authentication-mode command deletes the authentication mode and password configured for an OSPFv3 process or area.\n\nBy default, no authentication mode or password are configured for any OSPFv3 process or area.\n\n\nBy default, authentication is not configured for an OSPFv3 process or area. Configuring authentication is recommended to ensure system security.",
    "CLIs": [
        "authentication-mode { hmac-sha256 key-id <KeyId> { plain <PlainText> | [ cipher ] <CipherText> } }",
        "undo authentication-mode { hmac-sha256 key-id <KeyId> }"
    ],
    "ParentView": [
        "OSPFv3 view"
    ],
    "ParaDef": [
        {
            "Parameters": "hmac-sha256",
            "Info": "Configures HMAC-SHA256 authentication.\n-"
        },
        {
            "Parameters": "key-id KeyId",
            "Info": "Specifies a key ID for authentication, which must be the same as the one configured at the other end.\nThe value is an integer ranging from 1 to 65535."
        },
        {
            "Parameters": "plain PlainText",
            "Info": "Specifies simple authentication. You can only type in simple passwords, and the passwords are displayed in simple mode in the configuration file.\nThe new password is at least eight characters long and contains at least two of the following types: upper-case letters, lower-case letters, digits, and special characters.For security purposes, you are advised to configure a password in ciphertext mode. To further improve device security, periodically change the password.\nThe value is a string of 1 to 255 characters.\nA password cannot contain a question mark (?), but can contain spaces if surrounded by double quotation marks (\"\"). In this case, the double quotation marks are part of the password."
        },
        {
            "Parameters": "cipher CipherText",
            "Info": "Specifies the cipher authentication. You can type in simpletext or ciphertext passwords, and the passwords are displayed in ciphertext in the configuration file.\nThe value can be a string of 1 to 255 characters for a simpletext and 20 to 432 characters for a ciphertext.\nA password cannot contain a question mark (?), but can contain spaces if surrounded by double quotation marks (\"\"). In this case, the double quotation marks are part of the password."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospfv3 100",
            "[*HUAWEI-ospfv3-100] authentication-mode hmac-sha256 key-id 10 cipher Huawei-13579"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nDue to inherent defects and flawed implementation of the TCP/IP protocol suite, there are an increasing number of attacks, which poses greater threats on TCP/IP networks than ever before. The attacks on network devices may lead to network failures. To configure an authentication mode and a password for an OSPFv3 process or area to improve OSPFv3 network security, run the authentication-mode command.\nPrecautions\nIf you use area authentication, the authentication and password configurations on the interfaces of all the routers in the area must be the same.\nOSPFv3 area authentication has a lower priority than OSPFv3 interface authentication.\nTo configure OSPFv3 interface authentication, run the ospfv3 authentication-mode command."
}