{
    "PageTitle": "ospfv3 authentication-mode",
    "FuncDef": "The ospfv3 authentication-mode command configures an authentication mode and a password for an OSPFv3 interface.\nThe undo ospfv3 authentication-mode command deletes the authentication mode and password configured for an OSPFv3 interface.\nBy default, no authentication mode or password is configured for any OSPFv3 interface.",
    "CLIs": [
        "ospfv3 authentication-mode { hmac-sha256 key-id <KeyId> { plain <plainText> | [ cipher ] <cipherText> } } [ instance <instanceId> ]",
        "undo ospfv3 authentication-mode { hmac-sha256 key-id <KeyId> } [ plain <plainText> | cipher <cipherText> ] [ instance <instanceId> ]"
    ],
    "ParentView": [
        "VBDIF interface view",
        "FlexE interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "100GE interface view",
        "GE electrical interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Eth-Trunk interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "hmac-sha256",
            "Info": "Configures the HMAC-SHA256 authentication mode.\n-"
        },
        {
            "Parameters": "key-id KeyId",
            "Info": "Specifies a key ID for authentication, which must be the same as the one configured at the other end.\nThe value is an integer ranging from 1 to 65535"
        },
        {
            "Parameters": "plain plainText",
            "Info": "Specifies simple authentication. You can only type in simple passwords, and the passwords are displayed in simple mode in the configuration file.\nThe new password is at least eight characters long and contains at least two of the following types: upper-case letters, lower-case letters, digits, and special characters.For security purposes, you are advised to configure a password in ciphertext mode. To further improve device security, periodically change the password.\nThe value is a string of 1 to 255 characters. A password cannot contain a question mark (?), but can contain spaces if surrounded by double quotation marks (\"\"). In this case, the double quotation marks are part of the password."
        },
        {
            "Parameters": "cipher cipherText",
            "Info": "Configures the ciphertext mode. You can enter either a simple or ciphertext, but the password is displayed in ciphertext in the configuration file.\nThe value can be a string of 1 to 255 characters for a simple password and 20 to 432 characters for a ciphertext password.\nA password cannot contain a question mark (?), but can contain spaces if surrounded by double quotation marks (\"\"). In this case, the double quotation marks are part of the password."
        },
        {
            "Parameters": "instance instanceId",
            "Info": "Specifies the ID of the instance to which an interface belongs.\nThe value is an integer ranging from 0 to 255. The default value is 0."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospfv3 1",
            "[*HUAWEI-ospfv3-1] quit",
            "[*HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] ipv6 enable",
            "[*HUAWEI-GigabitEthernet1/0/0] ospfv3 1 area 0",
            "[*HUAWEI-GigabitEthernet1/0/0] ospfv3 authentication-mode hmac-sha256 key-id 10 cipher Huawei-13579"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nDue to inherent defects and flawed implementation of the TCP/IP protocol suite, there are an increasing number of attacks, which poses greater threats on TCP/IP networks than ever before. The attacks on network devices may lead to network failures. To configure an authentication mode and a password for an OSPFv3 interface to improve OSPFv3 network security, run the ospfv3 authentication-mode command.\nPrecautions\nOSPFv3 interface authentication takes precedence over OSPFv3 area authentication. If both interface authentication and area authentication are configured, the authentication succeeds as long as the interface authentication succeeds. If authentication is configured on an interface, OSPFv3 neighbor relationships can be established on the interface as long as interface authentication succeeds, regardless of the area authentication configuration or whether area authentication is configured.\nTo configure OSPFv3 area authentication, run the authentication-mode command."
}