{
    "PageTitle": "ospfv3 timer hello",
    "FuncDef": "The ospfv3 timer hello command sets the interval at which Hello packets are sent on an interface.\nThe undo ospfv3 timer hello command restores the default value.\nBy default, for P2P and broadcast interfaces, the interval is 10 seconds, for P2MP and NBMA interfaces, the interval is 30 seconds.",
    "CLIs": [
        "ospfv3 timer hello <interval> [ conservative ] [ instance <instance-id> ]",
        "undo ospfv3 timer hello [ <interval> [ conservative ] ] [ instance <instance-id> ]"
    ],
    "ParentView": [
        "VBDIF interface view",
        "FlexE interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "100GE interface view",
        "GE electrical interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Eth-Trunk interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "interval",
            "Info": "Specifies the interval at which Hello packets are sent on an interface.\nThe value is an integer ranging from 1 to 65535."
        },
        {
            "Parameters": "conservative",
            "Info": "Indicates the conservative mode of the dead timer. If the conservative mode is configured, the value configured for the dead timer using the ospfv3 timer dead command takes effect even when the value is less than 10s.\n-"
        },
        {
            "Parameters": "instance instance-id",
            "Info": "Specifies an interface instance ID.\nThe value is an integer ranging from 0 to 255. The default value is 0."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ospfv3 1",
            "[*HUAWEI-ospfv3-1] quit",
            "[*HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] ipv6 enable",
            "[*HUAWEI-GigabitEthernet1/0/0] ospfv3 1 area 0 instance 1",
            "[*HUAWEI-GigabitEthernet1/0/0] ospfv3 timer hello 20 instance 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nHello packets are periodically exchanged by OSPFv3 interfaces to establish and maintain neighbor relationships. A Hello packet contains information about timers, DRs, BDRs, and known neighbors.\nThe smaller the interval value, the faster a network topology change can be detected, and the larger the route cost. Ensure that the parameters of this interface and the adjacent routers are consistent.\nTo speed up OSPFv3 convergence in the case of a link failure, configuring BFD For OSPFv3 is recommended. If the remote end does not support BFD for OSPFv3 or you do not want to configure BFD for OSPFv3, specify conservative when you run the ospfv3 timer hello command. If the conservative mode is configured, the value configured for the dead timer using the ospfv3 timer dead command takes effect even when the value is less than 10s; if the value configured for the dead timer is greater than 10s, services may be affected.\nPrecautions\nThe command cannot be run on a null interface.\nIf the configured interval (X) at which Hello packets are sent is less than 10s, the valid interval (Y) is calculated using the formula: Y = X/2 + X mod 2, in which mod indicates a modulo operation. The valid interval prevents neighbor flapping and improves network reliability.\nIf hello interval is set but a dead interval is not set using the ospfv3 timer dead command, the dead interval of an OSPFv3 neighbor is four times the value of hello interval. If the dead interval of an OSPFv3 neighbor is shorter than 10s, the session may be closed. Therefore, if hello interval is shorter than or equal to 2s, the actual dead interval of an OSPFv3 neighbor is not shorter than 10s; if conservative is specified, the dead interval of an OSPFv3 neighbor is still four times the value of hello interval in this case."
}