{
    "PageTitle": "hdlc dampening level",
    "FuncDef": "The hdlc dampening level command configures an HDLC link dampening level.\nThe undo hdlc dampening level command restores the HDLC link dampening default level.\nBy default, the HDLC link dampening level is light.",
    "CLIs": [
        "hdlc dampening level { light | middle | heavy | manual { half-life-period <half-life-period-para> suppress-threshold <suppress-para> reuse-threshold <reuse-para> max-suppress-time <max-suppress-time-para> } }",
        "undo hdlc dampening level { light | middle | heavy | manual [ half-life-period <half-life-period-para> suppress-threshold <suppress-para> reuse-threshold <reuse-para> max-suppress-time <max-suppress-time-para> ] }"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "light",
            "Info": "Specifies that the HDLC link dampening level is light.\n-"
        },
        {
            "Parameters": "middle",
            "Info": "Specifies that the HDLC link dampening level is middle.\n-"
        },
        {
            "Parameters": "heavy",
            "Info": "Specifies that the HDLC link dampening level is light.\n-"
        },
        {
            "Parameters": "manual",
            "Info": "Specifies that the HDLC link dampening level is manually set.\n-"
        },
        {
            "Parameters": "half-life-period half-life-period-para",
            "Info": "Specifies half-life of the HDLC link dampening.\nThe value is an integer ranging from 1 to 60, in seconds."
        },
        {
            "Parameters": "suppress-threshold suppress-para",
            "Info": "Specifies the suppress value of the HDLC link dampening.\nThe value is an integer ranging from 1 to 20000. The default value is 1000."
        },
        {
            "Parameters": "reuse-threshold reuse-para",
            "Info": "Specifies the reuse value of the HDLC link dampening.\nThe value is an integer ranging from 1 to 20000. The default value is 1000."
        },
        {
            "Parameters": "max-suppress-time max-suppress-time-para",
            "Info": "Specifies the maximum suppression time of the HDLC link dampening.\nThe value is an integer ranging from 1 to 255, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] hdlc dampening level middle"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOptical fiber flapping on a physical interface causes HDLC link to alternate between Up and Down frequently. This results in the link or network layers unstable. To prevent frequent HDLC link flapping from causing flapping of the link and network layers, configure the HDLC link dampening function.\nThis function enables HDLC link dampening on an interface. Therefore, if the HDLC link flapping occurs, stability of the link or network layers can be guaranteed. When the HDLC dampening function is enabled, run the hdlc dampening level command to configure a light, middle, or heavy PPP link dampening level based on the dampening requirements, or configure the dampening level manually.\nlight: If a light HDLC link dampening is configured, dampening procedure will only be triggered when the HDLC link flaps frequently and rapidly.middle: If a middle HDLC link dampening is configured, intensity of the HDLC link dampening is between the light and heavy.heavy: If a heavy HDLC link dampening is configured, dampening will be triggered even if flapping of the link is not severe. That is, the link is vulnerable to dampening.manual: If HDLC link dampening is manually configured, you can configure HDLC link dampening level based on sensitivity of flapping."
}