{
    "PageTitle": "down-when-looped",
    "FuncDef": "The down-when-looped command enables a POS interface to set the HDLC status to Down if the POS interface detects a loopback message.\nThe undo down-when-looped command disables a POS interface from setting the HDLC status to Down if the POS interface detects a loopback message.\nBy default, a POS interface does not set the HDLC status to Down if the POS interface detects a loopback message.",
    "CLIs": [
        "down-when-looped",
        "undo down-when-looped"
    ],
    "ParentView": [
        "POS interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface pos 1/0/0",
            "[*HUAWEI-Pos1/0/0] link-protocol hdlc",
            "Warning: The encapsulation protocol of the link will be changed. ",
            "Continue? [Y/N]:Y",
            "[*HUAWEI-Pos1/0/0] down-when-looped"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAn IP-Trunk link is established between two devices, and multiple transmission devices may be deployed on the link to transparently transmit data. If a link connecting a POS interface of the IP-Trunk interface is faulty, the POS interface sets HDLC to Down.\nIf the loopback detection function is enabled on the transmission devices, the devices will send loopback messages to detect possible faults segment by segment. However, the loopback messages will cause the HDCL on a Down POS interface to reconnect and become Up. As a result, the IP-Trunk traffic will still be distributed on the faulty POS interface, causing the traffic to be discarded and affecting service forwarding.\nTo resolve the preceding problem and prevent IP-Trunk traffic from being discarded, run the down-when-looped command on a POS interface to set the HDLC status to Down if the interface detects a loopback message.\nPrerequisites\nHDLC has been enabled on the POS interface using the link-protocol hdlc command.\nFollow-up Procedure\nRun the ip-trunk command to add the POS interface to an IP-Trunk interface."
}