{
    "PageTitle": "trunkport (IP-Trunk interface view)",
    "FuncDef": "The trunkport command adds interfaces to an IP-Trunk interface in batches in the IP-Trunk interface view.\nThe undo trunkport command deletes member interfaces from an IP-Trunk interface in batches in the IP-Trunk interface view.\nBy default, no member interface is added to the IP-Trunk.",
    "CLIs": [
        "trunkport <PortType> { <beginifnum> [ to <endifnnum> ] } &<1-16>",
        "trunkport <ifname>",
        "undo trunkport <PortType> { <beginifnum> [ to <endifnnum> ] } &<1-16>",
        "undo trunkport <ifname>"
    ],
    "ParentView": [
        "IP-Trunk interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "PortType",
            "Info": "Specifies the type of interfaces to be added to an IP-Trunk interface, for example, POS.\n-"
        },
        {
            "Parameters": "beginifnum",
            "Info": "Specifies the number of the interface to be added to an IP-Trunk interface. to is placed between two interfaces, indicating that all interfaces from <beginifnum> to <endifnnum> are added to the IP-Trunk interface.\n-"
        },
        {
            "Parameters": "endifnnum",
            "Info": "Specifies the number of the interface to be added to an IP-Trunk interface. to is placed between two interfaces, indicating that all interfaces from <beginifnum> to <endifnnum> are added to the IP-Trunk interface.\n-"
        },
        {
            "Parameters": "ifname",
            "Info": "Specifies the name of the interface to be added to an IP-Trunk interface.\n-"
        }
    ],
    "Examples": [
        [
            "HUAWEI> system-view",
            "[~HUAWEI] interface ip-trunk 1",
            "[~HUAWEI-Ip-Trunk1] trunkport pos 1/0/0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTrunk is a technology that bundles multiple physical interfaces into a logical interface. The logical interface is a trunk interface and the bundled physical interfaces are member interfaces. To add physical interfaces to an IP-Trunk interface in batches to increase the bandwidth, improve the reliability, and perform load balancing, run the trunkport command.\nTo add only one interface to an IP-Trunk interface, you can run the trunkport command.\nTo delete member interfaces from an IP-Trunk interface in batches, you can run the undo trunkport command in the view of the specified IP-Trunk interface.\nTo delete only one member interface from an IP-Trunk interface, you can run the undo trunkport command in the view of the specified IP-Trunk interface. Alternatively, you can run the undo ip-trunk command in the view of the specified member interface.\nPrerequisites\nMember interfaces to be added to an IP-Trunk interface cannot be configured with Layer 3 attributes or any service.The link layer protocol of the interface to be added to an IP-Trunk interface must be HDLC and cannot be changed.\n\nPrecautions\nWhen adding interfaces to an IP-Trunk interface, note the following:\nThe link layer protocol of the interfaces to be added to the IP-Trunk interface must be HDLC.A POS interface can be added to only one IP-Trunk interface. The POS interface must be deleted from one IP-Trunk interface before joining another IP-Trunk interface.The interfaces to be added to the IP-Trunk interface cannot be IP-Trunk interfaces.POS interfaces with different forwarding capacities are not recommended to join the same IP-Trunk interface.If the interface connecting to the peer device is added to an IP-Trunk interface, the directly connected interface on the peer device must also be added to the same IP-Trunk interface.When you specify the interface range, make ensure that the interface range is specified in the correct format: The interface number after to must be greater than the interface number before to. Interfaces in the specified range must be of the same type."
}