{
    "PageTitle": "link-protocol hdlc",
    "FuncDef": "The link-protocol hdlc command configures the link layer protocol of an interface as HDLC.\nThe undo link-protocol hdlc command restores the default configuration.\nBy default, the link layer protocol of an interface is PPP.",
    "CLIs": [
        "link-protocol hdlc",
        "undo link-protocol hdlc"
    ],
    "ParentView": [
        "Serial interface view",
        "POS interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface pos 1/0/0",
            "[~HUAWEI-Pos1/0/0] link-protocol hdlc"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe point-to-point (P2P) connection is a simple WAN connection. Link layer protocols of a P2P link are PPP and HDLC. To configure the link layer protocol of an interface as HDLC, run the link-protocol hdlc command.\nPPP is a link layer protocol used to encapsulate and transmit network layer packets over P2P links. If a bit-oriented link layer protocol is needed for synchronous transmission and no complex services are configured, HDLC can be applied. HDLC does not require that data to be transmitted be character sets. Instead, it can transparently transmit bit flows of all types, especially the control and response messages.\nUnlike PPP, HDLC uses authentication protocols to ensure the correctness and connectivity of links to be established. A cyclic redundancy check (CRC) is performed for HDLC frames and information frames are sequentially numbered to ensure reliable transmission.\nAn IP-Trunk can consist of only POS links, and the link layer protocol running on IP-Trunk member interfaces must be HDLC.\nConfiguration Impact\nIf the link-protocol hdlc command is run more than once, the latest configuration overrides the previous one. After the configuration takes effect, the link layer protocol changes.\nPrecautions\nWhen configuring HDLC on an interface, ensure that the IP address of the interface must be on the same network segment as that of the peer. The link layer protocol specified for the interface added to an IP-Trunk interface must be HDLC.\nParameters of a link layer protocol can be configured only after the link layer protocol is properly configured."
}