{
    "PageTitle": "ip-trunk",
    "FuncDef": "The ip-trunk command adds a POS interface to an IP-Trunk interface.\nThe undo ip-trunk command deletes a POS interface from an IP-Trunk interface.\nBy default, no POS interface is added to an IP-Trunk interface.",
    "CLIs": [
        "ip-trunk <trunk-id>",
        "undo ip-trunk"
    ],
    "ParentView": [
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "trunk-id",
            "Info": "Specifies the number of an IP-Trunk interface.\nThe value is an integer ranging from 0 to 255."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface ip-trunk 1",
            "[*HUAWEI-Ip-Trunk1] quit",
            "[*HUAWEI] interface pos 1/0/1",
            "[*HUAWEI-Pos1/0/1] link-protocol hdlc",
            "Warning: The encapsulation protocol of the link will be changed. ",
            "Continue? [Y/N]:Y",
            "[*HUAWEI-Pos1/0/1] ip-trunk 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTrunk is a technology that bundles multiple physical interfaces into a logical interface. The logical interface is a trunk interface and the bundled physical interfaces are member interfaces.\nTrunk interfaces are classified into two types: Eth-Trunk interfaces and IP-Trunk interfaces. Only Ethernet interfaces can be bundled into an Eth-Trunk interface, and only POS interfaces can be bundled into an IP-Trunk interface. Ethernet interfaces and POS interfaces cannot be bundled into the same Trunk interface. This is because Ethernet interfaces are applicable to a broadcast network, whereas POS interfaces encapsulated with High-Level Data Link Control (HDLC) are applicable to a point-to-point network.\nTo add an interface to an IP-Trunk interface for load balancing and link backup, you can run the ip-trunk command. The link layer protocol of the interface to be added to the IP-Trunk interface must be HDLC.\nTo delete a member interface from the IP-Trunk interface, you can run the undo trunkport command.\nPrerequisites\nMember interfaces cannot be configured with Layer 3 attributes or any service.\nThe link layer protocol enabled on member interfaces must be HDLC.\nConfiguration Impact\nAfter POS interfaces are added to the IP-Trunk interface:\nThe bandwidth is increased. The bandwidth of the IP-Trunk interface is the total bandwidth of all member interfaces.The reliability is improved. When a member link fails, traffic is automatically switched to other available links.If the IP-Trunk interface is configured with services, members of the IP-Trunk interface take over these services.\n\nPrecautions\nWhen adding a POS interface to an IP-Trunk interface, note the following:\nThe link layer protocol of the POS interface to be added to the IP-Trunk interface must be HDLC.A POS interface can be added to only one IP-Trunk interface. The POS interface must be deleted from one IP-Trunk interface before joining another IP-Trunk interface.The interfaces to be added to the IP-Trunk interface cannot be IP-Trunk interfaces.POS interfaces with different forwarding capacities are not recommended to join the same IP-Trunk interface.If the interface connecting to the peer device is added to an IP-Trunk interface, the directly connected interface on the peer device must also be added to the same IP-Trunk interface."
}