{
    "PageTitle": "least active-bandwidth (IP-Trunk interface view)",
    "FuncDef": "The least active-bandwidth command sets the lower limit for an IP-Trunk interface's bandwidth.\nThe undo least active-bandwidth command restores the default lower limit for an IP-Trunk interface's bandwidth.\nBy default, no lower limit is configured for an IP-Trunk interface's bandwidth.",
    "CLIs": [
        "least active-bandwidth <bandwidth>",
        "undo least active-bandwidth",
        "undo least active-bandwidth <bandwidth>"
    ],
    "ParentView": [
        "IP-Trunk interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "bandwidth",
            "Info": "Specifies a lower limit for the bandwidth of an IP-Trunk interface's member interfaces.\nThe value is an integer ranging from 1 to 4294967295, in Mbit/s."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface IP-Trunk 1",
            "[*HUAWEI-Ip-Trunk1] least active-bandwidth 3"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe bandwidth of an IP-Trunk interface refers to the sum of all Up member interfaces' bandwidth. To ensure uninterrupted traffic forwarding, run the least active-bandwidth command to set the lower limit for an IP-Trunk interface's bandwidth. The IP-Trunk interface can go Up only after the sum of all Up member interfaces' bandwidth is greater than or equal to the set lower limit. Otherwise, the IP-Trunk interface goes Down.\nPrerequisites\nAn IP-Trunk interface has been configured.\nConfiguration Impact\nAfter the lower limit is set for an IP-Trunk interface's bandwidth:\nThe IP-Trunk interface goes Down when the sum of all Up member interfaces' bandwidth falls below the lower limit.The IP-Trunk interface goes Up when the sum of all Up member interfaces' bandwidth reaches the lower limit.\n\nPrecautions\nThis command is mutually exclusive with the least active-linknumber command. Check that the least active-linknumber command configuration does not exist before running this command.\nTo prevent an IP-Trunk interface from alternating between Up and Down, the lower limits configured on both ends of the IP-Trunk must be the same."
}