{
    "PageTitle": "least active-linknumber (IP-Trunk interface view)",
    "FuncDef": "The least active-linknumber command sets the minimum number (lower threshold) of IP-Trunk member links in the Up state.\nThe undo least active-linknumber command restores the default minimum number of IP-Trunk member links in the Up state.\nBy default, the minimum number of IP-Trunk member links is 1. That is, the IP-Trunk interface requires at least one active link to work.",
    "CLIs": [
        "least active-linknumber <link-number>",
        "undo least active-linknumber"
    ],
    "ParentView": [
        "IP-Trunk interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "link-number",
            "Info": "Specifies the minimum number of IP-Trunk member links in the Up state.\nThe value is an integer ranging from 1 to 64."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface ip-trunk 1",
            "[*HUAWEI-Ip-Trunk1] least active-linknumber 3"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe number of IP-Trunk member links in the Up state affects the status and bandwidth of an IP-Trunk interface. To maintain stability, you can set the minimum number of IP-Trunk member links in the Up state to reduce the impact of the status change on the IP-Trunk interface.\nTo set the minimum number of IP-Trunk member links in the Up state, you can run the least active-linknumber command. To restore the default minimum number of IP-Trunk member links in the Up state, you can run the undo least active-linknumber command.\nPrerequisites\nAn IP-Trunk interface has been configured.\nConfiguration Impact\nAfter the minimum number of IP-Trunk member links in the Up state is set:\nWhen the number of IP-Trunk member links in the Up state is less than the lower threshold, the IP-Trunk interface goes Down.When the number of IP-Trunk member links in the Up state reaches the lower threshold, the IP-Trunk interface goes Up.\n\nPrecautions\nIf the least active-linknumber command is run more than once, the latest configuration overrides the previous one.\nTo ensure normal forwarding, it is recommended that the same lower threshold be configured for the IP-Trunk interfaces on both ends of the same IP-Trunk link.\nThis command is mutually exclusive with the least active-bandwidth bandwidth command. Check that the least active-bandwidth bandwidth command configuration does not exist before running this command."
}