{
    "PageTitle": "smart-link flush enable",
    "FuncDef": "The smart-link flush enable command enables an interface to process Smart Link Flush packets.\nThe undo smart-link flush enable command disables the function.\nBy default, an interface does not process Smart Link Flush packets.",
    "CLIs": [
        "smart-link flush enable control-vlan <vlan-id>",
        "undo smart-link flush enable"
    ],
    "ParentView": [
        "Layer 2 40GE interface view",
        "Layer 2 50GE interface view",
        "Port extension Layer 2 interface view",
        "Layer 2 10GE interface view",
        "Layer 2 GE interface view",
        "Layer 2 100GE interface view",
        "Layer 2 50|100GE interface view",
        "Eth-Trunk interface view",
        "25GE-L2 view",
        "400GE-L2 view"
    ],
    "ParaDef": [
        {
            "Parameters": "control-vlan vlan-id",
            "Info": "Specifies the control VLAN ID of Smart Link Flush packets.\nThe value is an integer ranging from 1 to 4094."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] portswitch",
            "[*HUAWEI-GigabitEthernet1/0/1] smart-link flush enable control-vlan 10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a Smart Link-incapable device is connected to a Smart Link-capable device that sends Flush packets, you can run the smart-link flush enable command to enable an interface of the Smart Link-incapable device to process Flush packets.\nPrerequisites\nThe smart-link flush enable command must be run on a Layer 2 interface. Before running the smart-link flush enable command on a Layer 3 interface, the portswitch command must have been run to switch the Layer 3 interface to a Layer 2 interface.\nPrecautions\nThe control VLAN ID specified on the interface must be the same as that carried in Smart Link Flush packets. If the control VLAN IDs are different, the interface does not process the Smart Link Flush packets."
}