{
    "PageTitle": "default send-key-id",
    "FuncDef": "Using the default send-key-id command, you can configure a particular key-id as the default send-key-id for that keychain.\nUsing the undo default send-key-id command, you can delete default send-key-id.\nBy default, no key-id is configured as default send-key-id.",
    "CLIs": [
        "default send-key-id",
        "undo default send-key-id"
    ],
    "ParentView": [
        "weekly Key-ID view",
        "yearly Key-ID view",
        "daily Key-ID view",
        "monthly Key-ID view",
        "absolute Key-ID view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] keychain huawei mode absolute",
            "[*HUAWEI-keychain-huawei] key-id 1",
            "[*HUAWEI-keychain-huawei-keyid-1] default send-key-id"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn keychain authentication mode, secure protocol packet transmission is provided by changing the authentication algorithm and key dynamically. This can reduce the workload of changing the algorithm and key manually. A keychain consists of multiple authentication key IDs, each of which is valid within different time periods. When a key ID becomes valid, the authentication algorithm corresponding to the key ID is used, and packets passing the authentication will be sent or received.\nIf a key ID for packet sending is not configured in a keychain or no key ID for packet sending is valid within a certain period, protocol packets cannot be authenticated and encrypted. As a result, protocol packet transmission fails. To address such a problem, configure a default key ID for packet sending. If no key ID is valid, the default key ID for packet sending is used.\nPrecautions\nEach keychain can have only one default key ID for packet sending.\nIf the default key ID for packet sending is an existing key ID, the authentication and encryption algorithms, and key corresponding to the key ID are used.If the default key ID for packet sending is a newly created key ID, configure the authentication and encryption algorithms, and key for the key ID."
}