{
    "PageTitle": "key-string",
    "FuncDef": "Using the key-string command, you can specify a key-string that is used for encryption and decryption.\nUsing the undo key-string command, you can delete the key-string configuration.\nBy default, no key-string is configured.",
    "CLIs": [
        "key-string <plain-cipher-text>",
        "key-string cipher <plain-cipher-text>",
        "key-string plain <plain-text>",
        "undo key-string"
    ],
    "ParentView": [
        "weekly Key-ID view",
        "yearly Key-ID view",
        "daily Key-ID view",
        "monthly Key-ID view",
        "absolute Key-ID view"
    ],
    "ParaDef": [
        {
            "Parameters": "plain-cipher-text",
            "Info": "Indicates the cipher text used for authentication.\nThe value is a string of case-sensitive characters that can be letters or digits. The authentication password can be a string of 1 to 255 characters in simple text or a string of 20 to 432 characters in encrypted text. A 24-character ciphertext password configured in an earlier version is also supported in this version.\nExcept the question mark (?) and space. However, when quotation marks (\") are used around the password, spaces are allowed in the password."
        },
        {
            "Parameters": "cipher",
            "Info": "Specifies the key-string used for encryption and decryption.\n-"
        },
        {
            "Parameters": "plain plain-text",
            "Info": "Indicates the simple text used for authentication. The configured text will be stored as unencrypted text and displayed as unencrypted text.\nThe value is a string of 1 to 255 case-sensitive characters that can be letters or digits.\nExcept the question mark (?) and space. However, when quotation marks (\") are used around the password, spaces are allowed in the password."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] keychain huawei mode absolute",
            "[*HUAWEI-keychain-huawei] key-id 1",
            "[*HUAWEI-keychain-huawei-keyid-1] key-string cipher Huawei-13579"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn keychain authentication mode, secure protocol packet transmission is provided by changing the authentication algorithm and key dynamically. This can prevent unauthorized users from obtaining the key, and authentication and encryption algorithms, and reduce the workload of changing the algorithm and key manually.\nEach keychain consists of multiple key IDs that are valid within different time periods and each key ID is configured with an authentication algorithm. When a key ID becomes valid, the corresponding authentication algorithm is used.\nWhen configuring an authentication algorithm, configure a key for protocol packet authentication.\nPrecautions\nAn authentication key configured in cipher text mode will be displayed also in cipher text mode. Therefore, remember the plain-text key string when configuring the key in cipher text mode.\nIf the authentication key is not configured, the corresponding key ID remains in the inactive state."
}