{
    "PageTitle": "send-time day",
    "FuncDef": "The send-time command makes a key act as a send key for the specified interval of time.\nThe undo send-time command deletes the send-time configuration.\nBy default, no send-time is configured.",
    "CLIs": [
        "send-time day <start-day> to <end-day>",
        "send-time day { <start-day> } &<1-7>"
    ],
    "ParentView": [
        "weekly Key-ID view"
    ],
    "ParaDef": [
        {
            "Parameters": "start-day",
            "Info": "Specifies the day of the week to be configured as the start send day for the given key.\nThe value ranges from Monday to Sunday.montuewedthufrisat"
        },
        {
            "Parameters": "to",
            "Info": "Acts as a separator.\n-"
        },
        {
            "Parameters": "end-day",
            "Info": "Specifies the end send day for the given key.\nThe value ranges from Monday to Sunday.tuewedthufrisatsun\n\nThe end day should be greater than the start day."
        },
        {
            "Parameters": "day",
            "Info": "Specifies the days of the week.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] keychain huawei3 mode periodic weekly",
            "[*HUAWEI-keychain-huawei3] key-id 5",
            "[*HUAWEI-keychain-huawei3-keyid-5] send-time day mon"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nEach keychain consists of multiple key IDs that are valid within different time periods and each key ID is configured with an authentication algorithm. When a key ID becomes valid, the corresponding authentication algorithm is used, ensuring the dynamic change of authentication algorithms. Configure different key IDs for packet sending and receiving to be valid within different time periods.\nImplementation Procedure\nThere are two keychain validity modes:\nAbsolute time range: In this mode, keychains are valid within a certain period and are invalid out of the period.Periodic time range: In this mode, keychains are valid periodically. After one period ends, keychains continue to be valid within next period.\nThe mode in which key IDs for packet sending become valid must be identical with that configured for the keychain.\n\nPrecautions\nOnly one key ID is valid within a time period. In other words, the send time periods of different key-ids cannot overlap with each other."
}