{
    "PageTitle": "tcp-algorithm-id",
    "FuncDef": "Using the tcp-algorithm-id command, you can specify TCP algorithm ids to represent algorithms supported by the keychain uniquely.\nUsing the undo tcp-algorithm-id command, you can restore the default values specified by Internet Assigned Numbers Authority (IANA).\nBy default, the algorithm ids supported by IANA are adopted.",
    "CLIs": [
        "tcp-algorithm-id md5 <md5-algorithm-id>",
        "tcp-algorithm-id sha-1 <sha1-algorithm-id>",
        "tcp-algorithm-id hmac-md5 <hmac-md5-algorithm-id>",
        "tcp-algorithm-id hmac-sha1-12 <hmac-sha1-12-algorithm-id>",
        "tcp-algorithm-id hmac-sha1-20 <hmac-sha1-20-algorithm-id>",
        "tcp-algorithm-id hmac-sha-256 <hmac-sha-256-algorithm-id>",
        "tcp-algorithm-id sha-256 <sha-256-algorithm-id>",
        "tcp-algorithm-id sm3 <sm3-algorithm-id>",
        "undo tcp-algorithm-id md5",
        "undo tcp-algorithm-id sha-1",
        "undo tcp-algorithm-id hmac-md5",
        "undo tcp-algorithm-id hmac-sha1-12",
        "undo tcp-algorithm-id hmac-sha1-20",
        "undo tcp-algorithm-id hmac-sha-256",
        "undo tcp-algorithm-id sha-256",
        "undo tcp-algorithm-id sm3"
    ],
    "ParentView": [
        "Keychain view"
    ],
    "ParaDef": [
        {
            "Parameters": "md5-algorithm-id",
            "Info": "Specifies the TCP algorithm ID to represent the MD5 algorithm.\nThe value is a unsigned character, the range value is 1 to 63, the default value is 3."
        },
        {
            "Parameters": "sha-1",
            "Info": "Indicates that SHA-1 is used for packet encryption and authentication.\nTo ensure high security, do not use the SHA-1 algorithm.\nThe length of the key is 20 bytes."
        },
        {
            "Parameters": "sha1-algorithm-id",
            "Info": "Specifies the TCP algorithm ID to represent the SHA-1 algorithm.\nThe value is a unsigned character, the range value is 1 to 63, the default value is 4."
        },
        {
            "Parameters": "hmac-md5",
            "Info": "Indicates that HMAC-MD5 is used for packet encryption and authentication.\nThe length of the key is 16 bytes."
        },
        {
            "Parameters": "hmac-md5-algorithm-id",
            "Info": "Specifies the TCP algorithm ID to represent the HMAC-MD5 algorithm.\nThe value is a unsigned character, the range value is 1 to 63, the default value is 5."
        },
        {
            "Parameters": "hmac-sha1-12",
            "Info": "Indicates that HMAC-SHA1-12 is used for packet encryption and authentication.\nThe length of the key is 12 bytes."
        },
        {
            "Parameters": "hmac-sha1-12-algorithm-id",
            "Info": "Specifies the TCP algorithm ID to represent the HMAC-SHA1-12 algorithm.\nThe value is a unsigned character, the range value is 1 to 63, the default value is 2."
        },
        {
            "Parameters": "hmac-sha1-20",
            "Info": "Indicates that HMAC-SHA1-20 is used for packet encryption and authentication.\nThe length of the key is 20 bytes."
        },
        {
            "Parameters": "hmac-sha1-20-algorithm-id",
            "Info": "Specifies the TCP algorithm ID to represent the HMAC-SHA1-20 algorithm.\nThe value is a unsigned character, the range value is 1 to 63, the default value is 6."
        },
        {
            "Parameters": "hmac-sha-256",
            "Info": "Indicates that HMAC-SHA-256 is used for packet encryption and authentication.\nHAMC-SHA-256 authentication mode is better and more secure than other authentication modes. To ensure high security, HAMC-SHA-256 authentication algorithm is recommended.\nThe length of the key is 32 bytes."
        },
        {
            "Parameters": "hmac-sha-256-algorithm-id",
            "Info": "Specifies the TCP algorithm ID to represent the HMAC-SHA-256 algorithm.\nThe value is a unsigned character, the range value is 1 to 63, the default value is 7."
        },
        {
            "Parameters": "sha-256",
            "Info": "Indicates that SHA-256 is used for packet encryption and authentication.\nThe length of the key is 32 bytes."
        },
        {
            "Parameters": "sha-256-algorithm-id",
            "Info": "Specifies the TCP algorithm ID to represent the SHA-256 algorithm.\nThe value is a unsigned character, the range value is 1 to 63, the default value is 8."
        },
        {
            "Parameters": "sm3",
            "Info": "Indicates that SM3 is used for packet encryption and authentication.\nThe length of the key is 32 bytes."
        },
        {
            "Parameters": "sm3-algorithm-id",
            "Info": "Specifies the TCP algorithm ID to represent the SM3 algorithm.\nThe value is a unsigned character, the range value is 1 to 63, the default value is 9."
        },
        {
            "Parameters": "md5",
            "Info": "Indicates that MD5 is used for packet encryption and authentication.\nTo ensure high security, do not use the MD5 algorithm.\nThe length of the key is 16 bytes."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] keychain huawei mode absolute",
            "[*HUAWEI-keychain-huawei] tcp-algorithm-id hmac-sha-256 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA keychain ensures a secure protocol packet transmission by changing the authentication algorithm and key dynamically. Packets to be transmitted over non-TCP and TCP connections are authenticated using the authentication and encryption algorithms corresponding to a key ID. The difference lies in that the TCP connection needs to be authenticated to enhance the security.\nThe TCP connection is authenticated using the authentication algorithm specified by the algorithm ID. The algorithm ID is not defined by the IANA. Different vendors use different algorithm IDs to identify authentication algorithms. When two devices of different vendors are connected, ensure that algorithm IDs configured on the two devices are identical.\nPrerequisites\nThe authentication algorithm used to authenticate the TCP connection needs to be specified.\nImplementation Procedure\nThe algorithm IDs configured for the two communication devices must be identical:\nThe characteristics of each authentication algorithm are as follows:\nMD5(Message Digest 5): The 128-bit MD5 message digest is calculated based on the entered message of any length.SHA-1(Secure Hash Algorithm): The 160-bit SHA-1 message digest is calculated based on the entered message with the length shorter than the 64th power of 2.HMAC-MD5(Keyed-Hashing for Message Authentication-md5): The 128-bit HMAC-MD5 message digest is calculated based on the 512-bit message that is converted from the entered message of any length. If the length of an entered message is less than 512 bits, 0s are added to make up a 512-bit message. If the length of an entered message is greater than 512 bits, the message is converted into a 128-bit message based on the MD5 algorithm. After that, 0s are added to make up a 512-bit message.HMAC-SHA1-12: The 160-bit HMAC-SHA1-12 message digest is calculated based on the 512-bit message that is converted from the entered message of any length. The leftmost 96 bits (12 x 8) are used as the authentication code.HMAC-SHA1-20: The 160-bit HMAC-SHA1-20 message digest is calculated based on the 512-bit message that is converted from the entered message of any length. All the 160 bits are used as the authentication code.SHA-256: The 256-bit SHA-2 message digest is calculated based on the entered message with the length shorter than the 64th power of 2.HMAC-SHA-256: The 256-bit HMAC-SHA-256 message digest is calculated based on the 512-bit message that is converted from the entered message of any length. All the 256 bits are used as the authentication code.\nThe calculation speed of the MD5 algorithm is faster than that of the SHA algorithm; the SHA algorithm is more secure than the MD5 algorithm. Compared with MD5 and SHA, HMAC is more secure, but slower in calculation speed. To ensure high security, do not use the MD5 or SHA-1 algorithm.\n\nPrecautions\nEach algorithm ID uniquely identifies an algorithm."
}