{
    "PageTitle": "data-threshold",
    "FuncDef": "This command specifies the data rate threshold that triggers the switch from the inclusive provider tunnel to the selective provider tunnel for (C-S, C-G) within the group range. Optionally, PBR thresholds for creating or deleting NG-MVPN S-PMSI may also be specified. Omitting the PBR thresholds preserves currently set values (or defaults if never set). Multiple statements (one per a unique group) are allowed in the configuration.",
    "CLIs": [
        "data-threshold { <c-grp-ip-addr/mask> | <c-grp-ip-addr> <netmask> } <s-pmsi-threshold> [ pe-threshold-add <pe-threshold-add> ] [ pe-threshold-delete <pe-threshold-delete> ]",
        "data-threshold <c-grp-ipv6-addr/prefix-length> <s-pmsi-threshold> [ pe-threshold-add <pe-threshold-add> ] [ pe-threshold-delete <pe-threshold-delete> ]",
        "no data-threshold { <c-grp-ip-addr/mask> | <c-grp-ip-addr> <netmask> }",
        "no data-threshold <c-grp-ipv6-addr/prefix-length>"
    ],
    "ParentView": [
        "config>router>gtm>provider-tunnel>selective"
    ],
    "ParaDef": [
        {
            "Parameters": "c-grp-ip-addr/mask | c-grp-ip-addr netmask",
            "Info": "Specifies an IPv4 multicast group address and netmask length or network mask."
        },
        {
            "Parameters": "c-grp-ipv6-addr/prefix-length",
            "Info": "Specifies an IPv6 multicast group address and prefix length."
        },
        {
            "Parameters": "s-pmsi-threshold",
            "Info": "Specifies the rate, in kb/s. If the rate for a (C-S, C-G)) within the specified group range exceeds the threshold, traffic for the (C-S, C-G) will be switched to the selective provider tunnel."
        },
        {
            "Parameters": "s-pmsi-threshold-add",
            "Info": "Specifies the number of receiver PBRs for creating S-PMSI. When the number of receiver PBRs for a given multicast group configuration is non-zero and below the threshold and BW threshold is satisfied, S-PMSI is created."
        },
        {
            "Parameters": "s-pmsi-threshold-delete",
            "Info": "Specifies the number of receiver PBRs for deleting S-PMSI. When the number of receiver PBRs for a given multicast group configuration is above the threshold, S-PMSI is deleted and the multicast group is moved to I-PMSI or a wildcard S-PMSI. It is recommended that the delete threshold be significantly larger than the add threshold to avoid re-signaling of S-PMSI as the receiver PBR count fluctuates."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: no data-threshold"
}