{
    "PageTitle": "dcn (Interface view)",
    "FuncDef": "The dcn command enables the DCN feature on an interface.\nThe undo dcn command disables the DCN feature on an interface.\nThis command varies in transport and router modes. For detailed differences, see Differences Between Commands in Transport and Router Modes. This topic describes the command configuration in router mode.\nWhether the DCN feature is enabled by default on an interface depends on the type of the board on which the interface resides and the number of interfaces on the board.",
    "CLIs": [
        "dcn",
        "undo dcn"
    ],
    "ParentView": [
        "FlexE-50|100G interface view",
        "FlexE interface view",
        "40GE interface view",
        "100GE interface view",
        "GE electrical interface view",
        "Serial interface view",
        "10GE interface view",
        "GE optical interface view",
        "FlexE-100G interface view",
        "FlexE-50G interface view",
        "POS interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dcn",
            "Warning: This operation will enable DCN function. Continue? [Y/N]:y",
            "[*HUAWEI-dcn] quit",
            "[*HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] dcn"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo implement the DCN functions, you must run the dcn command to enable the DCN feature on specified interfaces after you enable the DCN feature globally.\nWhen you deploy an NE, check whether the DCN feature has been enabled on the interface that connects the NE to a live network. If the DCN feature has not been enabled, run the dcn command to enable it on the interface.\nPrerequisites\nThe DCN feature has been enabled globally using the dcn command in the system view.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.The dcn command can be run on the serial interfaces that are E1 channels in the timeslot range 1 to 31.If the DCN feature does not take effect on the specified interface, the NE will generate information for you to determine the failure cause. Possible causes are as follows:- The timeslot is not in the range of 1 to 31.- The DCN virtual local area network (VLAN) ID is the same as a service VLAN ID.To check whether the DCN feature has taken effect on an interface, run the display dcn default-port command.After the undo dcn command is run, DCN is disabled and devices will not be out of the NMS's control. Exercise caution when running this command."
}