{
    "PageTitle": "dcn ospf timer dead (Interface view)",
    "FuncDef": "The dcn ospf timer dead command sets the OSPF neighbor dead interval for DCN interfaces.\nThe undo dcn ospf timer dead command restores the default OSPF neighbor dead interval of DCN interfaces.\nThe default OSPF neighbor dead interval of P2P DCN interfaces is four times that of hello interval .\nThe default OSPF neighbor dead interval of P2P DCN serial interfaces is four times that of hello interval .",
    "CLIs": [
        "dcn ospf timer dead <interval>",
        "undo dcn ospf timer dead"
    ],
    "ParentView": [
        "FlexE-50|100G interface view",
        "FlexE interface view",
        "40GE interface view",
        "100GE interface view",
        "GE electrical interface view",
        "Serial interface view",
        "10GE interface view",
        "GE optical interface view",
        "FlexE-100G interface view",
        "POS interface view",
        "FlexE-50G interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "interval",
            "Info": "Specifies an OSPF neighbor dead interval.\nThe value is an integer ranging from 1 to 235926000, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dcn",
            "Warning: This operation will enable DCN function. Continue? [Y/N]:y",
            "[*HUAWEI-dcn] quit",
            "[*HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] dcn",
            "[*HUAWEI-GigabitEthernet1/0/0] dcn ospf timer dead 90"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter DCN is enabled for an interface, the system automatically creates DCN serial interfaces. To set the OSPF neighbor dead interval for DCN serial interfaces, run the dcn ospf timer dead command.\nIf an interface does not receive hello packets from an OSPF neighbor within the specified interval, the interface considers the neighbor Down.\nPrerequisites\nDCN has been enabled using the dcn command in the interface view.\nPrecautions\nThe interval value specified in the dcn ospf timer dead command must be greater than the interval at which Hello packets are sent. In addition, routers on the same network segment must have the same OSPF neighbor dead interval.\nIf the dcn ospf timer dead command is run in the DCN view, the OSPF neighbor dead interval is set for all DCN interfacesIf the dcn ospf timer dead command is run in the interface view, the OSPF neighbor dead interval is set for DCN interface.\nIn VS mode, this command is supported only by the admin VS."
}