{
    "PageTitle": "dcn encrypt",
    "FuncDef": "The dcn encrypt command encrypts the channel to the NE with a specified ID.\nThe undo dcn encrypt command deletes the encryption configuration for the channel to the NE with a specified ID.\nBy default, no encrypts the channel is configured.",
    "CLIs": [
        "dcn encrypt neid <neid> authkey <auth-key> dh-algorithm { dh1024 | dh2048 } *",
        "undo dcn encrypt neid <neid>"
    ],
    "ParentView": [
        "DCN view"
    ],
    "ParaDef": [
        {
            "Parameters": "neid neid",
            "Info": "Specifies the ID of an NE.\nThe value ranges from 10001 to fefffe, in hexadecimal notation. The default value is 10001."
        },
        {
            "Parameters": "authkey auth-key",
            "Info": "Specifies an authentication key.\nIn the case of plaintext mode, the key is a string of 12 to 16 characters. In the case of ciphertext mode, the key is a string of 48 or 128 characters.\nA password must contain at least three types of characters, such as upper-case letters, lower-case letters, digits, and special characters.The default value is 0x0."
        },
        {
            "Parameters": "dh-algorithm",
            "Info": "Specifies the dh-algorithm.\n-"
        },
        {
            "Parameters": "dh1024",
            "Info": "Specify the dh-algorithm as dh1024.\n-"
        },
        {
            "Parameters": "dh2048",
            "Info": "Specify the dh-algorithm as dh2048.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dcn",
            "[*HUAWEI-dcn] dcn encrypt neid 123123 authkey 123456_QAZqaz dh-algorithm dh2048"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the DCN channel between a GNE and an NE is not encrypted, the channel is prone to attacks. To encrypt the channel to the NE with a specified NE ID, run the dcn encrypt command.\nPrecautions\nThis command is supported only on the admin VS.\nTo delete the encryption configuration for the channel to the NE with a specified NE ID, run the undo dcn encrypt neid neid command on the NE and then on the GNE. Otherwise, the NE fails to be managed by the GNE."
}