{
    "PageTitle": "dcn mode vlan",
    "FuncDef": "The dcn mode vlan command enables DCN communication through sub-interfaces numbered 4094.\nThe undo dcn mode vlan command disables DCN communication through sub-interfaces numbered 4094.\nconfiguration in router mode.\n\nWhether DCN communication through sub-interfaces numbered 4094 is enabled by default depends on the type of the interface board and the number of interfaces on the board.\n\n\nThis command varies in transport and router modes. For detailed differences, see Differences Between Commands in Transport and Router Modes. This topic describes the command",
    "CLIs": [
        "dcn mode vlan",
        "undo dcn mode vlan"
    ],
    "ParentView": [
        "100GE interface view",
        "10GE interface view",
        "40GE interface view",
        "GE optical interface view",
        "GE electrical interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] dcn mode vlan"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nDCN communication uses the Huawei proprietary protocol. Therefore, Huawei NEs cannot communicate with non-Huawei NEs. To implement DCN communication between Huawei NEs and non-Huawei NEs, run the dcn mode vlan command to enable DCN communication through sub-interfaces 4094. After the command is run, each NE automatically creates a sub-interface numbered 4094 for DCN communication.\nAfter the sub-interface numbered 4094 is configured, it is automatically associated with VLAN 4094.\nPrerequisites\nDCN has been enabled globally using the dcn command in the system view.DCN communication through sub-interface 4094 can be enabled on this NE through a license, or the NE can learn this function through a neighbor NE.\nConfiguration Impact\nIf the device supports DCN communication through sub-interface 4094 and DCN is enabled globally, LLDP is automatically enabled after the device is restarted in CFG mode.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nIn most cases, the sub-interface numbered 4094 created using the dcn mode vlan command cannot be directly deleted.\nConfiguring a timeslot is implemented after a FlexE logical interface is created. Therefore, the DCN communication through sub-interfaces numbered 4094 function is not automatically enabled for the logical interface. To resolve this problem, enable the DCN communication through sub-interfaces numbered 4094 function on the interface where a timeslot has been configured.\nHowever, if a sub-interface numbered 4094 is created using the dcn mode vlan command on an interface that supports the flexible Ethernet (FlexE) mode and then the flexethmode enable port command is run to switch the working mode from the standard Ethernet mode to the FlexE mode, the sub-interface numbered 4094 is deleted. In this case, to continue to use DCN communication through sub-interfaces numbered 4094, you need to run the flexeth group command on a FlexE service interface split from the original interface to configure bandwidth for the FlexE service interface, and then run the dcn mode vlan command."
}