{
    "PageTitle": "dcn ospf timer poll (Interface view)",
    "FuncDef": "The dcn ospf timer poll command sets the interval at which DCN interfaces of a specified interface sends poll Hello packets on a non-broadcast multiple access (NBMA) network.\nThe undo dcn ospf timer poll command restores the default interval.\nThe default interval is 120 seconds.",
    "CLIs": [
        "dcn ospf timer poll <interval>",
        "undo dcn ospf timer poll"
    ],
    "ParentView": [
        "FlexE-50|100G interface view",
        "40GE interface view",
        "100GE interface view",
        "GE electrical interface view",
        "Serial interface view",
        "10GE interface view",
        "GE optical interface view",
        "FlexE-100G interface view",
        "POS interface view",
        "FlexE-50G interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "interval",
            "Info": "Specifies the interval at which poll Hello packets are sent.\nThe value is an integer ranging from 1 to 3600, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dcn",
            "Warning: This operation will enable DCN function. Continue? [Y/N]:y",
            "[*HUAWEI-dcn] quit",
            "[*HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] dcn",
            "[*HUAWEI-GigabitEthernet1/0/0] dcn ospf timer poll 130"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn an NBMA network, to enable a device to send poll Hello packets at a specified interval after the device's neighbor goes Down, run the dcn ospf timer poll command.\nPrerequisites\nThe DCN feature has been enabled globally using the dcn (interface view) command in the interface view.\nPrecautions\nThe interval value specified in the dcn ospf timer poll command must be at least four times as long as interval specified in the dcn ospf timer hello command.\nIf the dcn ospf timer poll command is run in the interface view, the interval at which poll Hello packets are sent is set for DCN interface.If the dcn ospf timer poll command is run in both the interface and DCN views, only the configuration in the interface view takes effect.\nIn VS mode, this command is supported only by the admin VS."
}