{
    "PageTitle": "dcn ospf trans-delay",
    "FuncDef": "The dcn ospf trans-delay command sets an extension period for link state advertisement (LSAs) that are transmitted on the DCN interfaces of a specified interface.\nThe undo dcn ospf trans-delay command restores the default extension period.\nThe default extension period is 1 second.",
    "CLIs": [
        "dcn ospf trans-delay <interval>",
        "undo dcn ospf trans-delay"
    ],
    "ParentView": [
        "FlexE-50|100G interface view",
        "FlexE interface view",
        "40GE interface view",
        "100GE interface view",
        "GE electrical interface view",
        "Serial interface view",
        "10GE interface view",
        "GE optical interface view",
        "FlexE-100G interface view",
        "POS interface view",
        "FlexE-50G interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "interval",
            "Info": "Specifies an extension period for LSAs.\nThe value is an integer ranging from 1 to 500, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dcn",
            "Warning: This operation will enable DCN function. Continue? [Y/N]:y",
            "[*HUAWEI-dcn] quit",
            "[*HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] dcn",
            "[*HUAWEI-GigabitEthernet1/0/0] dcn ospf trans-delay 3"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe aging time of an LSA in the link state database (LSDB) increases by one every second, but the LSA does not age during transmission. If you require DCN serial interfaces to extend the LSA transmission period, for example, on a low-speed network, run the dcn ospf trans-delay command to add an extension period for LSAs.\nPrerequisites\nThe DCN feature has been enabled globally using the dcn (interface view) command in the interface view.\nPrecautions\nIf the dcn ospf trans-delay command is run in the DCN view, the extension period is set for LSAs on all DCN interfaces.\nIf the dcn ospf trans-delay command is run in the interface view, the extension period is set for LSAs on DCN interface.\nIf the dcn ospf trans-delay command is run in both the interface and DCN views, only the configuration in the interface view takes effect.\nIn VS mode, this command is supported only by the admin VS."
}