{
    "PageTitle": "auto-restore e1-channel-set disable",
    "FuncDef": "The auto-restore e1-channel-set disable command disables automatic recovery of the default DCN interfaces formed by E1 channels' timeslots on a CPOS or E1 subcard.\nThe undo auto-restore e1-channel-set disable command enables automatic recovery of the default DCN interfaces formed by E1 channels' timeslots on a CPOS or E1 subcard.\nBy default, automatic recovery is enabled for the default DCN interfaces formed by E1 channels' timeslots on a CPOS or E1 subcard.",
    "CLIs": [
        "auto-restore e1-channel-set disable",
        "undo auto-restore e1-channel-set disable"
    ],
    "ParentView": [
        "DCN view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dcn",
            "[~HUAWEI-dcn] auto-restore e1-channel-set disable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe DCN plug-and-play function is implemented through automatic creation and recovery of default DCN interfaces. If a default E1 channel of a CPOS or E1 subcard does not require DCN plug-and-play, disable automatic recovery of the corresponding default DCN interface so that the interface can be reserved for other purposes.\nAfter DCN is enabled on a CPOS or E1 subcard, default DCN E1 channels are created automatically, DCN is enabled on the serial interfaces formed by E1 channels' timeslots, and DCN tunnels are established. If DCN tunnels are not required on a CPOS or E1 subcard, disable automatic recovery of corresponding default DCN interfaces. After automatic recovery is disabled:\nIf you delete the default DCN E1 channels that were created automatically, save the configuration, and restart the device, automatic recovery is disabled.If you install a new CPOS or E1 subcard, the default DCN E1 channels will not be created automatically.\n\nPrerequisites\nDCN has been enabled globally using the dcn command in the system view.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nDCN supports the serial interfaces that are formed by timeslots of CPOS interfaces' channelized E1 channels, and the timeslot ranges from 1 to 31.\nIf the DCN feature does not take effect on a specified interface, a message is displayed, helping you locate the cause. Possible causes are as follows: The E1 channel on the CPOS interface does not work in channelized mode; the timeslot is not in the range of 1 to 31; the DCN VLAN ID is the same as a service VLAN ID.\nTo check whether the DCN feature has taken effect on an interface, run the display dcn default-port command."
}