{
    "PageTitle": "lldp enable-dcn authentication",
    "FuncDef": "The lldp enable-dcn authentication command configures an authentication message for the private TLV that supports NMS automatic NE management in LLDP packets.\nThe undo lldp enable-dcn authentication command deletes an authentication message configured for the private TLV that supports NMS automatic NE management in LLDP packets.\nThis command varies in transport and router modes. For detailed differences, see Differences Between Commands in Transport and Router Modes. This topic describes the command configuration in router mode.\nBy default, no authentication message configured for the private TLV that supports NMS automatic NE management in LLDP packets.",
    "CLIs": [
        "lldp enable-dcn authentication <authentication-string>",
        "undo lldp enable-dcn authentication"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "authentication-string",
            "Info": "Indicates the authentication message configured for the private TLV that supports NMS automatic NE management in LLDP packets.\nThe value is a string of characters.\nPassword in simple text: a string of 8 to 16 charactersPassword in ciphertext: a string of 32, 48, or 108 to 128 characters"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] lldp enable-dcn authentication huaweidcn"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAn NE on which NMS automatic NE management is configured encapsulates an authentication message in the private TLV that supports NMS automatic NE management in an LLDP packet before sending the LLDP packet to a downstream NE. Upon receipt of the LLDP packet, the downstream NE parses the private TLV if the downstream NE supports NMS automatic NE management. If the authentication message carried in the LLDP packet is the same as the one configured locally, NMS automatic NE management takes effect on the downstream NE.\nPrecautions\nThis command is supported only on the admin VS.\nThe authentication messages configured on upstream and downstream NEs must be the same. If the authentication message is changed only on the upstream NE, NMS automatic NE management does not take effect on the downstream NE."
}