{
    "PageTitle": "ne-ip",
    "FuncDef": "The ne-ip command sets an IP address and a subnet mask for an NE.\nBy default, the IP address and subnet mask of an NE is generated automatically based on the NEIP address.",
    "CLIs": [
        "ne-ip <ip-address> { <ip-mask> | <mask-length> }"
    ],
    "ParentView": [
        "DCN view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address",
            "Info": "Specifies an IP address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "ip-mask",
            "Info": "Specifies a subnet mask.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "mask-length",
            "Info": "Specifies length of a subnet mask.\nThe value is an integer ranging from 0 to 32."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dcn",
            "Warning: This operation will enable DCN function. Continue? [Y/N]:Y",
            "[*HUAWEI-dcn] ne-ip 10.1.1.1 255.255.0.0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn a DCN network, an NEIP address is the IP address of an NE, and an NEIP address can be either manually configured or automatically generated based on the associated NEID. An NEID is a 24-bit value that consists of a subnet number and a basic ID. An automatically generated NEIP address is in the format of 128.subnet number.basic ID. The NEIP address and NEID are associated; therefore, the NEIP address changes if the NEID is changed.\nAfter the DCN feature runs on a loopback interface, the loopback interface automatically generates an NEIP address based on the NEID, and then OSPF advertises the NEIP address to core routing tables that store mappings between NEIDs and NEIP addresses. To re-plan a DCN network, run the ne-ip command to set an NEIP address and a subnet mask for an NE.\nPrerequisites\nThe DCN feature has been enabled globally using the dcn command in the system view.\nConfiguration Impact\nAfter an NEIP address is set manually, it no longer changes when the associated NEID is changed.\nThe DCN router ID, if not configured, is equal to the NEIP address. Therefore, after an NEIP address is changed, the DCN router ID will be changed to the same value. The new DCN router ID takes effect after the next startup of the corresponding process.Once the DCN router ID is manually changed, it no longer changes when the associated NEIP address is changed. The value of the DCN router ID does not affect the value of a common router ID, because the mechanism for determining the value of the DCN router ID is different from that for a common router ID.\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nNEIP addresses are configured in the DCN view and must be different from the IP addresses configured in the interface view."
}