{
    "PageTitle": "ssl-auth-fail threshold-alarm",
    "FuncDef": "The ssl-auth-fail threshold-alarm command configures an alarm generation threshold for the number of SSL authentication failures within 60s.\nThe undo ssl-auth-fail threshold-alarm command restores the default threshold.\nBy default, an alarm is generated when the number of SSL authentication failures reaches or exceeds 10 within 60s.",
    "CLIs": [
        "ssl-auth-fail threshold-alarm report-times <report-times>",
        "undo ssl-auth-fail threshold-alarm report-times <report-times>",
        "undo ssl-auth-fail threshold-alarm"
    ],
    "ParentView": [
        "DCN view"
    ],
    "ParaDef": [
        {
            "Parameters": "report-times report-times",
            "Info": "Specifies an alarm generation threshold for the number of SSL authentication failures within 60s.\nThe value is an integer ranging from 1 to 100. The default value is 10."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dcn",
            "[*HUAWEI-dcn] quit",
            "[~HUAWEI] ssl policy ftp_server",
            "[~HUAWEI-ssl-policy-ftp_server] certificate load asn1-cert servercert.der key-pair rsa key-file serverkey.der",
            "[~HUAWEI-ssl-policy-ftp_server] quit",
            "[~HUAWEI] dcn",
            "[*HUAWEI-dcn] ssl-auth-fail threshold-alarm report-times 20"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure an alarm generation threshold for the number of SSL authentication failures within 60s, run the ssl-auth-fail threshold-alarm command. If the number of SSL authentication failures reaches or exceeds the specified report-times within 60s, an alarm (hwIpRanSSLAuthFailure) is generated, requiring administrator intervention.\nThe conditions for alarm generation are as follows:\nIf the number of SSL authentication failures within 60s exceeds the configured report-times, the hwIpRanSSLAuthFailure alarm is generated.If the number of SSL authentication failures within 60s is less than the configured report-times, no alarm is generated, and SSL authentication works properly.\n\nPrerequisites\nDCN has been enabled globally using the dcn command in the system view.\nRun the set compatible mode command to enable the DCN compatible mode\nPrecautions\nThis command is supported only on the admin VS.\nTwo NEs on a same subnet cannot have the same NEID. Otherwise, network flapping occurs, and DCN connections cannot be established."
}