{
    "PageTitle": "undo dcn vlan",
    "FuncDef": "The dcn vlan command configures a DCN virtual local area network (VLAN).\nThe undo dcn vlan command deletes the DCN VLAN configuration.\n\nBy default, no DCN VLAN is configured in router mode, and the DCN VLAN ID is 4094 in transport mode.\n\n\nThis command varies in transport and router modes. For detailed differences, see Differences Between Commands in Transport and Router Modes. This topic describes the command configuration in router mode.",
    "CLIs": [
        "undo dcn vlan"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dcn",
            "Warning: This operation will enable DCN function. Continue? [Y/N]:y",
            "[*HUAWEI-dcn] quit",
            "[*HUAWEI] dcn vlan 4093",
            "[*HUAWEI] undo dcn vlan"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo enable DCN packets to pass through a Layer 2 network, run the dcn vlan command to configure a DCN VLAN. Then, the DCN VLAN ID specified in this command will be added to DCN packets before they are sent out.\nPrerequisites\nThe DCN feature has been enabled globally using the dcn command in the system view.\nPrecautions\nRunning this command in the system view to configure a global DCN VLAN refreshes the DCN VLAN configurations of all interfaces.Running this command in the interface view to configure a DCN VLAN refreshes the DCN VLAN configurations of only the interface.\nNew configurations overwrite existing configurations.\" jquery172019013437193979288=\"201\">In VS mode, this command is supported only by the admin VS.\nRunning this command in the system view to configure a global DCN VLAN refreshes the DCN VLAN configurations of all interfaces.Running this command in the interface view to configure a DCN VLAN refreshes the DCN VLAN configurations of only the interface.\nNew configurations overwrite existing configurations."
}