{
    "PageTitle": "authentication-key",
    "FuncDef": "This command configures a Message Digest 5 (MD5) authentication key to be used with a specific Multicast Source Discovery Protocol (MSDP) peering session. The authentication key must be configured per peer as such no global or group configuration is possible.",
    "CLIs": [
        "authentication-key [ authentication-key | <hash-key> ] [ hash | hash2 ]",
        "no authentication-key"
    ],
    "ParentView": [
        "config>router>msdp>peer",
        "config>router>msdp>group>peer"
    ],
    "ParaDef": [
        {
            "Parameters": "authentication-key",
            "Info": "The authentication key. Allowed values are any string up to 256 characters long composed of printable, 7-bit ASCII characters. If the string contains special characters (#, $, spaces, and so on), enclose the entire string in quotation marks (\" \")."
        },
        {
            "Parameters": "hash-key",
            "Info": "The hash key. The key can be any combination of ASCII characters up to 451 characters in length (encrypted). If spaces are used in the string, enclose the entire string in quotation marks (\" \")."
        },
        {
            "Parameters": "hash",
            "Info": "Specifies the key is entered in an encrypted form. If the hash or hash2 parameter is not used, the key is assumed to be in an unencrypted, clear text form. For security, all keys are stored in encrypted form in the configuration file with the hash or hash2 parameter specified."
        },
        {
            "Parameters": "hash2",
            "Info": "Specifies the key is entered in a more complex encrypted form that involves more variables than the key value alone, meaning that the hash2 encrypted variable cannot be copied and pasted. If the hash or hash2 parameter is not used, the key is assumed to be in an unencrypted, clear text form. For security, all keys are stored in encrypted form in the configuration file with the hash or hash2 parameter specified."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: no authentication-key"
}