{
    "PageTitle": "set said-node",
    "FuncDef": "The set said-node command disables a specified system of active immunization and diagnosis (SAID) node or all SAID nodes.\nThe undo set said-node command restores the default SAID node configuration.\nBy default, all SAID nodes are enabled.",
    "CLIs": [
        "set said-node <said-name> slot <slot-id> disable",
        "set said-node <said-name> disable",
        "set said-node all disable",
        "undo set said-node <said-name> slot <slot-id> disable",
        "undo set said-node <said-name> disable",
        "undo set said-node all disable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "said-name",
            "Info": "Name of the SAID node.\nThe value is an integer that ranges from 1 to 16 ."
        },
        {
            "Parameters": "slot slot-id",
            "Info": "ID of the slot.\nThe value is an integer that ranges from 1 to 16."
        },
        {
            "Parameters": "all",
            "Info": "All SAID nodes.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system view",
            "[~HUAWEI] set said-node aaa slot 1 disable",
            "Info:The node status is successfully set in the SAID."
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] set said-node said-ping slot 1 disable",
            "Info:The node status is successfully set in the SAID."
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe diagnosis and recovery durations of a single SAID node must not exceed 10 and 30 minutes, respectively. If either duration is exceeded, the SAID node is disabled by default. When a SAID node is processing a large number of services, the processing efficiency of other SAID nodes may be reduced because of performance insufficiency. To guarantee the processing efficiency, you can run the set said-node command to disable this node.\nIf the node is not in the detecting state after being disabled, it automatically returns to the detecting state upon completion of the operation in the current phase. When the next SAID task is started to perform detection, the system detects that the SAID node is disabled and therefore skips it.\nAfter the SAID node is enabled upon configuration completion, the device sends or receives ICMP packets. You can run the display said-node status command to check the status of the current SAID node.\nPrecautions\nSAID node IDs indicate the IDs of the SAID component's modules. The SAID node with the ID of 2 indicates the SAID ping function of a physical interface; the SAID node with the ID of 3 indicates the SAID ping function of a trunk interface; the SAID node with the ID of 8 indicates the SAID aaa function; the SAID node with the ID of 20 indicates the seu-trunk function; the SAID node with the ID of 26 indicates the control plane and forwarding plane consistency check function (CFC) .\nIn VS mode, this command is supported only by the admin VS."
}