{
    "PageTitle": "group mode",
    "FuncDef": "The group mode command configures a working mode for a VLAN group.\nThe undo group mode command restores the default working mode.\nBy default, a VLAN group works in single mode.",
    "CLIs": [
        "group mode { single | multiple }",
        "undo group mode"
    ],
    "ParentView": [
        "VLAN-group view"
    ],
    "ParaDef": [
        {
            "Parameters": "single",
            "Info": "Configures a VLAN group to work in single mode. In single mode, all VLAN tags to be terminated in a specified VLAN group belong to the same user.\nA VLAN group is considered as a user. This means that you cannot collect QinQ packet statistics or deploy QoS policies based on a VLAN or a VLAN range.\n-"
        },
        {
            "Parameters": "multiple",
            "Info": "Configures a VLAN group to work in multiple mode. In multiple mode, VLAN tags to be terminated in a specified VLAN group belong to different users.\nVLANs or VLAN ranges in a VLAN group are considered as different users. This means that you can collect QinQ packet statistics or deploy QoS policies based on a VLAN or VLAN range to implement refined management.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1/0/1.1",
            "[*HUAWEI-GigabitEthernet1/0/1.1] vlan-group 1",
            "[*HUAWEI-GigabitEthernet1/0/1.1-vlangroup1] group mode multiple"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf you want to specify whether to collect QinQ packet statistics or deploy QoS policies based on a VLAN or a VLAN range in a VLAN group, run the group mode command to configure a working mode for the VLAN group.\nPrerequisites\nA VLAN group has been created and the VLAN group view must be displayed using the vlan-group command.\nConfiguration Impact\nIf a VLAN group is in use, do not run the group mode command to change the working mode for the VLAN group. Unbind the VLAN tag termination sub-interface from a VLAN group before you change the working mode for the VLAN group.\nIf the working mode of a VLAN group is set to multiple and VLAN group-based QinQ packet statistics collection is enabled using the statistic enable command, the number of QinQ packets cannot exceed 4000. Otherwise, a system fault may occur."
}