{
    "PageTitle": "protocol outer-vlan-only",
    "FuncDef": "The protocol outer-vlan-only command disables an interface from changing the EthType value of the received single-tagged packets.\nThe undo protocol outer-vlan-only command enables an interface to change the EthType value of the received single-tagged packets.\nBy default, an interface is enabled to change the EthType value of the received single-tagged packets.",
    "CLIs": [
        "protocol outer-vlan-only",
        "undo protocol outer-vlan-only"
    ],
    "ParentView": [
        "100GE interface view",
        "10G LAN interface view",
        "10G WAN interface view",
        "25GE interface view",
        "400GE interface view",
        "40GE interface view",
        "Eth-Trunk interface view",
        "GE optical interface view",
        "GE interface view",
        "GE electrical interface view",
        "Layer 2 Eth-Trunk interface view",
        "Port extension interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] protocol outer-vlan-only"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, after an interface receives a single-tagged packet, it changes the packet's EthType value before sending the packet out. If the packet's EthType value must remain unchanged, run the protocol outer-vlan-only command to disable the interface from changing the packet's EthType value.\nAn interface changes the EthType value as follows:\nIf the qinq protocol ethertype-value command is not run, the EthType value in the single VLAN tag is changed to 0x8100.\nIf the qinq protocol ethertype-value command is run, the EthType value in the single VLAN tag is changed to the value specified by ethertype-value.\nPrecautions\nThe protocol outer-vlan-only command can be run on a Layer 2 or Layer 3 interface, but cannot be run on sub-interfaces.\nIf an interface receives a double-tagged packet, it changes the EthType in the outer VLAN tag, irrespective of whether the protocol outer-vlan-only command is run."
}