{
    "PageTitle": "qinq stacking client-mode single",
    "FuncDef": "The qinq stacking client-mode single command enables a QinQ stacking subinterface to learn the MAC address mapped to the smallest VLAN ID among all VLAN ranges that share the MAC address when the subinterface accesses VPLS services.\nThe undo qinq stacking client-mode single command configures a QinQ stacking sub-interface to learn a VLAN address from each VLAN segment when the sub-interface provides VPLS services.\nBy default, when a sub-interface provides VPLS services, each VLAN segment bound to the sub-interface can learn one VLAN address.",
    "CLIs": [
        "qinq stacking client-mode single",
        "undo qinq stacking client-mode single"
    ],
    "ParentView": [
        "100ge sub-interface view",
        "10G LAN interface view",
        "10G WAN interface view",
        "40GE sub-interface view",
        "Eth-Trunk sub-interface view",
        "GE sub-interface view",
        "Global VE sub-interface view",
        "VE sub-interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1/0/0.1",
            "[*HUAWEI-GigabitEthernet1/0/0.1] mpls",
            "[*HUAWEI-GigabitEthernet1/0/0.1] mpls 12vpn",
            "[*HUAWEI-GigabitEthernet1/0/0.1] qinq stacking vid 1 to 10",
            "[*HUAWEI-GigabitEthernet1/0/0.1] qinq stacking vid 11 to 20",
            "[*HUAWEI-GigabitEthernet1/0/0.1] qinq stacking client-mode single"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a QinQ stacking sub-interface provides VPLS services and multiple VLAN segments are configured on the sub-interface, the VLAN segments have the same user traffic. If the qinq stacking client-mode single command is not configured, the learned MAC address keeps flapping, causing some packets to fail to be forwarded and a high CPU usage. After the qinq stacking client-mode single command is configured on the QinQ stacking sub-interface, the sub-interface learns only one VLAN. No matter which VLAN segment has traffic, the learned MAC address does not flap.\nPrerequisites\nThe sub-interface has been configured as a QinQ stacking sub-interface using the qinq stacking vid command.\nConfiguration Impact\nAfter the qinq stacking client-mode single command is configured on a QinQ stacking sub-interface, the sub-interface can provide only VPLS services.\nIn a scenario where two or more sub-interfaces of the same interface are configured with the qinq stacking client-mode single command and are bound to the same VSI, if the inbound traffic has the same source MAC address, the MAC address still flaps.\nPrecautions\nThe QinQ stacking sub-interface that has the single leaf mode enabled using the qinq stacking client-mode single command cannot be bound to an I-VSI.\nBefore the VLAN configuration is modified in single leaf mode, run the shutdown command on the interface. The modification of the VLAN may change the outer VLAN tag on the sub-interface. As a result, multicast leaf entries and MAC address entries need to be updated, which causes traffic interruption.\nIn a VSI, MAC flapping also occurs if packets have the same source MAC addresses but different VLANs.\nIn single leaf mode, deleting the middle VLAN ID does not delete the corresponding MAC address. The MAC address is deleted after the aging period expires. When the minimum VLAN changes, the MAC address of the AC interface is deleted automatically."
}