{
    "PageTitle": "vlan-miss to-cpu enable",
    "FuncDef": "The vlan-miss to-cpu enable command enables a board to send a BAS user packet that carries two VLAN tags to the board's CPU in a stacking scenario.\nThe undo vlan-miss to-cpu enable command disables a board from sending a BAS user packet that carries two VLAN tags to the board's CPU in a stacking.\nBy default, a board is disabled from sending a BAS user packet that carries two VLAN tags to the board's CPU in a stacking scenario.",
    "CLIs": [
        "vlan-miss to-cpu enable",
        "undo vlan-miss to-cpu enable"
    ],
    "ParentView": [
        "Slot view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] slot 1",
            "[~HUAWEI-slot-1] vlan-miss to-cpu enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter a BAS service is configured and the BAS user packet carries two VLAN tags whose IDs are specified by the user-vlan { { start-vlan-id [ end-vlan-id ] [ qinq start-pe-vlan [ end-pe-vlan ] ] } | any-other } command, the BAS user cannot go online in the following stacking scenarios:The user's outer VLAN ID for Layer 2 access is the same as the VLAN ID specified in the vlan-type dot1q command for a dot1q sub-interface.The user's outer VLAN ID for Layer 2 access is the same as the VLAN ID terminated by a dot1q VLAN tag termination sub-interface.To allow the BAS user to go online, run the vlan-miss to-cpu enable command to enable a board to send a BAS user packet that carries two VLAN tags to the board's CPU in a stacking scenario.\nConfiguration Impact\nAfter the vlan-miss to-cpu enable command is run in a slot view, the command takes effect for all interfaces on the board in the specified slot. When a user packet that carries two VLAN tags is sent to a user-side interface, if the outer VLAN ID in the user packet does not match any configuration on the interface, the packet is processed differently, depending on the packet's destination MAC address. If the packet's destination MAC address is the same as that of the current interface, the packet is sent to the CPU. Otherwise, the packet is discarded.\nPrecautions\nThis command is supported only on the admin VS."
}