{
    "PageTitle": "default-martini",
    "FuncDef": "The default-martini enable command disables LDP PWs from sending Notification messages.\nThe default-martini disable command enables LDP PWs to send Notification messages.\nThe undo default-martini command restores the default PW configuration.\nBy default, the mpls l2vpn default martini command configuration applies to PWs.",
    "CLIs": [
        "default-martini { enable | disable }",
        "undo default-martini { enable | disable }"
    ],
    "ParentView": [
        "L2VPN peer view"
    ],
    "ParaDef": [
        {
            "Parameters": "enable",
            "Info": "Disables LDP PWs for sending Notification messages.\n-"
        },
        {
            "Parameters": "disable",
            "Info": "Enables LDP PWs to send Notification messages.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] peer 2.2.2.2",
            "[*HUAWEI-l2vpn-peer-2.2.2.2] default-martini enable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] peer 2.2.2.2",
            "[*HUAWEI-l2vpn-peer-2.2.2.2] undo default-martini enable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] peer 3.3.3.3",
            "[*HUAWEI-l2vpn-peer-3.3.3.3] default-martini disable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] peer 3.3.3.3",
            "[*HUAWEI-l2vpn-peer-3.3.3.3] undo default-martini disable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nInitially, draft states that LDP PWs cannot use Notification messages. Later, relevant standards states that LDP PWs can use Notification messages to process services. To enable a device supporting Notification messages to communicate with a device not supporting Notification messages, run the default-martini command to disable PWs from sending Notification messages.\nPrerequisites\nThe L2VPN peer view has been displayed using the peer command.\nPrecautions\nThe mpls l2vpn default martini command applies to global PWs, whereas the default-martini command applies to specific PWs. The default-martini command takes preference over the mpls l2vpn default martini command. If the default-martini command is not configured for a PW, the PW uses the mpls l2vpn default martini command configuration."
}