{
    "PageTitle": "display local-ce mac",
    "FuncDef": "The display local-ce mac command displays MAC addresses and VLAN IDs of Ethernet interfaces on the local CE.",
    "CLIs": [
        "display local-ce mac [ <interface-type> <interface-number> | <interface-name> ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "interface-type",
            "Info": "Specifies the interface type.\n-"
        },
        {
            "Parameters": "interface-number",
            "Info": "Specifies the interface number.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display local-ce mac",
            "INTERFACE                       MAC ADDRESS    EXPIRE TYPE VLAN PVC      IP ADDRESS",
            "-----------------------------------------------------------------------------",
            "GigabitEthernet1/0/1.1          00e0-fc20-b3a6        S(A)",
            "-----------------------------------------------------------------------------",
            "Total:1       Dynamic:0       Static:1       Broadcast:0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the Ethernet AC interface on the PE is configured with heterogeneous IP interworking, you need to run the local-ce mac or local-ce ip command on this AC interface to specify the MAC address or IP address for the Ethernet AC interface on the local CE, so as to ensure communication between CEs.\nTo view MAC addresses and VLAN IDs of Ethernet interfaces on the local CE, run the display local-ce mac command.\nConfiguration Impact\nIf a large number of Ethernet interfaces exist on the local CE, you are advised to specify the interface type and interface number to view MAC addresses and VLAN IDs by using this command. Otherwise, excess output information may cause the following problems:\nThe displayed information is repeatedly refreshed and the required information cannot be obtained.The system does not respond because of prolonged information traversing and searching.\n\nPrecautions\nIf no interface is specified, the display local-ce mac command will display MAC addresses and VLAN IDs of all interfaces."
}