{
    "PageTitle": "mpls switch-l2vc between encapsulation bit-error-detection",
    "FuncDef": "The mpls switch-l2vc between encapsulation bit-error-detection command enables bit-error-triggered PW switching on an SPE of an MS-PW.\nThe undo mpls switch-l2vc between encapsulation bit-error-detection command disables bit-error-triggered PW switching on an SPE of an MS-PW.\nBy default, bit-error-triggered PW switching is disabled on an SPE of an MS-PW.",
    "CLIs": [
        "mpls switch-l2vc <ip-address> <vc-id> between <ip-address> <vc-id> encapsulation { atm-1to1-vcc | atm-1to1-vpc | atm-aal5-pdu | atm-aal5-sdu | atm-nto1-vcc | atm-nto1-vpc | atm-trans-cell | cesopsn-basic | ethernet | fr | hdlc | ip-interworking | ip-layer2 | ppp | satop-e1 | satop-e3 | satop-t1 | vlan | cep } bit-error-detection",
        "undo mpls switch-l2vc <ip-address> <vc-id> between <ip-address> <vc-id> encapsulation { atm-1to1-vcc | atm-1to1-vpc | atm-aal5-pdu | atm-aal5-sdu | atm-nto1-vcc | atm-nto1-vpc | atm-trans-cell | cesopsn-basic | ethernet | fr | hdlc | ip-interworking | ip-layer2 | ppp | satop-e1 | satop-e3 | satop-t1 | vlan | cep } bit-error-detection"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address",
            "Info": "Specifies an LSR ID of the remote device on the PW.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "vc-id",
            "Info": "Specifies the ID of a L2VC.\nThe value is a decimal integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "vc-id",
            "Info": "Specifies the ID of a PW.\nThe value is an integer that ranges from 1 to 4294967295."
        },
        {
            "Parameters": "between",
            "Info": "Specifies the PW used with the current PW to form an MS-PW.\n-"
        },
        {
            "Parameters": "encapsulation",
            "Info": "Indicates the PW encapsulation type.\n-"
        },
        {
            "Parameters": "atm-1to1-vcc",
            "Info": "One PW carries the AAL5 SDUs of one PVC.\n-"
        },
        {
            "Parameters": "atm-1to1-vpc",
            "Info": "One PW carries the AAL5 SDUs of one PVC.\n-"
        },
        {
            "Parameters": "atm-aal5-pdu",
            "Info": "One PW carries the AAL5 SDUs of one PVC.\n-"
        },
        {
            "Parameters": "atm-aal5-sdu",
            "Info": "One PW carries the AAL5 SDUs of one PVC.\n-"
        },
        {
            "Parameters": "atm-nto1-vcc",
            "Info": "One PW carries the ATM cells of multiple PVCs.\n-"
        },
        {
            "Parameters": "atm-nto1-vpc",
            "Info": "ATM cells are transmitted over PWE3 VCs.\n-"
        },
        {
            "Parameters": "atm-trans-cell",
            "Info": "ATM cells are transmitted over PWE3 VCs.\n-"
        },
        {
            "Parameters": "cesopsn-basic",
            "Info": "Specifies the PW encapsulation type as cesopsn-basic.\n-"
        },
        {
            "Parameters": "ethernet",
            "Info": "This encapsulation type is used when Ethernet packets do not carry VLAN information.\n-"
        },
        {
            "Parameters": "fr",
            "Info": "FR provides protocol standards for the data link layer and physical layer.\n-"
        },
        {
            "Parameters": "hdlc",
            "Info": "HDLC is a bit-oriented link layer protocol.\n-"
        },
        {
            "Parameters": "ip-interworking",
            "Info": "Enables static PW interworking when devices in the interworking are all provided by Huawei.\n-"
        },
        {
            "Parameters": "ip-layer2",
            "Info": "Enables IP interworking for an LDP PW between a Huawei device and a non-Huawei device. ip-layer2 is required for IP interworking between a Huawei device and a non-Huawei device.\n-"
        },
        {
            "Parameters": "ppp",
            "Info": "PPP is a link layer protocol that specifies how to encapsulate and transmit network layer packets over P2P links.\n-"
        },
        {
            "Parameters": "satop-e1",
            "Info": "SAToP is insensitive to the E1 frame structure and encapsulates a whole E1 frame into a PW packet.\n-"
        },
        {
            "Parameters": "satop-e3",
            "Info": "SAToP is insensitive to the E3 frame structure and encapsulates a whole E3 frame into a PW packet.\n-"
        },
        {
            "Parameters": "satop-t1",
            "Info": "SAToP is insensitive to the T1 frame structure and encapsulates a whole T1 frame into a PW packet.\n-"
        },
        {
            "Parameters": "vlan",
            "Info": "This encapsulation type is used when Ethernet packets carry VLAN information.\n-"
        },
        {
            "Parameters": "cep",
            "Info": "This encapsulation type is used for CEP services.\n-"
        },
        {
            "Parameters": "bit-error-detection",
            "Info": "Specifies to use CRC to detect bit errors.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[*HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[~HUAWEI] mpls switch-l2vc 1.1.1.9 100 between 3.3.3.9 100 encapsulation vlan",
            "[*HUAWEI] mpls switch-l2vc 1.1.1.9 100 between 3.3.3.9 100 encapsulation vlan bit-error-detection"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn a PW redundancy scenario, if the endpoint PEs of a PW are in different ASs, you must configure the PW as an MS-PW. BFD for PW and BFD for LSP, two commonly deployed detection mechanisms in PW redundancy scenarios, can trigger the active/standby switchover of PWs only after detecting the loss of three consecutive BFD packets.\nTo resolve this problem, you can configure bit-error-triggered protection switching for the MS-PW. Bit-error-triggered PW switching uses CRC to check the bit error rate and works with the TE hot standby LSP or PW to protect services transmitted over a PW, ensuring end-to-end service quality of a PW.\nPrerequisites\nThe mpls l2vpn command has been run to enable MPLS L2VPN.\nConfiguration Impact\nAfter you enable bit-error-triggered PW switching on the SPEs and endpoint PEs, the primary and secondary PWs respond to bit error events and perform an active/standby switchover as needed. In a scenario in which both the primary and secondary PWs are normal:\nIf the primary PW does not encounter a bit error event, the primary PW forwards traffic.If the primary PW encounters a bit error event but the secondary PW does not, the secondary PW takes over traffic from the primary PW.If the primary and secondary PWs both encounter a bit error event, the primary PW forwards traffic.\n\nPrecautions\nThe mpls switch-l2vc bit-error-detection command applies to only dynamic LDP MS-PWs."
}