{
    "PageTitle": "mtu (MPLS-L2VPN instance view)",
    "FuncDef": "The mtu command configures the MTU of an MPLS L2VPN instance.\nThe undo mtu command restores the default configuration.\nBy default, the MTU of an MPLS L2VPN instance is 1500 bytes.",
    "CLIs": [
        "mtu <mtu>",
        "undo mtu"
    ],
    "ParentView": [
        "MPLS-L2VPN instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "mtu",
            "Info": "Specifies the MTU.\nThe value is a decimal integer that can be 0 or ranges from 46 to 16352."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] mpls l2vpn vpn1 encapsulation ethernet",
            "[*HUAWEI-mpls-l2vpn-vpn1] route-distinguisher 100:1",
            "[*HUAWEI-mpls-l2vpn-vpn1] mtu 1000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe MTU size determines the maximum packet size allowed by a VPWS network. If the MTU is greater than the maximum packet size allowed by a VPWS network or an intermediate node (P), packet fragmentation or even drop will occur, affecting network transmission. The MTU is one of the VPWS negotiation parameters. If the MTUs of the same L2VPN instance on the endpoint PEs are different, the two PEs cannot exchange reachability information or establish a PW. An appropriate MTU must be set for an L2VPN instance based on the MTU of the interface bound to the L2VPN instance. The MTU of an L2VPN instance must be less than or equal to the MTU of the interface bound to the L2VPN instance.\nPrerequisites\nThe MPLS-L2VPN instance view has been displayed using the mpls l2vpn l2vpn-name command.\nConfiguration Impact\nThe MTU of an MPLS L2VPN instance cannot be changed after VPN targets are configured for the MPLS L2VPN instance using the vpn-target (MPLS-L2VPN instance view).\nPrecautions\nThe devices of some vendors cannot perform the MTU match check for MPLS L2VPN instances. When a Huawei device interworks with a non-Huawei device on a BGP VPWS network, perform either of the following operations on the Huawei device to ensure that the VC can go Up:\nSet the MTU of the MPLS L2VPN instance on the Huawei device to be the same as that on the non-Huawei device.Run the ignore-mtu-match (MPLS-L2VPN instance view) command on the Huawei device to disable the device from performing the MTU match check."
}