{
    "PageTitle": "mpls l2vpn (System view)",
    "FuncDef": "The mpls l2vpn command creates a BGP VPWS instance and displays the MPLS-L2VPN instance view.\nThe undo mpls l2vpn command deletes a BGP VPWS instance, the MPLS-L2VPN instance view, and all configurations in the view.\nBy default, no BGP VPWS instance is created.",
    "CLIs": [
        "mpls l2vpn <l2vpn-name> [ encapsulation { ethernet | vlan | hdlc | ppp | ip-interworking | ip-layer2 | atm-1to1-vcc | atm-1to1-vpc | atm-nto1-vcc | atm-nto1-vpc | atm-aal5-sdu | atm-trans-cell } [ control-word | no-control-word ] ]",
        "undo mpls l2vpn <l2vpn-name>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "l2vpn-name",
            "Info": "Specifies an MPLS L2VPN instance name.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported.\nThe string can contain spaces if it is enclosed in double quotation marks (\")."
        },
        {
            "Parameters": "encapsulation",
            "Info": "Indicates the PW encapsulation type.\n-"
        },
        {
            "Parameters": "ethernet",
            "Info": "This encapsulation type is used when Ethernet packets do not carry VLAN information.\n-"
        },
        {
            "Parameters": "vlan",
            "Info": "This encapsulation type is used when Ethernet packets carry VLAN information.\n-"
        },
        {
            "Parameters": "hdlc",
            "Info": "HDLC is a bit-oriented link layer protocol.\n-"
        },
        {
            "Parameters": "ppp",
            "Info": "PPP is a link layer protocol that specifies how to encapsulate and transmit network layer packets over P2P links.\n-"
        },
        {
            "Parameters": "ip-interworking",
            "Info": "Enables static PW interworking when devices in the interworking are all provided by Huawei.\n-"
        },
        {
            "Parameters": "ip-layer2",
            "Info": "Enables IP interworking for an LDP PW between a Huawei device and a non-Huawei device. ip-layer2 is required for IP interworking between a Huawei device and a non-Huawei device.\n-"
        },
        {
            "Parameters": "atm-1to1-vcc",
            "Info": "One PW carries the AAL5 SDUs of one PVC.\n-"
        },
        {
            "Parameters": "atm-1to1-vpc",
            "Info": "One PW carries the AAL5 SDUs of one PVC.\n-"
        },
        {
            "Parameters": "atm-nto1-vcc",
            "Info": "One PW carries the ATM cells of multiple PVCs.\n-"
        },
        {
            "Parameters": "atm-nto1-vpc",
            "Info": "ATM cells are transmitted over PWE3 VCs.\n-"
        },
        {
            "Parameters": "atm-aal5-sdu",
            "Info": "One PW carries the AAL5 SDUs of one PVC.\n-"
        },
        {
            "Parameters": "atm-trans-cell",
            "Info": "ATM cells are transmitted over PWE3 VCs.\n-"
        },
        {
            "Parameters": "control-word",
            "Info": "Enables the control word function.\nBy default, the control word function is enabled only for L2VPNs with the ATM and FR encapsulation types."
        },
        {
            "Parameters": "no-control-word",
            "Info": "Disables the control word function.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] mpls l2vpn vpn1 encapsulation ethernet"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBGP VPWS is a type of L2VPN technology that uses BGP as the signaling protocol to transmit Layer 2 information and VC labels between PEs.\nBGP VPWS PWs must be configured in VPN instances. To create a VPN instance, run the mpls l2vpn command.\nPrerequisites\nMPLS L2VPN has been enabled using the mpls l2vpn command.\nFollow-up Procedure\nRun the route-distinguisher route-distinguisher command to configure an RD for the VPN instance.\nPrecautions\nThe encapsulation type configured using the mpls l2vpn l2vpn-name command must be the same as the encapsulation type used by the two AC interfaces. If the two AC interfaces use different encapsulation types, specify encapsulation-type as ip-interworking when running the mpls l2vpn l2vpn-name command."
}