{
    "PageTitle": "mpls l2vpn ignore-te-oam-state",
    "FuncDef": "The mpls l2vpn ignore-te-oam-state command configures PWs to ignore the recursive tunnel status detected by MPLS OAM/MPLS-TP OAM.\nThe undo mpls l2vpn ignore-te-oam-state command restores the default configuration.\nBy default, PWs determine their own status based on both the actual recursive tunnel status and the one detected by MPLS OAM/MPLS-TP OAM.",
    "CLIs": [
        "mpls l2vpn ignore-te-oam-state",
        "undo mpls l2vpn ignore-te-oam-state"
    ],
    "ParentView": [
        "MPLS-L2VPN view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] mpls l2vpn ignore-te-oam-state"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] undo mpls l2vpn ignore-te-oam-state"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen MPLS OAM/MPLS-TP OAM is used to detect recursive tunnel status, PWs determine their own status based on both the actual recursive tunnel status and the one detected by MPLS OAM/MPLS-TP OAM. A PW is Down so long as one of the two statuses is Down. In real-world situations, a tunnel may be normal even if the tunnel status detected by MPLS OAM/MPLS-TP OAM is Down. For example, when MPLS OAM/MPLS-TP OAM is enabled or disabled, the tunnel status detected by MPLS OAM/MPLS-TP OAM is momentarily Down due to the time difference of configurations on both ends. If the PW goes Down because the recursive tunnel status detected by MPLS OAM/MPLS-TP OAM is Down, PW traffic will be momentarily interrupted. To prevent this problem, run the mpls l2vpn ignore-te-oam-state command to configure PWs to ignore the recursive tunnel status detected by MPLS OAM/MPLS-TP OAM.\nPrerequisites\nMPLS L2VPN has been enabled using the mpls l2vpn command.\nConfiguration Impact\nAfter the undo mpls l2vpn ignore-te-oam-state command is run, PWs cannot recurse to tunnels with OAM faults."
}