{
    "PageTitle": "ce",
    "FuncDef": "The ce command creates a CE in an MPLS VPN instance and displays the MPLS-L2VPN-CE view.\nThe undo ce command deletes a CE from an MPLS L2VPN instance.\nBy default, no CE is configured in an MPLS VPN instance.",
    "CLIs": [
        "ce <ce-Name> [ id <ce-id> [ range <ce-range> ] [ default-offset <ce-offset> ] ]",
        "undo ce <ce-Name>"
    ],
    "ParentView": [
        "MPLS-L2VPN instance view"
    ],
    "ParaDef": [
        {
            "Parameters": "ce-Name",
            "Info": "Specifies a CE name.\nThe value is a string of 1 to 20 case-sensitive characters, spaces not supported.\nThe string can contain spaces if it is enclosed in double quotation marks (\")."
        },
        {
            "Parameters": "id ce-id",
            "Info": "Specifies a CE ID.\nA CE ID uniquely identifies a CE in an MPLS VPN instance. It is recommended that CE IDs be numbered with consecutive numbers starting from 1.\nThe value is an integer ranging from 0 to 65534."
        },
        {
            "Parameters": "range ce-range",
            "Info": "Specifies a CE range.\nThe value is an integer ranging from 1 to 65535. The default value is 10."
        },
        {
            "Parameters": "default-offset ce-offset",
            "Info": "Specifies a CE offset, or the difference between the remote and local CE IDs.\nThe value is 0 or 1. The default value is 0."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] mpls l2vpn vpn1 encapsulation ethernet",
            "[*HUAWEI-mpls-l2vpn-vpn1] route-distinguisher 100:1",
            "[*HUAWEI-mpls-l2vpn-vpn1] ce ce1 id 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn a BGP VPWS scenario, after an MPLS L2VPN instance is configured, the ce command must be run to create a CE in the L2VPN instance. In the ce command, you can specify ce-name, ce-id, ce-range, and the maximum number of CE connections allowed.\nPrerequisites\nAn RD has been configured using the route-distinguisher command for the MPLS L2VPN instance.\nPrecautions\nThe relationships between ce-range and ce-offset in the ce command and ce-offset-id in the connection command are as follows:If ce-offset is 0, ce-offset-id must be smaller than ce-range.If ce-offset is 1, ce-offset-id must be smaller than or equivalent to ce-range and must not be 0.The ce command can only be used to increase the ce-range value."
}