{
    "PageTitle": "protect-switch (PW-APS view)",
    "FuncDef": "The protect-switch command configures a manual switch request for a specified PW APS instance.\nThe protect-switch clear command deletes the manual switch request for a specified PW APS instance.\nBy default, no manual switch request is configured for a specified PW APS instance.",
    "CLIs": [
        "protect-switch { clear | force | lock | manual }"
    ],
    "ParentView": [
        "PW-APS view"
    ],
    "ParaDef": [
        {
            "Parameters": "clear",
            "Info": "Clears a manual switching request.\n-"
        },
        {
            "Parameters": "force",
            "Info": "Indicates to forcibly switch traffic to the protection path. If the protection path is Down, the configuration does not take effect.\nAfter you specify force, traffic travels along the protection even after the working path recovers.\n-"
        },
        {
            "Parameters": "lock",
            "Info": "Indicates to lock traffic to the working path. Traffic is not switched to the protection path even if the working path is faulty.\n-"
        },
        {
            "Parameters": "manual",
            "Info": "Indicates to manually switch traffic to the protection path. If the protection path is Down, the configuration does not take effect.\nIf the working path recovers after you specify manual, traffic switches back to the working path.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] pw-aps 1",
            "[*HUAWEI-pw-aps-1] protect-switch force"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] pw-aps 1 frr",
            "[*HUAWEI-pw-aps-1] protect-switch force"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn network O&M, service traffic sometimes needs to be switched to the protection path or locked to the working path. To switch traffic manually, run the protect-switch command.\nAfter maintenance operations are complete, you can run the protect-switch clear command to switch traffic back.\nPrerequisites\nA PW APS instance has been created using the pw-aps command.\nPrecautions\nDifferent switch requests have different priorities. When the priority of a new switch request is higher than that of the current switch request, the new switch request takes effect."
}