{
    "PageTitle": "pw-aps (System view)",
    "FuncDef": "The pw-aps command creates a PW APS instance.\nThe undo pw-aps command deletes a PW APS instance.\nBy default, no PW APS instance is configured in the system.",
    "CLIs": [
        "pw-aps <apsId> [ frr ]",
        "undo pw-aps <apsId> [ frr ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "apsId",
            "Info": "Specifies the number of a PW APS instance on the local end.\nThe value is an integer ranging from 1 to 16384."
        },
        {
            "Parameters": "frr",
            "Info": "Indicates pseudowire Fast Protection Switching (PW FPS) for VPWS reliability.In dual-homing protection scenarios where E-LAN services are deployed,PW FPS can be configured for VPWS reliability. PW FPS is the single-ended switching mode of PW APS. When PW FPS is used, the PEs at the two ends of a PW do not exchange APS negotiation packets. Instead, they select the primary and secondary PWs based on the local PW priority and PW OAM detection status.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] pw-aps 1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] pw-aps 1 frr"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nPW APS can be used to ensure the reliability of LDP and SVC PWs. In PW APS networking, the PW APS instance status determines the protection switching in a PW protection group. Therefore, you need to run the pw-aps command to create a PW APS instance first.\nPrerequisites\nMPLS and MPLS L2VPN have been enabled in the system view.\nConfiguration Impact\nIf you run the undo pw-aps command to delete a PW APS instance that has been associated with PW protection groups, an interactive prompt will be displayed, requiring your confirmation. Enter Y if you want to dissociate the PW APS instance from the PW protection groups and delete the PW APS instance. Enter N if you want to cancel the operation and retain the association.\nFollow-up Procedure\nConfigure the attributes of a PW APS instance as needed, such as its description, switchback mode, WTR time, manual operation, and switching delay time.\nIn an E-PW APS scenario, you need to run the role and remote-aps commands to configure inter-device protection.\nPrecautions\nThe default role of a PW APS instance is PW APS. In an E-PW APS scenario, you need to run the role command to specify the master or slave role for a PW APS instance.\nIf a PW APS instance has been bound to PW protection groups, deleting the PW APS instance causes all the binding relationships between the PW APS instance and the PW protection groups to be removed. Therefore, exercise caution when performing this operation."
}