{
    "PageTitle": "role",
    "FuncDef": "The role command configures the role of a PW APS instance in an E-PW APS scenario.\nThe undo role command restores the default role of a PW APS instance.\nBy default, the role of a PW APS instance is PW APS.",
    "CLIs": [
        "role { master | slave }",
        "undo role"
    ],
    "ParentView": [
        "PW-APS view"
    ],
    "ParaDef": [
        {
            "Parameters": "master",
            "Info": "Specifies the role of a PW APS instance as master in an E-PW APS scenario.\n-"
        },
        {
            "Parameters": "slave",
            "Info": "Specifies the role of a PW APS instance as slave in an E-PW APS scenario.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] pw-aps 1",
            "[*HUAWEI-pw-aps-1] role master"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA PW APS instance plays one of the following roles: PW APS, master (in E-PW APS), and slave (in E-PW APS). PW APS is the default role. In E-PW APS networking, two PW APS instances with the master and slave roles respectively are configured on each PE to which a CE is dual-homed. E-PW APS determines whether to implement protection switching based on the PW status of the master PW APS instance. To specify the master or slave role for a PW APS instance in an E-PW APS scenario, run the role command.\nPrerequisites\nA PW APS instance has been created using the pw-aps command.\nConfiguration Impact\nIn E-PW APS networking, after roles are specified for PW APS instances, the E-PW APS status is determined by the master PW APS instance.\nFollow-up Procedure\nRun the remote-aps command to configure the remote number of each PW APS instance.\nConfigure the attributes of the master PW APS instance as needed, such as its description, operating mode, WTR time, manual operation, and switching delay time.\nPrecautions\nThe role command can be used to change the role of a PW APS instance from PW APS to master or slave or between master and slave. If a PW APS instance has been associated with PW protection groups, its role cannot be changed between master and slave.After you run the undo role command, the role of a PW APS instance changes to PW APS and the remote number of the PW APS instance is automatically deleted."
}