{
    "PageTitle": "wtr (PW-FPS view)",
    "FuncDef": "The wtr command configures the WTR time for a PW APS instance.\nThe undo wtr command restores the default WTR time for a PW APS instance.\nBy default, the WTR time for a PW APS instance is 5 minutes.",
    "CLIs": [
        "wtr <wtrValue>",
        "undo wtr"
    ],
    "ParentView": [
        "PW-APS view",
        "PW-FPS view"
    ],
    "ParaDef": [
        {
            "Parameters": "wtrValue",
            "Info": "Specifies the WTR time for a PW APS instance.\nThe value is an integer ranging from 0 to 12, in minutes. The step length is 1 minute.\nThe WTR time equals interval multiplied by 1. Therefore, the minimum WTR time is 0 minutes, and the maximum WTR time is 12 minutes. By default, the WTR time for a PW APS instance is 5 minutes."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] pw-aps 1",
            "[*HUAWEI-pw-aps-1] wtr 10"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] pw-aps 1 frr",
            "[*HUAWEI-pw-aps-1] wtr 10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn a PW APS scenario, when the working path fails, traffic is switched to the protection path. After the working path recovers, traffic is switched back to the working path. If the working path frequently alternates between Up and Down, traffic will be interrupted. To prevent the preceding situation, run the\nwtr command to enable traffic to stay on the protection path for a specified period:\nTraffic travels along the protection path within the specified period, no matter whether the working path recovers.If the working path works properly after the specified period elapses, traffic is switched back to the working path.\n\nPrerequisites\nA PW APS instance has been created using the pw-aps command."
}