{
    "PageTitle": "remote-aps",
    "FuncDef": "The remote-aps command configures the remote number of a PW APS instance in an E-PW APS scenario.\nThe undo remote-aps command deletes the remote number of a PW APS instance in an E-PW APS scenario.\nBy default, the remote number of a PW APS instance is not configured.",
    "CLIs": [
        "remote-aps <remoteApsId>",
        "undo remote-aps"
    ],
    "ParentView": [
        "PW-APS view"
    ],
    "ParaDef": [
        {
            "Parameters": "remoteApsId",
            "Info": "Specifies the remote number of a PW APS instance.\nThe value is an integer ranging from 1 to 16384."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] pw-aps 1",
            "[*HUAWEI-pw-aps-1] role master",
            "[*HUAWEI-pw-aps-1] remote-aps 2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn E-PW APS networking, two PW APS instances with the master and slave roles respectively are configured on each PE to which a CE is dual-homed. The numbers of the two PW APS instances should be specified for each other as remote numbers to form E-PW APS.\nE-PW APS determines whether to implement protection switching based on the PW status of the master PW APS instance.\nPrerequisites\nPW APS instances have been configured, and their roles have been specified using the role command.\nConfiguration Impact\nIf the remote-aps command is run more than once, the latest configuration overrides the previous one. In E-PW APS networking, after the remote numbers of the master and slave PW APS instances are specified, the E-PW APS status is determined by the master PW APS instance.\nFollow-up Procedure\nConfigure the attributes of the master PW APS instance as needed, such as its description, operating mode, WTR time, manual operation, and switching delay time. Then, associate it with a PW protection group.For the slave PW APS instance, you only need to associate it with PW protection groups.\n\nPrecautions\nThe remote number of the master PW APS instance must be the number of the slave PW APS instance, and the remote number of the slave PW APS instance must be the number of the master PW APS instance. Otherwise, protection switching in PW protection groups cannot be performed."
}