{
    "PageTitle": "operation-type (PW-FPS view)",
    "FuncDef": "The operation-type command configures the switchback mode for a PW APS instance.\nThe undo operation-type command restores the default switchback mode for a PW APS instance.\nBy default, a PW APS instance is in revertive mode.",
    "CLIs": [
        "operation-type { non-revertive | revertive }",
        "undo operation-type"
    ],
    "ParentView": [
        "PW-APS view",
        "PW-FPS view"
    ],
    "ParaDef": [
        {
            "Parameters": "non-revertive",
            "Info": "Indicates that a PW APS instance is in non-revertive mode.\n-"
        },
        {
            "Parameters": "revertive",
            "Info": "Indicates that a PW APS instance is in revertive mode.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] pw-aps 1",
            "[*HUAWEI-pw-aps-1] operation-type non-revertive"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] pw-aps 1 frr",
            "[*HUAWEI-pw-aps-1] operation-type non-revertive"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, a PW APS instance is in revertive mode. When the fault on the working path is rectified, traffic is switched back to the working path. To maintain service topology stability by reducing the number of switching times, run the\noperation-type command to configure the switchback mode for a PW APS instance to non-revertive:\nIn non-revertive mode, if traffic travels along the protection path, traffic will not be switched to the working path even if the working path is normal and no switching command is run.In revertive mode, if traffic travels along the protection path, traffic will be switched back to the working path when the working path recovers (provided that no switching command is run).\n\nPrerequisites\nA PW APS instance has been created using the pw-aps command."
}