{
    "PageTitle": "peer-address (PW template view)",
    "FuncDef": "The peer-address command configures the peer address for a PW in the PW template.\nThe peer-address command deletes the peer address of a PW from the PW template.\nBy default, no peer address is configured for a PW.",
    "CLIs": [
        "peer-address <ip-address>",
        "undo peer-address"
    ],
    "ParentView": [
        "PW template view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address",
            "Info": "Specifies the IP address of the remote peer on a PW.\nThe value is usually the LSR ID of the remote peer."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] pw-template pwt",
            "[*HUAWEI-pw-template-pwt] peer-address 1.1.1.1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA PW template can simplify the configuration of PWs with similar attributes.\nThe peer attribute can be specified for a PW using the mpls l2vc or mpls static-l2vc command or a PW template. If it is specified using both a command and a PW template, the configuration made using the command prevails.\nPrerequisites\nMPLS L2VPN has been enabled.A PW template has been created.\n\nConfiguration Impact\nAfter the peer address is specified in a PW template, the restart of the PW template may affect system operation.\nFollow-up Procedure\nApply a configured PW template when creating an LDP or SVC VPWS connection on an interface.\nPrecautions\nThe peer address of a PW can be changed in real time. After the peer address in a PW template is changed, note the following:\nIf the PW template is not in use, it does not need to restart.If the PW template is in use, you must run the reset pw pw-template command for the new configuration to take effect. This, however, may disconnect and re-establish the PWs that apply the PW template. If multiple PWs use this template at the same time, the services take a long time to recover."
}