{
    "PageTitle": "control-word",
    "FuncDef": "The control-word command enables the control word function for a PW template.\nThe undo control-word command disables the control word function in a PW template.\nBy default, the control word function is not enabled for a PW template.",
    "CLIs": [
        "control-word",
        "undo control-word"
    ],
    "ParentView": [
        "PW template view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] pw-template pwt",
            "[*HUAWEI-pw-template-pwt] control-word"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn load balancing mode, packets received by a device may be out of order. Using the control word function, the device can reassemble the packets.\nIf PEs are connected over Ethernet links whereas PEs and CEs are connected over Point-to-Point Protocol (PPP) links, PPP negotiation fails when the size of a PPP control packet is smaller than the smallest MTU supported by the Ethernet. You can fill the PPP control packet with the control word to prevent such a problem.\nA PW template can simplify the configuration of PWs with similar attributes. control-word can be specified for a PW using the mpls l2vc command or a PW template. If it is specified using both the command and a PW template, the configuration made using the command prevails.\nPrerequisites\nMPLS L2VPN has been enabled.A PW template has been created.\n\nConfiguration Impact\nAfter the control word function is enabled for a PW template, the restart of the PW template may affect the system operation.\nFollow-up Procedure\nApply an existing PW template that has been configured when configuring an LDP VPWS connection on an interface.\nPrecautions\nAfter the status of the control word function in a PW template is changed, note the following:\nIf the PW template is not being applied, it does not need to restart.If the PW template is being applied, run the reset pw pw-template pw-template-name command for the new configuration to take effect. This, however, may disconnect and re-establish the PWs that apply the PW template. If multiple PWs use this template at the same time, the system operation is affected."
}