{
    "PageTitle": "idle-code",
    "FuncDef": "The idle-code command sets the idle code that is filled when the jitter buffer underflow occurs.\nThe undo idle-code command deletes the idle code that is filled when the jitter buffer underflow occurs.\nBy default, the system fills the idle code automatically.",
    "CLIs": [
        "idle-code <idleCodeValue>",
        "undo idle-code"
    ],
    "ParentView": [
        "PW template view"
    ],
    "ParaDef": [
        {
            "Parameters": "idleCodeValue",
            "Info": "Specifies the value of the idle code that is filled manually when the jitter buffer underflow occurs.\nThe value is a hexadecimal number that ranges from 00 to FF. The default value is FF."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] pw-template tdmpw",
            "[*HUAWEI-pw-template-tdmpw] idle-code ff"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThis command is used to set the value of the idle code that is filled when the jitter buffer underflow occurs. Underflow refers to the situation that the packets in the jitter buffer to be forwarded are insufficient. The idle code has no significance, and can be set to any value.\nPrerequisite\nA PW template has been created using the pw-template command and the PW template view is displayed.\nPrerequisites\nRun the pw-template command in the system view to create a PW template and enter the PW template view.\nFollow-up Procedure\nAfter running the idle-code command, run the reset pw command to apply the attributes in the PW template to the PW. To check whether the idle code configuration has taken effect on the PW, run the display mpls l2vc command to view the Idle-Code field.\nPrecautions\nThe mpls l2vc command can also be used to set the idle code if idle-code is specified in the command. If both the mpls l2vc command and idle-code command are used to configure the idle code, the mpls l2vc command takes precedence over the idle-code command."
}