{
    "PageTitle": "pw-template",
    "FuncDef": "The pw-template command creates a PW template and displays the PW template view. You can configure the attributes for PWs in the PW template. The attributes include the remote peer, control word, MTU, and tunnel policy.\nThe undo pw-template command deletes a PW template.\nBy default, no PW template is created.",
    "CLIs": [
        "pw-template <pwname>",
        "undo pw-template <pwname>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "pwname",
            "Info": "Specifies the name of a PW template.\nThe value is a string of 1 to 19 case-sensitive characters, spaces not supported.\nThe string can contain spaces if it is enclosed in double quotation marks (\")."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] pw-template pwt1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA PW template is a set of common attributes of PWs, which are shared by different PWs. A PW template can simplify the configuration of PWs with similar attributes. For example, if there are multiple VPWS connections between two devices and the VPWS connections share the same peer address and control word function, you can define those attributes in a PW template. Then, you can apply the PW template when setting up VPWS connections between interfaces.\nPrerequisites\nMPLS L2VPN has been enabled.\nFollow-up Procedure\nApply an existing PW template that has been configured when configuring an MPLS L2VPN connection on an interface.\nPrecautions\nWhen a pw is being configured on an interface by using a pw template, if the pw attributes specified on the interface are inconsistent with those specified in the pw template, the pw attributes specified on the interface prevail.After the configuration is modified, you need to run the reset pw pw-template pwname command for the new configuration to take effect. This, however, may disconnect and re-establish the PWs that apply the pw template. if multiple PWs use This template at the same time, the system operation is affected.the pw template being applied by a pw cannot be deleted."
}