{
    "PageTitle": "max-atm-cells",
    "FuncDef": "The max-atm-cells command configures the maximum number of ATM cells that can be transmitted in a PW template.\nThe undo mpls l2vc admin command restores the default maximum number of ATM cells that can be transmitted in a PW template.\nBy default, the maximum number of ATM cells that can be transmitted in a PW template is 28.",
    "CLIs": [
        "max-atm-cells <max-atm-cells-value>",
        "undo max-atm-cells"
    ],
    "ParentView": [
        "PW template view"
    ],
    "ParaDef": [
        {
            "Parameters": "max-atm-cells-value",
            "Info": "Specifies the maximum number of ATM cells that can be transmitted.\nThe value is an integer ranging from 1 to 28. The default value is 28."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[~HUAWEI-mpls] quit",
            "[~HUAWEI] mpls l2vpn",
            "[~HUAWEI-l2vpn] quit",
            "[~HUAWEI] pw-template pt",
            "[~HUAWEI-template-pt] max-atm-cells 20"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen VPWS PWs are used to carry ATM services and the network bandwidth is limited, to lessen the consumption of system resources, run the max-atm-cells command to configure the maximum number of ATM cells that can be transmitted. Then the local PE sends the configured max-atm-cells-value to a remote PE. Upon receipt, the remote PE compares its max-atm-cells-value with the received max-atm-cells-value and encapsulates ATM cells into packets based on the smaller one of the two values.\nPrerequisites\nA PW template has been created and the PW template view is displayed, or the PW template view is directly displayed using the pw-template pw-template-name command.\nConfiguration Impact\nAfter the max-atm-cells command is run, the local PE compares its max-atm-cells-value with max-atm-cells-value received from a remote PE and encapsulates ATM cells into packets for transmission based on the smaller one of the two values. If max-atm-cells-value is not configured, the default value 28 of max-atm-cells-value is used.\nFollow-up Procedure\nRun the reset pw command for the new PW template attributes to take effect. Run the display mpls l2vc command and check the max ATM cells field value to see if the maximum number of ATM cells that can be transmitted has been applied to PWs.\nPrecautions\nThe max-atm-cells command takes effect only on interfaces that carry ATM services.\nIf the mpls l2vc or mpls static-l2vc command with the max-atm-cells-value parameter has been run, and the max-atm-cells command has also been run in the PW template view to configure the maximum number of ATM cells to be transmitted, the mpls l2vc or mpls static-l2vc command configuration takes effect."
}