{
    "PageTitle": "cc seq-number",
    "FuncDef": "The cc seq-number command enables the sequence number function in a PW template.\nThe undo cc seq-number command disables the sequence number function in a PW template.\nBy default, the sequence number function is disabled.",
    "CLIs": [
        "cc seq-number",
        "undo cc seq-number"
    ],
    "ParentView": [
        "PW template view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] pw-template pt",
            "[*HUAWEI-template-pt] control-word",
            "[*HUAWEI-template-pt] cc seq-number"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn PW load balancing scenarios, PW packets may arrive at a device out of order. To prevent this problem, run the cc seq-number command to enable the sequence number function. After the sequence number function is enabled, the local PE sends PW packets carrying the Sequence Number field. Each time a PW packet is sent, the Sequence Number field value increases by 1 in sequence. After the remote PE receives PW packets, it checks the Sequence Number field in the packets. If the device receives a packet that has a smaller Sequence Number field value than that in the packet previously received, the device discards the packet with a smaller Sequence Number field value. In addition, the device calculates the number of packets discarded because they arrive out of order. If the number of packets discarded in a period of time exceeds the alarm threshold, the system generates an alarm so that the network administrator can take measures.\nPrerequisites\nThe control word function has been enabled using the control-word command.\nFollow-up Procedure\nRun the reset pw command for the new PW template attributes to take effect.\nPrecautions\nThe cc seq-number command takes effect only on interfaces that carry ATM services.If the mpls l2vc or mpls static-l2vc command with the cc seq-number parameter has been run, and the cc seq-number command has also been run in the PW template view to enable the sequence number function, the mpls l2vc or mpls static-l2vc command configuration takes effect."
}