{
    "PageTitle": "tdm-encapsulation-number",
    "FuncDef": "The tdm-encapsulation-number command configures the number of TDM frames that are encapsulated in a Circuit Emulation Service over Packet Switched Network (CESoPSN) or Structure-Agnostic Time Division Multiplexing over Packet (SAToP) packet in the TDMoPSN application.\nThe undo tdm-encapsulation-number command restores the default number of TDM frames in a CESoPSN or SAToP packet.\nBy default, the number of encapsulated TDM frames in a CESoPSN or SAToP packet is 8.",
    "CLIs": [
        "tdm-encapsulation-number <tdmEncapNumber>",
        "undo tdm-encapsulation-number"
    ],
    "ParentView": [
        "PW template view"
    ],
    "ParaDef": [
        {
            "Parameters": "tdmEncapNumber",
            "Info": "Specifies the number of TDM frames encapsulated in a CESoPSN or SAToP packet.\nThe value is an integer, which can be 8, 16, 24, 32, or 40. The default value is 32."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] pw-template tdmpw",
            "[*HUAWEI-pw-template-tdmpw] tdm-encapsulation-number 8"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen a dynamic PW is configured on a TDM interface, three parameters need to be negotiated between the two ends of the PW. They are the RTP header, time slot number, and time slot number x number of encapsulated frames.\nYou can configure the number of TDM frames encapsulated into each PW packet. The smaller the number of frames encapsulated into a packet, the shorter the transmission delay but the larger the encapsulation overhead. The larger the number of frames encapsulated into a packet, the higher the bandwidth utilization but the longer the encapsulation delay.\nPrerequisites\nA PW template has been created using the pw-template command and the PW template view is displayed.\nConfiguration Impact\nAfter the tdm-encapsulation-number command is run, the two ends of a PW will negotiate the number of frames encapsulated into each packet. If they cannot reach an agreement, the PW cannot go Up.\nFollow-up Procedure\nAfter running the tdm-encapsulation-number command, run the reset pw command to allow the attributes in the PW template to take effect on the PW. To check whether the configuration of the number of TDM frames encapsulated into each packet has taken effect on the PW, run the display mpls l2vc command to view the TDM Encapsulation Number field.\nPrecautions\nThe mpls l2vc command can also be used to configure the number of TDM frames encapsulated into each packet if tdm-encapsulation is specified in the command. If both the mpls l2vc command and tdm-encapsulation-number command are used to configure the number of TDM frames encapsulated into each packet, the mpls l2vc command takes precedence over the tdm-encapsulation-number command."
}