{
    "PageTitle": "atm-pack-overtime",
    "FuncDef": "The atm-pack-overtime command configures an ATM cell encapsulation period.\nThe undo atm-pack-overtime command restores the default ATM cell encapsulation period.\nBy default, the ATM cell encapsulation period is 1000 us.",
    "CLIs": [
        "atm-pack-overtime <atm-pack-overtime>",
        "undo atm-pack-overtime"
    ],
    "ParentView": [
        "PW template view"
    ],
    "ParaDef": [
        {
            "Parameters": "atm-pack-overtime",
            "Info": "Specifies an ATM cell encapsulation period.\nThe value is an integer ranging from 100 to 10000, in us. The value can only be multiples of 100 or 1000."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] pw-template pt",
            "[*HUAWEI-template-pt] atm-pack-overtime 2000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf VPWS PWs are used to carry ATM services, a PE encapsulates ATM cells into packets and sends the packets to the remote peer. By default, the ATM cell encapsulation period is 1000 us. To reduce system resource consumption when the system is busy or maximize system resource usage when the system is idle, run the atm-pack-overtime command to configure an ATM cell encapsulation period. After the ATM cell encapsulation period elapses, the device encapsulates ATM cells into packets and sends the packets.\nPrerequisites\nA PW template has been created, and the PW template view has been displayed using the pw-template command.\nPrecautions\nThe atm-pack-overtime command takes effect only on interfaces that carry ATM services.If the number of ATM cells is less than the configured maximum number allowed to be encapsulated into a packet, but the ATM cell encapsulation period elapses, the device encapsulates the existing ATM cells into a packet. This ensures real-time data transmission.If the mpls l2vc or mpls static-l2vc command with the parameter has been run, and the max-atm-cells command has also been run in the PW template view to configure an ATM cell encapsulation period, the mpls l2vc or mpls static-l2vc command configuration takes effect."
}