{
    "PageTitle": "transmit-atm-cells",
    "FuncDef": "The transmit-atm-cells command configures the maximum number of ATM cells to be encapsulated into a packet that can be sent by a device in a PW template.\nThe undo transmit-atm-cells command deletes the maximum number of ATM cells to be encapsulated into a packet that can be sent by a device in a PW template.\nBy default, the maximum number of ATM cells to be encapsulated into a packet that can be sent by a device is not configured.",
    "CLIs": [
        "transmit-atm-cells <transmit-atm-cells-value>",
        "undo transmit-atm-cells"
    ],
    "ParentView": [
        "PW template view"
    ],
    "ParaDef": [
        {
            "Parameters": "transmit-atm-cells-value",
            "Info": "Specifies the maximum number of ATM cells to be encapsulated into a packet that can be sent by a device.\nThe value is an integer ranging from 1 to 28. The default value is 0."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] pw-template pt",
            "[*HUAWEI-template-pt] transmit-atm-cells 20"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen VPWS PWs are used to carry ATM services, the maximum number of ATM cells to be encapsulated into a packet that can be sent by the local PE is limited by max-atm-cell-value in the max-atm-cells command used for PW negotiation on the remote PE. If max-atm-cell-value is beyond the processing capability of the local PE, run the transmit-atm-cells transmit-atm-cell-value command to configure the maximum number of ATM cells to be encapsulated into a packet that can be sent by a device. Then the local PE compares its transmit-atm-cell-value with max-atm-cell-value received from the remote PE and encapsulates ATM cells into a packet for transmission based on the smaller one of the two values. The transmit-atm-cell-value value range is limited by the processing capability of a device. You can set transmit-atm-cells-value of a Huawei device for this device to communicate with non-Huawei devices. By default, the maximum number of ATM cells to be sent is not configured, and the device encapsulates ATM cells based on max-atm-cell-value received from a peer device.\nPrerequisites\nA PW template has been created and the PW template view is displayed, or the PW template view is directly displayed using the pw-template command.\nConfiguration Impact\nAfter the transmit-atm-cells command is run, the local PE compares its with received from a remote PE and encapsulates ATM cells into packets for transmission based on the smaller one of the two values. If the transmit-atm-cells command is not run, the local PE encapsulates ATM cells into packets based on specified in the max-atm-cells command received from a remote PE.\nFollow-up Procedure\nRun the reset pw command for the new PW template attributes to take effect.\nPrecautions\nThe transmit-atm-cells command takes effect only on interfaces that carry ATM services.transmit-atm-cells-value specifies the maximum number of ATM cells to be encapsulated into a packet that can be sent by a device to the network side. This parameter is not used for PW parameter negotiation.If the mpls l2vc or mpls static-l2vc command with the transmit-atm-cells-value parameter has been run, and the transmit-atm-cells command has also been run in the PW template view to configure the maximum number of ATM cells to be encapsulated into a packet that can be sent by a device, the mpls l2vc or mpls static-l2vc command configuration takes effect."
}