{
    "PageTitle": "remote-ce ip",
    "FuncDef": "The remote-ce ip command specifies the IP address of the remote CE corresponding to an access interface or its sub-interface on a PE.\nThe undo remote-ce ip command deletes the configuration.\n\nBy default, the IP address of the remote CE corresponding to an access interface or its sub-interface on a PE is not specified.",
    "CLIs": [
        "remote-ce ip <ip-address>",
        "undo remote-ce ip"
    ],
    "ParentView": [
        "50GE Layer 2 sub-interface view",
        "40GE interface view",
        "Eth-Trunk Layer 2 sub-interface view",
        "GE Layer 2 sub-interface view",
        "GE electrical interface view",
        "XGE sub-interface view",
        "Eth-Trunk sub-interface view",
        "50|100GE interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "50|100GE sub-interface view",
        "GE sub-interface view",
        "Layer 2 sub-interface view",
        "VE sub-interface view",
        "GE interface view",
        "25GE sub-interface view",
        "100GE interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "XGE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "25GE interface view",
        "100ge sub-interface view",
        "Eth-Trunk interface view",
        "40GE sub-interface view",
        "10GE sub-interface view",
        "400GE Layer 2 sub-interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address",
            "Info": "Specifies the IP address of the remote CE corresponding to an access interface or its sub-interface on a PE.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0.1",
            "[*HUAWEI-GigabitEthernet1/0/0.1] remote-ce ip 10.1.1.1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\n\nIn a scenario in which VPWS is configured to support IP interworking, if sub-interfaces on a PE are used to establish multiple PWs, you need to run the remote-ce ip command on each sub-interface to specify the IP address of a remote CE corresponding to the sub-interface. In this manner, one CE can communicate with multiple CEs.\nBy default, the IP address of the remote CE corresponding to an access interface or its sub-interface on a PE is not specified. In this case, after receiving an ARP request from the local CE, each sub-interface on the PE replies with its MAC address and VLAN ID. The local CE, however, learns only the last ARP reply sent by a sub-interface on the PE. Therefore, whichever remote CE the local CE requests, the ARP entries of remote CEs learned by the local CE belong to the same VLAN. As a result, the local CE can communicate with only one remote CE. If the remote-ce ip command is run on each sub-interface of a PE, the PE will check whether the configured remote-ce ip on the sub-interface is the destination IP address in the ARP request sent by the local CE. If it is the one, the sub-interface on the PE will reply with its MAC address and VLAN ID. Otherwise, the sub-interface does not reply. In this manner, the ARP entry of each remote CE learned by the local CE belongs to respective VLANs, realizing communication between the local CE and multiple remote CEs.\n\nPrerequisites\n\n\nIP interworking has been configured for VPWS connections on the PE.\nThe AC interface on the PE is an Ethernet interface."
}