{
    "PageTitle": "reset pw",
    "FuncDef": "The reset pw command re-creates a PW or a PW template.",
    "CLIs": [
        "reset pw [ peer-address <peer-ip> ] <pwId> { ethernet | ppp | hdlc | vlan | ip-interworking | ip-layer2 | cesopsn-basic | satop-e1 | atm-1to1-vcc | atm-1to1-vpc | atm-nto1-vcc | atm-nto1-vpc | atm-trans-cell | cep }"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "peer-address peer-ip",
            "Info": "Specifies the IPv4 address of a peer PE.\nThe value is an IPv4 address in dotted decimal notation (X.X.X.X), for example, 10.1.1.1."
        },
        {
            "Parameters": "pwId",
            "Info": "Specifies a 32-bit VC ID. A VC ID and a VC type uniquely identify a VC.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "ethernet",
            "Info": "This encapsulation type is used when Ethernet packets do not carry VLAN information.\n-"
        },
        {
            "Parameters": "vlan",
            "Info": "This encapsulation type is used when Ethernet packets carry VLAN information.\n-"
        },
        {
            "Parameters": "ip-interworking",
            "Info": "Enables static PW interworking when devices in the interworking are all provided by Huawei.\n-"
        },
        {
            "Parameters": "ip-layer2",
            "Info": "Enables IP interworking for an LDP PW between a Huawei device and a non-Huawei device. ip-layer2 is required for IP interworking between a Huawei device and a non-Huawei device.\n-"
        },
        {
            "Parameters": "cesopsn-basic",
            "Info": "Specifies the PW encapsulation type as cesopsn-basic.\n-"
        },
        {
            "Parameters": "satop-e1",
            "Info": "SAToP is insensitive to the E1 frame structure and encapsulates a whole E1 frame into a PW packet.\n-"
        },
        {
            "Parameters": "ppp",
            "Info": "PPP is a link layer protocol that specifies how to encapsulate and transmit network layer packets over P2P links.\n-"
        },
        {
            "Parameters": "hdlc",
            "Info": "HDLC is a bit-oriented link layer protocol.\n-"
        },
        {
            "Parameters": "atm-1to1-vcc",
            "Info": "One PW carries the ATM cells of one PVC.\n-"
        },
        {
            "Parameters": "atm-1to1-vpc",
            "Info": "One PW carries the ATM cells of one PVP.\n-"
        },
        {
            "Parameters": "atm-nto1-vcc",
            "Info": "One PW carries the ATM cells of multiple PVCs.\n-"
        },
        {
            "Parameters": "atm-nto1-vpc",
            "Info": "One PW carries the ATM cells of multiple PVPs.\n-"
        },
        {
            "Parameters": "atm-trans-cell",
            "Info": "ATM cells are transmitted over PWE3 VCs.\n-"
        },
        {
            "Parameters": "cep",
            "Info": "This encapsulation type is used for CEP services.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset pw 100 vlan"
        ],
        [
            "<HUAWEI> reset pw pw-template pwt1"
        ],
        [
            "<HUAWEI> reset pw peer-address 10.1.1.1 100 vlan"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen modifying the attributes for a PW template, you need to run the reset pw command to commit the new configuration, so that the new configuration takes effect on all PWs applying the PW template. PW attributes can be configured by using a PW template or commands. The attributes configured using commands take precedence over those configured using the PW template. If you configure PW attributes using commands, the attributes in the PW template do not take effect. If you run the reset pw command in this situation, the PW attributes remain unchanged. You can configure the PW attributes to be modified in the PW template rather than configure the attributes using commands.\nPrerequisites\nA PW or PW template has been created.\nConfiguration Impact\nRunning the reset pw command to re-create a PW or a PW template may interrupt services on the PW or PWs applying the PW template.\nPrecautions\nIf you create a PW template with the same name as an existing one, the PWs applying the existing PW template are re-created. If a PW applies a PW template, the attributes of the PW change along with the attributes of the PW template."
}