{
    "PageTitle": "mtu (VSI-BD view)",
    "FuncDef": "The mtu command sets the MTU of a VSI.\nThe undo mtu command restores the default configuration.\nBy default, the MTU of a VSI is 1500 bytes.",
    "CLIs": [
        "mtu <mtu>",
        "undo mtu"
    ],
    "ParentView": [
        "VSI-AUTO view",
        "VSI-BD view",
        "VSI-BVSI view",
        "VSI-DEFAULT view",
        "VSI-IVSI-BEVPNINTERWORK view",
        "VSI-IVSI-P2P view",
        "VSI-STATIC view"
    ],
    "ParaDef": [
        {
            "Parameters": "mtu",
            "Info": "Specifies the MTU of a VSI.\nThe value is an integer ranging from 328 to 65535, in bytes. The default MTU (1500 bytes) is recommended in most cases."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] vsi company1",
            "[*HUAWEI-vsi-company1] mtu 1600"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe MTU set in the VSI view is just used for the negotiation between the two ends of a PW. You only need to ensure that the MTUs of the VSIs in the same VPLS are consistent. The MTU of a VSI is irrespective of the MTU of the outbound interface.\nIf the MTU of the VSI on the local end is different from that of the same VSI on the remote end, you must change them to be consistent.\nDuring network expansion, if a PE is added to the current network and the MTU of the VSI on the PE is different from that of the VSI on the remote end, the PW cannot be set up between the two ends. Then, you must change them to be consistent. In this situation, you are advised to modify the MTU of the newly added PE.\nConfiguration Impact\nhe MTU set in the VSI view is just used for the negotiation between the two ends of a PW and does not affect the size of packets.\nFor the PW that has been set up after successful negotiation, if you modify the MTU of the VSI on either PW end, a PW negotiation is triggered. Exercise caution when modifying the MTU.\nPrecautions\nIf the MTUs of the same VSI on two PEs are different, the two PEs cannot establish a connection.\nDifferent from the MTU set in the interface view, the MTU set in the VSI view takes effect immediately and you do not need to run the reset command."
}