{
    "PageTitle": "vrrp6 vrid initialize state-hold-time",
    "FuncDef": "The vrrp6 vrid initialize state-hold-time command configures an Initialize state hold time for a management VRRP6 (mVRRP6) backup group.\nThe undo vrrp6 vrid initialize state-hold-time command deletes the Initialize state hold time configured for an mVRRP6 backup group.\n\nBy default, no Initialize state hold time is configured for an mVRRP6 backup group.",
    "CLIs": [
        "vrrp6 vrid <virtual-router-id> initialize state-hold-time <timer-value>",
        "undo vrrp6 vrid <virtual-router-id> initialize state-hold-time [ <timer-value> ]"
    ],
    "ParentView": [
        "PW-VE sub-interface view",
        "40GE interface view",
        "Port extension interface view",
        "GE electrical interface view",
        "Eth-Trunk sub-interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "GE sub-interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "GE interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "100ge sub-interface view",
        "25GE interface view",
        "40GE sub-interface view",
        "Eth-Trunk interface view",
        "10GE sub-interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "virtual-router-id",
            "Info": "Specifies the ID of an mVRRP6 backup group.\nThe value is an integer ranging from 1 to 255."
        },
        {
            "Parameters": "timer-value",
            "Info": "Specifies an Initialize state hold time.\nThe value is an integer ranging from 0 to 3600, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/1.1",
            "[*HUAWEI-GigabitEthernet1/0/1.1] ipv6 enable",
            "[*HUAWEI-GigabitEthernet1/0/1.1] ipv6 address 100::1/64",
            "[*HUAWEI-GigabitEthernet1/0/1.1] admin-vrrp6 vrid 1 ignore-if-down",
            "[*HUAWEI-GigabitEthernet1/0/1.1] vrrp6 vrid 1 initialize state-hold-time 20"
        ]
    ],
    "ExtraInfo": "Usage Scenario\n\nWhen an mVRRP6 backup group is configured to ignore an interface Down event, the mVRRP6 backup group directly enters the Backup state. After the device restarts, the device switches to the Master state because it does not receive VRRP6 Advertisement packets before the interface goes Up. In this case, the delayed switchback function becomes invalid, and related service entries fail to be backed up. As a result, services are interrupted. For the preceding scenario, the mVRRP6 backup group remains the Initialize state before the interface goes Up for the first time by default.\nIf the interface always remains Down, the mVRRP6 backup group remains the Initialize state all the time. You can run the vrrp6 vrid initialize state-hold-time command to configure an Initialize state hold time for the mVRRP6 backup group. After the Initialize state hold time expires, the mVRRP6 backup group enters the Backup state.\n\nPrerequisites\n\nAn mVRRP6 backup group has been configured to ignore an interface Down event using the admin-vrrp6 vrid ignore-if-down command."
}