{
    "PageTitle": "vrrp6 vrid timer advertise",
    "FuncDef": "The vrrp6 vrid timer advertise command configures an interval at which the master router in a Virtual Router Redundancy Protocol for IPv6 (VRRP6) backup group sends VRRP6 Advertisement packets.\nThe undo vrrp6 vrid timer advertise command restores the default interval.\n\nBy default, the master router in a VRRP6 backup group sends a VRRP6 Advertisement packet every 1 second.",
    "CLIs": [
        "vrrp6 vrid <virtual-router-id> timer advertise <advertise-interval>",
        "undo vrrp6 vrid <virtual-router-id> timer advertise"
    ],
    "ParentView": [
        "PW-VE sub-interface view",
        "40GE interface view",
        "GE electrical interface view",
        "Port extension interface view",
        "Eth-Trunk sub-interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "GE sub-interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "GE interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "100ge sub-interface view",
        "25GE interface view",
        "40GE sub-interface view",
        "Eth-Trunk interface view",
        "10GE sub-interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "virtual-router-id",
            "Info": "Specifies the ID of a VRRP6 backup group.\nThe value is an integer ranging from 1 to 255."
        },
        {
            "Parameters": "advertise-interval",
            "Info": "Specifies an interval at which the master router in a VRRP6 backup group sends VRRP6 Advertisement packets.\nThe value is an integer ranging from 100 to 4095, in centiseconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] ipv6 enable",
            "[*HUAWEI-GigabitEthernet1/0/1] ipv6 address 2001:db8::1 64",
            "[*HUAWEI-GigabitEthernet1/0/1] vrrp6 vrid 1 virtual-ip FE80::7 link-local",
            "[*HUAWEI-GigabitEthernet1/0/1] vrrp6 vrid 1 timer advertise 500"
        ]
    ],
    "ExtraInfo": "Usage Scenario\n\nThe master router in a VRRP6 backup group periodically sends VRRP6 Advertisement packets to the backup routers in the group to notify them of its status. If the backup routers do not receive VRRP6 Advertisement packets from the master router after a period three times (As defined in relevant standards protocols: Interval specified by master-down-interval= (256 - priority)/256 + 3 x timer. According to the formula, the default interval specified by master-down-interval is about three times the interval specified by advertise-interval.) if the interval at which VRRP6 Advertisement packets are sent, the master router is considered Down and the backup router with the highest priority becomes the master router. If a backup router does not receive a VRRP6 Advertisement packet within a specified timeout period due to heavy network traffic or timer differences, a master/backup VRRP6 switchover is performed.\nTo prevent this situation, configure a large interval at which the master router sends VRRP6 Advertisement packets. To configure an interval at which the master router in a VRRP6 backup group sends VRRP6 Advertisement packets, run the vrrp6 vrid timer advertise command.\n\nPrerequisites\n\nA VRRP6 backup group has been created using the vrrp6 vrid command."
}