{
    "PageTitle": "ptp performance-monitor",
    "FuncDef": "The ptp performance-monitor timeoffset-cycle command configures the period of time offset monitoring.\nThe undo ptp performance-monitor timeoffset-cycle command restores the default configuration.\nThe ptp performance-monitor timestamp-cycle command configures the period of timestamp delay monitoring.\nThe undo ptp performance-monitor timestamp-cycle command restores the default configuration.\n\nBy default, the period of time offset monitoring is 15 minutes.\n\nBy default, the period of timestamp delay monitoring is 15 minutes.",
    "CLIs": [
        "ptp performance-monitor timeoffset-cycle <timeoffset-cycle>",
        "ptp performance-monitor timestamp-cycle <timestamp-cycle>",
        "undo ptp performance-monitor timeoffset-cycle [ timeoffset-cycle ]",
        "undo ptp performance-monitor timestamp-cycle [ timestamp-cycle ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "timeoffset-cycle timeoffset-cycle",
            "Info": "Period of time offset monitoring.\nThe value can be 1, 5, or 15, in minutes."
        },
        {
            "Parameters": "timestamp-cycle timestamp-cycle",
            "Info": "Period of timestamp delay monitoring.\nThe value can be 1, 5, or 15, in minutes."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ptp performance-monitor timeoffset-cycle 5"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ptp performance-monitor timestamp-cycle 5"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe BC, T-BC, or OC supports real-time monitoring of the deduction of T2 timestamp from T1 timestamp and the deduction of T4 timestamp from T3 timestamp as the unidirectional delay information. The ptp performance-monitor timestamp-cycle command can be run to set the period of delay monitoring. If the NMS wants to get aware of the PTP performance status more quickly, set the monitoring period to a smaller value.\nThe BC, T-BC, or OC supports real-time monitoring of the PTP time offset, which is calculated based on the following formula: [(t2-t1)+(t4-t3)]/2. The ptp performance-monitor timeoffset-cycle command can be run to set the period of time offset monitoring. If the NMS wants to get aware of the PTP performance status more quickly, set the monitoring period to a smaller value."
}