{
    "PageTitle": "ptp passive-measure alarm-threshold",
    "FuncDef": "The ptp passive-measure alarm-threshold command sets an offset alarm threshold on a passive interface.\nThe undo ptp passive-measure alarm-threshold command restores the default alarm threshold.\nThe default offset alarm threshold is 200 ns.\nBy default, the offset alarm threshold is 200 ns.",
    "CLIs": [
        "ptp passive-measure alarm-threshold <alarm-threshold-value>",
        "undo ptp passive-measure alarm-threshold"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "alarm-threshold-value",
            "Info": "Sets an offset alarm threshold.\nThe value is an integer ranging from 55 to 10000, in ns. The default value is 200."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ptp enable",
            "[*HUAWEI] ptp passive-measure alarm-threshold 100"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA passive interface does not trace or advertise time information. If a device has multiple master PTP interfaces in the same clock domain, the device selects the interface with the highest priority as the master clock. The interface connected to the master clock is the slave clock. The unselected master interfaces enter the Passive state and function as backups for the slave clock. Passive interfaces can send Delay_Req, Pdelay_Resp, Delay_Resp_Follow_Up, signaling, and management response messages.\nA passive interface can be selected as a slave clock or a master clock to participate in time synchronization after a clock source changes. Monitoring the passive interface before a clock source changes helps keep stable time signals on a synchronous PTP network.\nAfter the Router stably synchronizes time signals with a clock source, the Router can monitor the performance of its passive interface. The Router checks the offset between the master and slave clocks on the passive interface every 1000s. If the offset is greater than a configured alarm threshold, the Router sends an alarm named hwPtpPassiveFiberLengthChange to a network management system (NMS). To set the alarm threshold, run the ptp passive-measure alarm-threshold command.\nPrerequisites\nThe ptp passive-measure enable command has been run to monitor a passive interface.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}