{
    "PageTitle": "ptp delayreq send disable",
    "FuncDef": "The ptp delayreq send disable command disables an interface from sending Delay_Req packets.\nThe undo ptp delayreq send disable command enables an interface to send Delay_Req packets.\nBy default, an interface is enabled to send Delay_Req packets.",
    "CLIs": [
        "ptp delayreq send disable",
        "undo ptp delayreq send disable"
    ],
    "ParentView": [
        "100GE interface view",
        "10G LAN interface view",
        "25GE interface view",
        "400GE interface view",
        "40GE interface view",
        "50GE interface view",
        "50|100GE interface view",
        "GE optical interface view",
        "GE electrical interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] ptp delayreq send disable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTwo devices exchange Announce packets to determine the master/slave relationship. The master device sends Sync packets to notify the slave device of time signal parameters and uses a delay measurement mechanism to achieve time signals accuracy.\nDifferent delays on links deteriorate the accuracy of PTP time synchronization. PTP uses the delay measurement mechanism to correct time signals. A delay measurement process is implemented by sending delay measurement request packets and delay response packets. Either of the following parameters can be configured in the\nptp delay-mechanism command to enable a specific delay measurement mechanism:\ndelay: enables the delay request-response mechanism, in which information about the clock and time is calculated based on the delay of an entire link between the master and slave clocks. Only the slave clock sends Delay_Req packets to the master clock, and the master clock replies with Delay_Resp packets. Upon receipt, the slave clock uses information carried in Delay_Resp packets to correct time signals.pdelay: enables the peer delay mechanism, in which information about the clock and time is calculated based on the delay time of each link along the path between the master and slave clocks. In this mode, the master and slave clocks can send Pdelay_Rep packets to each other and then correct time signals based on the Pdelay_Resp packets. Upon receipt of the responses, the slave or master clock uses information carried in Delay_Resp packets to correct time signals.\nIn normal cases, if an interface in the slave state receive Sync packets, the interface sends Delay_Req packets to the master device. When static 1588 ACR is enabled on the slave device, Sync packets can be used to restore frequency and there is no need to send Delay_Req packets to the master device. Especially in multicast scenarios, sending Delay_Req packets to the master device causes other slave devices to receive useless Delay_Req packets.\nTo disable an interface from sending Delay_Req packets, run the ptp delayreq send disable command.\n\nConfiguration Impact\nAfter this command is run, the time may fail to be locked in the PTP scenario.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}