{
    "PageTitle": "ptp domain",
    "FuncDef": "The ptp domain command specifies the domain in which a device resides.\nThe undo ptp domain command restores the default domain.\nBy default, a 1588v2 device resides in domain 0.",
    "CLIs": [
        "ptp domain <domain-value>",
        "undo ptp domain"
    ],
    "ParentView": [
        "100GE interface view",
        "10G LAN interface view",
        "25GE interface view",
        "400GE interface view",
        "40GE interface view",
        "50GE interface view",
        "50|100GE interface view",
        "GE optical interface view",
        "GE electrical interface view",
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "domain-value",
            "Info": "Specifies the clock domain value.\nIn 1588v2 mode, The value is an integer ranging from 0 to 255. The default value is 0.In G.8275.1 mode, the value ranges from 24 to 43, and the default value is 24.In CU-106 mode, the value ranges from 24 to 43, and the default value is 24.In SMPTE-2059-2 mode, the value ranges from 0 to 127, and the default value is 127."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ptp domain 4"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ptp device-type tcandbc",
            "[*HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] ptp port-type tc",
            "[*HUAWEI-GigabitEthernet1/0/0] ptp domain 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA PTP network is large scale and allows multiple carriers to lease the PTP network as a bearer network. To transparently transmit PTP packets for specific carriers, the PTP network can be logically divided into clock domains. Each clock domain has a single clock source, and all devices in the domain synchronize clock signals with the clock source.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nThe differences between the configurations of domains for devices of different clock types are as follows:\nConfigure a domain only in the system view on an OC, a BC, a TC, a T-BC, or a TCOC.Configure a domain in the system view and configure another domain in the TC interface view on a TCandBC.\nThis command cannot be run on an OTN subcard."
}