{
    "PageTitle": "ptp sync-interval",
    "FuncDef": "The ptp sync-interval command sets the interval at which a PTP interface sends Sync packets.\nThe undo ptp sync-interval command restores the default interval at which a PTP interface sends Sync packets.\nFor details about the default values, see Parameter Description.",
    "CLIs": [
        "ptp sync-interval <sync-interval>",
        "undo ptp sync-interval"
    ],
    "ParentView": [
        "100GE interface view",
        "10G LAN interface view",
        "25GE interface view",
        "400GE interface view",
        "40GE interface view",
        "50GE interface view",
        "50|100GE interface view",
        "GE optical interface view",
        "GE electrical interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "sync-interval",
            "Info": "Sets the interval at which a PTP interface sends Sync packets.\nThe value of ethernet card is an integer ranging from 0 to 20.\nIn 1588v2 mode, the default value is 3, which means 8/1024s.In G.8275.1 mode, the default value is 6.In CU-106 mode, the default value is 6.\nThe mapping between sync-interval values and actual intervals is as follows:\n0 1/1024s1 2/1024s2 4/1024s3 8/1024s4 16/1024s5 32/1024s6 64/1024s7 128/1024s8 256/1024s9 512/1024s10 1s11 2s12 4s13 8s14 16s15 32s16 64s17 128s18 256s19 512s20 1024s"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] ptp sync-interval 7"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTwo devices exchange Announce packets to determine the master/slave relationship. The master device sends Sync packets to notify the slave device of time signal parameters and uses a delay measurement mechanism to achieve time signals accuracy.\nThe master interface periodically sends multicast Sync packets. If devices exchange Sync packets frequently and consume a lot of bandwidth resources, increase the sync-interval value. If time synchronization accuracy is low, reduce the sync-interval value.\nPrerequisites\nPTP has been enabled on an interface using the ptp enable command.\nPrecautions\nThe time when the Sync packets can be stamped into the Sync packets if the one-step timestamping mode is used or into Follow_Up packets if the two-step timestamping mode is used. To specify a timestamping mode, run the ptp clock-step { one-step | two-step } command."
}