{
    "PageTitle": "ptp standard-time-port",
    "FuncDef": "The ptp standard-time-port command configures an external BITS clock source as the absolute time reference interface.\nThe undo ptp standard-time-port command deletes the configured absolute time reference interface.\nBy default, a device is not configured with an absolute time reference interface.",
    "CLIs": [
        "ptp standard-time-port { bits0 | bits1 | bits2 }",
        "ptp standard-time-port bits1 slot <slotid>",
        "ptp standard-time-port { <interface-name> | <interface-type> <interface-number> }",
        "undo ptp standard-time-port [ bits1 slot <slotid> ]",
        "undo ptp standard-time-port [ bits0 | bits1 | bits2 ]",
        "undo ptp standard-time-port { <interface-name> | <interface-type> <interface-number> }"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "bits0",
            "Info": "Indicates that the external BITS clock source BITS0 serves as the absolute time reference interface.\n-"
        },
        {
            "Parameters": "bits1",
            "Info": "Indicates that the external BITS clock source BITS1 serves as the absolute time reference interface.\n-"
        },
        {
            "Parameters": "bits2",
            "Info": "Indicates that the external BITS clock source BITS2 serves as the absolute time reference interface.\n-"
        },
        {
            "Parameters": "slot slotid",
            "Info": "Specifies the slot ID of the main control board that functions as the clock board.\nThe value is a string of 1 to 16 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "interface-name",
            "Info": "Interface name.\n-"
        },
        {
            "Parameters": "interface-type",
            "Info": "Interface type.\n-"
        },
        {
            "Parameters": "interface-number",
            "Info": "Interface number.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] clock bits-type bits1 1pps input",
            "[~HUAWEI] ptp standard-time-port bits1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a device can obtain the absolute time reference source through an external BITS clock source, the device can compare the external reference time and PTP time and reports the time difference. If the time difference exceeds a specified threshold, an alarm will be reported. To configure an external BITS clock source as the absolute time reference interface, run the ptp standard-time-port command. After this configuration, the comparison function and alarm function are automatically enabled.\nPrecautions\nThe absolute time reference interfaces can be configured only when the BITS0 interface of the external BITS clock source is off and the signal type is 1PPS input, DCLS, or DCLS input.\nWhen the port is configured as absolute time reference interfaces, it cannot participate in source selection, cannot generate passive event, and cannot report passive replacement."
}