{
    "PageTitle": "ptp set-port-state",
    "FuncDef": "The ptp set-port-state enable command statically specifies the status of a 1588v2 interface.\nThe undo ptp set-port-state enable command statically deletes the configured status of a 1588v2 interface.\nBy default, statically specifying the status of PTP interfaces is disabled.",
    "CLIs": [
        "ptp set-port-state enable",
        "undo ptp set-port-state enable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ptp set-port-state enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nNodes on a clock synchronous 1588v2 network establish the master/slave relationship with one another. The master clock sends time information, and the slave clock receives the time information to synchronize the time with the master clock. The best master clock (BMC) algorithm automatically calculates master/slave relationships on a dynamic 1588v2 network. Before planning the master/slave relationships, configure the 1588v2 network to work in static mode and run the ptp set-port-state enable command to statically specify the status of each 1588v2 interface.\nThis command applies only to 1588v2 and SMPTE-2059-2.\nPrerequisites\nTasks of Enabling 1588v2 Globally and Enabling 1588v2 on a Specific Interface on a static 1588v2 network have been completed.\nConfiguration Impact\nAfter the ptp set-port-state enable command is run in the system view on a device, all 1588v2 interfaces on the device work in the Initializing state by default.\nFollow-up Procedure\nRun the ptp port-state command to specify the clock status of all interfaces, except TC interfaces.\nPrecautions\nThe ptp set-port-state enable command applies only to static 1588v2 scenarios. The ptp slaveonly command that is run on an OC in dynamic 1588v2 scenarios is mutually exclusive with the ptp set-port-state enable command. The device does not support statically specifying the status of each 1588v2 interface under G.8275.1 and CU-106."
}