{
    "PageTitle": "ptp local-priority",
    "FuncDef": "The ptp local-priority command configures the local priority of a PTP interface.\nThe undo ptp local-priority command restores the default configuration.\nThe default local priority of a PTP interface is 128.\nThe default local priority of a PTP interface is 128.",
    "CLIs": [
        "ptp local-priority <local-priority-value>",
        "undo ptp local-priority [ <local-priority-value> ]"
    ],
    "ParentView": [
        "25GE interface view",
        "400GE interface view",
        "50GE interface view",
        "50|100GE interface view",
        "GE optical interface view",
        "GE electrical interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "local-priority-value",
            "Info": "Displays the local priority of a PTP interface.\nThe value is an integer ranging from 1 to 255. A smaller value indicates a higher priority."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ptp profile g-8275-1 enable",
            "[~HUAWEI] interface GigabitEthernet 1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] ptp local-priority 10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nITUT G.8275.1 defines the local priority of an interface. To configure the local priority, run the ptp local-priority command. In the BMC algorithm of G.8275.1, when all the priority attributes are the same except for the local priority, the local priority is used for data set comparison algorithm.\nThis command applies only to G.8275.1 and CU-106.\nPrerequisites\nThe ptp profile g-8275-1 enable command has been run.\nPrecautions\nThis command is supported only on the admin VS.\nIf all the priority attributes of two line clock sources are the same other than the local priority, the clock source with the smaller local priority is preferred.\nIf the local clock source (or external BITS clock reference source) has the same priority attributes with another line clock source other than the local priority, the clock source with the smaller priority is preferred."
}