{
    "PageTitle": "ptp port-type",
    "FuncDef": "The ptp port-type command sets a clock mode for a TCandBC device.\nThe undo ptp port-type command deletes the configured 1588v2 clock mode for a TCandBC device.\nNo 1588v2 clock mode is set by default.",
    "CLIs": [
        "ptp port-type { tc | bc }",
        "undo ptp port-type"
    ],
    "ParentView": [
        "100GE interface view",
        "10G LAN interface view",
        "25GE interface view",
        "400GE interface view",
        "40GE interface view",
        "50GE interface view",
        "50|100GE interface view",
        "GE optical interface view",
        "GE electrical interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "tc",
            "Info": "Configures a TCandBC interface to work as a TC.\n-"
        },
        {
            "Parameters": "bc",
            "Info": "Configures a TCandBC interface to work as a BC.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ptp enable",
            "[~HUAWEI] ptp device-type tcandbc",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] ptp port-type bc"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA TCandBC device combines the advantages of both a TC and a BC. The TCandBC device uses TC interfaces and BC interfaces to communicate with other 1588v2 devices. A TCandBC independently transmits 1588v2 packets between 1588v2 domains.\nThe undo ptp port-type command must be run to specify TC and BC interfaces on the device that is configured as a TCandBC before the interfaces support 1588v2 functions.\nBC interface: sends and receives PTP messages to determine the synchronization hierarchy. Specifically, a BC interface can function as a master clock to distribute clock synchronization information to downstream devices and at the same time can function as a slave clock to receive clock synchronization information from upstream devices.TC interface: forwards PTP packets and corrects time in PTP event messages. TC interfaces do not participate in BMC source selection, and therefore do not determine the master/slave hierarchy.\nThis command applies only to 1588v2 and SMPTE-2059-2.\n\nPrerequisites\nThe device has been configured as a TCandBC using the ptp device-type tcandbc command.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}