{
    "PageTitle": "ptp profile enable",
    "FuncDef": "The ptp profile enable command enables the PTP function (except for 1588V2) on a device.\nThe undo ptp profile enable command restores the 1588v2 time synchronization mode.\nBy default, the time synchronization mode is 1588v2.",
    "CLIs": [
        "ptp profile { g-8275-1 | cu-106 } enable",
        "ptp profile smpte-2059-2 enable",
        "undo ptp profile { g-8275-1 | cu-106 } enable",
        "undo ptp profile smpte-2059-2 enable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "g-8275-1",
            "Info": "ITUT G.8275.1 mode.\n-"
        },
        {
            "Parameters": "cu-106",
            "Info": "CU-106 mode.\n-"
        },
        {
            "Parameters": "smpte-2059-2",
            "Info": "SMPTE-2095-2 mode.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ptp profile g-8275-1 enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe command is used to change the PTP time synchronization mode.\nConfiguration Impact\nAfter the command is run to switch the protocol, the default values and value range of time synchronization parameters are changed accordingly.\nPrecautions\nAfter the ptp profile g-8275-1 enable command is run, the ptp slaveonly, ptp set-port-state enable and ptp acr enable commands are not supported anymore.\nAfter the ptp profile cu-106 enable command is run, the time synchronization standard is changed to CU-106, the ptp slaveonly, ptp set-port-state enable, ptp acr enable and ptp udp-egress source-ip commands are not supported anymore.\nAfter the ptp profile smpte-2059-2 enable command is run, the default values and value ranges of time synchronization parameters are also changed. Exercise caution when configuring the ptp profile smpte-2059-2 enable command.When the SMPTE-2059-2 function is enabled on a device, the ptp slaveonly, ptp set-port-state enable, and ptp acr enable commands are not supported."
}