{
    "PageTitle": "ptp asymmetry-measure enable",
    "FuncDef": "The ptp asymmetry-measure enable command enables automatic asymmetry measurement on the device over a PTP ring network.\nThe undo ptp asymmetry-measure enable command disables automatic asymmetry measurement on the device over a PTP ring network.\nBy default, automatic asymmetry measurement is disabled on the device.",
    "CLIs": [
        "ptp asymmetry-measure enable",
        "undo ptp asymmetry-measure enable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ptp asymmetry-measure enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe NodeB can synchronize clock signals with the global positioning system (GPS) on the ring network shown in a ring network consisting of BC1-BC2-BC3-BC6-BC5-BC4 only if fibers working in opposite directions on each network segment have the same length. Each node can synchronize clock signals with the GPS, irrespective of changes in clock sources that slave clocks trace. If a fiber between BC5 and BC6 is disconnected, BC6 traces clock signals of BC3. As a compensation value has calculated, BC6 uses the compensation value to successfully synchronize clock signals with the GPS.\nAfter the faulty fiber between BC5 and BC6 is repaired, the difference between the lengths of the fibers that transmit traffic in opposite directions changes, and BC6 traces clock signals of BC5, not BC3. BC6 uses the previous compensation value but fails to synchronize clock signals with the GPS. To address this problem, run the ptp asymmetry-measure enable command to enable automatic asymmetry measurement. Automatic asymmetry measurement allows a device to calculate an offset and sends an alarm about the offset. The device uses the offset to synchronize clock signals with the GPS.\nThe prerequisite for automatic fiber compensation on a ring network is that each segment of fiber requires manual measurement on compensation. The asymmetry correction function can be manually enabled when such need exists.The asymmetry correction function applies only to scenarios where fibers are broken and then repaired on a ring network but the repaired fibers are asymmetric. This solution is not applicable to other scenarios such as adding nodes to a ring or removing nodes from a ring.The asymmetry correction function applies to ring networks where all devices are of the BC or TCANDBC type.The asymmetry correction function applies to scenarios where the clock is stably clocked for the NEs where ring network auto-measurement is performed as well as upstream NEs. If any operation that may lead to clock source switching, time out-of-lock, and device resetting is performed during ring network auto-measurement or before the fiber length change alarm is cleared, ring network auto-measurement may fail, and the port status fails to be properly restored.The asymmetry correction function applies to scenarios where the clock class of the clock source traced by NEs with ring network auto-measurement enabled is less than 187.Do not configure the asymmetry correction function if G.8275.1 or C37.238 is configured. If G.8275.1 and the asymmetry correction function are configured and a device tracks two grandmasters, the asymmetry correction function fails. If C37.238 and the asymmetry correction function are configured, the asymmetry correction function may also fail due to the flow rate at which packets are sent.\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}