{
    "PageTitle": "access user-ip-address trust dhcp-server user-type ppp",
    "FuncDef": "The access user-ip-address trust dhcp-server user-type ppp command enables a device to perform loose check on IP addresses assigned by a server when a remote address pool is used to assign IP addresses to PPP and L2TP users.\nThe undo access user-ip-address trust dhcp-server user-type ppp command disables a device from performing loose check on IP addresses assigned by a server when a remote address pool is used to assign IP addresses to PPP and L2TP users.\nBy default, a device is disabled from performing loose check on IP addresses assigned by a server when a remote address pool is used to assign IP addresses to PPP and L2TP users.",
    "CLIs": [
        "access user-ip-address trust dhcp-server user-type ppp",
        "undo access user-ip-address trust dhcp-server user-type ppp"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] access user-ip-address trust dhcp-server user-type ppp"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen a remote address pool is used to assign IP addresses to PPP and L2TP users and packets pass through a BRAS, the BRAS selects a remote address pool for the users. The BRAS uses the address pool's gateway as the users' gateway to apply to a remote DHCP server for IP addresses on the network segment of the gateway. By default, IP addresses assigned by the DHCP server are on the same network segment as the gateway. In this case, the BRAS performs strict check. That is, if IP addresses assigned by the DHCP server are not on the network segment of the gateway, the BRAS discards the packets. To enable the users to go online in the preceding scenario, run the access user-ip-address trust dhcp-server user-type ppp command in the system view to enable the BRAS to perform loose check on IP addresses assigned by the DHCP server. After the command is run, the BRAS reselects a remote address pool that is on the same network segment as the IP addresses assigned by the DHCP server in the user access domain.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nIf all address pools in a domain from which a user attempts to go online do not match an IP address assigned by the DHCP server, the user cannot go online."
}