{
    "PageTitle": "access wait-request-time",
    "FuncDef": "The access wait-request-time dhcpv4 command sets the timeout period for a router to wait for a Request message from a client in response to an Offer message sent to the client.\nThe undo access wait-request-time dhcpv4 command cancels the setting.\nThe access wait-request-time dhcpv6 command sets the timeout period for a router to wait for a Request message from a client in response to an Advertise message sent to the client.\nThe undo access wait-request-time dhcpv6 command cancels the setting.\nThe default value of the timeout period for a router to wait for a Request message from a client in response to an Offer message sent to the client is 25s, and the default value of the timeout period for a router to wait for a Request message from a client in response to an Advertise message sent to the client is 55s.",
    "CLIs": [
        "access wait-request-time { dhcpv4 | dhcpv6 } <time-value>",
        "undo access wait-request-time { dhcpv4 | dhcpv6 } [ <time-value> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "dhcpv4",
            "Info": "Sets the timeout period for a router to wait for a Request message from a client in response to an Offer message sent to the client.\n-"
        },
        {
            "Parameters": "dhcpv6",
            "Info": "Sets the timeout period for a router to wait for a Request message from a client in response to an Advertise message sent to the client.\n-"
        },
        {
            "Parameters": "time-value",
            "Info": "Specifies the timeout period for a router to wait for a Request message from a client.\nThe value is an integer ranging from 5 to 60, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] access wait-request-time dhcpv6 10"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] access wait-request-time dhcpv4 10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nYou are advised to set  to a value smaller than the default value.\nIn user access scenarios, a client sends a Discover message to request an IP address. By default, the timeout period for a router to wait for a Request message from a client in response to an Offer message sent to the client is 25s, which cannot be changed. After the timeout period elapses, the router releases the assigned IPv4 address to the Address Manager (AM) module. To prevent multiple malicious clients from exhausting IPv4 addresses in an address pool by sending DHCPv4 Discover messages, run the wait-request-time  command to adjust the timeout period for the router to wait for a Request message from a client in response to an Offer message sent to the client.In user access scenarios, a client sends a Solicit message to request an IPv6 address. By default, the timeout period for a router to wait for a Request message from a client in response to an Advertise message sent to the client is 55s, which cannot be changed. After the timeout period elapses, the router releases the assigned IPv6 address to the AMv6 module. To prevent multiple malicious clients from exhausting IPv6 addresses in an address pool by sending DHCPv6 Solicit messages, run the access wait-request-time dhcpv6 command to adjust the timeout period for the router to wait for a Request message from a client in response to an Advertise message sent to the client.\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nThe wait-request-time command is run in the IP address pool view whereas the access wait-request-time dhcpv4 command is run in the system view. When the two commands are both run, the wait-request-time command takes effect.\nThe wait-request-time command is run in the IP address pool view whereas the access wait-request-time dhcpv6 command is run in the system view. When the two commands are both run, the wait-request-time command takes effect."
}