{
    "PageTitle": "authentication-name(dynamic-pool)",
    "FuncDef": "The authentication-name command configures an authentication name and a password for the BRAS to apply to a RADIUS server for dynamic address segments.\nThe undo authentication-name command deletes an authentication name and a password used by the BRAS to apply to a RADIUS server for dynamic address segments.\nBy default, no authentication name or password is configured for the BRAS to apply to a RADIUS server for dynamic address segments.",
    "CLIs": [
        "authentication-name <authentication-name> password cipher password",
        "undo authentication-name [ authentication-name [ password cipher [ password ] ] ]"
    ],
    "ParentView": [
        "IP address pool view"
    ],
    "ParaDef": [
        {
            "Parameters": "authentication-name",
            "Info": "Specifies an authentication name used for applying for dynamic address segments.\nThe value is a string of 1 to 253 case-insensitive characters."
        },
        {
            "Parameters": "password cipher password",
            "Info": "Specifies a password used for applying for dynamic address segments.\nThe value is a string of 1 to 16 or 1 to 128 characters. There is no requirement for the password strength. The encryption mode must be AES256."
        },
        {
            "Parameters": "password",
            "Info": "Specifies a password.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip pool huawei bas dynamic",
            "[*HUAWEI-ip-pool-huawei] authentication-name dap password cipher abc@123"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter a dynamic address pool is configured on a RADIUS server, run the authentication-name command to configure an authentication name and a password for the BRAS to apply to the RADIUS server for dynamic address segments.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nAfter a dynamic address segment is locally saved on the BRAS, you cannot delete the authentication name or password."
}