{
    "PageTitle": "dhcp conflict-ip-address offline",
    "FuncDef": "The dhcp conflict-ip-address offline command configures the device to log out an online user and deny access of a new user if it detects that the IP address assigned to the new user from a remote address pool or by the RADIUS server is the same as the IP address of the online user.\nThe undo dhcp conflict-ip-address offline command restores the default configuration.\nBy default, if the device detects that the IP address assigned to a new user from a remote address pool or by the RADIUS server is the same as the IP address of an online user, the device sends a DHCP Decline message to the DHCP server. The online user is still online, but the new user fails to log in.",
    "CLIs": [
        "dhcp conflict-ip-address offline [ user [ include framed-ip ] ]",
        "undo dhcp conflict-ip-address offline [ user [ include framed-ip ] ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "framed-ip",
            "Info": "Configures the device to detect both IP addresses assigned from a remote address pool and by the RADIUS server.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dhcp conflict-ip-address offline user include framed-ip"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo implement authentication, authorization, and accounting for users separately, users must use different IP addresses to go online. This requires the device to detect whether the IP address assigned to a new user conflicts with that of an online user. By default, if the device detects that the IP address assigned to a new user is the same as the IP address of an online user, it sends a DHCP Decline message to the DHCP server. Then the new user cannot go online, but the online user is not affected.\nTo allow the device to log out the online user and trigger the new user to attempt to go online again, run the dhcp conflict-ip-address offline user command.\nIf include frame-ip is not configured, the device only detects whether the IP address assigned to a user from a remote address pool conflicts with that of another user.If include frame-ip is configured, the device detects whether the IP address assigned to a user from a remote address pool or by the RADIUS server conflicts with that of another user.\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nWhen both the dhcp conflict-ip-address offline and dhcp conflict-ip-address offline user commands are run, and a new user is assigned the IP address of an online user from a remote address pool and the two users are both IPv4/IPv6 dual-stack users, the dhcp conflict-ip-address offline command configuration takes effect. Specifically, the device will log out the online user only from the IPv4 address after detecting the IPv4 address conflict."
}