{
    "PageTitle": "dhcp-server giaddr ip-address(DHCP group view)",
    "FuncDef": "The dhcp-server giaddr ip-address command configures the GiAddr address of packets sent by a DHCPv4 server group.\nThe undo dhcp-server giaddr command restores the default setting.\nBy default, the GiAddr address of packets sent by a DHCPv4 server group is a gateway address.",
    "CLIs": [
        "dhcp-server giaddr ip-address <ip-addr> [ vpn-instance <vpn-instance-name> ] [ forward-rui-slave ]",
        "undo dhcp-server giaddr"
    ],
    "ParentView": [
        "DHCP group view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies the VPN instance name.\nThe value is a string of 1 to 31 characters. The instance must be a configured VPN instance."
        },
        {
            "Parameters": "forward-rui-slave",
            "Info": "Forward rui slave.\n-"
        },
        {
            "Parameters": "ip-address ip-addr",
            "Info": "Specifies a GiAddr address for an IP address pool in BRAS dual-device hot backup scenario.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dhcp-server group huawei",
            "[*HUAWEI-dhcp-server-group-huawei] commit",
            "[~HUAWEI-dhcp-server-group-huawei] dhcp-server giaddr ip-address 10.1.1.1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen a remote address pool is used for address allocation, if the DHCP server can only respond with a packet carrying the GiAddr address and not the source IP address, the double gateway solution must be used. To specify an IP address in the address pool to function as the GiAddr address, run the dhcp-server giaddr ip-address command. The IP address specified cannot be the same as the gateway address of the address pool.\nThe DHCP server cannot allocate the GiAddr address to any terminal.\nPrecautions\nThe GiAddr address specified by ip-addr cannot conflict with any user IP address."
}