{
    "PageTitle": "dhcp rebind no-user action",
    "FuncDef": "The dhcp rebind no-user action keep-silence command disables the device from sending an NAK message in response to a client's DHCP Rebind message if a corresponding user entry does not exist on the device.\nThe undo dhcp rebind no-user action keep-silence command restores the default configuration.\nThe dhcp rebind no-user action nak server-ip command configures a device to send a NAK message with the source IP address being the configured gateway address in response to a client's DHCP Rebind message if the corresponding user entry does not exist.\nThe undo dhcp rebind no-user action nak server-ip command disables the function that NAK packets are forcibly sent in non-VPN scenarios and not replied in VPN scenarios if the corresponding user entry does not exist after DHCP Rebind messages are received.\nBy default, the device is enabled to send an NAK message in response to a client's DHCP Rebind message if a corresponding user entry does not exist on the device.",
    "CLIs": [
        "dhcp rebind no-user action { keep-silence | nak server-ip <gateway-ip-address> }",
        "undo dhcp rebind no-user action { keep-silence | nak server-ip <gateway-ip-address> }"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "server-ip gateway-ip-address",
            "Info": "The IP address of gateway.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dhcp rebind no-user action keep-silence"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn a cold backup scenario, users go online only through the master device. However, DHCP Rebind messages used to extend user leases are broadcast, and the backup device also receives such messages and replies with NAK messages. If a client receives an NAK message before receiving a normal lease response message, the user is logged out, and the user needs to perform a login again if the user wants to continue to use services. To resolve this issue, run the dhcp rebind no-user action keep-silence command to disable the device from sending an NAK message in response to a client's DHCP Rebind message if a corresponding user entry does not exist on the device.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}