{
    "PageTitle": "dhcp check-server-pkt",
    "FuncDef": "The dhcp check-server-pkt command selects strict or loose check on replay packets received from the DHCPv4 server.\nBy default, the device conducts strict check on reply packets from the DHCPv4 server.",
    "CLIs": [
        "dhcp check-server-pkt [ loose | strict ]",
        "dhcp check-server-pkt loose [ include option <dhcp-option-code> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "loose",
            "Info": "Indicates the loose check of the reply packet from the DHCPv4 server.\n-"
        },
        {
            "Parameters": "strict",
            "Info": "Indicates the strict check of the reply packet form the DHCPv4 server.\n-"
        },
        {
            "Parameters": "include",
            "Info": "Indicates the option value.\n-"
        },
        {
            "Parameters": "option dhcp-option-code",
            "Info": "Specifies the option code. If this parameter is not configured, the device does not conduct loose check on reply packets that do not carry Option 3 from the DHCPv4 server. If this parameter is configured, the device conducts loose check on all reply packets from the DHCPv4 server, including those carrying Option 3.\nOnly Option 3 can be specified."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dhcp check-server-pkt loose"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe dhcp check-server-pkt command selects strict or loose check on replay packets received from the DHCPv4 server.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nIf loose check is configured for reply packets from the DHCPv4 server and the gateway address carried in reply packets form the DHCPv4 server is different from the locally configured gateway address, the device searches the domain for a new address pool with the same gateway address as that carried in the reply packet form the DHCPv4 server.\nWhen loose check is configured on the packets sent by the DHCPv4 server, if two users ahve the same IP address but are in different VPNs, the subsequent users fail to go online.\nTherefore, during loose check on the packets sent by a DHCPv4 server, users in different VPNs are advised to use different IP addresses."
}