{
    "PageTitle": "dhcp retransmit-request forward-mode through-packet",
    "FuncDef": "The dhcp retransmit-request forward-mode through-packet command controls whether the BRAS transparently transmits the Request packets retransmitted by a DHCP user to the DHCP server. After this command is run, if the BRAS receives a Request packet retransmitted by a DHCP user whereas waiting for an ACK packet from the DHCP server, the BRAS transparently transmits the Request packet to the DHCP server.\nThe undo dhcp retransmit-request forward-mode through-packet command restores the default configuration.\nBy default, the BRAS discards the Request packets retransmitted by a DHCP user whereas waiting for an ACK packet from the DHCP server.",
    "CLIs": [
        "dhcp retransmit-request forward-mode through-packet",
        "undo dhcp retransmit-request forward-mode through-packet"
    ],
    "ParentView": [
        "DHCP group view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dhcp-server group huawei",
            "[~HUAWEI-dhcp-server-group-huawei] dhcp retransmit-request forward-mode through-packet"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nUsage scenario\nIn DHCP remote address pool scenarios, if the DHCP server's performance is not good and there is a probability that the DHCP server does not send an ACK packet in response to a Request packet, the BRAS may discard the Request packet retransmitted by the DHCP user. This results in a DHCP user online failure. After the dhcp retransmit-request forward-mode through-packet command is run, the BRAS can transparently transmit the Request packet to the DHCP server whereas waiting for an ACK packet from the DHCP server. This increases the probability of successful DHCP user line.\nConfiguration impact\nThis configuration involves the Request packets only in DHCP user online. If the ACK packets are responded by the DHCP server at low speed and a lot of Request packets are retransmitted during DHCP user online, this function will exert pressure on the DHCP server in processing packets.\nConfiguration Impact\nThis configuration involves the Request packets only in DHCP user online. If the ACK packets are responded by the DHCP server at low speed and a lot of Request packets are retransmitted during DHCP user online, this function will exert pressure on the DHCP server in processing packets.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}