{
    "PageTitle": "dhcp-server",
    "FuncDef": "The dhcp-server command configures the IP address of a DHCPv4 server and configures the weight of a specified DHCPv4 server when it performs load balancing. A DHCPv4 server group contains a maximum of eight DHCPv4 servers.\nThe undo dhcp-server command removes the DHCPv4 server(s). If you do not use any parameter, all DHCPv4 servers in the DHCPv4 server group are removed.\nBy default, the IP address of a DHCPv4 server and the weight of a specified DHCPv4 server is not configured.",
    "CLIs": [
        "dhcp-server <ip-address> [ vpn-instance <vpn-instance> ] [ weight <weight-value> ]",
        "undo dhcp-server [ <ip-address> [ vpn-instance <vpn-instance> ] ]"
    ],
    "ParentView": [
        "DHCP group view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address",
            "Info": "Specifies the IP address of the DHCPv4 server in the dotted decimal format.\nThe value is in the dotted format."
        },
        {
            "Parameters": "vpn-instance vpn-instance",
            "Info": "Specifies the VPN instance name.\nThe value is a string of 1 to 31 characters. The instance must be a configured VPN instance."
        },
        {
            "Parameters": "weight weight-value",
            "Info": "Specifies the weight of a DHCPv4 server.\nThe value is an integer that ranges from 0 to 100. The default value is 5."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dhcp-server group remote",
            "[*HUAWEI-dhcp-server-group-remote] dhcp-server 1.2.3.4 weight 20"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe weight configured using the dhcp-server command takes effect only when both DHCPv4 servers in a DHCPv4 server group work in load balancing mode. To specify the working mode of the DHCPv4 servers in a DHCPv4 server group, run the dhcp-server algorithm command.\nThe dhcp-server command sets the weight of a DHCPv4 server that works in load balancing mode rather than the priority of the DHCPv4 server. If the weight is set, packets are sent to two DHCPv4 servers according to the weight of each DHCPv4 server. If the weight is not set, packets are sent equally to two DHCPv4 servers.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}