{
    "PageTitle": "dhcp reply trust broadcast-flag",
    "FuncDef": "The dhcp reply trust broadcast-flag command enables a device to use the broadcast flag value in a DHCP request packet to determine the destination MAC address type for a DHCP response packet.\nThe undo dhcp reply trust broadcast-flag command restores the default configuration.\nBy default, the destination MAC address in a DHCP response packet is the user MAC address.",
    "CLIs": [
        "dhcp reply trust broadcast-flag",
        "undo dhcp reply trust broadcast-flag"
    ],
    "ParentView": [
        "BAS interface view (GE)",
        "BAS interface view (VE)",
        "BAS interface view (trunk)"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 2/0/0",
            "[~HUAWEI-GigabitEthernet2/0/0] bas",
            "[~HUAWEI-GigabitEthernet2/0/0-bas] access-type layer2-subscriber",
            "[~HUAWEI-GigabitEthernet2/0/0-bas] dhcp reply trust broadcast-flag"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, a device replies to a DHCP request packet with a DHCP response packet that carries the user MAC address as the destination MAC address. If you want your device to use the broadcast flag value in a DHCP request packet to determine the destination MAC address type for a DHCP response packet, run the dhcp reply trust broadcast-flag command.\nConfiguration Impact\nAfter the dhcp reply trust broadcast-flag command is run, if the broadcast flag value in a DHCP request packet is 1, the device replies with a DHCP response packet that carries the broadcast address of all Fs as the destination MAC address; if the broadcast flag value in a DHCP request packet is 0, the device replies with a DHCP response packet that carries the user MAC address as the destination MAC address.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nThe dhcp reply trust broadcast-flag command applies only to Layer 2 access users. The dhcp reply trust broadcast-flag command is mutually exclusive with the dhcp-broadcast command."
}