{
    "PageTitle": "dhcp option121 route",
    "FuncDef": "The dhcp option121 route command allocates static routes to domain users.\nThe undo dhcp option121 route command cancels the static routes allocated to domain users.\nBy default, no static routes are configured for domain users.",
    "CLIs": [
        "dhcp option121 route <ip-addr> <mask> <gateway-address>",
        "undo dhcp option121 route <ip-addr> <mask> <gateway-address>"
    ],
    "ParentView": [
        "AAA domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-addr",
            "Info": "Specifies the destination IP address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "mask",
            "Info": "Specifies the mask length.\nThe value is an integer that ranges from 0 to 32."
        },
        {
            "Parameters": "gateway-address",
            "Info": "Specifies the IP address of the gateway.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[*HUAWEI-aaa] domain huawei",
            "[*HUAWEI-aaa-domain-huawei] commit",
            "[~HUAWEI-aaa-domain-huawei] dhcp option121 route 192.168.21.104 24 192.168.21.1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOption 121 allows a DHCP server to allocate static routes to DHCP clients.\nWhen clients access certain servers, you can run the dhcp option121 route command for the user domain to allocate static routes to clients and adjust routes.\nWhen a DHCP user goes online, the BRAS encapsulates static route information into DHCP Option 121 and sends the information to a client. When a PPPoE user goes online, the BRAS encapsulates static route information into PPPoE PADN Tag 0x121 IP_ROUTE_ADD and sends the information to a client if you configure the client-option82 version1 command on the BAS interface to enable static route allocation for PPPoE users. When both PPPoE PADM and PADN packets need to be sent to a client, PADN packets are sent first.\nA maximum of 24 routes can be configured for a domain.\nDHCP clients will perform addressing based on the delivered static routes.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}