{
    "PageTitle": "dhcp option82 rebuild version3 send-to-server",
    "FuncDef": "The dhcp option82 rebuild version3 send-to-server command enables a device to encapsulate the Option 82 attribute into a message to be sent to the DHCP server based on a fixed format.\nThe undo dhcpoption82 rebuild version3 send-to-server command disables the function.\nThe dhcp option82 rebuild version4 send-to-server command enables a device to encapsulate the Option 82 attribute in the format of sysname:interface-name:svlan-cvlan into a message to be sent to a DHCP server.\nThe undo dhcp option82 rebuild version4 send-to-server command disables a device from encapsulating the Option 82 attribute in the format of sysname:interface-name:svlan-cvlan into a message to be sent to a DHCP server.\nBy default, the Option 82 attribute is not encapsulated in a fixed format into a message to be sent to a DHCP server.",
    "CLIs": [
        "dhcp option82 rebuild version3 send-to-server [ remote-id { neba | vula } ]",
        "dhcp option82 rebuild version4 send-to-server",
        "undo dhcp option82 rebuild version3 send-to-server",
        "undo dhcp option82 rebuild version4 send-to-server"
    ],
    "ParentView": [
        "BAS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "remote-id",
            "Info": "Identifies a remote host.\n-"
        },
        {
            "Parameters": "neba",
            "Info": "Remote-id padding to string NEBA.\n-"
        },
        {
            "Parameters": "vula",
            "Info": "Remote-id padding to string VULA.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1/0/1.1",
            "[*HUAWEI-interface GigabitEthernet1/0/1.1] commit",
            "[~HUAWEI-interface GigabitEthernet1/0/1.1] bas",
            "[~HUAWEI-interface GigabitEthernet1/0/1.1-bas] access-type layer2-subscriber",
            "[~HUAWEI-interface GigabitEthernet1/0/1.1-bas] dhcp option82 rebuild version4 send-to-server"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1/0/1.1",
            "[*HUAWEI] commit",
            "[~HUAWEI-interface GigabitEthernet1/0/1.1] bas",
            "[~HUAWEI-interface GigabitEthernet1/0/1.1-bas] access-type layer2-subscriber",
            "[~HUAWEI-interface GigabitEthernet1/0/1.1-bas] dhcp option82 rebuild version3 send-to-server"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn scenarios where a remote address pool is used to assign IP addresses to Layer 2 access users, run the dhcp option82 rebuild version4 send-to-server command to enable a device to encapsulate the Option 82 attribute in the format of sysname:interface-name:svlan-cvlan into a message to be sent to a DHCP server.\nPrerequisites\nDHCP proxy has been enabled in the BAS interface view.\nConfiguration Impact\nIf the dhcp option82 rebuild version3 send-to-server or dhcp option82 rebuild version3 send-to-server remote-id neba command is configured, the Option 82 attribute is encapsulated in the following format:\nRemote id: NEBA;Circuit id::.\nIf the dhcp option82 rebuild version3 send-to-server remote-id vula command is configured, the Option 82 attribute is encapsulated in the following format:\nRemote id: VULA;Circuit id::.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nThe dhcp option82 rebuild version3 send-to-server command has a higher priority than the dhcp option-82 agent-remote-id strip command.The dhcp option82 rebuild version3 send-to-server and dhcp option82 rebuild self-define { circuit-id | out-vlan | inner-vlan | remote-id } * send-to-server commands are mutually exclusive.The dhcp option82 rebuild version3 send-to-server and ipoe-server multi-sessions per-mac enable commands are mutually exclusive.The dhcp option82 rebuild version4 send-to-server command is mutually exclusive with the dhcp option82 rebuild version3 send-to-server and dhcp option82 rebuild self-define { circuit-id | out-vlan | inner-vlan | remote-id } * send-to-server commands.The dhcp option82 rebuild version4 send-to-server and ipoe-server multi-sessions per-mac enable commands are mutually exclusive."
}