{
    "PageTitle": "dhcp-server group(System view)",
    "FuncDef": "The dhcp-server group command creates the DHCPv4 server group.\nThe undo dhcp-server group command removes the DHCPv4 server group.\nBy default, the DHCPv4 server group is not created.",
    "CLIs": [
        "dhcp-server group <group-name> remote-backup-service <service-name>",
        "dhcp-server group <group-name>",
        "undo dhcp-server group <group-name>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "remote-backup-service service-name",
            "Info": "Specifies the backup service associated with the DHCPv4 server group.\nThe value is a string of 1 to 32 case-insensitive characters."
        },
        {
            "Parameters": "group group-name",
            "Info": "Specifies the name of the DHCPv4 server group.\nThe value is a string of 1-32 characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] dhcp-server group huawei"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the device as the DHCPv4 relay and needs to send DHCPv4 requests to a remote DHCPv4 server, you must configure a DHCPv4 server group on the BRAS, specifying specific IP addresses of DHCPv4 servers, VPNs to which the DHCPv4 servers belong, and the load balancing algorithm, and then bind the DHCPv4 server group to the remote address pool.\nAfter the remote backup service is specified, only one master DHCP server can be configured in the DHCP server group view. The status of the DHCP server is associated with the TCP status of the remote backup service. If the remote backup service is in the Connected state, the DHCP server is Up, even if the connection to the DHCP server times out; if the remote backup service is in the Interrupted state, the DHCP server is Down. After the remote backup service is specified, the DHCP server can be bound to only the RUI-Slave address pool. It is required that the IP address of the master DHCP server in the DHCP server group be the same as that of the peer IP configured in the remote backup service.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}