{
    "PageTitle": "export host-route",
    "FuncDef": "The export host-route command exports host routes from the current address pool.\nThe undo export host-route command restores the default configuration.\nBy default, routes destined for network segment are exported from an address pool.",
    "CLIs": [
        "export host-route",
        "undo export host-route"
    ],
    "ParentView": [
        "IP address pool view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip pool kk bas remote",
            "[~HUAWEI-ip-pool-kk] export host-route"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBefore configuring this command, you must create the corresponding address pool in the system view using the ip pool command.\nUsers can configure the advertisement of 32-bit specific routes in the address pool of the primary node, advertisement of host routes in the address pool of the secondary node, and IGP route summarization on the network to ensure that network-side traffic can be entered from the primary node.\nIf IP addresses are delivered by the RADIUS server:\nHost routes for Layer 2 DHCPv4 users are not advertised by default, but can be advertised after the export host-route command is run.Host routes for Layer 3 DHCPv4 users are not advertised.Host routes for PPPv4 users can be delivered by the RADIUS attributes.\nIf IP addresses are not delivered by the RADIUS server, host routes for Layer 2 DHCPv4 users, Layer 3 DHCPv4 users, and PPPv4 users are not advertised by default, but can be advertised after the export host-route command is run.\nAfter this command is run, only host routes can be advertised and network segment routes will be withdrawn. Before running this command, ensure that the address pool is not used by any user. If you run this command when the address pool is used by some users, the UNR routes of these users will fail to be advertised.\nSubnet route withdrawal causes a failure to advertise gateway routes and may affect user access and lease renewal from a remote address pool. To address this problem, configure a static route.\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}