{
    "PageTitle": "gateway unnumbered",
    "FuncDef": "The gateway unnumbered command enables an address pool to borrow an interface address as a gateway address.\nThe undo gateway unnumbered command disables an address pool from borrowing an interface address as a gateway address.\nBy default, an address pool to borrow an interface address as a gateway address is disabled.",
    "CLIs": [
        "gateway unnumbered interface { <interface-name> | <interface-type> <interface-number> }",
        "undo gateway unnumbered"
    ],
    "ParentView": [
        "Bas IP address pool view"
    ],
    "ParaDef": [
        {
            "Parameters": "interface interface-type",
            "Info": "Specifies the type of the interface.\n-"
        },
        {
            "Parameters": "interface interface-number",
            "Info": "Specifies the number of the interface.\n-"
        },
        {
            "Parameters": "interface interface-name",
            "Info": "Specifies the name of the interface.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip pool pool1 bas local",
            " Info:It's successful to create an IP address pool",
            "[*HUAWEI-ip-pool-pool1] gateway unnumbered interface loopback1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen you configure a gateway in an address pool, the gateway address and user address must be in the same network segment. In addition, the gateway address cannot be allocated to the user. This will waste many IP addresses. After the gateway unnumbered command is run, the loopback address of the device is used as the gateway address for all user IP addresses, the gateway address and user address may not be in the same network segment preventing IP addresses from being wasted.\nYou can run the gateway ip-address mask command to configure the gateway address in an address pool or run the gateway unnumbered interface interface-type interface-number command to enable an address pool to borrow an interface address as a gateway address. If an address pool is enabled to borrow an interface address as a gateway address and the loopback interface has two or more IP addresses, the main IP address is borrowed as the gateway address.\nPrerequisites\nThe address to be borrowed must be a loopback address or the IP address of a physical interface, physical sub-interface, trunk interface, or trunk sub-interface.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nCurrently, this command can be used only for the local IPv4 address pool.\nIf an address pool is bound to a domain, you must unbind the address pool from the domain. If the binding is not removed, you cannot configure an address pool to borrow an interface address as a gateway address, or delete or modify the configuration.\nAfter the gateway unnumbered command is run, the configuration of the borrowed interface cannot be deleted or modified."
}