{
    "PageTitle": "ip-attribute public",
    "FuncDef": "The ip-attribute public command configures the public network attribute of an IP address pool or an IP address pool group. After the configuration is complete, the IP address pool or the IP address pool group is used for the calculation of public IP address pool status.\nThe undo ip-attribute public command restores the private network attribute of the address pool or the address pool group.\nBy default, IP address pools or IP address pool groups have no public network attribute. They are not used for the calculation of public IP address pool status.",
    "CLIs": [
        "ip-attribute public",
        "undo ip-attribute public"
    ],
    "ParentView": [
        "IP address pool view",
        "Address pool group view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip pool huawei bas local",
            "[*HUAWEI-ip-pool-huawei] ip-attribute public"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAn AAA domain has public and private network users. A BRAS sends public IP address pool status to a RADIUS server. The RADIUS server determines whether a user is a public or private network user based on user information and the public IP address pool status. The RADIUS server then sends the corresponding user group name and IP address pool name or IP address pool group name to the BRAS. The BRAS determines whether the user is a public or private network user based on the received user group name and assigns an IP address to the user from the received IP address pool or IP address pool group. In this case, run the ip-attribute public command to specify IP address pools or IP address pool groups whose status is to be calculated.\nPrerequisites\nConfigure the upper and lower thresholds for IP address pool usage to calculate the public IP address pool status to be sent to the RADIUS server.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nThe ip-attribute public command is applicable to local address pools only."
}