{
    "PageTitle": "ip-pool-group",
    "FuncDef": "The ip-pool-group command binds an address pool group to a domain.\nThe undo ip-pool-group command unbinds an address pool group from a domain.\nBy default, no address pool group is bound to a domain.",
    "CLIs": [
        "ip-pool-group <group-name>",
        "ip-pool-group <group-name> move-to <new-position>",
        "undo ip-pool-group <group-name>",
        "undo ip-pool-group"
    ],
    "ParentView": [
        "AAA domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "group-name",
            "Info": "Specifies the name of an address pool group.\nThe value is a string of 1 to 128 case-insensitive characters."
        },
        {
            "Parameters": "move-to new-position",
            "Info": "Specifies the information on the address pool groups. The value depends on the number of address pool group configured in the domain. The maximum value is 1024.\nThe value is an integer that ranges from 1 to 1024."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip pool-group pool1 bas",
            "[~HUAWEI-ip pool-group pool1] quit",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] domain huawei",
            "[*HUAWEI-aaa-domain-huawei] commit",
            "[*HUAWEI-aaa-domain-huawei] ip-pool-group pool1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf different domains share some address pools, these address pools can be configured to form an address pool group. The address pool group simplifies configuration.\nPrerequisites\nAn address pool has been created.\nConfiguration Impact\nAfter an address pool group is bound to a domain, all address pools in that group are bound to the domain.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nNote the following issues after using the ip-pool-group command:\nAfter an address pool group is bound to a domain, the VPN instance to which the address pool group is bound cannot be modified, and no more address pools can be added to or deleted from this address pool group.A maximum of eight address pool groups can be bound to a domain.A maximum of 1024 IPv4 address pools can be bound to a domain."
}