{
    "PageTitle": "ip-pool mode priority",
    "FuncDef": "The ip-pool mode priority command configures a device to prefer a local or remote IP address pool in a domain.\nThe undo ip-pool mode priority command deletes the preference configured for an IP address pool in a domain.\nBy default, a device selects an IP address pool for Layer 3 DHCP users based on its gateway address and preferentially selects a local address pool for Layer 2 DHCP and PPP users.",
    "CLIs": [
        "ip-pool mode priority { local [ layer2-subscriber ] | remote [ layer2-subscriber [ ipoe | pppoe ] ] }",
        "undo ip-pool mode priority [ local layer2-subscriber | remote layer2-subscriber [ ipoe | pppoe ] ]"
    ],
    "ParentView": [
        "AAA domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "local",
            "Info": "Indicates that a local IP address pool takes precedence during address pool allocation.\n-"
        },
        {
            "Parameters": "layer2-subscriber",
            "Info": "Indicates Layer 2 common users.\n-"
        },
        {
            "Parameters": "remote",
            "Info": "Indicates that a remote IP address pool takes precedence during address pool allocation.\n-"
        },
        {
            "Parameters": "ipoe",
            "Info": "Indicates IPoE users.\n-"
        },
        {
            "Parameters": "pppoe",
            "Info": "Indicates PPPoE users.\n-"
        },
        {
            "Parameters": "mode",
            "Info": "Specifies a mode in which an IP address pool assigns IP addresses.\nOnly mode is currently available."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] domain huawei",
            "[*HUAWEI-aaa-domain-huawei] commit",
            "[~HUAWEI-aaa-domain-huawei] ip-pool mode priority local"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] domain huawei",
            "[*HUAWEI-aaa-domain-huawei] commit",
            "[~HUAWEI-aaa-domain-huawei] ip-pool mode priority remote layer2-subscriber pppoe"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure a device to prefer a local or remote IP address pool in a domain, run the ip-pool priority mode command. To delete the preference, run the undo ip-pool priority mode command.\nWhen Layer 2 or Layer 3 users access a device, they must be assigned IP addresses from an IP address pool in a domain. You can run the ip-pool priority mode command to configure the device to preferentially select a desired IP address pool.\nPrecautions\nThis command is supported only on the admin VS.\nIf a device is configured to prefer a remote address pool in a domain for address assignment, IP addresses can only be assigned from a remote address pool for vCPE users."
}