{
    "PageTitle": "ip-pool",
    "FuncDef": "The ip-pool command configures the address pool used by the ip pool-group or changes the ID of the address pool. You can configure up to 1024 address pools for each ip pool-group.\nThe undo ip-pool command removes an address pool from the ip pool-group. If you do not specify the name of the address pool, all the address pools for the ip pool-group are removed.\nBy default, no address pool is referenced by the ip pool-group.",
    "CLIs": [
        "ip-pool <pool-name> move-to <new-position>",
        "ip-pool <pool-name>",
        "undo ip-pool [ <pool-name> ]"
    ],
    "ParentView": [
        "Address pool group view"
    ],
    "ParaDef": [
        {
            "Parameters": "pool-name",
            "Info": "Specifies an IP address pool name.\nThe value is a string of 1 to 128 case-insensitive characters. The IP address pool to be bound must have been configured. You can configure an IP address pool by using the ip pool command in the system view."
        },
        {
            "Parameters": "move-to new-position",
            "Info": "Specifies the information on the address pools. The value depends on the number of address pools configured in the domain. The maximum value is 1024.\nThe value is an integer that ranges from 1 to 1024 ."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip pool pool1 bas local",
            "[~HUAWEI-ip-pool-pool1] quit",
            "[~HUAWEI] ip pool-group huawei bas",
            "[~HUAWEI-ip-pool-group-huawei] ip-pool pool1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nRunning this command, you only reference an address pool that is already configured. If you want to configure an address pool, you need to run the ip pool command in system view.\nThe address pools in the address pool group are used in the order in which they are configured. A second address pool can be used only when the previous one is exhausted.\nPrecautions\nThis command is supported only on the admin VS.\nAfter the IP address pool is bound to the remote backup profile, you need to remove the binding before deleting the IP address pool."
}