{
    "PageTitle": "ip-pool auto-block",
    "FuncDef": "The ip-pool auto-block disable command disables automatic isolation for an IPv4 address pool.\nThe ip-pool auto-block enable command enables automatic isolation for an IPv4 address pool.\nThe undo ip-pool auto-block disable command enables automatic isolation for an IPv4 address pool.\nBy default, the automatic isolation for an IPv4 address pool is enabled.",
    "CLIs": [
        "ip-pool auto-block enable",
        "ip-pool auto-block disable",
        "undo ip-pool auto-block disable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip-pool auto-block disable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the number of times that a user consecutively fails to apply for an IP address in an address pool reaches 50, the address pool is considered faulty and is automatically isolated. Users cannot select the address pool to go online. To disable automatic isolation for the faulty address pool, run the ip-pool auto-block disable command. After the command is run, an address pool is not automatically isolated even if the number of times that a user consecutively fails to apply for an IP address in the address pool reaches 50. The user can still select the address pool to go online. To enable automatic isolation for a faulty address pool, run the undo ip-pool auto-block disable or ip-pool auto-block enable command.\nThe mechanism for de-isolating an automatically isolated address pool is as follows:\nAfter an address pool is isolated, the de-isolation timer is started. After 60 minutes, the timer expires and the system automatically de-isolates the address pool.If no address pool is available in a domain, the system de-isolates all automatically isolated address pools (excluding locked address pools) in the domain.If an address pool is isolated for 50 consecutive times and an address pool is available in the domain, the system will not start the de-isolation timer. If no address pool is available in the domain, the system de-isolates all automatically isolated address pools in the domain. Alternatively, you can de-isolate the address pool using the clear auto-block command.\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}