{
    "PageTitle": "ip-pool(AAA domain view)",
    "FuncDef": "The ip-pool command configures the address pool used by the domain or changes the ID of the address pool. You can configure up to 1024 address pools for each domain.\nThe undo ip-pool command removes an address pool from the domain. If you do not specify the name of the address pool, all the address pools for the domain are removed.\nBy default, no address pool is referenced by the domain.",
    "CLIs": [
        "ip-pool <pool-name> move-to <new-position>",
        "ip-pool <pool-name>",
        "undo ip-pool [ <pool-name> ]"
    ],
    "ParentView": [
        "AAA domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "pool-name",
            "Info": "Specifies the name of the address pool.\nThe value is a string of 1 to 128 case-insensitive characters."
        },
        {
            "Parameters": "move-to new-position",
            "Info": "Specifies the information on the address pools.\nThe value depends on the number of address pools configured in the domain. The maximum value is 1024.\nFor example, if 10 address pools are configured in the domain, then the value ranges from 1 to 10."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip pool pool1 bas local",
            "[~HUAWEI-ip-pool-pool1] gateway 10.10.110.1 255.255.0.0",
            "[~HUAWEI-ip-pool-pool1] quit",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] domain huawei",
            "[*HUAWEI-aaa-domain-huawei] commit",
            "[*HUAWEI-aaa-domain-huawei] ip-pool pool1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nYou must limit the IP addresses used by the users in a domain by configuring the address pools.\nRunning this command, you only reference an address pool that is already configured. If you want to configure an address pool, you need to run ip pool in system view.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}