{
    "PageTitle": "ip used-threshold(IP address pool view)",
    "FuncDef": "The ip used-threshold command configures upper and lower address usage thresholds of a dynamic address pool.\nThe undo ip used-threshold command restores the default configuration.\nBy default, the upper threshold for address segment application is 80%, and the lower threshold for address segment release is 20%.",
    "CLIs": [
        "ip used-threshold upper-limit <upper-value> lower-limit <lower-value>",
        "undo ip used-threshold [ upper-limit [ <upper-value> ] [ lower-limit [ <lower-value> ] ] ]"
    ],
    "ParentView": [
        "IP address pool view"
    ],
    "ParaDef": [
        {
            "Parameters": "lower-limit lower-value",
            "Info": "Specifies a lower threshold for address segment release, in percentage. lower-limit must be smaller than upper-limit.\nThe value is an integer ranging from 0 to upper-limit-1."
        },
        {
            "Parameters": "upper-limit upper-value",
            "Info": "Specifies an upper threshold for address segment application, in percentage.\nThe value is an integer ranging from 1 to 100."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip pool huawei bas dynamic",
            "[*HUAWEI-ip-pool-huawei] ip used-threshold upper-limit 90 lower-limit 30"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure upper and lower address usage thresholds of a dynamic address pool, run the ip used-threshold command. Then the address segments in the dynamic address pool can be dynamically applied for or released.\nThe BRAS checks the dynamic address pool usage every 10 minutes. If the BRAS detects that the dynamic address pool usage reaches the upper threshold, the BRAS applies to the RADIUS server for new address segments. If the BRAS detects that the dynamic address pool usage falls below the lower threshold, the BRAS applies to the RADIUS server for releasing address segments.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nIf the ip used-threshold command is run more than once, the latest configuration overrides the previous one."
}