{
    "PageTitle": "option(Bas IP address pool view)",
    "FuncDef": "The option command configures the information represented by the option code.\nThe undo option command removes the option code. If you do not use any parameter, all option codes are removed.\nBy default, the information represented by the option code is disabled.",
    "CLIs": [
        "option <code> { ip { <ip-address> } &<1-2> | string <string-value> | hex { <hex-string> } &<1-160> }",
        "undo option [ <code> [ ip <ip-address> ] ]"
    ],
    "ParentView": [
        "Bas IP address pool view"
    ],
    "ParaDef": [
        {
            "Parameters": "code",
            "Info": "Specifies the value of the self-defined options.\nThe value is an integer that ranges from 2 to 254, include 2 and 254, exclude 3, 6, 15, 44, 46, 50-54, 57- 59, 82,119."
        },
        {
            "Parameters": "ip ip-address",
            "Info": "Specifies the IP address in the dotted decimal format.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "string string-value",
            "Info": "Specifies the string that is represented by the value of the option code.\nThe length of the string ranges from 1 to 255 characters."
        },
        {
            "Parameters": "hex hex-string",
            "Info": "Specifies the hexadecimal character string that is represented by the value of the option code.\nThe value is a case-insensitive hexadeimal number ranging from 2 to 320.The length of the hexadecimal string is an even number of characters.You can input the characters without any spaces or in groups of two with a space in-between each group  For example, 80070000010A2C00FE and 80 07 00 00 01 0A 2C 00 FE are both acceptable."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip pool huawei bas local",
            "[*HUAWEI-ip-pool-huawei] option 128 ip 10.1.1.1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip pool huawei bas local",
            "[*HUAWEI-ip-pool-huawei] option 129 string huawei"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nDHCPv4 provides the framework for transmitting configuration parameters on a TCP/IP network. Therefore, you can transmit the configuration parameters and control information by using the option codes between the DHCPv4 client and the server.\nAfter an option code is configured, the device replies the configured option code to a client only when the client applies for the option code.\nThe value of a common option code, such as DNS and lease, is determinate. The common option codes include 3, 6, 15, 44, 46, 50 to 54 and 57 to 59, 82, 119. When the value is reset, the system prompts that resetting the value is disallowed.\nThis command is inapplicable for remote servers.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}