{
    "PageTitle": "option-61",
    "FuncDef": "The option-61 command sets the value of the option-61 field.\nThe undo option-61 command restores the default value of the option-61 field.\nBy default, the value of the option-61 field is 1.",
    "CLIs": [
        "option-61 hardware-type { none | <type> }",
        "undo option-61"
    ],
    "ParentView": [
        "BAS interface view (GE)",
        "BAS interface view (VE)",
        "BAS interface view (trunk)"
    ],
    "ParaDef": [
        {
            "Parameters": "none",
            "Info": "Encapsulates the MAC address in the character string format into the Option61 field.\n-"
        },
        {
            "Parameters": "type",
            "Info": "Specifies the type of the encapsulated Option 61 field.\nThe value is 0 or 1.\nIf the value is 0, the device encapsulates the MAC address to Option 61 as a string of characters.If the value is 1, the device encapsulates the MAC address to Option 61 in hexadecimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1/0/0.1",
            "[*HUAWEI-GigabitEthernet1/0/0.1] commit",
            "[~HUAWEI-GigabitEthernet1/0/0.1] bas",
            "[~HUAWEI-GigabitEthernet1/0/0.1-bas] access-type layer2-subscriber",
            "[~HUAWEI-GigabitEthernet1/0/0.1-bas] option-61 hardware-type 0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nRun the access-type command to configure the access type of the BAS interface before running the option-61 command.\nThis command can be run only when the user accessing the device is a common Layer 2 or Layer 3 user.\nIf the packets sent by users that attempt to log in do not carry the Option61 field, the device encapsulates the Option61 field into packets based on the parameter specified in the command. When 1 is configured, the device encapsulates the MAC address in the hexadecimal format into the Option61 field; when 0 or none is configured, the device encapsulates the MAC address in the character string format into the Option61 field.\nIf packets sent by users that attempt to log in carry the Option61 field, the device uses the Option61 field.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}