{
    "PageTitle": "remote-ip lease manage (IP address pool view)",
    "FuncDef": "The remote-ip lease manage command enables the lease management function for the remote address pool.\nThe undo remote-ip lease manage command disables the lease management function for the remote address pool.\nBy default, the lease management function is disabled for the remote address pool.",
    "CLIs": [
        "remote-ip lease manage",
        "undo remote-ip lease manage"
    ],
    "ParentView": [
        "IP address pool view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip pool huawei bas remote",
            "[*HUAWEI-ip-pool-huawei] remote-ip lease manage"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the device serves as a DHCP relay, the device disables the ARP detection on access interfaces, because some clients do not respond to ARP probe packets sent by device. If a client is powered off or has gone offline unexpectedly, the device cannot sense that the client is offline, because the client does not send any Release packet. As a result, the remote address pool does not release the IP address used by the client. To prevent this problem, enable the lease management function for the remote address pool.\nConfiguration Impact\nAfter the lease management function for the remote address pool is enabled, it takes effect for offline users immediately when they go online. In addition, it takes effect for online users when they successfully renew their leases for the next time. After the lease management function for the remote address pool is disabled, it takes effect for online users immediately and takes effect for offline users after they go online again.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nDuring lease renewal of a user, if the destination IP address carried in the response message from the DHCP server is the user's IP address, the DSCP priorities set for response messages on the interfaces of the DHCP relay agent do not take effect.\nThe function to apply the original lease expiration time for DHCPv4 users who go online again after going offline unexpectedly:\nIn remote address pool scenarios, this function takes effect only after the lease management function is enabled for remote address pools.This function does not take effect if an infinite lease (which means that the assigned lease will not expire) is configured for a user."
}