{
    "PageTitle": "reserved ip-address",
    "FuncDef": "The reserved ip-address command configures the reservation type of an IP address for a user, either leased-based IP address reservation or MAC-address-based IP address reservation.\nThe undo reserved ip-address command cancels the previous configuration.\nBy default, IP addresses are not reserved. When a user goes offline, the IP address is reclaimed.",
    "CLIs": [
        "reserved ip-address { lease | mac }",
        "undo reserved ip-address"
    ],
    "ParentView": [
        "IP address pool view"
    ],
    "ParaDef": [
        {
            "Parameters": "lease",
            "Info": "Configures lease-based IP address reservation.\n-"
        },
        {
            "Parameters": "mac",
            "Info": "Configures MAC-address-based IP address reservation.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip pool huawei bas local",
            "[*HUAWEI-ip-pool-huawei] reserved ip-address lease"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo enable the user to use the originally-allocated IP address for the second login, which is called IP address reservation, you can run the reserved ip-address command to configure the reservation type.\nIf a user is assigned a lease of four days during the first login, the user can still use the originally-allocated IP address provided that he goes online for the second time within four days. This is called lease-based IP address reservation.\nIf a user's MAC address and the allocated IP address are recorded during the first login, the user can still use the originally-allocated IP address when he goes online for the second time. This is called MAC-address-based IP address reservation.\nConfiguration Impact\nIf MAC-address-based IP address reservation is used, the state of the address entry is reserved after a user gets offline; if leased-based IP address reservation is used, the state of the address entry is used after the user gets offline.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nThis command supports only IPoE users."
}