{
    "PageTitle": "static-bind",
    "FuncDef": "The static-bind command configures the statically bound IP-MAC address pair.\nThe undo static-bind command deletes the statically bound IP-MAC address pair.\nBy default, no IP-MAC address pair is bound statically.",
    "CLIs": [
        "static-bind ip-address <ip-address> mac-address <mac-address>",
        "undo static-bind ip-address <ip-address> mac-address <mac-address>"
    ],
    "ParentView": [
        "Bas IP address pool view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address ip-address",
            "Info": "Specifies the IP address to be bound.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "mac-address mac-address",
            "Info": "Specifies the host MAC address to be bound.\nThe value is a 12-digit hexadecimal number, in the format of H-H-H. Each H is 4 digits. If an H contains fewer than 4 digits, the left-most digits are padded with zeros. For example, e0 is displayed as 00e0. The MAC address cannot be set to FFFF-FFFF-FFFF."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip pool huawei bas local",
            "[~HUAWEI-ip-pool-huawei] gateway 10.1.1.1 255.255.255.0",
            "[~HUAWEI-ip-pool-huawei] section 0 10.1.1.2 10.1.1.253",
            "[~HUAWEI-ip-pool-huawei] static-bind ip-address 10.1.1.10 mac-address 00e0-fc12-3456"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe static-bind command is used to configure the statically bound IP-MAC address pair, which corresponds to manual address assignment. Assume that an IP address 10.110.20.10 is bound to an MAC address 00e0-fc12-3456. Then, the user with the MAC address 00e0-fc12-3456 is always assigned the bound IP address 10.110.20.10.\nIn configuring the static-bind command, the gateway command must be used to configure the IP address of a gateway and the section command must be used to configure the usable address range.\nIn configuring the static-bind command, make sure that the statically bound IP address is unused.\nIn addition, the static-bind command is valid only if the local address pool is used to assign IP addresses.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}