{
    "PageTitle": "subnet length",
    "FuncDef": "The subnet length command configures mask lengths for the initial and extended address segments being applied for a dynamic address pool.\nThe undo subnet length command deletes the mask lengths configured for the initial and extended address segments being applied for a dynamic address pool.\nBy default, no mask length of address segments is configured for any dynamic address pool.",
    "CLIs": [
        "subnet length initial { length | <gateway-mask> } [ extend { length | <gateway-mask> } ]",
        "undo subnet length [ initial { length | <gateway-mask> } [ extend { length | <gateway-mask> } ] ]"
    ],
    "ParentView": [
        "IP address pool view"
    ],
    "ParaDef": [
        {
            "Parameters": "extend gateway-mask",
            "Info": "Specifies a mask of subsequent address segments applied for when IP address resources become insufficient after users go online.\nThis value is in dotted decimal notation, for example, 255.255.0.0."
        },
        {
            "Parameters": "extend length",
            "Info": "Specifies a mask length of subsequent address segments applied for when IP address resources become insufficient after users go online.\nThe value is 0 or an integer ranging from 16 to 30. Nonconsecutive masks are not supported."
        },
        {
            "Parameters": "initial gateway-mask",
            "Info": "Specifies a mask of the initial address segment applied for.\nThis value is in dotted decimal notation, for example, 255.255.0.0."
        },
        {
            "Parameters": "initial length",
            "Info": "Specifies a mask length for the initial address segment applied for.\nThe value is 0 or an integer rangeing from 16 to 30. Nonconsecutive masks are not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip pool huawei bas dynamic",
            "[*HUAWEI-ip-pool-huawei] subnet length initial 26 extend 26"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure mask lengths for the initial and extended address segments being applied for a dynamic address pool, run the subnet length initial command.\nConfiguration Impact\nAfter the command is run, address segment application is triggered immediately. The mask length for address segments cannot be changed if the dynamic address pool has address segments.\nIf extend { length | gateway-mask } is not specified, the mask or mask length specified in initial { length | gateway-mask } is applied to extended address segments being applied for.\nPrecautions\nThe mask length of the initial address segment specified by initial length and that of subsequent address segments specified by extend length must be consistent with that specified by length subnet-length in the network ip-address mask-length subnet length subnet-length command. Otherwise, address segment application fails, and users cannot go online."
}