{
    "PageTitle": "wait-request-time(IP address pool view)",
    "FuncDef": "The wait-request-time command sets the timeout period for a router to wait for a Request message from a client in response to an Offer message sent to the client.\nThe undo wait-request-time command cancels the setting.\n\nIf the access wait-request-time dhcpv4 time-value command has been run in the system view, the default timeout period for a router to wait for a Request message from a client in response to an Offer message sent to the client is specified by time-value.\n\n\nIf the access wait-request-time dhcpv4 time-value has not been run in the system view, the default timeout period for a router to wait for a Request message from a client in response to an Offer message sent to the client is 25s.",
    "CLIs": [
        "wait-request-time <time-value>",
        "undo wait-request-time [ <time-value> ]"
    ],
    "ParentView": [
        "IP address pool view"
    ],
    "ParaDef": [
        {
            "Parameters": "time-value",
            "Info": "Specifies the timeout period for a router to wait for a Request message from a client.\nThe value is an integer ranging from 5 to 60, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip pool huawei bas local",
            "[*HUAWEI-ip-pool-huawei] wait-request-time 10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn user access scenarios, a client sends a Discover message to request an IP address. By default, the timeout period for a router to wait for a Request message from a client in response to an Offer message sent to the client is the default value. After the timeout period elapses, the router releases the assigned IPv4 address. To prevent multiple malicious clients from exhausting IPv4 addresses in an address pool by sending DHCPv4 Discover messages, run the wait-request-time command to adjust the timeout period for the router to wait for a Request message from a client in response to an Offer message sent to the client.\nYou are advised to set time-value to a value smaller than the default value.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nThe wait-request-time command is run in the IP address pool view whereas the access wait-request-time dhcpv4 command is run in the system view. When the two commands are both run, the wait-request-time command takes effect."
}