{
    "PageTitle": "nqa",
    "FuncDef": "The nqa command creates an NQA test instance and displays the NQA test instance view.\nThe undo nqa command deletes an NQA test instance.\nBy default, no NQA test is created.",
    "CLIs": [
        "nqa test-instance <admin-name> <test-name>",
        "undo nqa test-instance <admin-name> <test-name>",
        "undo nqa all-test-instance"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "test-name",
            "Info": "Specifies the name of an NQA test instance.\nThe value is a string of 1 to 32 characters, excluding question marks (?), en dashes (-), a single or consecutive quotation marks (\")."
        },
        {
            "Parameters": "test-instance admin-name",
            "Info": "Specifies the administrator of an NQA test instance.\nThe value is a string of 1 to 32 characters, excluding question marks (?), en dashes (-), a single or consecutive quotation marks (\")."
        },
        {
            "Parameters": "all-test-instance",
            "Info": "Specifies all NQA test instances.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nqa test-instance user test"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nNQA integrates the network test function into devices to test network operation conditions, output statistical information, and effectively help reduce costs.\nNQA measures the performance of different protocols running on a network. Carriers can collect network operation indexes in real time, such as delay in TCP connections, packet loss ratio, and path maximum transmission unit (MTU).\nNQA creates test instances to monitor the preceding indexes. In NQA, two test ends are called an NQA client and server. An NQA test is initiated by the NQA client. After test instances are configured on the client, NQA places different types of test instances into various test queues. After the test starts, a response packet is returned. The analysis on the received response packet helps carriers check protocol operating status by analyzing the received response packet. The test packet is marked a timestamp based on the local system time before being sent to the destination. After receiving the test packet, the destination sends a response packet to the source. The source then timestamps the received response packet based on the current local system time. This helps the source calculate the RTT of the packet based on the time of sending and receiving the packet.\nFor example, if you want to check whether the peer device is reachable, run the nqa command to create an NQA test instance, set the test type of the test instance to ICMP, and run the destination-address command to specify the IP address of the peer device as the destination IP address. After that, you can start the test instance. Then, you can check whether the peer device is reachable by analyzing the received response packet.\nConfiguration Impact\nThe undo nqa all-test-instance command deletes all the NQA test instances, including the running ones.\nPrecautions\nBefore deleting an NQA test instance, delete the services associated to it.After all NQA test instances are deleted, associated services are affected."
}