{
    "PageTitle": "timeout (DNS test instance)",
    "FuncDef": "The timeout command sets the timeout period of packets in an NQA test instance of DNS test type.\nThe undo timeout command restores the default timeout period.\nBy default, the timeout period is 3s.",
    "CLIs": [
        "timeout <time>",
        "undo timeout"
    ],
    "ParentView": [
        "NQA view"
    ],
    "ParaDef": [
        {
            "Parameters": "time",
            "Info": "Specifies the timeout period of probe packets.\nThe value is an integer ranging from 1 to 60, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nqa test-instance user test",
            "[*HUAWEI-nqa-user-test] test-type dns",
            "[*HUAWEI-nqa-user-test] timeout 60"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn networks with poor quality and the low transmission rate, increase the timeout period of probe packets so that packets in response to probe packets can be returned. The timeout period is the period for waiting for a response packet after a request packet is sent. If no response packet is received within the timeout period, the test is considered failed.\nThe value of the timeout period depends on the actual networking. If the value is too small, the NQA test instance may fail.\nConfiguration Impact\nYou are advised to set the timeout period based on the RTT value. The timeout period configured using the timeout command must be greater than the RTT value.\nThe timeout period set using the timeout command must be less than or equal to the interval for sending NQA test packets configured using the interval command. Otherwise, packets time out.\nPrecautions\nIf parameters need to be changed during the running of the test instance, the system prompts you whether to terminate the test instance. Press \"Y\" or \"N\" as required.\nIf you press \"Y\", the test instance is terminated and parameters changed. The changed parameters take effect after the commit command is run. To restart the test instance, run the start command.If you press \"N\", the test instance keeps running, and the parameters fail to be modified."
}