{
    "PageTitle": "frequency",
    "FuncDef": "The frequency command sets the interval at which an NQA test instance is automatically performed.\nThe undo frequency command restores the default interval.\nBy default, no interval is set. An NQA test instance is performed once.",
    "CLIs": [
        "frequency <frequencyValue>",
        "undo frequency"
    ],
    "ParentView": [
        "NQA view"
    ],
    "ParaDef": [
        {
            "Parameters": "frequencyValue",
            "Info": "Specifies the interval at which an NQA test instance is performed.\nThe value is an integer ranging from 1 to 604800, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nqa test-instance user test",
            "[*HUAWEI-nqa-user-test] test-type icmp",
            "[*HUAWEI-nqa-user-test] frequency 20"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe start command sets the start time and end time for an NQA test instance. If a test instance needs to be performed periodically during the interval between the start time and end time, run the frequency command to set the interval at which the NQA test instance is performed automatically.\nIf no end time is set, the test will not stop automatically. You need to stop it manually.\nFor example, if the start daily 12:00:00 to 13:00:00 begin 2009/10/19 end 2010/10/20 command is run to configure an ICMP test instance to run once between 12:00 to 13:00 each day, and the\nfrequency 1200 command is run to set the interval to 1200 seconds, the start time of the ICMP test instance can be:\n12:00, at which the ICMP test is automatically performed for the first time12:20, at which the ICMP test is automatically performed for the second time12:40, at which the ICMP test is automatically performed for the third time13:00, at which the ICMP test is automatically performed for the fourth time\nIf the interval at which an NQA test instance is automatically performed is set, you do not need to perform the NQA test instance manually.\n\nConfiguration Impact\nIf an active/standby switchover is performed on the NQA client before the test instance is complete, any of the following situations may occur:\nIf the interval at which a test instance is automatically performed is not set, the test instance stops after the active/standby switchover is complete.If the interval at which a test instance is automatically performed is set, the test instance will be performed from the next period after the active/standby switchover is complete.\n\nPrecautions\nThe interval at which the test is automatically performed must be greater than the one specified using the timeout command. Otherwise, packets will time out.\nIf parameters need to be changed during the running of the test instance, the system prompts you whether to terminate the test instance. Press \"Y\" or \"N\" as required.\nIf you press \"Y\", the test instance is terminated and parameters changed. The changed parameters take effect after the commit command is run. To restart the test instance, run the start command.If you press \"N\", the test instance keeps running, and the parameters fail to be modified.\nIf the configured frequency is less than or equal to (number of sent packets - 1) x interval + timeout + 1, the test result may be no result. For the test instance supporting the jitter-packetnum parameter, the number of sent packets is probe-count x jitter-packetnum packets."
}