{
    "PageTitle": "receive-timestamp-unit",
    "FuncDef": "The receive-timestamp-unit command sets the unit of the destination's timestamp in an NQA test instance.\nThe undo receive-timestamp-unit command restores the default configuration.\nBy default, the unit of the destination's timestamp in an NQA test instance is not configured. In this case, the unit is negotiated.",
    "CLIs": [
        "receive-timestamp-unit microsecond",
        "receive-timestamp-unit millisecond",
        "undo receive-timestamp-unit"
    ],
    "ParentView": [
        "NQA view"
    ],
    "ParaDef": [
        {
            "Parameters": "millisecond",
            "Info": "Sets the timestamp's unit to milliseconds.\n-"
        },
        {
            "Parameters": "microsecond",
            "Info": "Sets the timestamp's unit to microseconds.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nqa test-instance user test",
            "[*HUAWEI-nqa-user-test] test-type icmpjitter",
            "[*HUAWEI-nqa-user-test] hardware-based enable",
            "[*HUAWEI-nqa-user-test] receive-timestamp-unit microsecond"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn a scenario where a Huawei device is connected to a non-Huawei device, an ICMP jitter test in which the Huawei device functions as the source (client) is configured to detect the delay, jitter, and packet loss on the network. To set the timestamp unit of the ICMP timestamp packet returned by the destination, run the receive-timestamp-unit command.\nPrerequisites\nHardware-based packet forwarding has been enabled using the hardware-based enable command.\nPrecautions\nThe receive-timestamp-unit command applies only to ICMP jitter test instances.\nThe source's timestamp unit configured using the timestamp-unit { millisecond | microsecond } command must be the same as the destination's timestamp unit configured using the receive-timestamp-unit command. If the timestamp unit is set to microseconds and the interface board's precision that the device supports is milliseconds, the device uses milliseconds as the timestamp unit."
}