{
    "PageTitle": "lsp-type (LSP ping test instance)",
    "FuncDef": "The lsp-type command specifies an LSP test type for an LSP Ping test instance.\nThe undo lsp-type command restores the default LSP test type.\nBy default, the LSP test type is ipv4.",
    "CLIs": [
        "lsp-type ipv4",
        "lsp-type te",
        "lsp-type bgp",
        "lsp-type srte",
        "lsp-type srbe",
        "lsp-type srte-policy",
        "undo lsp-type"
    ],
    "ParentView": [
        "NQA view"
    ],
    "ParaDef": [
        {
            "Parameters": "te",
            "Info": "Indicates that the TE tunnel is the test type of an LSP ping or traceroute test instance.\n-"
        },
        {
            "Parameters": "bgp",
            "Info": "Indicates that the BGP tunnel is the test type of an LSP ping or traceroute test instance.\n-"
        },
        {
            "Parameters": "srte",
            "Info": "Indicates that the SR-MPLS TE tunnel is the test type of an LSP ping or traceroute test instance.\n-"
        },
        {
            "Parameters": "srbe",
            "Info": "Indicates that the SR-MPLS BE tunnel is the test type of an LSP ping or traceroute test instance.\n-"
        },
        {
            "Parameters": "srte-policy",
            "Info": "Indicates that the SR-MPLS BE policy tunnel is the test type of an LSP ping or traceroute test instance.\n-"
        },
        {
            "Parameters": "ipv4",
            "Info": "Indicates that IPv4 is the test type of an LSP ping or traceroute test instance.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nqa test-instance user test",
            "[*HUAWEI-nqa-user-test] test-type lspping",
            "[*HUAWEI-nqa-user-test] lsp-type ipv4"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo specify a test type of an NQA LSP test instance, run the lsp-type command so that the test instance can monitor the connectivity of an LDP LSP or a TE tunnel.\nIf ipv4 is configured, the NQA test instance monitors the connectivity of a specified LDP LSP. The destination address of the test instance is configured using the destination-address command.If te is configured, the NQA test instance monitors the connectivity of a TE tunnel. The destination address of the test instance is configured using the lsp-tetunnel command.If bgp is configured, the NQA test instance monitors the connectivity of a BGP tunnel. The destination address of the test instance is configured using the destination-address command.If srte is configured, the NQA test instance monitors the connectivity of an SR-MPLS TE tunnel. The destination address of the test instance is configured using the lsp-tetunnel command.If srbe is configured, the NQA test instance monitors the connectivity of an SR-MPLS BE tunnel. The destination address of the test instance is configured using the destination-address command.If srte-policy is configured, the NQA test instance monitors the connectivity of an SR-MPLS TE policy tunnel. The destination address of the test instance is configured using the policy command.\n\nPrerequisites\nAn LSP test instance has been configured.\nPrecautions\nIf parameters need to be changed during the running of the test instance, the system prompts you whether to terminate the test instance. Press \"Y\" or \"N\" as required.\nIf you press \"Y\", the test instance is terminated and parameters changed. The changed parameters take effect after the commit command is run. To restart the test instance, run the start command.If you press \"N\", the test instance keeps running, and the parameters fail to be modified."
}