{
    "PageTitle": "probe-failtimes (Mac Ping test instance)",
    "FuncDef": "The probe-failtimes command sets a threshold for the number of consecutive probe failures in an NQA MAC ping test instance. Once this threshold is reached, a trap is sent to the NMS.\nThe undo description command restores the default threshold for the number of consecutive probe failures in an NQA MAC ping test instance.\nBy default, a trap is sent for each probe failure.",
    "CLIs": [
        "probe-failtimes <probeFailTimes>",
        "undo probe-failtimes"
    ],
    "ParentView": [
        "NQA view"
    ],
    "ParaDef": [
        {
            "Parameters": "probeFailTimes",
            "Info": "Specifies the number of consecutive probe failures in an NQA test instance.\nThe value is an integer from 1 to 15."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nqa test-instance user test",
            "[*HUAWEI-nqa-user-test] test-type macping",
            "[*HUAWEI-nqa-user-test] probe-failtimes 10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAn NQA test checks whether response packets are received in a probe. If no response to a probe packet is received, the probe fails. When the number of consecutive probe failures in an NQA test instance reaches the specified threshold, a trap is sent to the NMS.\nPrerequisites\nThe type of an NQA test instance has been specified using the test-type command.\nFollow-up Procedure\nAfter the probe-failtimes command is executed, run the send-trap probefailure command to enable the system to send traps to the NMS after the number of consecutive probe failures reaches the specified threshold.\nPrecautions\nIf you change a TTL propagation mode for the local PE during the running of a test instance, the system displays a message, asking you whether to stop the test instance. You can press \"Y\" or \"N\" as required.\nIf you press \"Y\", the system stops the test instance and changes the PW ID for the local PE. After you run the commit command, the change takes effect. To restart the test instance, run the start command.If you press \"N\", the test instance keeps running, and the TTL propagation mode fails to be modified."
}