{
    "PageTitle": "nqa-server icmp-server",
    "FuncDef": "The nqa-server icmp-server command specifies an Internet Control Messages Protocol (ICMP) server for an NQA test.\nThe undo nqa-server icmp-server command deletes the ICMP server for an NQA test.\nBy default, no ICMP server is configured for an NQA test.",
    "CLIs": [
        "nqa-server icmp-server <ip-address>",
        "nqa-server icmp-server vpn-instance <vpn-instance-name> <ip-address>",
        "undo nqa-server icmp-server <ip-address>",
        "undo nqa-server icmp-server vpn-instance <vpn-instance-name> <ip-address>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address",
            "Info": "Specifies the IP address of ICMP services monitored by the NQA server.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies the name of a VPN instance to which the ICMP server belongs.\nThe value is a string of 1 to 31 case-sensitive characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nqa-server icmp-server 10.1.1.1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn an ICMP jitter instance using the mechanism that an interface board sends packets, the hardware forwarding engine is used to send packets and add timestamps to the packets to collect statistics about the delay, jitter and packet loss ratio. You need to configure the IP address of the monitored ICMP service on the NQA server. The server with the specified IP address can then respond to NQA probe packets.\nTo specify the destination IP address of the NQA test instance, run the destination-address command. The destination IP address is the same as the ICMP server IP address configured using the nqa-server icmp-server command.\nIf the client and server are connected using a VPN, specify the VPN instance name.\nPrecautions\nAn ICMP server can be specified only for jitter test instances using the mechanism that an interface board sends packets."
}