{
    "PageTitle": "nqa-server udpecho",
    "FuncDef": "The nqa-server udpecho command configures a UDP server for an NQA test instance.\nThe undo nqa-server udpecho command deletes a UDP server for an NQA test instance.\nBy default, no UDP server is configured for an NQA test.",
    "CLIs": [
        "nqa-server udpecho { <ip-address> | ipv6 <ipv6-address> } <port-number>",
        "nqa-server udpecho vpn-instance <vpn-instance-name> { <ip-address> | ipv6 <ipv6-address> } <port-number>",
        "undo nqa-server udpecho { <ip-address> | ipv6 <ipv6-address> } <port-number>",
        "undo nqa-server udpecho vpn-instance <vpn-instance-name> { <ip-address> | ipv6 <ipv6-address> } <port-number>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address",
            "Info": "Specifies the IP address of the NQA server for monitoring UDP services.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "ipv6 ipv6-address",
            "Info": "Specifies the IPv6 address of the NQA server for monitoring UDP services.\nThe address is a 32-bit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "port-number",
            "Info": "Specifies the port number of the NQA server for monitoring UDP services.\nThe value is integer ranging from 1 to 65535. The well-known port number is not recommended."
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies the name of a VPN instance to which the UDP server belongs.\nThe value is a string of 1 to 31 case-sensitive characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vpn1",
            "[*HUAWEI-vpn-instance-vpn1] quit",
            "[*HUAWEI] nqa-server udpecho vpn-instance vpn1 10.10.10.2 2000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo specify an NQA server for a UDP jitter test instance or a UDP test instance, run the nqa-server udpecho command. The UDP server responds to probe packets initiated by an NQA client.\nConfiguration Impact\nIf no UDP server is configured, the NQA client will receive no response to probe packets within the timeout period. Then, all UDP jitter test instances or UDP test instances will fail."
}