{
    "PageTitle": "nqa reflector",
    "FuncDef": "The nqa reflector command configures the reflector of a generalflow or Ethernet service activation test instance.\nThe undo nqa reflector command deletes the reflector.\nBy default, no reflector is configured.",
    "CLIs": [
        "nqa reflector <reflector-id> interface { <interface-name> | <interface-type> <interface-number> } [ [ [ test-flow { <testFlowId> } &<1-16> ] | [ [ ipv4 <ip-address> | simulate-ip ipv4 <ip-address2> | mac <mac-address> ] [ pe-vid <pe-vid> ce-vid <ce-vid> | vlan <vlan-id> ] [ source-port <source-port> ] [ destination-port <destination-port> ] ] ] | exclusive ] [ exchange-port ] [ agetime <agetime> | endtime { endtime | <enddate> endtime } ]",
        "nqa reflector <reflector-id> interface { <interface-name> | <interface-type> <interface-number> } [ ipv4 <ip-address> | simulate-ip ipv4 <ip-address2> | mac <mac-address> ] [ pe-vid <pe-vid> ce-vid <ce-vid> | vlan <vlan-id> ] [ source-port <source-port> ] [ destination-port <destination-port> ] [ exchange-port ] [ agetime <agetime> | endtime { endtime | <enddate> endtime } ] [ share-mode ]",
        "undo nqa reflector <reflector-id>",
        "undo nqa reflector all"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "reflector-id",
            "Info": "Specifies the ID of a reflector.\nThe ID must be unique on a local node.\nThe value is an integer ranging from 1 to 65535."
        },
        {
            "Parameters": "interface interface-name",
            "Info": "Specifies the name of a reflector interface. The interface is a specified User-to-Network Interface (UNI).\n-"
        },
        {
            "Parameters": "interface-type",
            "Info": "Specifies the type of a reflector interface. The interface is a specified User-to-Network Interface (UNI).\n-"
        },
        {
            "Parameters": "interface-number",
            "Info": "Specifies the number of a reflector interface. The interface is a specified User-to-Network Interface (UNI).\n-"
        },
        {
            "Parameters": "test-flow testFlowId",
            "Info": "Specifies the ID of a test flow bound to a reflector.\nThis parameter is configured only in an NQA Ethernet service activation test instance.\nThe value is an integer ranging from 1 to 65535."
        },
        {
            "Parameters": "ipv4 ip-address",
            "Info": "Specifies the simulated IP address used by an IP gateway network.\nThe simulated IP address is set to a local CE address or an IP address on the same network segment with the local CE. The simulated IP address is used to send gratuitous ARP packets.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "ipv4 ip-address2",
            "Info": "Specifies the simulated IP address used by an IP gateway network.\nThe simulated IP address is set to the local CE address or an IP address on the same network segment with the local CE.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "simulate-ip",
            "Info": "Specifies the simulated IP address used by an IP gateway network.\n-"
        },
        {
            "Parameters": "mac mac-address",
            "Info": "Specifies the MAC address of packets in a Layer 2 scenario.\nThe value is equal to the destination MAC address configured on the initiator. The MAC address of the UNI of the reflector can be used.\nThe value is a 12-digit hexadecimal number, in the format of H-H-H. Each H is 4 digits. If an H contains fewer than 4 digits, the left-most digits are padded with zeros. For example, e0 is displayed as 00e0. The MAC address cannot be set to FFFF-FFFF-FFFF or a multicast address starting with 01."
        },
        {
            "Parameters": "pe-vid pe-vid",
            "Info": "Specifies the outer VLAN ID.\nThe value is an integer ranging from 1 to 4094."
        },
        {
            "Parameters": "ce-vid ce-vid",
            "Info": "Specifies the inner VLAN ID.\nThe value is an integer ranging from 1 to 4094."
        },
        {
            "Parameters": "vlan vlan-id",
            "Info": "Specifies the VLAN ID of packets in a Layer 2 scenario.\nThe configuration on the reflector must be the same as that on the initiator.\nThe value is an integer ranging from 1 to 4094."
        },
        {
            "Parameters": "source-port source-port",
            "Info": "Specifies the number of a source port of a reflector.\nThe source port number on the reflector must be the same as the destination port number on the initiator. This parameter is configured when a Huawei device is connected to a non-Huawei device.\nThe value is an integer ranging from 0 to 65535. The default value is 49184."
        },
        {
            "Parameters": "destination-port destination-port",
            "Info": "Specifies the number of a destination port of a reflector.\nThe destination port number on the reflector must be the same as the source port number on the initiator. This parameter is configured when a Huawei device is connected to a non-Huawei device.\nThe value is an integer ranging from 0 to 65535. The default value is 7."
        },
        {
            "Parameters": "exclusive",
            "Info": "Configures the reflector's port to work in exclusive mode.\n-"
        },
        {
            "Parameters": "exchange-port",
            "Info": "Enables the reflector to exchange the UDP source and destination power numbers in filtered packets before looping the packets back.\nIf an NQA Ethernet service activation test instance is performed, this parameter is necessary. If a generalflow test instance is performed, this parameter is optional.\n-"
        },
        {
            "Parameters": "agetime agetime",
            "Info": "Specifies the aging time of the reflector.\nAfter the aging time elapses, the reflector is automatically deleted.\nThe value can be 0 or an integer ranging from 10 to 173400, in seconds. The default value is 14400. The value 0 indicates that the reflector never ages."
        },
        {
            "Parameters": "endtime",
            "Info": "Indicates the end time on the reflector.\n-"
        },
        {
            "Parameters": "endtime",
            "Info": "Specifies the end time on the reflector.\nThe value is in the format of HH:MM:SS. The value of HH ranges from 0 to 23 and the values of MM and SS range from 0 to 59."
        },
        {
            "Parameters": "enddate",
            "Info": "Specifies the end date on the reflector.\nThe value is in the format of YYYY/MM/DD. The value of YYYY ranges from 2000 to 2099, the value of MM ranges from 1 to 12, and the value of DD ranges from 1 to 31."
        },
        {
            "Parameters": "share-mode",
            "Info": "Specifies the type of traffic filtered by the reflector. If you configure the share-mode keyword, test flows and non-test flows are reflected.\n-"
        },
        {
            "Parameters": "all",
            "Info": "Delete all NQA reflectors.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nqa reflector 1 interface GigabitEthernet 1/0/1 ipv4 10.1.1.1 agetime 180"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nDevices performing an NQA test play two roles: initiator and reflector. An initiator sends simulated service traffic to a reflector, and the reflector reflects the service traffic. The reflector can reflect all packets on a reflector port or reflect packets matching filter conditions, such as a destination MAC address or a port number. If exclusive is specified for a port, the reflector will reflect all packets received by the port.\nNote the following issues for an Ethernet service activation test:\nIf no MAC or IP address is specified, a reflector configured on a UNI loops all packets that the UNI receives without filtering packets.If the test-flow parameter is configured, the reflector filters packets and loops only packet matching the configured test flow packet characters.If the exchange-port parameter is configured, the reflector exchanges the UDP source and destination port numbers in packets and then loops the packets back.\n\nPrecautions\nThe following parameter combinations for a reflector configured on a device are unique and cannot be configured for another reflector or generalflow test or Ethernet service activation test instance on the same device:\ninterface name + PE VID + CE VIDinterface name + VLAN ID\nYou cannot change this configuration of a running test instance."
}