{
    "PageTitle": "nqa-server tcpconnect",
    "FuncDef": "The nqa-server tcpconnect command specifies a TCP server for an NQA test instance.\nThe undo nqa-server tcpconnect command deletes a TCP server for an NQA test instance.\nBy default, no TCP server is configured for an NQA test.",
    "CLIs": [
        "nqa-server tcpconnect <ip-address> <port-number>",
        "nqa-server tcpconnect vpn-instance <vpn-instance-name> <ip-address> <port-number>",
        "undo nqa-server tcpconnect <ip-address> <port-number>",
        "undo nqa-server tcpconnect vpn-instance <vpn-instance-name> <ip-address> <port-number>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address",
            "Info": "Specifies the IP address monitored by the TCP server.\nIt is in dotted decimal notation."
        },
        {
            "Parameters": "port-number",
            "Info": "Specifies the number of the port monitored by the TCP server.\nThe value is integer ranging from 1 to 65535. The well-known port number is not recommended."
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies a VPN instance to which the TCP server belongs.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vsi",
            "[*HUAWEI-vpn-instance-vsi] quit",
            "[*HUAWEI] nqa-server tcpconnect vpn-instance vsi 10.10.10.1 2000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBoth the server and client need to be configured before starting NQA TCP test instances. Otherwise, a test instance cannot be started.\nConfigurations about the server that are performed on the client are as follows:\nRun the destination-port command to configure the destination port number for an NQA test instance. The client can access the server through the port specified using port-number.Run the destination-address command on the client to configure the destination IP address for an NQA test instance. The server is enabled to monitor the IP address specified using ip-address.If the client and server are connected using a VPN, run the vpn-instance command to specify a VPN instance.\n\nPrerequisites\nA TCP server has been configured."
}