{
    "PageTitle": "nqa upload",
    "FuncDef": "The nqa upload command enables a device to upload test result files onto a specified server.\nThe undo nqa upload command disables a device from uploading test result files onto a specified server.\nBy default, a device is disabled from uploading test result files onto a specified server.",
    "CLIs": [
        "nqa upload test-type { icmp | icmpjitter | jitter | udp } ftp ipv4 <ipv4-address> file-name <file-name> [ vpn-instance <vpn-instance-name> ] [ port <port-number> ] username <user-name> password <password> [ interval <upload-interval> ] [ retry <retry-times> ]",
        "undo nqa upload test-type { icmp | icmpjitter | jitter | udp }"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "icmp",
            "Info": "Indicates the NQA test type ICMP.\n-"
        },
        {
            "Parameters": "icmpjitter",
            "Info": "Indicates the NQA test type ICMPJitter.\n-"
        },
        {
            "Parameters": "jitter",
            "Info": "Indicates the NQA test type Jitter.\n-"
        },
        {
            "Parameters": "udp",
            "Info": "Indicates the NQA test type UDP.\n-"
        },
        {
            "Parameters": "ftp",
            "Info": "Indicates an FTP server.\n-"
        },
        {
            "Parameters": "ipv4 ipv4-address",
            "Info": "Specifies a destination IPv4 address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "file-name file-name",
            "Info": "Specifies the name of a file generated.\nThe value is a string of 1 to 64 characters. The file name cannot contain characters \\, /, :, ~, \", ', ?, *, [, ], <, >, |, (, ), &, ;, !, $. Spaces can be used only at the beginning or end of the file name."
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies the name of a VPN instance to which a server belongs.\nThe value is a string of 1 to 31 characters."
        },
        {
            "Parameters": "port port-number",
            "Info": "Specifies the listening port number of a specified server.\nThe value is an integer ranging from 1 to 65535. The default value 21."
        },
        {
            "Parameters": "username user-name",
            "Info": "Specifies the number of a user device connected to a server.\nThe value is a string of 1 to 255 case-sensitive characters, spaces not supported.\nThe string can contain spaces if it is enclosed in double quotation marks (\")."
        },
        {
            "Parameters": "password password",
            "Info": "Specifies a password.\nThe value is a case-sensitive string of 1 to 16 characters without such metacharacters as spaces and question marks. The length of a simple test password ranges from 1 to 32 characters, and that of an AES ciphertext password ranges from 32 to 168 characters.\nThe string can contain spaces if it is enclosed in double quotation marks (\")."
        },
        {
            "Parameters": "interval upload-interval",
            "Info": "Specifies an interval at which test results are sent to a server.\nThe value is an integer ranging from 60 to 4294967295, in seconds. The default value is 300."
        },
        {
            "Parameters": "retry retry-times",
            "Info": "Specifies the number of retransmission times.\nThe value is an integer ranging from 1 to 3. The default value is 3."
        },
        {
            "Parameters": "test-type",
            "Info": "Indicates an NQA test type.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nqa upload test-type udp ftp ipv4 10.1.1.10 file-name test1 port 21 username a password a interval 600 retry 3"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe result table of NQA test instances records results of each test type. A maximum of 5000 test result records are supported in total. If the number of records reaches 5000, test results are uploaded. Intervals can be configured for each test type to upload test results. To write the test results into a file and upload the file onto a specified server, run the nqa upload command. This allows you to query the test results saved on the server.\nPrecautions\nIf this command with the same test type specified is run several times, the latest configuration overwrites the previous one, and all test results recorded but not uploaded are deleted.\nAfter a test instance is deleted, all the corresponding test results recorded but not uploaded are deleted.\nThe name of a file to be uploaded is in the format of NQA_MAC address_Test instance type_Character string of the timestamp_File name configured.xml. The .xml file type does not need to be configured."
}