{
    "PageTitle": "nqa vxlanecho enable",
    "FuncDef": "The nqa vxlanecho enable command enables VXLAN ping/tracert.\nThe undo nqa vxlanecho enable command disables VXLAN ping/tracert.\nBy default, VXLAN ping/tracert is disabled.",
    "CLIs": [
        "nqa vxlanecho enable udp-port <udpPort> [ source-ip-interface { <ifName> | <ifType> <ifNum> } ]",
        "undo nqa vxlanecho enable udp-port <udpPort> [ source-ip-interface { <ifName> | <ifType> <ifNum> } ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "source-ip-interface ifName",
            "Info": "Specifies the name of an interface where the source IP address of the VXLAN echo request and response packets resides.\nBy default, no IP address and interface is specified.\n-"
        },
        {
            "Parameters": "ifType",
            "Info": "Specifies the type of an interface where the source IP address of the VXLAN echo request and response packets resides.\nBy default, no IP address and interface is specified.\n-"
        },
        {
            "Parameters": "ifNum",
            "Info": "Specifies the number of an interface where the source IP address of the VXLAN echo request and response packets resides.\nBy default, no IP address and interface is specified.\n-"
        },
        {
            "Parameters": "udp-port udpPort",
            "Info": "Specifies a listening port number of the VXLAN server for the NQA test.\nThe value is an integer ranging from 1 to 65535."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nqa vxlanecho enable udp-port 2000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe VXLAN echo capability needs to be enabled and the VXLAN echo listening port number needs to be configured on the responder when the ping vxlan or tracert vxlan operation is required.\nWhen you configure the source IP interface, if you do not specify the source IP address when running the ping vxlan or tracert vxlan command, the source IP address of the request packet is obtained from this interface. The source IP address of the response packet is obtained from the interface.\nConfiguration Impact\nIf the VXLAN echo listening port number is not configured on the responder, the ping vxlan and tracert vxlan configuration initiated by the initiator will time out and fail.\nIf the VXLAN echo listening port number is not enabled on the initiator, the initiator fails to initiate a ping or tracert test when the replyMode is set to 3."
}