{
    "PageTitle": "source-interface (Path MTU test instance)",
    "FuncDef": "The source-interface command specifies a source interface for an NQA test instance of Path MTU test.\nThe undo source-interface command deletes the source interface for an NQA test instance of Path MTU test.\nBy default, no source interface is specified for an NQA test instance.",
    "CLIs": [
        "source-interface { <ifName> | <ifType> <ifNum> }",
        "undo source-interface"
    ],
    "ParentView": [
        "NQA view"
    ],
    "ParaDef": [
        {
            "Parameters": "ifName",
            "Info": "Specifies the name of a source interface.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "ifType",
            "Info": "Specifies the type of a source interface.\n-"
        },
        {
            "Parameters": "ifNum",
            "Info": "Specifies the number of a source interface.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nqa test-instance user test",
            "[*HUAWEI-nqa-user-test] test-type pathmtu",
            "[*HUAWEI-nqa-user-test] source-interface GigabitEthernet 1/0/0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe source-interface command specifies a source interface for an NQA test instance.\nThe source-interface command is applicable to the following scenarios:\nIf both a source IP address and a source interface are specified for an NQA test instance, test packets are sent through the specified source interface.If no source IP address is specified, the IP address of the source interface is used as the source IP address of the NQA test instance. In this case, the test packets are sent and received on the source interface configured using the source-interface command.\n\nPrerequisites\nThe specified source interface is Up.\nPrecautions\nIf parameters need to be changed during the running of the test instance, the system prompts you whether to terminate the test instance. Press \"Y\" or \"N\" as required.\nIf you press \"Y\", the test instance is terminated and parameters changed. The changed parameters take effect after the commit command is run. To restart the test instance, run the start command.If you press \"N\", the test instance keeps running, and the parameters fail to be modified."
}