{
    "PageTitle": "jitter-packetnum (Path Jitter test instance)",
    "FuncDef": "The jitter-packetnum command sets the number of the packets sent each time in a probe for Path Jitter test.\nThe undo jitter-packetnum command restores the default number of the packets sent each time in a probe.\nBy default, 20 packets are sent each time in a probe.",
    "CLIs": [
        "jitter-packetnum <packetNum>",
        "undo jitter-packetnum"
    ],
    "ParentView": [
        "NQA view"
    ],
    "ParaDef": [
        {
            "Parameters": "packetNum",
            "Info": "Specifies the number of packets sent each time in a probe.\nThe value is an integer ranging from 1 to 3000."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nqa test-instance user test",
            "[*HUAWEI-nqa-user-test] test-type pathjitter",
            "[*HUAWEI-nqa-user-test] probe-count 3",
            "[*HUAWEI-nqa-user-test] jitter-packetnum 1000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen a jitter test instance is used to monitor VoIP services, to set the number of the packets sent each time in a probe, run the jitter-packetnum command. The test simulates actual traffic within a specified period of time.\nThe jitter-codec command can also be used to simulate VoIP services. The jitter-packetnum command with a parameter configured, however, can implement more finely granular simulation. In addition, the jitter-packetnum command sets the number of packets to be sent for all services, which is widely applied.\nConfiguration Impact\nIf a code type has been configured, running the jitter-packetnum command overrides the configured code type.\nPrecautions\nIf parameters need to be changed during the running of the test instance, the system prompts you whether to terminate the test instance. Press \"Y\" or \"N\" as required.\nIf you press \"Y\", the test instance is terminated and parameters changed. The changed parameters take effect after the commit command is run. To restart the test instance, run the start command.If you press \"N\", the test instance keeps running, and the parameters fail to be modified."
}