{
    "PageTitle": "step (NQA view)",
    "FuncDef": "The step command sets the incremental step for the packet length in a path MTU test.\nThe undo step command deletes the current incremental step.\nBy default, the incremental step for the packet length is 10 bytes.",
    "CLIs": [
        "step <step>",
        "undo step"
    ],
    "ParentView": [
        "NQA view"
    ],
    "ParaDef": [
        {
            "Parameters": "step",
            "Info": "Specifies the step value of a path MTU.\nThe value is an integer ranging from 1 to 512, in bytes."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nqa test-instance pathmtu pathmtu",
            "[*HUAWEI-test-pathmtu-pathmtu] test-type pathmtu",
            "[*HUAWEI-test-pathmtu-pathmtu] step 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nNQA path MTU test instances are used to check the path MTU. In a path MTU test instance, the initial size of a test packet is 28 bytes (excluding the IP header). If a reply packet is received and the size of the packet does not exceed the specified maximum MTU, a second probe is required. In the second probe, a step is incremented to the packet sent in the first probe so that the size of this test packet is the size of 28 bytes plus a step.\nThe step command sets the incremental step for the packet length in a path MTU test.\nPrerequisites\nThe incremental step is supported only in path MTU test instances.\nConfiguration Impact\nIf you set the step to 1, you can check the maximum MTU from the source to the destination. This process, however, takes a long time.\nPrecautions\nIf parameters need to be changed during the running of the test instance, the system prompts you whether to terminate the test instance. Press \"Y\" or \"N\" as required.\nIf you press \"Y\", the test instance is terminated and parameters changed. The changed parameters take effect after the commit command is run. To restart the test instance, run the start command.If you press \"N\", the test instance keeps running, and the parameters fail to be modified."
}