{
    "PageTitle": "probe-failtimes (ICMP Ping test instance)",
    "FuncDef": "The probe-failtimes command sets a threshold for the number of consecutive probe failures in an NQA ICMP Ping test instance. Once this threshold is reached, a trap is sent to the NMS.\nThe undo description command restores the default threshold for the number of consecutive probe failures in an NQA ICMP Ping test instance.\nBy default, a trap is sent for each probe failure.",
    "CLIs": [
        "probe-failtimes <failTimes>",
        "undo probe-failtimes"
    ],
    "ParentView": [
        "NQA view"
    ],
    "ParaDef": [
        {
            "Parameters": "failTimes",
            "Info": "Specifies the threshold for the number of consecutive probe failures in an NQA test instance.\nThe value is an integer ranging from 1 to 15. The default value is 1."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nqa test-instance user test",
            "[*HUAWEI-nqa-user-test] test-type icmp",
            "[*HUAWEI-nqa-user-test] probe-failtimes 10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAn NQA test checks whether response packets are received in a probe. If no response to a probe packet is received, the probe fails. When the number of consecutive probe failures in an NQA test instance reaches the specified threshold, a trap is sent to the NMS.\nPrerequisites\nThe type of an NQA test instance has been specified using the test-type command.\nFollow-up Procedure\nAfter the probe-failtimes command is executed, run the send-trap probefailure command to enable the system to send traps to the NMS after the number of consecutive probe failures reaches the specified threshold.\nPrecautions\nIf parameters need to be changed during the running of the test instance, the system prompts you whether to terminate the test instance. Press \"Y\" or \"N\" as required.\nIf you press \"Y\", the test instance is terminated and parameters changed. The changed parameters take effect after the commit command is run. To restart the test instance, run the start command.If you press \"N\", the test instance keeps running, and the parameters fail to be modified."
}