{
    "PageTitle": "interval (PWE3 Ping test instance)",
    "FuncDef": "The interval command sets the interval at which PWE3 Ping test packets are sent.\nThe undo interval command restores the default interval.\nBy default, the interval is 4 seconds.",
    "CLIs": [
        "interval seconds interval",
        "undo interval"
    ],
    "ParentView": [
        "NQA view"
    ],
    "ParaDef": [
        {
            "Parameters": "seconds interval",
            "Info": "Specifies the interval at which test packets are sent, in seconds.\nThe value is an integer that ranges from 1 to 60, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nqa test-instance user test",
            "[*HUAWEI-nqa-user-test] test-type pwe3ping",
            "[*HUAWEI-nqa-user-test] interval seconds 30"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe probe-count command sets the number of probes to be sent for an NQA test instance. Based on statistics about these probes, you can evaluate network quality. To set the interval at which test packets are sent in each probe, run the interval command.\nOn networks with poor quality, the interval at which test packets are sent must be long; otherwise, performing jitter test instances deteriorates the network quality.On networks with good quality, the interval at which test packets are sent can be short, because test instances do not take long.\n\nConfiguration Impact\nThe interval at which test packets are sent must be longer than or equal to the timeout period specified using the timeout command.\nIf the interval at which test packets are sent has been configured, running the interval command overrides the configured interval.\nPrecautions\nIf parameters need to be changed during the running of the test instance, the system prompts you whether to terminate the test instance. Press \"Y\" or \"N\" as required.\nIf you press \"Y\", the test instance is terminated and parameters changed. The changed parameters take effect after the commit command is run. To restart the test instance, run the start command.If you press \"N\", the test instance keeps running, and the parameters fail to be modified."
}