{
    "PageTitle": "ttl-copymode (PWE3 ping test instance)",
    "FuncDef": "The ttl-copymode command specifies a TTL propagation mode for multi-segment PW detection in an NQA PWE3 ping test instance.\nThe undo ttl-copymode command deletes the TTL propagation mode configured in the NQA view.\nBy default, the TTL propagation mode configured using the mpls ldp ttl-mode command is used.",
    "CLIs": [
        "ttl-copymode <ttlModeVal>",
        "undo ttl-copymode"
    ],
    "ParentView": [
        "NQA view"
    ],
    "ParaDef": [
        {
            "Parameters": "ttlModeVal",
            "Info": "Specifies the TTL propagation mode.\nPipe or Uniform."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nqa test-instance admin pwe3",
            "[*HUAWEI-nqa-admin-pwe3] test-type pwe3ping",
            "[*HUAWEI-nqa-admin-pwe3] ttl-copymode pipe"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen you monitor a multi-segment PW, you can run the ttl-copymode command to control the TTL values in labels.\nThe system differently processes TTL values in either pipe or uniform propagation mode.If you set the propagation mode to pipe, the system removes the outer label, decreases the TTL value in the inner label by 1, and sets the TTL value in the outer label to 255 after receiving a packet.If you set the propagation mode to uniform, the system copies the TTL value in the outer label to the inner label, decreases the TTL value in the inner label by 1, and sets the TTL value in the outer label to the TTL value in the inner label after receiving a packet.\nPrecautions\nIf you change a TTL propagation mode for the local PE during the running of a test instance, the system displays a message, asking you whether to stop the test instance. You can press \"Y\" or \"N\" as required.\nIf you press \"Y\", the system stops the test instance and changes the PW ID for the local PE. After you run the commit command, the change takes effect. To restart the test instance, run the start command.If you press \"N\", the test instance keeps running, and the TTL propagation mode fails to be modified."
}