{
    "PageTitle": "source-port (SNMP test instance)",
    "FuncDef": "The source-port command sets the source port number for an NQA SNMP test instance.\nThe undo source-port command restores the default source port number.\nBy default, the source port number is 0, and the system automatically allocates the port number.",
    "CLIs": [
        "source-port <portValue>",
        "undo source-port"
    ],
    "ParentView": [
        "NQA view"
    ],
    "ParaDef": [
        {
            "Parameters": "portValue",
            "Info": "Specifies the source port number for an NQA test instance.\nThe value is an integer that ranges from 1 to 65535."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nqa test-instance user test",
            "[*HUAWEI-nqa-user-test] test-type snmp",
            "[*HUAWEI-nqa-user-test] source-port 2000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo set the source port number for an NQA test instance, run the source-port command.\nIf no source port number is set for an NQA test instance, a port is randomly selected to send and receive test packets.If a source port number is set for an NQA test instance, the set source port is used to send and receive test packets.\nSpecifying the source port number allows NQA test packets to be sent and received in a standard manner and prevents NQA test packets from being filtered out by ACL rules.\n\nPrerequisites\nThe source port configured with the source-port command must be a valid port. Otherwise, the test fails.\nPrecautions\nIf parameters need to be changed during the running of the test instance, the system prompts you whether to terminate the test instance. Press \"Y\" or \"N\" as required.\nIf you press \"Y\", the test instance is terminated and parameters changed. The changed parameters take effect after the commit command is run. To restart the test instance, run the start command.If you press \"N\", the test instance keeps running, and the parameters fail to be modified."
}