{
    "PageTitle": "destination-port (TCP test instance view)",
    "FuncDef": "The destination-port command can configure the destination port number of an NQA test instance of TCP test type.\nThe undo destination-port command can restore the default setting.\nBy default, the destination port number of a TCP test instance is 7.",
    "CLIs": [
        "destination-port <port-number>",
        "undo destination-port"
    ],
    "ParentView": [
        "NQA view"
    ],
    "ParaDef": [
        {
            "Parameters": "port-number",
            "Info": "Specifies the destination port number (UDP port) of an NQA test instance.\nThe value is an integer from 1 to 65535."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nqa test-instance user test",
            "[*HUAWEI-nqa-user-test] test-type tcp",
            "[*HUAWEI-nqa-user-test] destination-port 2000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nNQA detects service features by creating test instances. In NQA, two test ends are called an NQA client and an NQA server. An NQA test is initiated by the NQA client. After test instances are configured through commands on the client, NQA places different types of test instances into various test queues. After the test starts, a response packet is returned. Carriers can then know the operating status about protocols by analyzing the received response packet.\nFor a test instance, the port for accessing the server is specified through the destination port number configured with the destination-port command on the client.\nFor example, if you need to detect whether the TCP service runs normally on the peer device through a TCP test instance, perform the following configurations:\nOn the server: Configure the TCP server used for NQA tests, including the client IP addresses that are supported and the TCP port number opened to the client.\nOn the client:\nCreate an NQA test instance and configure its type as TCP.Configure the IP address of the server as the destination IP address and configure the opened TCP port number on the server as the destination port number.Start the test instance.\n\nPrecautions\nFor TCP test instances, the configured destination port number must be the same as the opened port number on the server.\nIf parameters need to be changed during the running of the test instance, the system prompts you whether to terminate the test instance. Press \"Y\" or \"N\" as required.\nIf you press \"Y\", the test instance is terminated and parameters changed. The changed parameters take effect after the commit command is run. To restart the test instance, run the start command.If you press \"N\", the test instance keeps running, and the parameters fail to be modified."
}