{
    "PageTitle": "test-failtimes (Trace test instance)",
    "FuncDef": "The test-failtimes command sets the threshold for the number of consecutive failures of an NQA trace test instance. Once this threshold is reached, a trap is sent to the NMS.\nThe undo test-failtimes command restores the default threshold for the number of consecutive failures of an NQA trace test instance.\nBy default, an NQA test instance sends a trap message for each test failure.",
    "CLIs": [
        "test-failtimes <failTimes>",
        "undo test-failtimes"
    ],
    "ParentView": [
        "NQA view"
    ],
    "ParaDef": [
        {
            "Parameters": "failTimes",
            "Info": "Specifies the number of consecutive failures of an NQA test.\nThe value is an integer ranging from 1 to 15."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nqa test-instance user test",
            "[*HUAWEI-nqa-user-test] test-type trace",
            "[*HUAWEI-nqa-user-test] test-failtimes 10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA probe is a process in which a probe packet is sent in a test.\nMultiple packets can be sent in a test. That is, a test can contain several probes. By default, a test is considered as a success if one or more probes in the test succeed; a test is considered failed if all probes in the test fail.\nAfter the test-failtimes command is executed for an NQA test instance, traps will be sent only when send-trap is enabled.\nPrecautions\nWhen the test-failtimes command is executed to change the value of times for a running test instance, the system prompts you whether to terminate the test instance. Press \"Y\" or \"N\" as required.\nIf you press \"Y\", the test instance is terminated, and the value of times is changed. The setting takes effect after the commit command is executed. To restart the test instance, run the start command.If you press \"N\", the test instance keeps running, and the value of times fails to be changed."
}