{
    "PageTitle": "send-trap (Trace test instance)",
    "FuncDef": "The send-trap command configures conditions for sending a trap message in an NQA trace test.\nThe undo send-trap command deletes the configured conditions for sending a trap message.\nBy default, no trap messages are sent in any condition.",
    "CLIs": [
        "send-trap { all | { rtd | testfailure | testcomplete } * }",
        "undo send-trap { all | { rtd | testfailure | testcomplete } * }"
    ],
    "ParentView": [
        "NQA view"
    ],
    "ParaDef": [
        {
            "Parameters": "all",
            "Info": "Indicates that trap messages are sent in any of the following situations.\n-"
        },
        {
            "Parameters": "rtd",
            "Info": "Indicates that a trap message is sent if the RTD reaches the specified threshold.\n-"
        },
        {
            "Parameters": "testfailure",
            "Info": "Indicates that a trap message is sent if a test fails.\n-"
        },
        {
            "Parameters": "testcomplete",
            "Info": "Indicates that a trap message is sent after a test is complete.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nqa test-instance user test",
            "[*HUAWEI-nqa-user-test] test-type trace",
            "[*HUAWEI-nqa-user-test] send-trap rtd"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTraps are generated no matter whether the NQA test succeeds or fails. You can determine whether traps are sent to the NMS by enabling or disabling the trap function.\nThe send-trap command can be used to configure conditions for sending a trap message. If the specified conditions are met, the system sends a trap to the NMS.\nPrerequisites\nBefore using the send-trap command, run the test-type command to specify a test type.\nPrecautions\nIf parameters need to be changed during the running of the test instance, the system prompts you whether to terminate the test instance. Press \"Y\" or \"N\" as required.\nIf you press \"Y\", the test instance is terminated and parameters changed. The changed parameters take effect after the commit command is run. To restart the test instance, run the start command.If you press \"N\", the test instance keeps running, and the parameters fail to be modified.\nIf the trap function is enabled for multiple test instances, a large number of traps (logs) may be generated, which increases the CPU usage and affects other services."
}