{
    "PageTitle": "datafill (Trace test instance)",
    "FuncDef": "The datafill command fills padding characters into the Data field of packets to be sent in an NQA test instance.\nThe undo datafill command disables a device from filling padding characters into the Data field of packets to be sent in an NQA test instance.\nBy default, there are no padding characters in the Data field.",
    "CLIs": [
        "datafill <fill-string>",
        "undo datafill"
    ],
    "ParentView": [
        "NQA view"
    ],
    "ParaDef": [
        {
            "Parameters": "fill-string",
            "Info": "Specifies the padding characters filled into NQA test packets.\nThe value is a string of 1 to 230 characters. The default value is a null string with no characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nqa test-instance user test",
            "[*HUAWEI-nqa-user-test] test-type trace",
            "[*HUAWEI-nqa-user-test] datafill abcd"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo fill special padding characters into the Data field of the test packets to be sent for identification, run the datafill command.\nFor example, if a test packet sent in an ICMP test instance is destined for a port that does not exist, the destination that receives the test packet replies to the transmit end with a port unreachable packet containing the contents of the test packet. The transmit end will receive a great number of reply packets, but it can identify different test instances based on the padding characters.\nConfiguration Impact\nWhen running the datafill command, note the following points:\nIf the length of the data field in the test packet is shorter than the configured padding characters, only the forepart of the padding characters is used.If the length of the Data field in the test packet is longer than the configured padding characters, the padding characters are used in cycle to fill in the Data field.\nFor example, fill the padding characters abcd into the Data field of a test packet. If the size of the Data field is 3, only abc will be filled in. If the size of the Data field is 6, abcdab will be filled in.\n\nPrecautions\nIf parameters need to be changed during the running of the test instance, the system prompts you whether to terminate the test instance. Press \"Y\" or \"N\" as required.\nIf you press \"Y\", the test instance is terminated and parameters changed. The changed parameters take effect after the commit command is run. To restart the test instance, run the start command.If you press \"N\", the test instance keeps running, and the parameters fail to be modified."
}