{
    "PageTitle": "destination-port (UDP test instance)",
    "FuncDef": "The destination-port command specifies the destination port number for an NQA UDP test instance.\nThe undo destination-port command restores the default destination port number.\nBy default, the destination port number of a UDP test is 7.",
    "CLIs": [
        "destination-port <destPort-value>",
        "undo destination-port"
    ],
    "ParentView": [
        "NQA view"
    ],
    "ParaDef": [
        {
            "Parameters": "destPort-value",
            "Info": "Specifies the destination port number (UDP port) of an NQA test instance.\nThe value is an integer from 1 to 65535."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nqa test-instance user test",
            "[*HUAWEI-nqa-user-test] test-type udp",
            "[*HUAWEI-nqa-user-test] destination-port 2000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nNQA monitors service features by creating test instances. In NQA, two test ends are called an NQA client and an NQA server. An NQA test is initiated by the NQA client. After test instances are configured on the client, NQA places different types of test instances into various test queues. After the test starts, a response packet is returned. Carriers can then check the operating status about protocols by analyzing the received response packet. For a test instance, the port for accessing the server is specified using the destination port number configured using the destination-port command on the client.\nPrecautions\nIf parameters need to be changed during the running of the test instance, the system prompts you whether to terminate the test instance. Press \"Y\" or \"N\" as required.\nIf you press \"Y\", the test instance is terminated and parameters changed. The changed parameters take effect after the commit command is run. To restart the test instance, run the start command.If you press \"N\", the test instance keeps running, and the parameters fail to be modified.\nPlease avoid using a well-known port number because the rate of a well-known port is generally limited."
}