{
    "PageTitle": "adv-factor",
    "FuncDef": "The adv-factor command specifies the advantage factor for a UDP voice jitter test instance.\nThe undo adv-factor command deletes the advantage factor configured for a UDP voice jitter test instance.\nBy default, the advantage factor configured for a UDP voice jitter test instance is 0.",
    "CLIs": [
        "adv-factor <factor-value>",
        "undo adv-factor"
    ],
    "ParentView": [
        "NQA view"
    ],
    "ParaDef": [
        {
            "Parameters": "factor-value",
            "Info": "Specifies the advantage factor for a UDP voice jitter test instance.\nThe value is an integer ranging from 0 to 20."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nqa test-instance admin Jitter",
            "[*HUAWEI-nqa-admin-Jitter] test-type jitter",
            "[*HUAWEI-nqa-admin-Jitter] jitter-codec g711a",
            "[*HUAWEI-nqa-admin-Jitter] adv-factor 20"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen using a UDP jitter test instance to monitor Voice over Internet Protocol (VoIP) services, you can run the adv-factor command to set the advantage factor so that the UDP jitter test can be performed by simulating actual voice packets.\nWhen calculating the quality of the voice transmission network specified by the parameter R, a testing engineer needs to specify an advantage factor using the <factor-value> parameter based on the transmission distance and media. The advantage factor is the compensation paid in advance by the user for the quality loss during voice transmission on the network to be tested. The value of an advantage factor depends on the type of the network to be tested and is defined by the user. The greater the anticipated loss, the greater the value. The value represents the tolerance of the user on the quality loss during voice transmission on the network.\nFor example:\nIn a wired communication system, set the advantage factor to 0.In a wireless network that comprises satellites through multi-hop relay agents, set the advantage factor to 20.\n\nPrerequisites\nThe adv-factor command can be used to specify an advantage factor only after the following conditions are met:\nA UDP jitter test is being performed.The jitter-codec command is used to specify a code type for a UDP voice jitter test instance. The code type can be g711a, g711u, or g729a. They are used in VoIP services for conversion between simulated voice signals and digital signals. Before configuring an advantage factor, you can specify different code types based on actual code types used in VoIP applications.\nBefore a UDP jitter test instance starts, ensure that the nqa-server udpecho command is used on the peer device to respond to the UDP jitter tests.\n\nConfiguration Impact\nIf an advantage factor has been configured, running the adv-factor command again overrides the previous configuration.\nIf the code type of a test instance is changed using the jitter-codec command, the previously configured advantage factor becomes invalid, and a new advantage factor needs to be set.\nPrecautions\nIf parameters need to be changed during the running of the test instance, the system prompts you whether to terminate the test instance. Press \"Y\" or \"N\" as required.\nIf you press \"Y\", the test instance is terminated and parameters changed. The changed parameters take effect after the commit command is run. To restart the test instance, run the start command.If you press \"N\", the test instance keeps running, and the parameters fail to be modified."
}