{
    "PageTitle": "vpn-instance (UDP jitter test instance)",
    "FuncDef": "The vpn-instance command specifies a VPN instance for an NQA UDP jitter test instance.\nThe undo vpn-instance command deletes the VPN instance for an NQA UDP jitter test instance.\nThe default VPN instance in an NQA test instance is named _public_.",
    "CLIs": [
        "vpn-instance <vrfName>",
        "undo vpn-instance"
    ],
    "ParentView": [
        "NQA view"
    ],
    "ParaDef": [
        {
            "Parameters": "vrfName",
            "Info": "Specifies the name of a VPN instance to which NQA test packets belong. The VPN instance is created using the ip vpn-instance command.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vrf1",
            "[*HUAWEI-vpn-instance-vrf1] quit",
            "[*HUAWEI] nqa test-instance user test",
            "[*HUAWEI-nqa-user-test] test-type jitter",
            "[*HUAWEI-nqa-user-test] vpn-instance vrf1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo specify a VPN instance for an NQA test instance, run the vpn-instance command.\nBefore performing NQA tests on a VPN, specify a VPN instance for the NQA test instance.\nConfiguration Impact\nThe VPN instance must be already created and valid. Otherwise, the test instance fails. After the VPN is deleted, the NQA test instance that uses the VPN is deleted.\nPrecautions\nIf parameters need to be changed during the running of the test instance, the system prompts you whether to terminate the test instance. Press \"Y\" or \"N\" as required.\nIf you press \"Y\", the test instance is terminated and parameters changed. The changed parameters take effect after the commit command is run. To restart the test instance, run the start command.If you press \"N\", the test instance keeps running, and the parameters fail to be modified."
}