{
    "PageTitle": "destination-address (VPLS Mac Ping test instance)",
    "FuncDef": "The destination-address command configures a destination MAC address for an NQA test instance of VPLS MAC Ping test type.\nThe undo destination-address command deletes a destination MAC address.\nBy default, the destination address of an NQA test is not configured.",
    "CLIs": [
        "destination-address mac <macAddress>",
        "undo destination-address"
    ],
    "ParentView": [
        "NQA view"
    ],
    "ParaDef": [
        {
            "Parameters": "mac macAddress",
            "Info": "Specify the destination MAC address of test packets.\nThe value is a 12-digit hexadecimal number, in the format of H-H-H. Each H is 4 digits. If an H contains fewer than 4 digits, the left-most digits are padded with zeros. For example, e0 is displayed as 00e0."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] nqa test-instance user test",
            "[*HUAWEI-nqa-user-test] test-type vplsping",
            "[*HUAWEI-nqa-user-test] destination-address mac 00e0-fc12-3456"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nNQA monitors service features by creating test instances. In NQA, two test ends are called an NQA client and an NQA server. An NQA test is initiated by the NQA client. After test instances are configured on the client, NQA places different types of test instances into various test queues. After the test starts, a response packet is returned. You can then check the operating status about protocols by analyzing the received response packet.\nFor a test instance, the server is specified using the destination MAC address configured using the destination-address command.\nConfiguration Impact\nIf a destination MAC address has been configured for a test instance, running the destination-address command overrides the previous configuration.\nPrecautions\nIf parameters need to be changed during the running of the test instance, the system prompts you whether to terminate the test instance. Press \"Y\" or \"N\" as required.\nIf you press \"Y\", the test instance is terminated and parameters changed. The changed parameters take effect after the commit command is run. To restart the test instance, run the start command.If you press \"N\", the test instance keeps running, and the parameters fail to be modified."
}