{
    "PageTitle": "pim snooping enable (Virtual template view)",
    "FuncDef": "The pim snooping enable command enables PIM over L2TP on a VT interface.\nThe undo pim snooping enable command disables PIM over L2TP on a VT interface.\nBy default, PIM over L2TP is disabled on a VT interface.",
    "CLIs": [
        "pim [ ipv6 ] snooping enable",
        "undo pim [ ipv6 ] snooping enable"
    ],
    "ParentView": [
        "Virtual template view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv6",
            "Info": "Enables IPv6 PIM over L2TP on a VT interface.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Virtual-Template 1",
            "[~HUAWEI-Virtual-Template1] pim sm",
            "[*HUAWEI-Virtual-Template1] pim snooping enable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Virtual-Template 1",
            "[*HUAWEI-Virtual-Template1] pim ipv6 snooping enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWith the development of network applications, users need to access services such as video on demand (VoD), online conference, and remote teaching. However, L2TP users are restricted because traditional L2TP networks cannot carry multicast technologies and can only carry multicast services in unicast mode. This wastes bandwidth resources. To solve this problem, deploy L2TP on the network to carry VPN multicast traffic. The VPN multicast traffic can be transmitted through the public network and finally reach the L2TP users.\nHowever, L2TP cannot authenticate multicast users, which is inconvenient for carriers to provide multicast services. To allow only L2TP users who have paid fees to watch IPTV programs (join multicast groups), configure controllable multicast over L2TP. Then the device will authenticate the user requests to join a multicast group and deny invalid or unauthorized requests.\nTo implement user authentication and accounting, you can run the pim snooping enable command to enable PIM over L2TP.\nTo implement user authentication and accounting, you can run the pim ipv6 snooping enable command to enable IPv6 PIM over L2TP.\nPrerequisites\nThe pim sm/pim ipv6 sm command has been run on the interface to enable PIM-SM.\nPrecautions\nPIM over L2TP cannot work with the following features:\nIGMP: If the igmp enable command is configured, the pim snooping enable command cannot be used.PIM DM: If the pim dm command is configured, the pim snooping enable command cannot be used.PIM BFD: If the pim bfd enable command is configured, the pim snooping enable command cannot be used.PIM Silent: If the pim silent command is configured, the pim snooping enable command cannot be used.MLD: If the mld enable command is run, the pim snooping enable command cannot be used.\nPIM over L2TP cannot work with the following features:\nIGMP: If the igmp enable command is configured, the pim ipv6 snooping enable command cannot be used.IPv6 PIM BFD: If the pim ipv6 bfd enable command is configured, the pim ipv6 snooping enable command cannot be used.IPv6 PIM Silent: If the pim ipv6 silent command is configured, the pim ipv6 snooping enable command cannot be used.MLD: If the mld enable command is configured, the pim ipv6 snooping enable command cannot be used."
}