{
    "PageTitle": "pim snooping enable",
    "FuncDef": "The pim snooping enable command enables PIM over PPPoE on a BAS interface.\nThe undo pim snooping enable command disables PIM over PPPoE on a BAS interface.\nBy default, PIM over PPPoE is disabled.",
    "CLIs": [
        "pim snooping enable",
        "undo pim snooping enable"
    ],
    "ParentView": [
        "BAS interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/2",
            "[~HUAWEI-GigabitEthernet1/0/2] pim sm",
            "[*HUAWEI-GigabitEthernet1/0/2] bas",
            "[*HUAWEI-GigabitEthernet1/0/2-bas] access-type layer2-subscriber",
            "[*HUAWEI-GigabitEthernet1/0/2-bas] multicast copy by-session",
            "[*HUAWEI-GigabitEthernet1/0/2-bas] pim snooping enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nUsually, users can send IGMP protocol messages to Layer 3 multicast devices for multicast access. However, VPN users cannot directly send IGMP protocol messages to Layer 3 multicast devices to access multicast services. In this case, PIM can be used to address this problem, but PIM cannot authenticate or charge users. To solve this problem, you can run the pim snooping enable command to enable PIM over PPPoE.\nPrerequisites\nOn the interface, the pim sm command has been used to enable PIM-SM and the multicast copy by-session command has been used to set a multicast replication type.\nPrecautions\nPIM over PPPoE cannot work with the following features:\nIGMP: If the igmp enable command is configured, the pim snooping enable command cannot be used.PIM DM: If the pim dm command is configured, the pim snooping enable command cannot be used.PIM BFD: If the pim bfd enable command is configured, the pim snooping enable command cannot be used.PIM Silent: If the pim silent command is configured, the pim snooping enable command cannot be used.MLD: If the mld enable command is run, the pim snooping enable command cannot be used."
}