{
    "PageTitle": "c-bsr group",
    "FuncDef": "The c-bsr group command configures a candidate-bootstrap router (C-BSR) for the BSR administrative domain that serves a specified multicast group.\nThe undo c-bsr group command restores the default configuration.\nBy default, no C-BSR is configured for a BSR administrative domain.",
    "CLIs": [
        "c-bsr group <group-address> { <mask-length> | <mask> } [ hash-length <hash-length> | priority <priority> ] *",
        "undo c-bsr group <group-address>"
    ],
    "ParentView": [
        "VPN instance PIM view",
        "PIM view of a public network instance"
    ],
    "ParaDef": [
        {
            "Parameters": "group-address",
            "Info": "Specifies a multicast group address.\nThe value ranges from 239.0.0.0 to 239.255.255.255, in dotted decimal notation."
        },
        {
            "Parameters": "mask-length",
            "Info": "Specifies the mask length of a multicast address.\nThe value is an integer ranging from 8 to 32."
        },
        {
            "Parameters": "mask",
            "Info": "Specifies the mask of a multicast group address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "hash-length hash-length",
            "Info": "Specifies the hash mask length for a C-BSR in the BSR administrative domain that serves a specified multicast group.\nThe value is an integer ranging from 0 to 32. The default value is 30."
        },
        {
            "Parameters": "priority priority",
            "Info": "Specifies the priority for a C-BSR in the BSR administrative domain that serves a specified multicast group. A larger value indicates a higher C-BSR priority.\nThe value is an integer ranging from 0 to 255. The default value is 0."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] pim",
            "[*HUAWEI-pim] c-bsr group 239.0.0.0 255.0.0.0 priority 10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, each PIM-SM domain has only one BSR to serve all routers in the entire PIM-SM domain. To implement better device management, a PIM-SM domain can be divided into one global domain and multiple BSR administrative domains. This function can therefore reduce the workload of a single BSR and provide dedicated services for users in a specific domain using private group addresses.\nEach BSR administrative domain maintains a BSR, serving the multicast groups on the network segment 239.0.0.0/8. Multicast packets for groups on this network segment cannot go across a BSR administrative domain border. Multicast groups that do not belong to any BSR administrative domain belong to the global domain. The global domain maintains a BSR, serving all other multicast groups not on the network segment 239.0.0.0/8.\nSimilar to VPN in unicast, a BSR administrative domain can be regarded as a VPN, and the multicast address segment 239.0.0.0/8 can be regarded as the unicast address segment 10.0.0.0/8. Other multicast group addresses can be all used on the public network; therefore, address collision must be prevented. However, a same multicast group address can be assigned to different BSR administrative domains.\nTo configure a C-BSR for the BSR administrative domain that serves a specified multicast group, run the c-bsr group command.\nPrerequisites\nThe BSR administrative domain function has been enabled using the c-bsr admin-scope command.\nConfiguration Impact\nIf the c-bsr group command is run more than once, the latest configuration overrides the previous one.\nAfter the undo pim command or the undo multicast routing-enable command is run in the system view, C-BSRs of a BSR administrative domain are automatically disabled.\nPrecautions\nEach BSR administrative domain serves a multicast group address range. Multicast packets whose group addresses are within a specified range can be transmitted only within the corresponding BSR administrative domain"
}