{
    "PageTitle": "pim bsr-boundary",
    "FuncDef": "The pim bsr-boundary command configures a bootstrap router (BSR) boundary on an interface.\nThe undo pim bsr-boundary command restores the default configuration.\nBy default, no BSR boundary is configured on an interface.",
    "CLIs": [
        "pim bsr-boundary",
        "pim bsr-boundary incoming",
        "undo pim bsr-boundary"
    ],
    "ParentView": [
        "PW-VE sub-interface view",
        "Tunnel interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "GE electrical interface view",
        "Port extension interface view",
        "Loopback interface view",
        "Serial interface view",
        "MTI interface view",
        "Eth-Trunk sub-interface view",
        "50GE sub-interface view",
        "MP-group interface view",
        "400GE interface view",
        "10GE interface view",
        "POS sub-interface view",
        "GE sub-interface view",
        "VBDIF interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "GE interface view",
        "100GE interface view",
        "Mtunnel view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "100ge sub-interface view",
        "25GE interface view",
        "40GE sub-interface view",
        "Eth-Trunk interface view",
        "10GE sub-interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "incoming",
            "Info": "Applies a BSR boundary only to incoming traffic.If this parameter is specified, an interface can send BSR messages but cannot receive BSR messages.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] pim bsr-boundary"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] interface tunnel 5",
            "[*HUAWEI-Tunnel5] tunnel-protocol gre",
            "[*HUAWEI-Tunnel5] pim bsr-boundary"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA BSR is responsible for collecting rendezvous point (RP)-set information on a PIM-SM network, encapsulating the RP-set information in a bootstrap message, and advertising the message to every PIM neighbor.\nBefore configuring PIM-SM inter-domain multicast, run the pim bsr-boundary command to configure BSR boundaries on interfaces of edge routers to divide PIM-SM domains.Configuring BSR boundaries for a PIM-SM network and the Internet also helps isolate the PIM-SM network from the Internet.\nPrerequisites\nThe multicast routing function has been enabled using the multicast routing-enable command in the public network instance view or VPN instance view.\nConfiguration Impact\nIf an interface is disabled from sending and receiving BSR messages through the BSR boundary configuration, BSR messages cannot pass the BSR boundary but other multicast packets can pass the BSR boundary. BSR boundaries divide a large-scale PIM-SM network into several PIM-SM domains and each BSR serves only the local PIM-SM domain and routers in another PIM-SM domain cannot participate in packet forwarding in the local domain.\nFollow-up Procedure\nConfigure a BSR RP for each PIM-SM domain.\nEstablish a Multicast Source Discovery Protocol (MSDP) peer relationship between RPs in each two PIM-SM domains and configure PIM-SM inter-domain multicast.\nPrecautions\nIf two PIM-SM domains are in different autonomous systems (ASs), you also need to configure BSR boundaries on edge routers.\nCommon tunnel interfaces do not support this command. Only the GRE Tunnel interface supports this command."
}