{
    "PageTitle": "local-address (VPN instance anycast-RP view/Public network instance Anycast-RP view)",
    "FuncDef": "The local-address command sets a local address for an anycast-rendezvous point (Anycast-RP).\nThe undo local-address command deletes the local address of an Anycast-RP.\nBy default, no local address is set for an Anycast-RP.",
    "CLIs": [
        "local-address <local-address>",
        "undo local-address"
    ],
    "ParentView": [
        "VPN instance anycast-RP view",
        "Public network instance Anycast-RP view"
    ],
    "ParaDef": [
        {
            "Parameters": "local-address",
            "Info": "Specifies a local address for an Anycast-RP.\nThe value is in dotted decimal notation. This address must be a valid unicast IP address and cannot be an address on the network segment 127.0.0.0/8."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] pim",
            "[*HUAWEI-pim] anycast-rp 10.10.10.10",
            "[*HUAWEI-pim-anycast-rp-10.10.10.10] local-address 1.1.1.1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf PIM Anycast-RP is configured, after an RP receives a Register message, it checks the source address in the Register message. If the Register message is sent by the source's designated router (DR), the RP forwards the Register message to Anycast-RP peers. If the Register message is sent by an Anycast-RP peer, it does not forward the Register message.\nWhen forwarding a PIM Register message to other Anycast-RP peers, the local RP needs to use its own IP address (called the local address) as the source address of the Register message and use the addresses of Anycast-RP peers as the destination addresses of the Register message. In such a manner, Anycast-RP peers can learn source/group information from each other. To set a local address for an Anycast-RP, run the local-address command.\nPrecautions\nA local address for an Anycast-RP must be different from the Anycast RP address.\nSetting a loopback interface address as the local address for an Anycast-RP is recommended."
}