{
    "PageTitle": "rpf-frr clone join",
    "FuncDef": "The rpf-frr clone join command enables the function to clone user-to-source multicast Join messages.\nThe undo rpf-frr clone join command disables the function.\nBy default, the function to clone user-to-source multicast Join messages is disabled.",
    "CLIs": [
        "rpf-frr clone join <source-address> to <source-address1> and <source-address2> masklen <mask-length>",
        "undo rpf-frr clone join <source-address> to <source-address1> and <source-address2> masklen <mask-length>"
    ],
    "ParentView": [
        "VPN instance PIM view",
        "PIM view of a public network instance"
    ],
    "ParaDef": [
        {
            "Parameters": "source-address",
            "Info": "Clones a user-to-source multicast Join message to two specified Join messages. source-address2 must be different from source-address and source-address1.\nThe values are Class A, B, or C IP addresses, in dotted decimal notation, but cannot be IP addresses on the segment 0.0.0.0/8 or 127.0.0.0/8."
        },
        {
            "Parameters": "to source-address1",
            "Info": "Clones a source-address1.\nThe values are Class A, B, or C IP addresses, in dotted decimal notation, but cannot be IP addresses on the segment 0.0.0.0/8 or 127.0.0.0/8."
        },
        {
            "Parameters": "and source-address2",
            "Info": "Clones a source-address2.\nThe values are Class A, B, or C IP addresses, in dotted decimal notation, but cannot be IP addresses on the segment 0.0.0.0/8 or 127.0.0.0/8."
        },
        {
            "Parameters": "masklen mask-length",
            "Info": "Specifies the mask length for a multicast source address.\nThe value is an integer ranging from 1 to 32."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] pim",
            "[*HUAWEI-pim] rpf-frr",
            "[*HUAWEI-pim] rpf-frr clone join 10.0.5.100 to 10.0.1.10 and 10.0.2.20 masklen 24"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf dual feed and selective receiving is needed to improve fault convergence performance in multicast service scenarios, multicast source cloning-based PIM FRR can be deployed to protect services. To enable the function to clone user-to-source multicast Join message, run the rpf-frr clone join command on the user-side multicast device, so that multicast traffic of the cloned multicast sources can also be sent to users.\nPrerequisites\nPIM FRR has been enabled using the rpf-frr command.\nPrecautions\nIf s1 is set to the same value as , PIM FRR traffic switchback must be disabled. Otherwise, multicast traffic will be repeatedly switched between the primary and backup paths, causing service loss."
}