{
    "PageTitle": "pim single-tag forward enable",
    "FuncDef": "The pim single-tag forward enable command enables a QinQ/dot1q VLAN tag termination sub-interface to forward single-tagged PIM messages.\nThe undo pim single-tag forward enable command restores the default configuration.\nBy default, a QinQ/dot1q VLAN tag termination sub-interface is not enabled to forward single-tagged PIM messages.",
    "CLIs": [
        "pim single-tag forward enable",
        "undo pim single-tag forward enable"
    ],
    "ParentView": [
        "100ge sub-interface view",
        "10GE sub-interface view",
        "25GE sub-interface view",
        "400GE sub-interface view",
        "40GE sub-interface view",
        "50GE sub-interface view",
        "Eth-Trunk sub-interface view",
        "GE sub-interface view",
        "Global VE sub-interface view",
        "VE sub-interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] interface GigabitEthernet 1/0/1.1",
            "[*HUAWEI-GigabitEthernet1/0/1.1] encapsulation dot1q-termination",
            "[*HUAWEI-GigabitEthernet1/0/1.1] dot1q termination vid 10",
            "[*HUAWEI-GigabitEthernet1/0/1.1] pim single-tag forward enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a QinQ/dot1q VLAN tag termination sub-interface on the Router is connected to a downstream Router, run the pim single-tag forward enable command to enable the sub-interface to forward single-tagged PIM messages received from the downstream device.\nPrerequisites\nMulticast routing has been enabled using the multicast routing-enable command in the system view, and PIM-SM has been enabled on the sub-interface using the pim sm command.\nPrecautions\nThe pim single-tag forward enable command is mutually exclusive with the igmp enable and igmp static-group commands.\nThis command applies only to QinQ/dot1q VLAN tag termination sub-interfaces that are configured to terminate single-tagged PIM messages or are not configured to terminate any tagged PIM messages.\nThe pim single-tag forward enable command takes effect only when the QinQ/Dot1q termination sub-interface functions as the outbound interface.\nAfter the undo pim single-tag forward enable command is run on a QinQ/dot1q VLAN tag termination sub-interface, QinQ/dot1q outbound interface entries of the sub-interface fail to be delivered to the sub-interface, causing multicast traffic forwarding failures."
}