{
    "PageTitle": "pim hello-option override-interval",
    "FuncDef": "The pim hello-option override-interval command sets the interval for overriding the prune action carried in a Hello message sent by a PIM interface.\nThe undo pim hello-option override-interval command restores the default setting.\nBy default, the interval for overriding the prune action carried in a Hello message sent by a PIM interface is 2500 milliseconds.",
    "CLIs": [
        "pim hello-option override-interval <interval>",
        "undo pim hello-option override-interval"
    ],
    "ParentView": [
        "Virtual template view",
        "PW-VE sub-interface view",
        "Tunnel interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "GE electrical interface view",
        "Port extension interface view",
        "Loopback interface view",
        "Serial interface view",
        "Eth-Trunk sub-interface view",
        "50GE sub-interface view",
        "MP-group interface view",
        "400GE interface view",
        "10GE interface view",
        "POS sub-interface view",
        "GE sub-interface view",
        "VBDIF interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "GE interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "100ge sub-interface view",
        "25GE interface view",
        "40GE sub-interface view",
        "Eth-Trunk interface view",
        "10GE sub-interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "interval",
            "Info": "Specifies the interval for overriding the prune action carried in a Hello message sent by a PIM interface is 2500 milliseconds.\nThe value is an integer that ranges from 1 to 65535, in milliseconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] pim hello-option override-interval 2000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nHello messages sent by Routers carry lan-delay and override-interval. lan-delay indicates the delay for transmitting messages in the LAN. When the values of lan-delay on all Routers on the same link are different, the maximum value of these values is used.\nIf a Router receives a Prune message from the upstream interface, it indicates that other downstream Routers still exist in the LAN. If the Router still needs to receive multicast data, it must send a Join message to the upstream interface in the override-interval period.\nWhen receiving a Prune message from a downstream interface, the Router does not perform the prune action immediately until the Prune-Pending Timer (PPT) times out. The PPT equals the value of the lan-delay plus the override-interval. If the Router receives a Join message from the downstream interface in PPT, the Router cancels the prune action.\nPrerequisites\nThe multicast routing-enable command is run in the public network instance view or VPN instance view.\nConfiguration Impact\nIf the pim hello-option override-interval command is run more than once, the latest configuration overrides the previous one."
}