{
    "PageTitle": "spt-switch-threshold infinity (VPN instance PIM view/PIM view of a public network instance)",
    "FuncDef": "The spt-switch-threshold infinity command sets a multicast data forwarding rate threshold at which a receiver's designated router (DR) performs a switchover from the rendezvous point tree (RPT) to the shortest path tree (SPT).\nThe undo spt-switch-threshold infinity command restores the default value.\nBy default, a receiver's DR performs a switchover from the RPT to the SPT immediately after receiving the first multicast data packet.",
    "CLIs": [
        "spt-switch-threshold infinity",
        "undo spt-switch-threshold infinity"
    ],
    "ParentView": [
        "VPN instance PIM view",
        "PIM view of a public network instance"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] pim",
            "[*HUAWEI-pim] spt-switch-threshold infinity"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn PIM-SM, a source's DR encapsulates multicast data packets in a Register message and sends the Register message to the rendezvous point (RP). The RP then transmits the multicast datas along the RPT to receivers. The RP and the receiver's DR are responsible for checking the forwarding rate of multicast data packets.\nIf a rate threshold is configured on the receiver's DR, the receiver's DR sends a Join message to the source only it finds that the forwarding rate of multicast data packets exceeds the threshold and then triggers the switchover from the RPT to the SPT. To set such a rate threshold, run the spt-switch-threshold command.\nThis command takes effect on the Router that functions as the receiver's DR, but does not take effect on the RP.\nPrerequisites\nThe multicast routing function has been enabled using the multicast routing-enable command in the public network instance view or VPN instance view.\nPrecautions\nIf the spt-switch-threshold command is run more than once for one multicast group, the first command that the multicast group matches takes effect."
}