{
    "PageTitle": "rpf-frr clone interface-inheritance",
    "FuncDef": "The rpf-frr clone interface-inheritance command enables cloned (S, G) entries to inherit the outbound interfaces of (*, G) entries.\nThe undo rpf-frr clone interface-inheritance command disables cloned (S, G) entries from inheriting the outbound interfaces of (*, G) entries.\nBy default, cloned (S, G) entries are not enabled to inherit the outbound interfaces of (*, G) entries.",
    "CLIs": [
        "rpf-frr clone interface-inheritance [ policy { <acl-number> | acl-name <acl-name> } ]",
        "undo rpf-frr clone interface-inheritance [ policy { <acl-number> | acl-name <acl-name> } ]"
    ],
    "ParentView": [
        "VPN instance PIM view",
        "PIM view of a public network instance"
    ],
    "ParaDef": [
        {
            "Parameters": "policy",
            "Info": "Applies a policy to define the range of cloned (S, G) entries that can inherit the outbound interfaces of (*, G) entries.\n-"
        },
        {
            "Parameters": "acl-number",
            "Info": "Specifies an ACL number.\nThe value is an integer ranging from 2000 to 3999."
        },
        {
            "Parameters": "acl-name acl-name",
            "Info": "Specifies an ACL name.\nThe value is a string of 1 to 64 case-sensitive characters without spaces. The value must start with a letter (a to z or A to Z, case sensitive)."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] pim",
            "[*HUAWEI-pim] rpf-frr",
            "[*HUAWEI-pim] rpf-frr clone interface-inheritance"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf multicast user terminals run IGMPv2, cloned (S, G) entries need to inherit the outbound interfaces of (*, G) entries, allowing such user terminals to receive two copies of the same multicast flow. However, to prevent duplicated data, cloned (S, G) entries are disabled from inheriting the outbound interfaces of (*, G) entries by default. Therefore, if multicast user terminals running IGMPv2 exist on interfaces, run the rpf-frr clone interface-inheritance command to enable (S, G) entries to inherit the outbound interfaces of (*, G) entries.\nPrerequisites\nPIM FRR has been enabled using the rpf-frr command."
}