{
    "PageTitle": "pim neighbor-policy",
    "FuncDef": "The pim neighbor-policy command configures a policy for filtering PIM neighbors and sets a valid range for PIM neighbor addresses.\nThe undo pim neighbor-policy command restores the default configuration.\nBy default, no policy is configured for filtering PIM neighbors, and the valid range of PIM neighbor addresses is not limited.",
    "CLIs": [
        "pim neighbor-policy { <basic-acl-number> | acl-name <acl-name> }",
        "undo pim neighbor-policy"
    ],
    "ParentView": [
        "Virtual template view",
        "Tunnel interface view",
        "PW-VE sub-interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "GE electrical interface view",
        "Port extension interface view",
        "Loopback interface view",
        "Serial interface view",
        "Eth-Trunk sub-interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "MP-group interface view",
        "POS sub-interface view",
        "GE sub-interface view",
        "VBDIF interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "GE interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "100ge sub-interface view",
        "25GE interface view",
        "40GE sub-interface view",
        "Eth-Trunk interface view",
        "10GE sub-interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "basic-acl-number",
            "Info": "Specifies the number of a basic ACL.\nThe value is an integer ranging from 2000 to 2999."
        },
        {
            "Parameters": "acl-name acl-name",
            "Info": "Specifies the name of a named basic ACL.\nThe value is a string of 1 to 64 case-sensitive characters without spaces. The value must start with a letter (a to z or A to Z, case sensitive)."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] acl number 2001",
            "[*HUAWEI-acl4-basic-2001] rule permit source 10.1.1.0 0.0.0.255",
            "[*HUAWEI-acl4-basic-2001] quit",
            "[*HUAWEI] multicast routing-enable",
            "[*HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] pim neighbor-policy 2001"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo protect a Router against pseudo PIM Hello message attacks, run the pim neighbor-policy command to set a range of valid PIM neighbor addresses. The Router then discards Hello messages received from Routers whose addresses are not in the specified range.\nPrerequisites\nThe multicast routing function has been enabled using the multicast routing-enable command in the public network instance view or VPN instance view.\nConfiguration Impact\nIf the pim neighbor-policy command is run more than once, the latest configuration overrides the previous one.\nAfter the pim neighbor-policy command is configured, an interface sets up neighbor relationships only with the devices whose IP addresses are in the specified range of valid addresses.\nIf a Router address is permitted by the ACL, Hello messages sent by this Router are accepted.If a Router address is denied by the ACL or no action is configured for this Router address, Hello messages sent by this Router are discarded.If the ACL specified in the pim neighbor-policy command does not exist, all Hello messages are discarded."
}