{
    "PageTitle": "register-source",
    "FuncDef": "The register-source command specifies an interface using which the source's designated router (DR) sends Register messages.\nThe undo register-source command restores the default setting.\nBy default, no interface is specified for the source's DR to send Register messages.",
    "CLIs": [
        "register-source { <interface-type> <interface-number> | <interface-name> }",
        "undo register-source"
    ],
    "ParentView": [
        "VPN instance PIM view",
        "PIM view of a public network instance"
    ],
    "ParaDef": [
        {
            "Parameters": "interface-type",
            "Info": "Specifies the type of an interface using which the source's DR sends Register messages.\n-"
        },
        {
            "Parameters": "interface-number",
            "Info": "Specifies the number of an interface using which the source's DR sends Register messages.\n-"
        },
        {
            "Parameters": "interface-name",
            "Info": "Specifies the name of an interface.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] interface LoopBack 0",
            "[*HUAWEI-LoopBack0] quit",
            "[*HUAWEI] pim",
            "[*HUAWEI-pim] register-source loopback 0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the source's DR uses more than one or a filtered out interface to send Register messages to the rendezvous point (RP), errors occur in the registration process and extra traffic occupies bandwidth on the network. To address this issue, run the register-source command to specify an interface (a loopback interface is recommended) using which the source's DR sends Register messages.\nPrerequisites\nPIM-SM has been enabled on the interface to be specified by the port-type port-number parameter.\nConfiguration Impact\nIf the register-source command is run more than once, the latest configuration overrides the previous one.\nPrecautions\nThe command configuration is effective only when the specified interface is in the Up state."
}