{
    "PageTitle": "rpf-prune-delay",
    "FuncDef": "The rpf-prune-delay command sets a delay in sending Prune messages to upstream devices, so that Prune messages are not sent immediately when a PIM-SM SPT or PIM-SSM route change occurs.\nThe undo rpf-prune-delay command restores the default configuration.\nBy default, no delay is set in sending Prune messages to upstream devices.",
    "CLIs": [
        "rpf-prune-delay <delay-time> [ policy { <acl-number> | acl-name <acl-name> } ]",
        "undo rpf-prune-delay [ <delay-time> [ policy { <acl-number> | acl-name <acl-name> } ] ]"
    ],
    "ParentView": [
        "VPN instance PIM view",
        "PIM view of a public network instance"
    ],
    "ParaDef": [
        {
            "Parameters": "delay-time",
            "Info": "Sets a delay in sending Prune messages to upstream devices.\nThe value is an integer ranging from 1 to 300, in seconds."
        },
        {
            "Parameters": "policy",
            "Info": "Indicates a matching policy for multicast entries to be pruned.\n-"
        },
        {
            "Parameters": "acl-number",
            "Info": "Specifies an ACL number.\nThe value is an integer ranging from 2000 to 3999."
        },
        {
            "Parameters": "acl-name acl-name",
            "Info": "Specifies an ACL number.\nThe value is a string of 1 to 64 case-sensitive characters without spaces. The value must start with a letter (a to z or A to Z, case sensitive)."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] pim",
            "[~HUAWEI-pim] rpf-prune-delay 210"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn IGP ECMP-based or non-ECMP-based PIM FRR scenarios, IGP route changes will trigger frequent PIM inbound interface switchovers, causing frequent master/backup forwarding entry switchovers on the forwarding plane. As a result, the rapid convergence function of PIM FRR is adversely affected. To resolve this issue, run the rpf-prune-delay command to set a delay in sending Prune messages to upstream devices.\nConfiguration Impact\nIf the rpf-prune-delay command is run for more than one, the latest configuration overrides the previous one."
}