{
    "PageTitle": "pim hello-option holdtime (Mtunnel view)",
    "FuncDef": "The pim hello-option holdtime command sets the neighbor timeout period carried in PIM Hello packets to be sent by a PIM interface.\nThe undo pim hello-option holdtime command restores the default value.\nBy default,  the neighbor timeout period carried in PIM Hello packets to be sent by a PIM interface is 105 seconds.",
    "CLIs": [
        "pim hello-option holdtime <interval>",
        "undo pim hello-option holdtime"
    ],
    "ParentView": [
        "MTI interface view",
        "Mtunnel view"
    ],
    "ParaDef": [
        {
            "Parameters": "interval",
            "Info": "Specifies the neighbor timeout period carried in PIM Hello messages to be sent.\nThe value is an integer ranging from 1 to 65535, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance mytest",
            "[*HUAWEI-vpn-instance-mytest] ipv4-family",
            "[*HUAWEI-vpn-instance-mytest-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-mytest-af-ipv4] multicast routing-enable",
            "[*HUAWEI-vpn-instance-mytest-af-ipv4] multicast-domain share-group 224.1.1.1 binding mtunnel 10",
            "[*HUAWEI-vpn-instance-mytest-af-ipv4] commit",
            "[~HUAWEI-vpn-instance-mytest-af-ipv4] quit",
            "[~HUAWEI-vpn-instance-mytest] quit",
            "[~HUAWEI] interface Mtunnel 10",
            "[~HUAWEI-MTunnel10] pim hello-option holdtime 120"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a router does not receive any Hello message from PIM neighbors within a specified timeout period, it considers the neighbor invalid or unreachable. To set such a timeout period, run the pim hello-option holdtime command. If you want a router to quickly sense the changes of PIM neighbors, set a smaller value for the interval parameter, but the interval value is larger than the interval at which PIM neighbors send Hello messages.\nPrerequisites\nThe multicast routing function has been enabled using the multicast routing-enable command in the public network instance view or VPN instance view.\nConfiguration Impact\nIf the pim hello-option holdtime command is run more than once, the latest configuration overrides the previous one."
}