{
    "PageTitle": "pim require-genid (Mtunnel view)",
    "FuncDef": "The pim require-genid command configures a PIM interface to reject a Hello message without a generation ID.\nThe undo pim require-genid command restores the default configuration.\nBy default, a PIM interface permits a Hello message without a generation ID.",
    "CLIs": [
        "pim require-genid",
        "undo pim require-genid"
    ],
    "ParentView": [
        "MTI interface view",
        "Mtunnel view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance mytest",
            "[*HUAWEI-vpn-instance-mytest] ipv4-family",
            "[*HUAWEI-vpn-instance-mytest-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-mytest-af-ipv4] multicast routing-enable",
            "[*HUAWEI-vpn-instance-mytest-af-ipv4] multicast-domain share-group 224.1.1.1 binding mtunnel 10",
            "[*HUAWEI-vpn-instance-mytest-af-ipv4] commit",
            "[~HUAWEI-vpn-instance-mytest-af-ipv4] quit",
            "[~HUAWEI-vpn-instance-mytest] quit",
            "[~HUAWEI] interface Mtunnel 10",
            "[~HUAWEI-MTunnel10] pim require-genid"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter PIM-SM is enabled on an interface of a router, the router generates a random number as the generation ID for Hello messages. Each time the router status changes, the router generates a new generation ID.\nIf a router receives a Hello message that contains a changed generation ID from the same PIM neighbor, the router considers that the PIM neighbor status has changed. In this manner, the router can detect status changes of its neighbors. To configure a PIM interface to reject Hello messages without a generation ID, run the pim require-genid command, improving communication security.\nPrerequisites\nThe multicast routing function has been enabled using the multicast routing-enable command in the public network instance view or VPN instance view.\nConfiguration Impact\nAfter the pim require-genid commands run, the router sets up PIM neighbor relationships only with devices that send Hello messages with a generation ID."
}