{
    "PageTitle": "pim holdtime join-prune (Mtunnel view)",
    "FuncDef": "The pim holdtime join-prune command sets the holdtime for Join/Prune messages sent by a PIM interface.\nThe undo pim holdtime join-prune command restores the default value.\nBy default, the holdtime value in Join/Prune messages sent by a PIM interface is 210 seconds.",
    "CLIs": [
        "pim holdtime join-prune <interval>",
        "undo pim holdtime join-prune"
    ],
    "ParentView": [
        "MTI interface view",
        "Mtunnel view"
    ],
    "ParaDef": [
        {
            "Parameters": "interval",
            "Info": "Specifies the value of holdtime in Join/Prune messages sent by a PIM interface.\nThe value is an integer ranging from 1 to 65535, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance mytest",
            "[*HUAWEI-vpn-instance-mytest] ipv4-family",
            "[*HUAWEI-vpn-instance-mytest-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-mytest-af-ipv4] multicast routing-enable",
            "[*HUAWEI-vpn-instance-mytest-af-ipv4] multicast-domain share-group 224.1.1.1 binding mtunnel 10",
            "[*HUAWEI-vpn-instance-mytest-af-ipv4] commit",
            "[~HUAWEI-vpn-instance-mytest-af-ipv4] quit",
            "[~HUAWEI-vpn-instance-mytest] quit",
            "[~HUAWEI] interface Mtunnel 10",
            "[~HUAWEI-MTunnel10] pim holdtime join-prune 280"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter receiving a Join/Prune message from a downstream interface, an upstream router determines the time period for keeping the join or prune state of a downstream interface based on the holdtime field carried in the Join/Prune message. To set a value for the holdtime field of Join/Prune messages sent by a specified PIM interface, run the pim holdtime join-prune command on the interface.\nGenerally, the holdtime is 3.5 times the interval (specified using the timer join-prune command) at which Join/Prune messages are sent.\nPrerequisites\nThe multicast routing function has been enabled using the multicast routing-enable command in the public network instance view or VPN instance view.\nConfiguration Impact\nIf the pim holdtime join-prune command is run more than once, the latest configuration overrides the previous one."
}