{
    "PageTitle": "pim silent",
    "FuncDef": "The pim silent command enables the PIM silent function on an interface.\nThe undo pim silent command disables the PIM silent function on an interface.\nBy default, the PIM silent function is not enabled on an interface.",
    "CLIs": [
        "pim silent",
        "undo pim silent"
    ],
    "ParentView": [
        "Virtual template view",
        "PW-VE sub-interface view",
        "Tunnel interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "GE electrical interface view",
        "Port extension interface view",
        "Loopback interface view",
        "Serial interface view",
        "Eth-Trunk sub-interface view",
        "50GE sub-interface view",
        "MP-group interface view",
        "400GE interface view",
        "10GE interface view",
        "POS sub-interface view",
        "GE sub-interface view",
        "VBDIF interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "GE interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "100ge sub-interface view",
        "25GE interface view",
        "40GE sub-interface view",
        "Eth-Trunk interface view",
        "10GE sub-interface view",
        "POS interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] pim silent"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo prevent malicious hosts from constructing pseudo PIM Hello messages to attack a Router, enable PIM silent using the pim silent command on an interface connected to hosts. After PIM silent is enabled on an interface, all PIM packets will be discard by this interface, and all PIM neighbors and PIM state machines will be deleted for this interface. The interface automatically becomes a static designated router (DR). IGMP functions, however, are not affected on the interface.\nPrecautions\nPIM silent applies only to interfaces directly connected to a host network segment on which only one PIM device is deployed.\nThe pim silent command is mutually exclusive with the pim timer dr-switch-delay command.\nThe pim silent command is mutually exclusive with the pim dm command.\nThe pim silent command is mutually exclusive with the pim bfd enable command.\nIf PIM silent is enabled on an interface connected to a router, a PIM neighbor relationship cannot be set up on the interface, causing multicast faults.\nIf a host network segment connects to multiple Routers and PIM silent is enabled on interfaces of multiple Routers, all these interfaces become static DRs, causing multicast faults."
}