{
    "PageTitle": "pim ignore assert-state",
    "FuncDef": "The pim ignore assert-state command enables an interface to ignore the Assert state.\nThe undo pim ignore assert-state command restores the default configuration.\nBy default, an interface is not enabled to ignore the Assert state.",
    "CLIs": [
        "pim ignore assert-state",
        "undo pim ignore assert-state"
    ],
    "ParentView": [
        "40GE interface view",
        "GE electrical interface view",
        "400GE interface view",
        "10GE interface view",
        "POS sub-interface view",
        "GE interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Sub-interface view",
        "50GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Eth-Trunk interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] pim",
            "[*HUAWEI-pim] commit",
            "[~HUAWEI-pim] quit",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] pim ignore assert-state"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn a VRRP backup group for multicast services, when the failed master device recovers, the backup device that is elected as the temporary master will be blocked again. If the recovered master device has started to forward multicast traffic before the blocking process is complete, the master and backup devices forward multicast traffic at the same time. In this case, an Assert election is triggered. If the downstream interface of the backup device becomes the Assert winner, the downstream interface of the master device becomes the Assert loser and stops forwarding multicast traffic. After the blocking process is complete, both the master and slave devices stop forwarding multicast traffic to the downstream device, causing multicast traffic interruptions. The master device starts to forward multicast traffic again only after the current Assert message times out and the downstream interface of the master device becomes the Assert winner in the new round of Assert election. If the traffic switchback specification does not meet performance requirements, run the pim ignore assert-state command to enable an interface to ignore the Assert state. An Assert election will then not be performed between the master and backup devices, preventing multicast traffic interruptions during the wait for a new round of Assert election. If pim mode is dm, this command can be configured but does not take effect.\nPrerequisites\nPIM has been enabled using the pim command."
}