{
    "PageTitle": "pim timer graft-retry",
    "FuncDef": "The pim timer graft-retry command configures the interval at which Graft messages are retransmitted by an interface.\nThe undo pim timer graft-retry command restores the default interval.\n\nBy default, the interval at which Graft messages are retransmitted is 3 seconds.",
    "CLIs": [
        "pim timer graft-retry <interval>",
        "undo pim timer graft-retry"
    ],
    "ParentView": [
        "Tunnel interface view",
        "PW-VE sub-interface view",
        "40GE interface view",
        "GE electrical interface view",
        "Loopback interface view",
        "Eth-Trunk sub-interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "MP-group interface view",
        "POS sub-interface view",
        "GE sub-interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "100ge sub-interface view",
        "25GE interface view",
        "40GE sub-interface view",
        "Eth-Trunk interface view",
        "10GE sub-interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "interval",
            "Info": "Specifies the interval at which an interface retransmits Graft messages.\nThe value is an integer ranging from 1 to 65535, in seconds. The default value is recommended."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] pim timer graft-retry 80"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] interface tunnel 5",
            "[*HUAWEI-Tunnel5] tunnel-protocol gre",
            "[*HUAWEI-Tunnel5] pim timer graft-retry 80"
        ]
    ],
    "ExtraInfo": "Usage Scenario\n\nOn a PIM-DM network, if State-Refresh is enabled on pruned interfaces, it is possible that the forwarding function will never be restored. When a new multicast member is added to a pruned interface, PIM-DM uses the graft mechanism to restore the forwarding function on the interface to save time. In other words, a Router sends a Graft message to require an upstream Router to forward multicast data to this network segment. Upon receipt of the Graft message, the upstream Router returns a Graft-Ack message and re-enables the forwarding function on the interface that received the Graft message. If no Graft-Ack message is received after the pim timer graft-retry is run, the Router will keep sending the same Graft message before it receives a Graft-Ack message from the upstream device.\n\nPrerequisites\n\nMulticast has been enabled using the multicast routing-enable command.\n\nPrecautions\n\nThe pim timer graft-retry command does not apply to interfaces bound to VPNs."
}