{
    "PageTitle": "pim hello-option dr-priority (Mtunnel view)",
    "FuncDef": "The pim hello-option dr-priority command configures a designated router (DR) election priority for a PIM interface.\nThe undo pim hello-option dr-priority command restores the default priority.\nBy default, the DR election priority of a PIM interface is 1.",
    "CLIs": [
        "pim hello-option dr-priority <priority>",
        "undo pim hello-option dr-priority"
    ],
    "ParentView": [
        "MTI interface view",
        "Mtunnel view"
    ],
    "ParaDef": [
        {
            "Parameters": "priority",
            "Info": "Specifies a DR election priority. A larger value indicates a higher priority.\nThe value is an integer ranging from 0 to 4294967295."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance mytest",
            "[*HUAWEI-vpn-instance-mytest] ipv4-family",
            "[*HUAWEI-vpn-instance-mytest-af-ipv4] route-distinguisher 100:1",
            "[*HUAWEI-vpn-instance-mytest-af-ipv4] multicast routing-enable",
            "[*HUAWEI-vpn-instance-mytest-af-ipv4] multicast-domain share-group 224.1.1.1 binding mtunnel 10",
            "[*HUAWEI-vpn-instance-mytest-af-ipv4] commit",
            "[~HUAWEI-vpn-instance-mytest-af-ipv4] quit",
            "[~HUAWEI-vpn-instance-mytest] quit",
            "[~HUAWEI] interface Mtunnel 10",
            "[~HUAWEI-MTunnel10] pim hello-option dr-priority 3"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn a PIM-SM shared network segment, a DR is dynamically elected among candidate Router interfaces. DR election is based on priorities and IP addresses of interfaces on Routers. In a DR election process, Routers exchange Hello messages carrying DR election priorities.\nIf all Routers support Hello messages that carry DR election priorities, the interface with the highest DR election priority wins. If all interfaces have the same DR election priority, the interface with the largest IP address wins.If one or more Routers do not support Hello messages that carry DR priorities, the interface with the largest IP address wins.\n\nPrerequisites\nThe multicast routing function has been enabled using the multicast routing-enable command in the public network instance view or VPN instance view.\nConfiguration Impact\nIf the pim hello-option dr-priority command is run more than once, the latest configuration overrides the previous one."
}