{
    "PageTitle": "ipsec unicast-message sa(VPN instance PIM view/PIM view of a public network instance)",
    "FuncDef": "The ipsec unicast-message sa command globally specifies a security association (SA) using which interfaces authenticate sent and received IPv4/IPv6 PIM unicast messages to implement IPv4/IPv6 PIM IPsec authentication.\nThe undo ipsec unicast-message sa command restores the default configuration.\nBy default, no SA is specified globally, so that interfaces do not authenticate sent or received IPv4/IPv6 PIM unicast messages.",
    "CLIs": [
        "ipsec unicast-message sa <sa-name>",
        "undo ipsec unicast-message sa"
    ],
    "ParentView": [
        "VPN instance PIM view",
        "PIM view of a public network instance"
    ],
    "ParaDef": [
        {
            "Parameters": "sa-name",
            "Info": "Specifies the name of an SA.\nIt is a string of 1 to 15 case-sensitive characters, spaces not supported. The characters can be letters or numbers, hyphens (-) not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] ipsec sa sa1",
            "[*HUAWEI-ipsec-sa-sa1] quit",
            "[*HUAWEI] pim",
            "[*HUAWEI-pim] ipsec unicast-message sa sa1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn a multicast network, forged IPv6 PIM messages may be used to attack devices, causing devices unable to forward multicast traffic. To protect a device against attacks launched using forged IPv6 PIM messages, run the ipsec sa command to configure the device to authenticate the sent and received IPv6 PIM messages based on a specified SA.\nOn a multicast network, forged IPv4 PIM messages may be used to attack devices, causing devices unable to forward multicast traffic. To protect a device against attacks launched using forged IPv4 PIM messages, run the ipsec sa command to configure the device to authenticate sent and received IPv4 PIM messages based on a specified SA.\nPrerequisites\nBasic IPsec functions have been configured.\nPrecautions\nIf the ipsec unicast-message sa command is run more than once, the latest configuration overrides the previous one. If the ipsec unicast-message sa and hello ipsec sa commands are both configured, the command configured later overrides the command configured earlier."
}