{
    "PageTitle": "static-rp",
    "FuncDef": "The static-rp command configures a static rendezvous point (RP).\nThe undo static-rp command deletes the configuration.\nBy default, no static RP is configured.",
    "CLIs": [
        "static-rp <rp-address> [ <basic-acl-number> | acl-name <acl-name> ] [ preferred ]",
        "undo static-rp <rp-address>"
    ],
    "ParentView": [
        "VPN instance PIM view",
        "PIM view of a public network instance"
    ],
    "ParaDef": [
        {
            "Parameters": "rp-address",
            "Info": "Specifies a static RP address.\nThe value is in dotted decimal notation. It must be a valid unicast IP address and cannot be configured as an address on the network segment 127.0.0.0/8."
        },
        {
            "Parameters": "basic-acl-number",
            "Info": "Specifies the name of a named basic ACL.\nThe value is an integer that ranges from 2000 to 2999."
        },
        {
            "Parameters": "acl-name acl-name",
            "Info": "Specifies the name of a named basic ACL.\nThe value is a string of 1 to 64 case-sensitive characters without spaces. The value must start with a letter (a to z or A to Z, case sensitive)."
        },
        {
            "Parameters": "preferred",
            "Info": "Indicates that a static RP is preferred.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] acl number 2001",
            "[*HUAWEI-acl4-basic-2001] rule permit source 225.1.0.0 0.0.255.255",
            "[*HUAWEI-acl4-basic-2001] quit",
            "[*HUAWEI] pim",
            "[*HUAWEI-pim] static-rp 192.168.0.6 2001 preferred"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen only one RP exists on a network, you can run the static-rp command to configure a static RP. Compared with dynamic RP election using the bootstrap router (BSR) mechanism, the static RP mechanism can reduce bandwidth occupied by messages exchanged between candidate-rendezvous points (C-RPs) and the BSR. To make the static RP work properly, you must run the static-rp command on all Routers.\nPrerequisites\nPIM has been enabled and the PIM instance view has been displayed using the pim command.\nConfiguration Impact\nIn PIM-SM, if the static RP address is the address of an interface in the Up state on a router, the router acts as the static RP. PIM does not need to be enabled on the interface of the static RP.\nIf no ACL is specified, or an ACL is specified but no rule is configured for the ACL, the configured static RP serves all multicast groups. If an ACL is specified and rules are specified for the ACL, the configured static RP serves only multicast groups permitted by the ACL.\nIf preferred is specified, the router prefers the static RP. If preferred is not specified, the router prefers the RP elected using the BSR mechanism. If no BSR is configured on the network or the dynamically elected RP becomes invalid, the static RP takes effect.\nA static RP is configured each time the static-rp command is run. If multiple static RPs are configured to serve the same group, the RP with the largest IP address is selected. If the ACL for static RPs changes, re-select static RPs for all groups. If a same RP address is specified in the rp-address parameter, the latest configuration overrides the previous one.\nPrecautions\nUp to 50 static RPs can be configured using the static-rp command, but a same ACL can be applied to only one static RP.\nIf an ACL is not specified, only one static RP can be configured."
}