{
    "PageTitle": "pim hello-option lan-delay",
    "FuncDef": "The pim hello-option lan-delay command sets the delay in transmitting Prune messages on a shared network segment.\nThe undo pim hello-option lan-delay command restores the default setting.\nBy default, a PIM interface delays sending Prune messages on the shared network segment for 500 milliseconds.",
    "CLIs": [
        "pim hello-option lan-delay <interval>",
        "undo pim hello-option lan-delay"
    ],
    "ParentView": [
        "Virtual template view",
        "Tunnel interface view",
        "PW-VE sub-interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "Port extension interface view",
        "GE electrical interface view",
        "Loopback interface view",
        "Serial interface view",
        "Eth-Trunk sub-interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "MP-group interface view",
        "POS sub-interface view",
        "GE sub-interface view",
        "VBDIF interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "GE interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "100ge sub-interface view",
        "25GE interface view",
        "40GE sub-interface view",
        "Eth-Trunk interface view",
        "10GE sub-interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "lan-delay",
            "Info": "Specifies the delay in sending Prune messages on the shared network segment.\nThe value is an integer that ranges from 1 to 32767, in milliseconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] pim hello-option lan-delay 200"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nHello messages sent by Routers carry lan-delay and override-interval. lan-delay indicates the delay in transmitting messages in the LAN. When the values of lan-delay on all Routers on the same link are different, the maximum value of these values is used.\nIf a Router receives a Prune message from the upstream interface, it indicates that other downstream Routers still exist in the LAN. If the Router still needs to receive multicast data, it must send a Join message to the upstream interface in the override-interval period.\nWhen receiving a Prune message from a downstream interface, the Router does not perform the prune action immediately until the Prune-Pending Timer (PPT) times out. The PPT equals the value of the lan-delay plus the override-interval. If the Router receives a Join message from the downstream interface in PPT, the Router cancels the prune action.\nPrerequisites\nThe multicast routing-enable command is run in the public network instance view or VPN instance view.\nConfiguration Impact\nIf the pim hello-option lan-delay command is run more than once, the latest configuration overrides the previous one."
}