{
    "PageTitle": "holdtime assert (VPN instance PIM view/PIM view of a public network instance)",
    "FuncDef": "The holdtime assert command globally sets a timeout period during which PIM interfaces wait to receive Assert messages from the forwarder.\nThe undo holdtime assert command restores the default timeout period.\nBy default, the timeout period is 180 seconds.",
    "CLIs": [
        "holdtime assert <interval>",
        "undo holdtime assert"
    ],
    "ParentView": [
        "VPN instance PIM view",
        "PIM view of a public network instance"
    ],
    "ParaDef": [
        {
            "Parameters": "interval",
            "Info": "Specifies a timeout period during which PIM interfaces wait to receive Assert messages from the forwarder.\nThe value is an integer ranging from 7 to 65535, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] pim",
            "[*HUAWEI-pim] holdtime assert 100"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo prevent redundant traffic, a shared network segment should have only one forwarder. Therefore, a router sends an Assert message immediately after its forwarding interface receives the same multicast packet on a shared network segment, which indicates that more than one forwarder exists. After all PIM routers on the shared network segment receive Assert messages, the routers elect a unique forwarder and refresh the outbound interface lists of (*, G) and (S, G) entries to prune redundant outbound interfaces. The router that wins the election is called an assert winner, and all the other routers are called assert losers. Only the assert winner forwards multicast data.\nThe assert winner periodically sends Assert messages to maintain its winner state. If the assert losers do not receive any Assert messages from the assert winner within a specified timeout period, the assert losers restore the pruned interfaces to forward packets. A new round of assert election is then triggered. To set such a timeout period, run the holdtime assert command.\nPrerequisites\nThe multicast routing function has been enabled using the multicast routing-enable command in the public network instance view or VPN instance view.\nConfiguration Impact\nIf the holdtime assert command is run more than once, the latest configuration overrides the previous one."
}