{
    "PageTitle": "action",
    "FuncDef": "This mandatory command associates the forwarding class or enqueuing priority with specific IP, IPv6, or MAC criteria entry ID. The action command supports setting the forwarding class parameter to a subclass. Packets that meet all match criteria within the entry have their forwarding class and enqueuing priority overridden based on the parameters included in theactionparameters. When the forwarding class is not specified in theactioncommand syntax, a matching packet preserves (or inherits) the existing forwarding class derived from earlier matches in the classification hierarchy. When the enqueuing priority is not specified in the action, a matching packet preserves (or inherits) the existing enqueuing priority derived from earlier matches in the classification hierarchy.",
    "CLIs": [
        "action [ fc <fc-name> ] [ priority { high | low } ] [ policer <policer-id> ]",
        "no action"
    ],
    "ParentView": [
        "config>qos>sap-ingress>ip-criteria>entry",
        "config>qos>sap-ingress>ipv6-criteria>entry",
        "config>qos>sap-ingress>mac-criteria>entry"
    ],
    "ParaDef": [
        {
            "Parameters": "fc fc-name",
            "Info": "The value given for fc fc-name must be one of the predefined forwarding classes in the system. Specifying the fc fc-name is required. When a packet matches the rule, the forwarding class is only overridden when the fc fc-name parameter is defined on the rule. If the packet matches and the forwarding class is not explicitly defined in the rule, the forwarding class is inherited based on previous rule matches. Values-fc: |class[.subclass], ||class: be, l2, af, l1, h2, ef, h1, nc, ||subclass: 29 characters max. ParamDefault: Default- Inherit (When fc fc-name is not defined, the rule preserves the previous forwarding class of the packet.)"
        },
        {
            "Parameters": "priority",
            "Info": "The priority parameter overrides the default enqueuing priority for all packets received on a SAP using this policy that match this rule. Specifying the priority (high or low) is optional. When a packet matches the rule, the enqueuing priority is only overridden when the priority parameter is defined on the rule. If the packet matches and priority is not explicitly defined in the rule, the enqueuing priority is inherited based on previous rule matches. ParamDefault: Default- Inherit (When the priority (high or low) is not defined, the rule preserves the previous enqueuing priority of the packet)"
        },
        {
            "Parameters": "high",
            "Info": "The high parameter is used in conjunction with the priority parameter. Setting the priority enqueuing parameter to high for a packet increases the likelihood to enqueue the packet when the queue is congested. The enqueuing priority only affects ingress SAP queuing. When the packet is placed in a buffer on the queue, the significance of the enqueuing priority is lost."
        },
        {
            "Parameters": "low",
            "Info": "The low parameter is used in conjunction with the priority parameter. Setting the priority enqueuing parameter to low for a packet decreases the likelihood to enqueue the packet when the queue is congested. The enqueuing priority only affects ingress SAP queuing. When the packet is placed in a buffer on the ingress queue, the significance of the enqueuing priority is lost. ParamDefault: Default- Inherit"
        },
        {
            "Parameters": "policer-id",
            "Info": "A valid policer-id must be specified. The parameter policer-id references a policer-id that has already been created within the sap-ingress QoS policy. Values-1 to 63."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}