{
    "PageTitle": "adaptation-rule",
    "FuncDef": "This command defines the method used by the system to derive the operational FIR, CIR and PIR settings when the queue is provisioned in hardware. For the FIR, CIR and PIR parameters individually, the system attempts to find the best operational rate depending on the defined constraint.",
    "CLIs": [
        "adaptation-rule [ pir adaptation-rule ] [ cir adaptation-rule ] [ fir { max | min | closest } ]",
        "no adaptation-rule"
    ],
    "ParentView": [
        "config>qos>sap-ingress>queue"
    ],
    "ParaDef": [
        {
            "Parameters": "pir adaptation-rule",
            "Info": "Defines the constraints enforced when adapting the queue's PIR. The pir parameter requires a qualifier that defines the constraint used when deriving the operational PIR for the queue. When the pir parameter is not specified, the default applies."
        },
        {
            "Parameters": "cir adaptation-rule",
            "Info": "Defines the constraints enforced when adapting the queue's CIR. The cir parameter requires a qualifier that defines the constraint used when deriving the operational CIR for the queue. When the cir parameter is not specified, the default constraint applies."
        },
        {
            "Parameters": "fir",
            "Info": "Defines the constraints enforced when adapting the queue's FIR. The fir parameter requires a qualifier that defines the constraint used when deriving the operational CIR for the queue. When the fir parameter is not specified, the default constraint applies. FIR is only supported on FP4 hardware and is ignored when the related policy is applied to FP2- or FP3-based hardware."
        },
        {
            "Parameters": "max",
            "Info": "Specifies that the operational rate for the queue will be equal to or less than the requested rate."
        },
        {
            "Parameters": "min",
            "Info": "Specifies that the operational rate for the queue will be equal to or greater than the requested rate."
        },
        {
            "Parameters": "closest",
            "Info": "Specifies that the operational rate for the queue will be the rate closest to the requested rate."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: adaptation-rule pir closest cir closest fir closest"
}