{
    "PageTitle": "bcg",
    "FuncDef": "Theshow qos bcgcommand outputs the current and historical visitation time associated with the specified BCG name.",
    "CLIs": [
        "bcg <burst-control-group-name> member-queues [ at-risk-only ] [ exp-util-bw <megabits-persecond> ] [ port <port-id> ] [ sap <sap-id> ] [ subscriber <sub-ident> ] [ access-queue-grp <queue-group-name> ] [ service-id <service-id> ]",
        "bcg <burst-control-group-name> [ member-queues ] [ exp-util-bw <megabits-persecond> ]",
        "bcg <card-slot-number> [ ingress | egress ]"
    ],
    "ParentView": [
        "show>qos"
    ],
    "ParaDef": [
        {
            "Parameters": "burst-control-group-name",
            "Info": "Specifies which globally unique Burst Control Group will be displayed. If the specified Burst Control Group does not exist, the show command will fail. Values-<slot>/<fp>-<target-visitation-time>[-<direction>]."
        },
        {
            "Parameters": "member-queues",
            "Info": "Includes a list of all queues attached to the specified burst-control-group-name. The 100% scheduling bandwidth used in the  at-risk  determination may be overridden with a specified scheduling bandwidth by using the exp-util-bw parameter. When the member-queues parameter is specified, the output includes a single entry summary of the internal queues."
        },
        {
            "Parameters": "exp-util-bw megabits-persecond",
            "Info": "Displays a calculated worst-case visitation rate for the specified BCG name based on the specified value of megabits-persecond which also modifies the member queue s  at-risk  state output. This parameter is not applicable to FP4-based hardware which has dedicated internal resources for handling BCG visitations and is unaffected by scheduling bandwidth. Values-0 to 4294967."
        },
        {
            "Parameters": "port port-id",
            "Info": "Specifies that the system should find and display the BCG and calculate the slowest accurate visitation time for the queues associated with the specified port-id. If the specified port-id does not exist, the show command will fail. Values-Up to 17 characters."
        },
        {
            "Parameters": "sap sap-id",
            "Info": "Specifies that the system should find and display the BCG and calculate the slowest accurate visitation time for the queues associated with the specified sap-id. If the specified sap-id does not exist, the show command will fail. Values-Up to 64 characters."
        },
        {
            "Parameters": "subscriber sub-ident",
            "Info": "Specifies that the system should find and display the BCG and calculate the slowest accurate visitation time for the queues associated with the specified sub-ident. If the specified sub-ident does not exist, the show command will fail. Values-Up to 32 characters."
        },
        {
            "Parameters": "access-queue-grp queue-group-name",
            "Info": "Specifies that the system should find and display the BCG and calculate the slowest accurate visitation time for the queues within the specified queue-group-name. If the specified queue-group-name is not found, the show command will fail. Values-Up to 32 characters."
        },
        {
            "Parameters": "service service-id",
            "Info": "Specifies that the system should find and display the BCG and calculate the slowest accurate visitation time for the queues associated with the specified service-id. If the specified service-id does not exist, the show command will fail. Values-1 to 2147483647."
        },
        {
            "Parameters": "card-slot-number",
            "Info": "Specifies that the system should find and display the BCG and calculate the slowest accurate visitation time for all queues associated with the specified card-slot-number. If the specified card-slot-number does not exist, the show command will fail. Values-1 to 40."
        },
        {
            "Parameters": "[ingress | egress]",
            "Info": "The ingress and egress keywords specify the direction to display and are mutually exclusive."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}