{
    "PageTitle": "copy",
    "FuncDef": "This command copies existing QoS policy entries for a QoS policy-id to another QoS policy-id.",
    "CLIs": [
        "copy hsmda-pool-policy <src-name> <dst-name> [ overwrite ]",
        "copy hsmda-scheduler-policy <src-name> <dst-name> [ overwrite ]",
        "copy hsmda-slope-policy <src-name> <dst-name> [ overwrite ]",
        "copy named-pool-policy <src-name> <dst-name> [ overwrite ]",
        "copy sap-egress <src-pol> <dst-pol> [ overwrite ]",
        "copy sap-ingress <src-pol> <dst-pol> [ overwrite ]"
    ],
    "ParentView": [
        "config>qos"
    ],
    "ParaDef": [
        {
            "Parameters": "hsmda-pool-policy src-name dst-name",
            "Info": "Indicates that the source HSMDA pool policy ID and the destination policy ID are HSMDA pool policy IDs. Specify the source policy ID that the copy command will attempt to copy from and specify the destination policy ID to which the command will copy a duplicate of the policy. This parameter applies only to the 7450 ESS and 7750 SR."
        },
        {
            "Parameters": "hsmda-scheduler-policy src-name dst-name",
            "Info": "Indicates that the source HSMDA scheduler policy ID and the destination policy ID are HSMDA scheduler policy IDs. Specify the source policy ID that the copy command will attempt to copy from and specify the destination policy ID to which the command will copy a duplicate of the policy. This parameter applies only to the 7450 ESS and 7750 SR."
        },
        {
            "Parameters": "hsmda-slope-policy src-name dst-name",
            "Info": "Indicates that the source HSMDA slope policy ID and the destination policy ID are HSMDA slope policy IDs. Specify the source policy ID that the copy command will attempt to copy from and specify the destination policy ID to which the command will copy a duplicate of the policy. This parameter applies only to the 7450 ESS and 7750 SR."
        },
        {
            "Parameters": "overwrite",
            "Info": "Specifies to replace the existing destination policy. Everything in the existing destination policy will be overwritten with the contents of the source policy. If overwrite is not specified, an error will occur if the destination policy ID exists."
        },
        {
            "Parameters": "sap-egress src-pol dst-pol",
            "Info": "Indicates that the source policy ID and the destination policy ID are SAP egress policy IDs. Specify the source policy ID that the copy command will attempt to copy from and specify the destination policy ID to which the command will copy a duplicate of the policy. Values-1 to 65535."
        },
        {
            "Parameters": "sap-ingress src-pol dst-pol",
            "Info": "Indicates that the source policy ID and the destination policy ID are SAP ingress policy IDs. Specify the source policy ID that the copy command will attempt to copy from and specify the destination policy ID to which the command will copy a duplicate of the policy. Values-1 to 65535."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}