{
    "PageTitle": "dot1p",
    "FuncDef": "This command defines a specific dot1p value that must be matched to perform the associated reclassification actions. If an egress packet on the SAP matches the specified dot1p value, the forwarding class or profile may be overridden. By default, the forwarding class and profile of the packet is derived from ingress classification and profiling functions.",
    "CLIs": [
        "dot1p <dot1p-value> [ fc <fc-name> ] [ profile { in | out | use-de | exceed | inplus } ]",
        "no dot1p <dot1p-value>"
    ],
    "ParentView": [
        "config>qos>sap-egress"
    ],
    "ParaDef": [
        {
            "Parameters": "dot1p-value",
            "Info": "This value is a required parameter that specifies the unique IEEE 802.1p value that will match the dot1p rule. If the command is executed multiple times with the same dot1p-value, the previous forwarding class and enqueuing priority is completely overridden by the new parameters or defined to be inherited when a forwarding class or enqueuing priority parameter is missing. Values-0 to 7."
        },
        {
            "Parameters": "fc fc-name",
            "Info": "The value given for the fc-name parameter must be one of the predefined forwarding classes in the system. Specifying the FC name is optional. When a packet matches the rule, the forwarding class is only overridden when the fc fc-name parameter is defined on the rule. If the packet matches and the forwarding class is not explicitly defined in the rule, the forwarding class is inherited based on previous rule matches. ParamDefault: Default- None"
        },
        {
            "Parameters": "profile {in | out | use-de | exceed | inplus}",
            "Info": "The profile reclassification action is optional. When specified, packets matching the dot1p value will be explicitly reclassified to the profile specified regardless of the ingress profiling decision. The explicit profile reclassification may be overwritten by a DSCP, IP precedence, IPv6 criteria, or IP criteria reclassification match. To remove the profile reclassification action for the specified dotp1 value, the dot1p command must be re-executed without the profile reclassification action defined. Values-in - Specifies that any packets matching the reclassification rule will be treated as in-profile by the egress forwarding plane.."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}