{
    "PageTitle": "dscp",
    "FuncDef": "This command defines IP Differentiated Services Code Point (DSCP) names that must be matched to perform the associated reclassification actions. The specified name must exist as a DSCP name. SR OS software provides names for the well-known code points. A list of up to eight DSCP names can be entered on a single command. The lists of DSCP names within the configuration are managed by the system to ensure that each list does not exceed eight names. Entering more than eight DSCP names with the same parameters (fc,hsmda-counter-override,profile) will result in multiple lists being created. Conversely, multiple lists with the same parameters (fc,hsmda-counter-override,profile) are merged and the lists repacked to a maximum of eight per list if DSCP names are removed or the parameters changed so the multiple lists use the same parameters. Also, if a subset\nof a list is entered with different parameters, a new list will be created for the subset. When the list is stored in the configuration, the DSCP names are sorted by their DSCP value in ascending numerical order; consequently, the order in the configuration may not be exactly what the user entered.",
    "CLIs": [
        "dscp <dscp-name> [ <dscp-name> ] [ fc <fc-name> ] [ hsmda-counter-override <counter-id> ] [ profile { in | out | exceed | inplus } ]",
        "no dscp <dscp-name> [ <dscp-name> ]"
    ],
    "ParentView": [
        "config>qos>sap-egress"
    ],
    "ParaDef": [
        {
            "Parameters": "dscp-name",
            "Info": "The dscp-name parameter is required when defining a DSCP reclassification rule. The specified name must exist as a DSCP name. A maximum of eight DSCP names can be specified in a single statement. SR OS software provides names for the well-known code points. These can be shown using the following command:."
        },
        {
            "Parameters": "fc-name:",
            "Info": "The fc reclassification action is optional. When specified, packets matching the IP DSCP value corresponding to a specified dscp-name will be explicitly reclassified to the forwarding class specified as fc-name regardless of the ingress classification decision. The explicit forwarding class reclassification may be overwritten by an IP criteria reclassification match. The fc name defined must be one of the eight forwarding classes supported by the system. To remove the forwarding class reclassification action for the specified DSCP value, the dscp command must be re-executed without the fc reclassification action defined. Values-be, l1, af, l2, h1, ef, h2 or nc."
        },
        {
            "Parameters": "profile",
            "Info": "The profile reclassification action is optional. When specified, packets matching the IP DSCP value corresponding to a specified dscp-name will be explicitly reclassified to the specified profile regardless of the ingress profiling decision. The explicit profile reclassification may be overwritten by an IPv6 criteria or IP criteria reclassification match. To remove the profile reclassification action for the specified dscp-name, the dscp command must be re-executed without the profile reclassification action defined."
        },
        {
            "Parameters": "in",
            "Info": "Specifies that any packets matching the reclassification rule will be treated as in-profile by the egress forwarding plane."
        },
        {
            "Parameters": "out",
            "Info": "Specifies that any packets matching the reclassification rule will be treated as out-of-profile by the egress forwarding plane."
        },
        {
            "Parameters": "exceed",
            "Info": "Specifies that when exceed is specified, any packets matching the reclassification rule will be treated as exceed-profile by the egress forwarding plane."
        },
        {
            "Parameters": "inplus",
            "Info": "Specifies that any packets matching the reclassification rule will be treated as inplus-profile by the egress forwarding plane."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}