{
    "PageTitle": "lsp-exp",
    "FuncDef": "This command explicitly sets the forwarding class or subclass enqueuing priority when a packet is marked with a MPLS EXP bits specified. Adding a lsp-exp rule on the policy forces packets that match the MPLS LSP EXP specified to override the forwarding class and enqueuing priority based on the parameters included in the lsp-exp rule. When the forwarding class is not specified in the rule, a matching packet preserves (or inherits) the existing forwarding class derived from earlier matches in the classification hierarchy. When the enqueuing priority is not specified in the rule, a matching packet preserves (or inherits) the existing enqueuing priority derived from earlier matches in the classification hierarchy.",
    "CLIs": [
        "lsp-exp <lsp-exp-value> [ fc <fc-name> ] [ priority { low | high } ]",
        "no lsp-exp <lsp-exp-value>"
    ],
    "ParentView": [
        "config>qos>sap-ingress"
    ],
    "ParaDef": [
        {
            "Parameters": "lsp-exp-value",
            "Info": "This value is a required parameter that specifies the unique MPLS LSP EXP value that will match the lsp-exp rule. If the command is executed multiple times with the same lsp-exp-value, the previous forwarding class and enqueuing priority is completely overridden by the new parameters or defined to be inherited when a forwarding class or enqueuing priority parameter is missing. Values-0 to 7."
        },
        {
            "Parameters": "fc fc-name",
            "Info": "The value given for the fc-name parameter must be one of the predefined forwarding classes in the system. Specifying the fc-name is optional. When a packet matches the rule, the forwarding class is only overridden when the fc fc-name parameter is defined on the rule. If the packet matches and the forwarding class is not explicitly defined in the rule, the forwarding class is inherited based on previous rule matches. Values-fc: |class[.subclass], ||class: be, l2, af, l1, h2, ef, h1, nc, ||subclass: 29 characters max."
        },
        {
            "Parameters": "priority",
            "Info": "The priority parameter is used to override the default enqueuing priority for all packets received on an ingress SAP using this policy that match this rule. Specifying the priority is optional. When a packet matches the rule, the enqueuing priority is only overridden when the priority parameter is defined on the rule. If the packet matches and priority is not explicitly defined in the rule, the enqueuing priority is inherited based on previous rule matches."
        },
        {
            "Parameters": "high",
            "Info": "The high parameter is used in conjunction with the priority parameter. Setting the enqueuing parameter to high for a packet increases the likelihood of enqueuing the packet when the ingress queue is congested. Ingress enqueuing priority only affects ingress SAP queuing. When the packet is placed in a buffer on the ingress queue, the significance of the enqueuing priority is lost."
        },
        {
            "Parameters": "low",
            "Info": "The low parameter is used in conjunction with the priority parameter. Setting the enqueuing parameter to low for a packet decreases the likelihood of enqueuing the packet when the ingress queue is congested. Ingress enqueuing priority only affects ingress SAP queuing. When the packet is placed in a buffer on the ingress queue, the significance of the enqueuing priority is lost. ParamDefault: Default- no override"
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}