{
    "PageTitle": "packet-byte-offset",
    "FuncDef": "This command is used to modify the size of each packet handled by the policer by adding or subtracting a number of bytes. The actual packet size is not modified; only the size used to determine the bucket depth impact is changed. Thepacket-byte-offsetcommand is meant to be an arbitrary mechanism that can be used to either add downstream frame encapsulation or remove portions of packet headers. Both the policing metering and profiling throughput is affected by the offset as well as the stats associated with the policer.",
    "CLIs": [
        "packet-byte-offset { add <add-bytes> | subtract <sub-> <bytes> }",
        "no packet-byte-offset"
    ],
    "ParentView": [
        "config>qos>sap-ingress>dyn-policer",
        "config>qos>sap-egress>dyn-policer",
        "config>qos>sap-ingress>policer",
        "config>qos>sap-egress>policer"
    ],
    "ParaDef": [
        {
            "Parameters": "add add-bytes",
            "Info": "The add keyword is mutually exclusive to the subtract keyword. Either add or subtract must be specified. When add is defined, the corresponding bytes parameter specifies the number of bytes that is added to the size of each packet associated with the policer for rate metering, profiling, and accounting purposes. From the policer s perspective, the maximum packet size is increased by the amount being added to the size of each packet. Values-0 to 31."
        },
        {
            "Parameters": "subtract sub-bytes",
            "Info": "The subtract keyword is mutually exclusive to the add keyword. Either add or subtract must be specified. When subtract is defined, the corresponding bytes parameter specifies the number of bytes that is subtracted from the size of each packet associated with the policer for rate metering, profiling, and accounting purposes. From the policer s perspective, the maximum packet size is reduced by the amount being subtracted from the size of each packet. The minimum resulting packet size used by the system is 1 byte. Values-1 to 64."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}