{
    "PageTitle": "parent",
    "FuncDef": "This command is used to create a child-to-parent mapping between each instance of the policer and either therootarbiter or a specific tieredarbiteron the object where the policy is applied. Defining a parent association for the policer causes the policer to compete for the parent policer s available bandwidth with other child policers mapped to the policer control hierarchy.",
    "CLIs": [
        "parent <arbiter-name> [ weight <weight-within-level> ] [ level <level> ]",
        "no parent"
    ],
    "ParentView": [
        "config>qos>sap-ingress>dyn-policer",
        "config>qos>sap-egress>dyn-policer",
        "config>qos>sap-ingress>policer",
        "config>qos>sap-egress>policer"
    ],
    "ParaDef": [
        {
            "Parameters": "{root | arbiter-name}",
            "Info": "When the parent command is executed, either the keyword root or an arbiter-name must be specified."
        },
        {
            "Parameters": "root",
            "Info": "The root keyword specifies that the policer is intended to become a child to the root arbiter where an instance of the policer is created. If the root arbiter does not exist, the policer will be placed in the orphan state. ParamDefault: Default- root"
        },
        {
            "Parameters": "arbiter-name",
            "Info": "The arbiter-name parameter specifies that the policer is intended to become a child to one of the tiered arbiters with the given arbiter-name where an instance of the policer is created. If the specified arbiter-name does not exist, the policer will be placed in the orphan state."
        },
        {
            "Parameters": "weight weight-within-level",
            "Info": "The weight weight-within-level keyword and parameter are optional when executing the parent command. When weight is not specified, a default level of 1 is used in the parent arbiters priority level. When weight is specified, the weight-within-level parameter must be specified as an integer value from 1 through 100. ParamDefault: Default- 1"
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}