{
    "PageTitle": "percent-rate",
    "FuncDef": "This command configures a queue's PIR and CIR as a percentage of the egress port line rate or as a percentage of its parent scheduler rate oragg-raterate. When the rates are expressed as aport-limit, the actual rates used per instance of the queue will vary based on the port speed. For example, when the same QoS policy is used on a 1 Gb and a 10 Gb Ethernet port, the queue s rates will be 10 times greater on the 10 Gb port due to the difference in port speeds. This enables the same QoS policy to be used on SAPs on different ports without needing to use SAP-based queue overrides to modify a queue s rate to get the same relative performance from the queue.",
    "CLIs": [
        "percent-rate <pir-percent> [ cir <cir-percent> ] [ { port-limit | local-limit } ]",
        "no percent-rate"
    ],
    "ParentView": [
        "config>qos>sap-egress>queue"
    ],
    "ParaDef": [
        {
            "Parameters": "pir-percent",
            "Info": "Specifies the queue s PIR as a percentage dependent on the use of the port-limit or local-limit. Values-0.01 to 100.00. ParamDefault: Default- 100.00"
        },
        {
            "Parameters": "cir-percent",
            "Info": "Specifies the queue s CIR as a percentage dependent on the use of the port-limit or local-limit. Values-0.00 to 100.00. ParamDefault: Default- 100.00"
        },
        {
            "Parameters": "port-limit",
            "Info": "Specifies that the configure PIR and CIR percentages are relative to the rate of the port (including the egress-rate setting) to which this queue connects. The port-limit is the default."
        },
        {
            "Parameters": "local-limit",
            "Info": "Specifies that the configure PIR and CIR percentages are relative to the rate of the queue s parent scheduler rate or agg-rate rate at egress. If there is no parent scheduler rate or agg-rate rate, or those rates are max, the port-limit is used."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}