{
    "PageTitle": "port-parent",
    "FuncDef": "This command specifies whether this SAP egress policer feeds off a port-level scheduler. When configured, the policer is parented by a port-level scheduler. This requires thatpolicers-hqos-manageablebe configured in the SAP egress QoS policy. This command and the SAP egress policerscheduler-parentand theparentcommands are mutually exclusive.",
    "CLIs": [
        "port-parent [ weight <weight> ] [ level <level> ] [ cir-weight <cir-weight> ] [ cir-level <cir-level> ]",
        "no port-parent"
    ],
    "ParentView": [
        "config>qos>sap-egress>policer"
    ],
    "ParaDef": [
        {
            "Parameters": "weight weight",
            "Info": "Defines the weight that the policer will use at the above-CIR port priority level (defined by the level parameter). Values-0 to 100. ParamDefault: Default- 1"
        },
        {
            "Parameters": "level level",
            "Info": "Defines the port priority that the policer will use to receive bandwidth for its above-CIR offered load. Values-1 to 8 (8 is the highest priority). ParamDefault: Default- 1"
        },
        {
            "Parameters": "cir-weight cir-weight",
            "Info": "Defines the weight that the policer will use at the within-CIR port priority level (defined by the cir-level parameter). Values-0 to 100. ParamDefault: Default- 0"
        },
        {
            "Parameters": "cir-level cir-level",
            "Info": "Defines the port priority that the policer will use to receive bandwidth for its within-CIR offered load. If the cir-level parameter is set to a value of 0 (the default value), the policer does not receive bandwidth during the port schedulers within-CIR pass and the cir-weight parameter is ignored. If the cir-level parameter is 1 or greater, the cir-weight parameter is used. Values-0 to 8 (8 is the highest priority). ParamDefault: Default- 0"
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: no port-parent"
}