{
    "PageTitle": "queue",
    "FuncDef": "Theshow qos queuecommand outputs the Burst Control Group (BCG) name and slowest accurate visitation time for the specified queues.",
    "CLIs": [
        "queue queue-group <port-id> <queue-group-name> { ingress | egress } [ id <queue-id> ] [ instance <instance-id> ]",
        "queue sap <sap-id> { ingress | egress } [ id <queue-id> ]",
        "queue subscriber <sub-ident-string> [ sla-profile <sla-profile-name> ] { ingress | egress } [ id <queue-id> ]"
    ],
    "ParentView": [
        "show>qos"
    ],
    "ParaDef": [
        {
            "Parameters": "port-id queue-group-name",
            "Info": "Specifies that the system should find and display the BCG and calculate the slowest accurate visitation time for the queues within the specified queue-group-name on the specified port-id. If the specified port-id is not provisioned on the system or the specified queue-group-name is not found on the port s specified direction, the show command will fail. Values-port-id: up to 17 characters."
        },
        {
            "Parameters": "{ingress | egress}",
            "Info": "Specifies the direction to display and are mutually exclusive."
        },
        {
            "Parameters": "queue-id",
            "Info": "Limits the return queues to a single queue-id. Values-1 to 16."
        },
        {
            "Parameters": "instance-id",
            "Info": "Specifies which instance of a queue group with template queue-group-name to which this queue should be redirected. This parameter is only valid for queue groups on egress ports where policy-based redirection is required. Values-1 to 65535."
        },
        {
            "Parameters": "sap-id",
            "Info": "Specifies that the system should find and display the BCG and calculate the slowest accurate visitation time for the queues within the specified sap-id. If the specified sap-id is not found, the show command will fail. Values-up to 64 characters."
        },
        {
            "Parameters": "sub-ident-string",
            "Info": "Specifies that the system should find and display the BCG and calculate the slowest accurate visitation time for the queues associated with the specified sub-ident-string. If the specified sub-ident-string does not exist, the show command will fail. Values-up to 32 characters."
        },
        {
            "Parameters": "sla-profile-name",
            "Info": "Specifies that the system should find and display the BCG and calculate the slowest accurate visitation time for the queues associated with the specified subscriber and sla-profile sla-profile-name. If the specified sla-profile-name does not exist, the show command will fail."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}