{
    "PageTitle": "queue",
    "FuncDef": "This command overrides the default queue mapping forfcfc-name. The specified queue-id must exist within the policy before the mapping can be made. When the forwarding class mapping is executed, all traffic is classified to fc-name on a SAP using this policy.",
    "CLIs": [
        "queue <queue-id> [ { group <queue-group-name> [ instance <instance-id> ] | port-redirect-group-queue } ]",
        "no queue"
    ],
    "ParentView": [
        "config>qos>sap-egress>fc"
    ],
    "ParaDef": [
        {
            "Parameters": "queue-id",
            "Info": "Specifies the SAP egress queue-id to be associated with the forwarding class. The queue-id must be an existing queue defined in sap-egress policy-id. Values-1 to 8. ParamDefault: Default- 1"
        },
        {
            "Parameters": "queue-group-name",
            "Info": "This optional parameter is used to redirect the forwarding type within the forwarding class to the specified queue-id within the queue-group-name. When the policy is applied, all packets matching the forwarding class and forwarding type will be redirected to the queue within the specified queue group. The queue-group-name are configured in the config>qos>queue-group-templates egress and ingress contexts. This parameter is used when policy-based queue group redirection is desired. That is, the specific queue group to redirect to is named in the QoS policy."
        },
        {
            "Parameters": "instance-id",
            "Info": "This parameter is used to specify the specific instance of a queue group with template queue-group-name to which this queue should be redirected. This parameter is only valid for queue groups on egress ports where policy-based redirection is required. Values-1 to 40960. ParamDefault: Default- 1"
        },
        {
            "Parameters": "port-redirect-group-queue",
            "Info": "This keyword is used to mark a given forwarding class queue for redirection to an egress queue group queue. This is only used when the specific queue group instance is assigned at the time the QoS policy is applied to the SAP. This redirection model is known as SAP-based redirection."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: no queue"
}