{
    "PageTitle": "display snmp-agent statistics",
    "FuncDef": "The display snmp-agent statistics command displays SNMP messages statistics.",
    "CLIs": [
        "display snmp-agent statistics"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> display snmp-agent statistics",
            "  3158 Messages delivered to the SNMP entity",
            "  0 Messages which were for an unsupported version",
            "  0 Messages which used an SNMP community name not known",
            "  0 Messages which represented an illegal operation for the community supplied",
            "  0 ASN.1 or BER errors in the process of decoding",
            "  3152 Messages passed from the SNMP entity",
            "  0 SNMP PDUs which had badValue error-status",
            "  3 SNMP PDUs which had genErr error-status",
            "  0 SNMP PDUs which had noSuchName error-status",
            "  0 SNMP PDUs which had tooBig error-status",
            "  3135 MIB objects retrieved successfully",
            "  0 MIB objects altered successfully",
            "  0 GetRequest-PDU accepted and processed",
            "  3158 GetNextRequest-PDU accepted and processed",
            "  0 GetBulkRequest-PDU accepted and processed",
            "  3152 GetResponse-PDU sent",
            "  0 SetRequest-PDU accepted and processed",
            "  0 Trap-PDU sent",
            "  0 Inform-PDU sent",
            "  0 Inform-PDU received with no acknowledgement",
            "  0 Inform-PDU received with acknowledgement"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo view statistics about SNMP messages, run the display snmp-agent statistics command. The command output contains information about the communication between the SNMP agent and NM station for fault identification.\nIn an SNMP management system, an NM station and an SNMP agent exchange SNMP messages as follows:\nThe NM station acts as a manager to send an SNMP Request message to the SNMP agent.The SNMP agent searches the MIB on the device for desired information and sends an SNMP Response message to the NM station.When the trap triggering conditions are met, the SNMP agent sends a trap message to the NM station to report the event occurring on the device. The network administrator can process the event occurring on the network immediately.\nIf a large number of messages are received within a short period, a great number of CPU resources are consumed. The number of received messages depends on the frequency at which the NM station sends the Request messages."
}