{
    "PageTitle": "display snmp-agent notification-log",
    "FuncDef": "The display snmp-agent notification-log command displays alarm logs in an alarm buffer.",
    "CLIs": [
        "display snmp-agent notification-log [ logtime <startTime> <startDate> to <endTime> <endDate> | size <size> ]",
        "display snmp-agent notification-log info"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "logtime startTime",
            "Info": "Specifies the start time when a device logs alarms.\nThe value is in the format of HH:MM:SS. The HH value ranges from 0 to 23, and the MM and SS values range from 0 to 59."
        },
        {
            "Parameters": "startDate",
            "Info": "Specifies the start date when a device logs alarms.\nThe value is in the format of YYYY/MM/DD. The YYYY value ranges from 2000 to 2099, the MM value ranges from 1 to 12, and the DD value ranges from 1 to 31."
        },
        {
            "Parameters": "to endTime",
            "Info": "Specifies the end time when a device stops logging alarms.\nThe value is in the format of HH:MM:SS YYYY/MM/DD. The HH value ranges from 0 to 23, and the MM and SS values range from 0 to 59. The YYYY value ranges from 2000 to 2099, the MM value ranges from 1 to 12, and the DD value ranges from 1 to 31."
        },
        {
            "Parameters": "endDate",
            "Info": "Specifies the end date when a device stops logging alarms.\nThe value is in the format of YYYY/MM/DD. The YYYY value ranges from 2000 to 2099, the MM value ranges from 1 to 12, and the DD value ranges from 1 to 31."
        },
        {
            "Parameters": "size size",
            "Info": "Specifies the recent alarm logs to be displayed.\nThe VRP supports 15000. If the specified number of alarm logs to be displayed exceeds the number of alarm logs currently saved by the system, information on all alarm logs in the alarm buffer is displayed."
        },
        {
            "Parameters": "info",
            "Info": "Indicates information in an alarm buffer. The information includes the number of global alarm logs in the alarm buffer, the number of discarded alarm logs, aging time of alarm logs, limitation on the number of alarm logs, total number of existing alarm logs, and enabling status of alarm logging.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display snmp-agent notification-log info",
            " Notification log information: ",
            " Notification Admin Status : enable",
            " GlobalNotificationsLogged : 0",
            " GlobalNotificationsBumped : 0",
            " GlobalNotificationsLimit  : 1000",
            " GlobalNotificationsAgeout : 36",
            " Total number of notification log(s): 0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nYou can set the following conditions for displaying detailed information about alarm logs in the alarm buffer:\nA specific piece of alarm logsAlarm logs based on the time when alarms are loggedAll alarm logs by default"
}