{
    "PageTitle": "display snmp-agent usm-user",
    "FuncDef": "The display snmp-agent usm-user command displays information about an SNMP user.",
    "CLIs": [
        "display snmp-agent usm-user [ engineid <engineid> | username <user-name> | group <group-name> ] *"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "engineid engineid",
            "Info": "Displays information about an SNMPv3 user with a specified engine ID.\nThe value is a string of 10 to 64 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "username user-name",
            "Info": "Displays information about a specified SNMPv3 user.\nThe value is a string of 1 to 32 case-sensitive characters, spaces not supported.\nWhen quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "group group-name",
            "Info": "Displays the SNMPv3 user belonging to a specified group.\nThe value is a string of 1 to 32 case-sensitive characters, spaces not supported.\nWhen quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display snmp-agent usm-user",
            "   User name: usmtest1",
            "       Engine ID: 800007DB0338BA8B9AAC01 active",
            "       Authentication Protocol: sha2-512",
            "       Privacy Protocol: aes256",
            "       State: Active"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo view the SNMP user information configured, run the display snmp-agent usm-user command. The SNMP user is a remote user that carries out SNMP management.\nThe command output contains the following information:\nUser name.Local engine ID of the user. The SNMP engine ID uniquely identifies an SNMP agent in a management domain. The SNMP engine ID is an important component of the SNMP agent. It helps schedule and process SNMP messages and implement security authentication and access control.\n\nPrecautions\nThe display snmp-agent usm-user command is applicable only to SNMPv3 users."
}