{
    "PageTitle": "display snmp-agent inform",
    "FuncDef": "The display snmp-agent inform command displays parameters configured for a specific or all target hosts to send Inform messages.",
    "CLIs": [
        "display snmp-agent inform { host-name <host-name> | address udp-domain <ip-address> [ vpn-instance <vpn-instance-name> ] params securityname { <interface-name> | { cipher <protocol-interface-name> } } }",
        "display snmp-agent inform"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "host-name host-name",
            "Info": "Specifies an SNMP target host name.\nThe name is a string of 1 to 32 characters, spaces not supported.\nWhen quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "address",
            "Info": "Indicates the address of a target host for receiving SNMP messages.\nThe IP address specified using address and the security name specified using securityname together identify a host."
        },
        {
            "Parameters": "udp-domain ip-address",
            "Info": "Specifies the IP address of a target host within a User Datagram Protocol (UDP) transmission domain.\n-"
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string.\nvpn-instance is optional. To run the display snmp-agent inform command on a VPN network, use the VPN instance name, IP address, and security name together to identify a host."
        },
        {
            "Parameters": "params",
            "Info": "Indicates information about a target host that generates SNMP messages.\n-"
        },
        {
            "Parameters": "securityname interface-name",
            "Info": "Specifies the user name or community name displayed on the NMS.\nThe value is a string of 1 to 32 case-sensitive characters, spaces not supported.\nWhen quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "cipher protocol-interface-name",
            "Info": "Specifies the unencrypted or encrypted password of a security name. The simple text password or the ciphertext password can be entered. The password in the configuration file is displayed in ciphertext.\nA simple text password is a string of 1 to 32 case-sensitive characters. A ciphertext password is a string of 48 or from 68 to 168 case-sensitive characters.\nWhen quotation marks are used around the string, spaces are allowed in the string.\nCiphertext passwords with various lengths configured in an earlier version are also supported in the existing version."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display snmp-agent inform",
            "Global config: resend-times 3, timeout 15s, pending 39",
            "Global status: current notification count 0",
            "Target-host ID: Host name/VPN instance/IP-Address/Security name",
            "targetHost_1_36305/-/10.1.1.1/%#%#[7SCH}$<HX.vZ8%7YS3L:IsCPA^LbRRK-`/6\"i\"$%#%#:",
            "    Config: resend-times 3, timeout 15s",
            "    Status: retries 0, pending 0, sent 0, dropped 0, failed 0, confirmed 0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo view the configuration of sending Inform messages on all target hosts, run the display snmp-agent inform command. The command output contains the following information:\nRetransmission times configured on all target hostsTimeout periodMaximum number of Inform messages that can be pending in the inform buffer for acknowledgment from the NMSCurrent number of Inform messages pending in the inform buffer waiting for acknowledgment from the NMS\nTo view the configuration of sending Inform messages on a specified target host and message statistics, run the display snmp-agent inform command. The command output contains the following information:\nRetransmission times configured on the specified target hostTimeout period in seconds after which an inform message is retransmitted from the inform buffer to the NMS.Number of times that an Inform message has been retransmittedNumber of Inform messages to be confirmedNumber of Inform messages that have been sentNumber of Inform messages that are dropped because the inform buffer is fullNumber of Inform messages that are dropped because no corresponding acknowledgement messages are returnedNumber of received acknowledgement messages\n\nPrerequisites\nThe IP address of the target host that receives Inform messages and parameters for sending Inform messages has been configured using the snmp-agent target-host inform command."
}