{
    "PageTitle": "snmp-agent inform (System view)",
    "FuncDef": "The snmp-agent inform command sets global parameters of Inform messages. The parameters include the timeout period for waiting for Inform ACK messages, number of times to retransmit Inform messages, and maximum number of Inform messages to be confirmed in the inform buffer.\nThe undo snmp-agent inform command restores the default parameters.\nBy default, the time-out waiting period for Inform ACK messages is 15 seconds, the number of times to retransmit Inform messages is 3, and the maximum number of informs in the inform buffer is 39.",
    "CLIs": [
        "snmp-agent inform { timeout <seconds> | resend-times <times> | pending <number> } *",
        "undo snmp-agent inform { timeout <seconds> | resend-times <times> | pending <number> } *"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "timeout seconds",
            "Info": "Specified the timeout period for waiting for Inform ACK messages from the NMS.\nThe value is an integer ranging from 1 to 1800, in seconds. The default value is 15, which is equal to the global timeout period configured using the snmp-agent inform command."
        },
        {
            "Parameters": "resend-times times",
            "Info": "Specifies the maximum number of attempts to retransmit an Inform message if no Inform ACK message is returned by the NMS.\nThe value is an integer ranging from 0 to 10. The default value is 3, which is equal to the global retransmission times configured using the snmp-agent inform command."
        },
        {
            "Parameters": "pending number",
            "Info": "Specifies the maximum number of Inform messages to be confirmed in the inform buffer.\nThe value is an integer ranging from 1 to 2048. The default value is 39."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] snmp-agent inform resend-times 5 pending 100"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter sending an Inform message, an SNMP agent waits for an Inform ACK message sent by the NMS. You can run the snmp-agent inform command to set parameters timeout, resend-times, and pending for Inform messages.\nThese three parameters affect one another. For example, if the timeout period for waiting for Inform ACK messages prolongs or the number of attempts to retransmit Inform messages increases, but the maximum number of Inform messages to be confirmed is not changed, the number of Inform messages to be confirmed increases, causing the inform buffer to be quickly filled up.\nOnce the inform buffer is filled up, the earliest Inform message in the inform buffer is deleted each time a new Inform message enters the queue. The deleted Inform messages are not retransmitted to the NMS. To prevent this problem, increase the maximum number of Inform messages to be confirmed in the inform buffer.\nYou can configure the snmp-agent inform command to contain the parameter timeout, resend-times, or pending as needed.\nWhen a large number of Inform messages are dropped on a network, run the snmp-agent inform pending command to increase the inform buffer.When the transmission speed on the network is low, increase the timeout period. Increasing the timeout period will increase the waiting time of Inform messages in the inform buffer. You can also run the snmp-agent inform { timeout | pending } * command to increase the inform message.When the transmission speed on the network is high, run the snmp-agent inform timeout command to reduce the timeout period.When Inform messages are transmitted on an unreliable network, increase the retransmission times. In this case, the Inform messages in the inform buffer need to wait for a longer time to be confirmed. You can run the snmp-agent inform { resend-times | pending } * command to increase the inform buffer.\n\nPrerequisites\nParameters for sending Inform messages take effect only after the IP address of the target host for receiving Inform messages is configured using the snmp-agent target-host inform command.\nThe IP address of the target host for receiving Inform messages has been configured using the snmp-agent target-host inform command.\nConfiguration Impact\nYou must set suitable parameters timeout, resend-times, and pending. Setting an inappropriate parameter deteriorates SNMP working efficiency.\nPrecautions\nOnly parameters for sending Inform messages need to be configured using the snmp-agent inform address command. Parameters for sending trap messages do not need to be configured."
}