{
    "PageTitle": "snmp-agent community",
    "FuncDef": "The snmp-agent community command configures an SNMPv1 or SNMPv2c read/write community name and specifies a MIB view for APs.\nThe undo snmp-agent community command restores the default configuration.\nBy default, no community name is configured for APs.",
    "CLIs": [
        "snmp-agent community { read | write } cipher <communityName> [ mib-view <view-name> ]",
        "undo snmp-agent community <communityName>"
    ],
    "ParentView": [
        "Virtual access port-extension view"
    ],
    "ParaDef": [
        {
            "Parameters": "read",
            "Info": "Indicates that the community name has the read-only permission in the specified MIB view.\n-"
        },
        {
            "Parameters": "write",
            "Info": "Indicates that the community name has the read-write permission in the specified MIB view.\n-"
        },
        {
            "Parameters": "cipher communityName",
            "Info": "Specifies a community name.\nThe value is a string of 8 to 32 and 48 and 68 to 168 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "mib-view view-name",
            "Info": "Specifies the name of a MIB view that can be accessed by the community name.\nThe value is a string of 8 to 32 case-sensitive characters in plaintext, 68 to 168 or a string of 48 or 68 case-sensitive characters in ciphertext, spaces not supported.\nThe string can contain spaces if it is enclosed in double quotation marks (\")."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] virtual-access port-extend",
            "[*HUAWEI-virtual-access-portextend] snmp-agent community read cipher huawei-123"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAn SNMP proxy community defines administrative relationships between NMSs and managed devices. The community name acts like a password to regulate access to a managed device. An NMS can access a managed device only if the community name carried in the SNMP request sent by the NMS is the same as the community name configured on the managed device. You can run the snmp-agent community command to configure an SNMP community name to implement communication between an NMS and APs.\nPrecautions\nThis command is supported only on the admin VS.\nAn NMS can access a device only when the community names configured on the NMS are the same as those configured on the AP."
}