{
    "PageTitle": "snmp-agent sys-info version(Virtual access port-extension view)",
    "FuncDef": "The snmp-agent sys-info version command sets an SNMP version for an AP.\nThe undo snmp-agent sys-info version command deletes current configurations.\nBy default, the system version is not configured for APs.",
    "CLIs": [
        "snmp-agent sys-info version { { <version1> | <version2c> | <version3> } * | <all> }",
        "snmp-agent sys-info version <all>",
        "undo snmp-agent sys-info version { { <version1> | <version2c> | <version3> } * | <all> }"
    ],
    "ParentView": [
        "Virtual access port-extension view"
    ],
    "ParaDef": [
        {
            "Parameters": "version1",
            "Info": "Indicates SNMPv1.\nv1"
        },
        {
            "Parameters": "version2c",
            "Info": "Indicates SNMPv2c.\nv2c"
        },
        {
            "Parameters": "version3",
            "Info": "Indicates SNMPv3.\nv3"
        },
        {
            "Parameters": "all",
            "Info": "Enables all SNMP versions, namely, SNMPv1, SNMPv2c, and SNMPv3.\nall"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] virtual-access port-extend",
            "[*HUAWEI-virtual-access-portextend] snmp-agent sys-info version v1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure the contact information for a managed node, run the snmp-agent sys-info contact command.\nTo configure the physical location of a node, run the snmp-agent sys-info location command.\nTo configure features in a specified version, run the snmp-agent sys-info version command to set an SNMP version.\nSNMP of each version supports various access control functions:\nSNMPv1:\nCommunity-name-based access controlMIB-view-based access control\nSNMPv2c:\nCommunity-name-based access controlMIB-view-based access controlSupporting Inform messages\nBesides inheriting basic SNMPv2c operations, SNMPv3 defines a management architecture, which introduces a User-based Security Model (USM) to provide users with a more secure access mechanism.\nUser groupGroup-based access controlUser-based access controlSNMPv3 supports authentication and encryption\n\nPrecautions\nSNMPv1 and SNMPv2c have security risks. Using SNMPv3 is recommended."
}