{
    "PageTitle": "snmp-agent protocol(AP view)",
    "FuncDef": "The snmp-agent protocol source-interface command specifies a source interface on an AP for SNMP to receive and respond to requests from an NMS.\nThe undo snmp-agent protocol source-interface command restores the default configuration.\nThe snmp-agent protocol source-status all-interface command allows all interfaces on an AP to be used by SNMP to receive and respond to requests from an NMS.\nThe undo snmp-agent protocol source-status all-interface command restores the default configuration.\nBy default, no source interface is specified on an AP for SNMP to receive and respond to requests from an NMS. The function that allows all interfaces on an AP to be used by SNMP to receive and respond to requests from an NMS is not enabled.",
    "CLIs": [
        "snmp-agent protocol source-interface <protocol-interface-name>",
        "snmp-agent protocol source-status all-interface",
        "undo snmp-agent protocol source-interface <protocol-interface-name>",
        "undo snmp-agent protocol source-status all-interface"
    ],
    "ParentView": [
        "AP view"
    ],
    "ParaDef": [
        {
            "Parameters": "source-interface protocol-interface-name",
            "Info": "Specifies the name of a source interface used by SNMP to receive and respond to requests from an NMS.\nThe value is a string of 1 to 255 case-sensitive characters. It cannot contain spaces."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ap-id 2000",
            "[~HUAWEI-ap2000] snmp-agent protocol source-interface Loopback 1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ap-id 2000",
            "[~HUAWEI-ap2000] snmp-agent protocol source-status all-interface",
            "Warning: It will allowed all accessible network to access the device."
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo specify a source interface on an AP for SNMP to receive and respond to requests from an NMS, run the snmp-agent protocol source-interface command. To allow all interfaces on an AP to be used by SNMP to receive and respond to requests from an NMS, run the snmp-agent protocol source-status all-interface command.\nPrecautions\nThe snmp-agent protocol source-interface command can be used to specify a maximum of 20 source interfaces for SNMP to receive and respond to requests from the NMS.\nAfter the snmp-agent protocol source-status all-interface command is run, all interfaces on the device can be used by SNMP to receive and respond to requests from an NMS, which brings security risks. Therefore, a risk message will be displayed when you run the snmp-agent protocol source-status all-interface command.\nBefore running the snmp-agent protocol source-interface command on an AP, check whether the AP has the specified interface. If the AP does not have the specified interface, the configuration does not take effect."
}