{
    "PageTitle": "snmp-agent protocol ipv6 (AP view)",
    "FuncDef": "The snmp-agent protocol ipv6 source-ip command specifies an IPv6 source address on an AP for SNMP to receive and respond to requests from an NMS.\nThe undo snmp-agent protocol ipv6 source-ip command restores the default configuration.\nThe snmp-agent protocol source-status ipv6 all-interface command allows all IPv6 addresses on an AP to be used by SNMP to receive and respond to requests from an NMS.\nThe undo snmp-agent protocol source-status ipv6 all-interface command restores the default configuration.\nBy default, no IPv6 source address is specified on an AP for SNMP to receive and respond to requests from an NMS. The function that allows all IPv6 source addresses on an AP to be used by SNMP to receive and respond to requests from an NMS is not enabled.",
    "CLIs": [
        "snmp-agent protocol ipv6 source-ip <ip-address> [ vpn-instance <vpn-instance-name> ]",
        "snmp-agent protocol source-status ipv6 all-interface",
        "undo snmp-agent protocol ipv6 source-ip <ip-address> [ vpn-instance <vpn-instance-name> ]",
        "undo snmp-agent protocol source-status ipv6 all-interface"
    ],
    "ParentView": [
        "AP view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies the name of a VPN instance. Before specifying a VPN instance, ensure that the specified VPN instance has been created on the AP.\nThe value is a string of 1 to 31 characters without spaces."
        },
        {
            "Parameters": "source-ip ip-address",
            "Info": "Specifies an IPv6 source address.\nThe address is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ap-id 2000",
            "[~HUAWEI-ap2000] snmp-agent protocol ipv6 source-ip 2001:db8::1 vpn-instance vpn4"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ap-id 2000",
            "[~HUAWEI-ap2000] snmp-agent protocol source-status ipv6 all-interface",
            "Warning: It will allowed all accessible network to access the device."
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo specify an IPv6 source address on an AP for SNMP to receive and respond to requests from an NMS, run the snmp-agent protocol ipv6 source-ip command. To allow all IPv6 source addresses on an AP to be used by SNMP to receive and respond to requests from an NMS, run the snmp-agent protocol source-status ipv6 all-interface command.\nPrecautions\nThe snmp-agent protocol ipv6 source-ip command can be used to specify a maximum of 20 IPv6 source addresses for SNMP to receive and respond to requests from an NMS.\nAfter the snmp-agent protocol source-status ipv6 all-interface command is run, all IPv6 source addresses on the AP can be used by SNMP to receive and respond to requests from an NMS, which brings security risks. Therefore, a risk message will be displayed when you run the snmp-agent protocol source-status ipv6 all-interface command."
}