{
    "PageTitle": "snmp-agent blacklist user-block failed-times",
    "FuncDef": "The snmp-agent blacklist user-block failed-times command configures the maximum number of consecutive authentication failures allowed for an SNMPv3 user.\nThe undo snmp-agent blacklist user-block failed-times command restores the default maximum number of consecutive authentication failures allowed.\nBy default, an SNMPv3 user is locked if the user's five consecutive authentication attempts fail within 5 minutes.",
    "CLIs": [
        "snmp-agent blacklist user-block failed-times <failed-times> period <period-time>",
        "undo snmp-agent blacklist user-block failed-times"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "failed-times",
            "Info": "Specifies the maximum number of consecutive authentication failures allowed.\nThe value is an integer ranging from 0 to 10.\nValue 0 indicates that no limitation is set for the number of user consecutive authentication failures."
        },
        {
            "Parameters": "period period-time",
            "Info": "Specifies the period during which consecutive authentication attempts fail.\nThe value is an integer ranging from 1 to 120, in minutes. The default value is 5."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] snmp-agent blacklist user-block failed-times 3 period 5"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo defense against a user's attack to crack other users' passwords, run the snmp-agent blacklist user-block failed-times command so that when a user's consecutive authentication attempts exceed a specified number of times, the user is put on a blacklist and cannot be authenticated.\nConfiguration Impact\nThis command takes effect on subsequent SNMPv3 users, not existing logged-in SNMPv3 users.If a malicious user repeatedly enters incorrect passwords, the user will be put on a blacklist and not allowed to log in to a device.\n\nFollow-up Procedure\nTo unlock a user, run the snmp-agent activate usm-user command."
}