{
    "PageTitle": "snmp-agent trap enable feature-name",
    "FuncDef": "The snmp-agent trap enable feature-name command enables the device to send a specified trap about a specified feature to the NMS.\nThe undo snmp-agent trap enable feature-name command restores the default trap function.\nThe clear configuration snmp-agent trap enable command deletes all the trap function configurations of a feature in a one-click manner.\nTo view the default trap configuration, run the display snmp-agent trap all command.",
    "CLIs": [
        "snmp-agent trap enable feature-name <feature-name> [ trap-name <trap-name> ]",
        "clear configuration snmp-agent trap enable feature-name <feature-name>",
        "undo snmp-agent trap enable feature-name <feature-name> [ trap-name <trap-name> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "feature-name feature-name",
            "Info": "Specifies the name of a feature that generates traps.\nThe value is a string of 1 to 256 characters, which are case-insensitive and cannot be blank spaces."
        },
        {
            "Parameters": "trap-name trap-name",
            "Info": "Specifies the name of a trap.\nThe value is a string of 1 to 256 case-insensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] snmp-agent trap enable feature-name snmp trap-name coldstart"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] snmp-agent",
            "[*HUAWEI] clear configuration snmp-agent trap enable feature-name fm"
        ]
    ],
    "ExtraInfo": "Configuration Impact\nWhen enabling or disabling the global trap function, running the clear configuration snmp-agent trap enable feature-name feature-name command deletes the trap function configurations of a feature specified by feature-name and restores the trap function state to be the same as that of the global trap function.If the global trap function is in the default state, running the clear configuration snmp-agent trap enable feature-name feature-name command deletes the trap function configurations of the feature specified by feature-name and restores the trap function state to the default.\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}