{
    "PageTitle": "snmp-agent trap source",
    "FuncDef": "The snmp-agent trap source command specifies the source address of a specified interface for trap messages.\nThe undo snmp-agent trap source command deletes the source address of an interface for trap messages.\nBy default, the source address of trap messages is not specified.",
    "CLIs": [
        "snmp-agent trap source { <interface-name> | <interface-type> <interface-number> }",
        "undo snmp-agent trap source"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "interface-name",
            "Info": "Specifies the name of the source interface that sends trap messages.\n-"
        },
        {
            "Parameters": "interface-type",
            "Info": "Specifies the type of the source interface that sends trap messages.\n-"
        },
        {
            "Parameters": "interface-number",
            "Info": "Specifies the number of the source interface that sends trap messages.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] snmp-agent trap source GigabitEthernet 1/0/0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo specify the type and number of a source interface with a specific IP address used to send SNMP trap messages, run the snmp-agent trap source command.\nConfiguration Impact\nTrap messages carry IP addresses of the outbound interfaces, and the receivers can identify the source addresses.\nPrecautions\nThe source interface that sends trap messages must have an IP address configured.After the snmp-agent trap source command is run, the private VPN where the source interface resides is automatically bound to the interface.\nRules for a destination host to select a VPN\nRule 1: If the snmp-agent target-host trap command is run with a specified source interface-type interface-number, the private VPN bound to the source interface is used to send trap messages. Otherwise, refer to rule 2.Rule 2: If the snmp-agent trap source command is run to specify the source interface for trap messages globally, the private VPN bound to the source interface is used to send trap messages. Otherwise, refer to rule 3.Rule 3: If the snmp-agent target-host trap command is run with a specified public-net, the public network is used to send trap messages. Otherwise, refer to rule 4.Rule 4: If the snmp-agent target-host trap command is run with a specified vpn-instance vpn-instance-name, the host VPN is used to send trap messages. Otherwise, refer to rule 5.Rule 5: If the set net-manager vpn-instance command is run to configure a global VPN, the global VPN is used to send trap messages. Otherwise, refer to rule 6.Rule 6: The public network is used to send trap messages."
}