{
    "PageTitle": "snmp-agent password min-length",
    "FuncDef": "The snmp-agent password min-length command configures the minimum SNMP password length.\nThe undo snmp-agent password min-length command restores the default minimum SNMP password length.\nBy default, the minimum SNMP password length is 8 bytes.",
    "CLIs": [
        "snmp-agent password min-length <min-length>",
        "undo snmp-agent password min-length"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "min-length",
            "Info": "Specifies the minimum SNMP password length.\nThe value is an integer ranging from 8 to 16."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] snmp-agent password min-length 10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo improve system security and prevent password theft, run the snmp-agent password min-length command to configure the minimum SNMP password length. After this command is run, the length of a configured SNMP password must be longer than or equal to the minimum SNMP password length.\nSNMP passwords consist of the authentication and encryption passwords of local and SNMP users as well as communities.\nPrerequisites\nThe snmp-agent password min-length command takes effect only when password complexity check is enabled. By default, password complexity check is enabled.\nFor the authentication and encryption passwords of local users, run the undo snmp-agent local-user password complexity-check disable command to enable password complexity check.For the authentication and encryption passwords of SNMP users, run the undo snmp-agent usm-user password complexity-check disable command to enable password complexity check.For communities, run the undo snmp-agent community complexity-check disable command to enable password complexity check.\n\nPrecautions\nConfiguring the minimum length of an SNMP password does not affect existing SNMP passwords because the device does not check the password length during configuration restoration. However, the device checks the password length during password configuration."
}