{
    "PageTitle": "snmp-agent protocol source-status all-interface",
    "FuncDef": "The snmp-agent protocol ipv6 source-ip command specifies an IPv6 source address for SNMP to receive and respond to requests from an NMS.\nThe undo snmp-agent protocol ipv6 source-ip command restores the default configuration.\nThe snmp-agent protocol source-status ipv6 all-interface command allows all IPv6 addresses on the device to be used by SNMP to receive and respond to requests from an NMS.\nThe undo snmp-agent protocol source-status ipv6 all-interface command restores the default configuration.\nThe snmp-agent protocol source-interface command specifies a source interface for SNMP to receive and respond to requests from an NMS.\nThe undo snmp-agent protocol source-interface command restores the default configuration.\nThe snmp-agent protocol source-status all-interface command allows all interfaces on the device to be used by SNMP to receive and respond to requests from an NMS.\nThe undo snmp-agent protocol source-status all-interface command restores the default configuration.\nThe snmp-agent proxy protocol source-interface command specifies a source interface for the SNMP proxy to receive and respond to requests from the CCU.\nThe undo snmp-agent proxy protocol source-interface command restores the default configuration.\nThe snmp-agent proxy protocol source-status all-interface allows all interfaces on the device to be used by the SNMP proxy to receive and respond to requests from the CCU.\nThe undo snmp-agent proxy protocol source-status all-interface command restores the default configuration.\nThe snmp-agent proxy protocol ipv6 source-ip command specifies an IPv6 source address for the SNMP proxy to receive and respond to requests from the CCU.\nThe undo snmp-agent proxy protocol ipv6 source-ip command restores the default configuration.\nThe snmp-agent proxy protocol source-status ipv6 all-interface allows all IPv6 source addresses on the device to be used by the SNMP proxy to receive and respond to requests from the CCU.\nThe undo snmp-agent proxy protocol source-status ipv6 all-interface restores the default configuration.\nBy default, no IPv6 source address is specified for SNMP to receive and respond to requests from an NMS. The function that allows all IPv6 addresses on the device to be used by SNMP to receive and respond to requests from an NMS is not enabled. No source interface is specified for SNMP to receive and respond to requests from an NMS. The function that allows all interfaces on the device to be used by SNMP to receive and respond to requests from an NMS is not enabled. No source interface/IPv6 source address is specified for the SNMP proxy to receive and respond to requests from the CCU. The function that allows all interfaces or IPv6 addresses on the device to be used by the SNMP proxy to receive and respond to requests from the CCU is not enabled.",
    "CLIs": [
        "snmp-agent protocol source-status [ ipv6 ] all-interface",
        "snmp-agent proxy protocol source-status [ ipv6 ] all-interface",
        "undo snmp-agent protocol source-status [ ipv6 ] all-interface",
        "undo snmp-agent proxy protocol source-status [ ipv6 ] all-interface"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] snmp-agent protocol source-status all-interface",
            "Warning: It will allowed all accessible network to access the device."
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo allow all IPv6 addresses on the device to be used by SNMP to receive and respond to requests from an NMS, run the snmp-agent protocol source-status ipv6 all-interface command.\nTo allow all interfaces on the device to be used by SNMP to receive and respond to requests from an NMS, run the snmp-agent protocol source-status all-interface command.\nTo allow data to be managed in a unified manner, you can specify the source interface/IPv6 source address for the SNMP proxy to receive and respond to requests from the CCU or configure the function that allows all interfaces/IPv6 addresses on the device to be used by the SNMP proxy to receive and respond to requests from the CCU.\nPrecautions\nAfter the snmp-agent protocol source-status ipv6 all-interface command is run, all IPv6 addresses on the device can be used by SNMP to receive and respond to requests from an NMS, which brings security risks. Therefore, a risk message will be displayed when you run the snmp-agent protocol source-status ipv6 all-interface command.\nAfter the snmp-agent protocol source-status all-interface command is run, all interfaces on the device can be used by SNMP to receive and respond to requests from an NMS, which brings security risks. Therefore, a risk message will be displayed when you run the snmp-agent protocol source-status all-interface command.\nA risk message will be displayed when you run the snmp-agent proxy protocol source-status all-interface command.\nA risk message will be displayed when you run the snmp-agent proxy protocol source-status ipv6 all-interface command."
}