{
    "PageTitle": "snmp-agent group (Virtual access port-extension view)",
    "FuncDef": "The snmp-agent group command creates an SNMP user group by mapping SNMP users to the SNMP view.\nThe undo snmp-agent group command deletes a specified SNMP user group.\nBy default, the system SNMP group is not configured for APs.",
    "CLIs": [
        "snmp-agent group v3 <group-name> { authentication | privacy | noauthentication } [ read-view <read-view> | write-view <write-view> | notify-view <notify-view> ] *",
        "undo snmp-agent group v3 <group-name> { authentication | privacy | noauthentication }"
    ],
    "ParentView": [
        "Virtual access port-extension view"
    ],
    "ParaDef": [
        {
            "Parameters": "group-name",
            "Info": "Specifies the name of an SNMP user group.\nThe value is a string of 1 to 32 case-sensitive characters, spaces not supported.\nWhen quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "authentication",
            "Info": "Indicates that messages are authenticated without being encrypted.\n-"
        },
        {
            "Parameters": "privacy",
            "Info": "Indicates that messages are authenticated and encrypted.\n-"
        },
        {
            "Parameters": "noauthentication",
            "Info": "Indicates that no encryption or authentication is performed for an SNMP group to be configured.\n-"
        },
        {
            "Parameters": "read-view read-view",
            "Info": "Specifies a read-only view.The view must have been created using the snmp-agent mib-view { excluded | included } view-name oid-tree command.\nThe value is a string of 1 to 32 case-sensitive characters, spaces not supported. read-view is specified using the snmp-agent mib-view command. The NMS can read a MIB node in the read-view. If read-view is not configured, the NMS will read the ViewDefault by default. You can run display snmp-agent mib-view to view the default view.\nWhen quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "write-view write-view",
            "Info": "Specifies a read-write view.The view must have been created using the snmp-agent mib-view { excluded | included } view-name oid-tree command.\nThe value is a string of 1 to 32 case-sensitive characters, spaces not supported. write-view is specified using the snmp-agent mib-view command. The NMS can write and read a MIB node in the write-view.\nWhen quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "notify-view notify-view",
            "Info": "Specifies a notify view.The view must have been created using the snmp-agent mib-view { excluded | included } view-name oid-tree command.\nThe value is a string of 1 to 32 case-sensitive characters, spaces not supported. notify-view is specified using the snmp-agent mib-view command. The MIB node information in the notify-view can be carried in alarms and sent to an NMS.\nWhen quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "v3",
            "Info": "Indicates that the SNMP user group uses the security mode in SNMPv3.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] virtual-access port-extend",
            "[*HUAWE-virtual-access-portextend] snmp-agent group v3 Johngroup authentication"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] virtual-access port-extend",
            "[*HUAWEI-virtual-access-portextend] snmp-agent group v3 Johngroup privacy"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] virtual-access port-extend",
            "[*HUAWE-virtual-access-portextend] snmp-agent mib-view included mib2view 1.3.6.1.2.1",
            "[*HUAWE-virtual-access-portextend] snmp-agent group v3 Johngroup privacy read-view mib2view"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] virtual-access port-extend",
            "[*HUAWE-virtual-access-portextend] snmp-agent mib-view included mib2view 1.3.6.1.2.1",
            "[*HUAWE-virtual-access-portextend] snmp-agent group v3 Johngroup privacy write-view mib2view"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nSNMPv1 and SNMPv2c have serious security defects. A security authentication mechanism used by SNMPv1 and SNMPv2c is based on a community name. In this mechanism, the community name is transmitted in simple text, which is easy to be obtained. Do not to use SNMPv1 or SNMPv2c on untrusted networks.\nIn the user-based security model, SNMPv3 eradicates security defects in SNMPv1 and SNMPv2c and provides authentication and privacy services. The user-based security model defines the following three security authentication levels:\nAuthNoPrivAuthPrivnoAuthNoPriv\nThe security authentication level noAuthPriv does not exist. This is because the generation of a key is based on the authentication information and product information.\nThe snmp-agent group command can be used to configure the following information:\nAuthenticationPrivacyAccess permission for users in an SNMP groupBinding between an SNMP group and a MIB view\nTo configure the AuthNoPriv authentication level and read permission for an SNMP group, run the snmp-agent group authentication read-view command.\nTo configure the AuthPriv authentication level and read-write permission for an SNMP group, run the snmp-agent group privacy write-view command. You can set the authentication mode of SNMP users to Message-Digest Algorithm 5 (MD5) or Secure Hash Algorithm (SHA) and the privacy mode to Data Encryption Standard 56 (DES56), Triple Data Encryption Standard 168 (3DES168), Advanced Encryption Standard 128 (AES128), Advanced Encryption Standard 192 (AES192), or Advanced Encryption Standard 256 (AES256).\nThe authentication keys and privacy passwords configured on the NMS and the SNMP agent must be the same. A configuration inconsistency causes an authentication failure.To ensure high security, do not use the MD5 algorithm as the SNMPv3 authentication algorithm.To ensure high security, do not use the DES-56 or 3DES168 algorithm as the SNMPv3 encryption algorithm.\n\nConfiguration Impact\nAfter you run the undo snmp-agent group command to delete an SNMP user group, information about all SNMP users in the SNMP user group is deleted.\nYou can run the snmp-agent usm-user command to configure an authentication mode and an encrypted string for users in an SNMP user group only after the authentication and encryption functions are enabled for the SNMP user group.\nFollow-up Procedure\nAfter configuring the SNMP user group, run the snmp-agent mib-view command to create a MIB view and the access control for the view. You can run the snmp-agent usm-user command to add a user to SNMP user group and configure MIB-view-based access permission for the SNMP user. This is performed to ensure that SNMP users in an SNMP user group have the same security level and access control list.\nPrecautions\nTo ensure that trap information sent by MIB objects in the view specified by the notify-view parameter can be received, you must run the snmp-agent target-host trap command to specify a destination for receiving the trap information."
}