{
    "PageTitle": "snmp-agent trap (system view)",
    "FuncDef": "The snmp-agent trap disable command disables the trap function for all features.\nThe undo snmp-agent trap disable command restores the trap function for all features to the default status.\nThe snmp-agent trap enable command enables the device to send trap messages.\nThe undo snmp-agent trap enable command restores the default trap function.\nBy default, the display snmp-agent trap all command can be used to view the status of the trap function for all features.",
    "CLIs": [
        "snmp-agent trap enable",
        "snmp-agent trap disable",
        "undo snmp-agent trap { enable | disable }"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "disable",
            "Info": "disable.\n-"
        },
        {
            "Parameters": "enable",
            "Info": "enable.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] snmp-agent trap disable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] snmp-agent trap enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe snmp-agent trap enable command must be used together with the snmp-agent target-host inform command or snmp-agent target-host trap command.\nTo enable a device to send trap messages, run at least the snmp-agent target-host inform command or snmp-agent target-host trap command on the device to specify the destination address of the trap messages.\nTo enable the trap function for all features, run the snmp-agent trap enable command. To enable the trap function for a specified feature, run the snmp-agent trap enable feature-name command.\nTo disable the trap function for all features, run the snmp-agent trap disable command.To restore the trap function for all features to the default status, run the undo snmp-agent trap disable or undo snmp-agent trap enable command.To disable the trap function for a specified feature, run the undo snmp-agent trap enable feature-name command.\n\n\nPrecautions\nThe snmp-agent trap enable command and the related commands are used in the following scenarios:\nTo enable trap functions of all modules at a time, run the snmp-agent trap enable command.To enable trap functions of a specified module, run the snmp-agent trap enable feature-name command.If you want to disable the trap function of a specified module, run the undo snmp-agent trap enable feature-name command.To enable specified trap functions of a specified module, run the snmp-agent trap enable feature-name trap-name command.To disable the trap function of a specified module, run the undo snmp-agent trap enable feature-name trap-name command.To restore all default trap functions at a time, run the undo snmp-agent trap enable command."
}