{
    "PageTitle": "snmp-agent sys-info version",
    "FuncDef": "The snmp-agent sys-info version command configures SNMP system information.\nThe undo snmp-agent sys-info version command restores the default SNMP system information.\nBy default, the version is none.",
    "CLIs": [
        "snmp-agent sys-info version { { <v1> | <v2c> | <v3> } * | <all> }",
        "undo snmp-agent sys-info version { { <v1> | <v2c> | <v3> } * | <all> }"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "v1",
            "Info": "Indicates SNMPv1.\nv1"
        },
        {
            "Parameters": "v2c",
            "Info": "Indicates SNMPv2c.\nv2c"
        },
        {
            "Parameters": "v3",
            "Info": "Indicates SNMPv3.\nv3"
        },
        {
            "Parameters": "all",
            "Info": "Enables all SNMP versions, namely, SNMPv1, SNMPv2c, and SNMPv3.\nall"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] snmp-agent sys-info version v3"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure features in a specified version, run the snmp-agent sys-info version command to set an SNMP version.\nSNMP of each version supports various access control functions:\nSNMPv1:\nCommunity-name-based access controlMIB-view-based access control\nSNMPv2c:\nCommunity-name-based access controlMIB-view-based access controlSupporting Inform messages\nBesides inheriting basic SNMPv2c operations, SNMPv3 defines a management architecture, which introduces a User-based Security Model (USM) to provide users with a more secure access mechanism.\nUser groupGroup-based access controlUser-based access controlAuthentication and encryption mechanismsSupporting Inform messages\nRun the display snmp-agent sys-info command to view system maintenance information, such as the node physical location and SNMP version.\n\nConfiguration Impact\nRunning the undo snmp-agent command cause configuration of all SNMP versions (SNMPv1, SNMPv2c, and SNMPv3) on the device to become invalid.\nPrecautions\nSNMPv1 and SNMPv2c have security risks. Using SNMPv3 is recommended."
}