{
    "PageTitle": "snmp-agent protocol ipv6 source-ip",
    "FuncDef": "The snmp-agent protocol ipv6 source-ip command specifies an IPv6 source address for SNMP to receive and respond to requests from an NMS.\nThe undo snmp-agent protocol ipv6 source-ip command restores the default configuration.\nThe snmp-agent proxy protocol ipv6 source-ip command specifies an IPv6 source address for the SNMP proxy to receive and respond to requests from the CCU.\nThe undo snmp-agent proxy protocol ipv6 source-ip command restores the default configuration.\nThe snmp-agent protocol ipv6 physic-isolate source-interface source-ip command specifies an IPv6 isolate source address for SNMP to receive and respond to requests from an NMS.\nThe undo snmp-agent protocol ipv6 physic-isolate source-interface source-ip command restores the default configuration.\nThe snmp-agent proxy protocol ipv6 physic-isolate source-interface source-ip command specifies an IPv6 isolate source address for the SNMP proxy to receive and respond to requests from the CCU.\nThe undo snmp-agent proxy protocol ipv6 physic-isolate source-interface source-ip command restores the default configuration.\nBy default, no IPv6 source address is specified for SNMP to receive and respond to requests from an NMS. The function that allows all IPv6 addresses on the device to be used by SNMP to receive and respond to requests from an NMS is not enabled. No source interface is specified for SNMP to receive and respond to requests from an NMS. The function that allows all interfaces on the device to be used by SNMP to receive and respond to requests from an NMS is not enabled. No source interface/IPv6 source address is specified for the SNMP proxy to receive and respond to requests from the CCU. The function that allows all interfaces or IPv6 addresses on the device to be used by the SNMP proxy to receive and respond to requests from the CCU is not enabled.",
    "CLIs": [
        "snmp-agent protocol ipv6 source-ip <ip-address> [ vpn-instance <vpn-instance-name> ]",
        "snmp-agent proxy protocol ipv6 source-ip <ip-address> [ vpn-instance <vpn-instance-name> ]",
        "snmp-agent proxy protocol ipv6 physic-isolate source-interface { <protocol-interface-type> <protocol-interface-number> | <protocol-interface-name> } source-ip <ip-address>",
        "snmp-agent protocol ipv6 physic-isolate source-interface { <protocol-interface-type> <protocol-interface-number> | <protocol-interface-name> } source-ip <ip-address>",
        "undo snmp-agent protocol ipv6 source-ip <ip-address> [ vpn-instance <vpn-instance-name> ]",
        "undo snmp-agent proxy protocol ipv6 source-ip <ip-address> [ vpn-instance <vpn-instance-name> ]",
        "undo snmp-agent protocol ipv6 physic-isolate source-interface { <protocol-interface-type> <protocol-interface-number> | <protocol-interface-name> } source-ip <ip-address>",
        "undo snmp-agent proxy protocol ipv6 physic-isolate source-interface { <protocol-interface-type> <protocol-interface-number> | <protocol-interface-name> } source-ip <ip-address>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 characters. It cannot contain spaces."
        },
        {
            "Parameters": "source-ip ip-address",
            "Info": "Specifies an IPv6 source address for SNMP to receive and respond to requests from an NMS.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "protocol-interface-type",
            "Info": "Specifies the type of a source interface.\n-"
        },
        {
            "Parameters": "protocol-interface-number",
            "Info": "Specifies the number of a source interface.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "protocol-interface-name",
            "Info": "Specifies the name of a source interface.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] snmp-agent protocol ipv6 source-ip 2001:db8:1::1"
        ],
        [
            "[~HUAWEI] snmp-agent protocol ipv6 physic-isolate source-interface Ethernet 3/0/0 source-ip 2001:db8:1::1",
            "[*HUAWEI]"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo specify a source interface for SNMP to receive and respond to requests from an NMS, run the snmp-agent protocol source-interface command.\nTo specify an isolate source interface and source IP for SNMP to receive and respond to requests from an NMS, run the snmp-agent protocol ipv6 physic-isolate source-interface source-ip command.\nTo allow data to be managed in a unified manner, you can specify the source interface for the SNMP proxy to receive and respond to requests from the CCU or configure the function that allows all interfaces on the device to be used by the SNMP proxy to receive and respond to requests from the CCU.\nPrecautions\nThe snmp-agent protocol ipv6 source-ip command can be used to specify a maximum of 20 IPv6 source addresses for SNMP to receive and respond to requests from an NMS.\nThe snmp-agent proxy protocol ipv6 source-ip command can be used to specify a maximum of 20 IPv6 source addresses for the SNMP proxy to receive and respond to requests from the CCU.\nRun the snmp-agent [proxy] protocol physic-isolate command to configure interface isolation. If a common source interface is configured using the snmp-agent [proxy] protocol command, the common source interface configuration takes effect."
}