{
    "PageTitle": "transmission-alarm holdup-timer (Virtual access AP-ID view)",
    "FuncDef": "The transmission-alarm holdup-timer command enables the global filtering function for alarm-clear messages and sets an interval for filtering alarm-clear messages.\nThe undo transmission-alarm holdup-timer command disables the global filtering function for alarm-clear messages.\nBy default, the filtering function for alarm-clear messages is enabled globally.",
    "CLIs": [
        "transmission-alarm holdup-timer <holdup-time>",
        "undo transmission-alarm holdup-timer [ <holdup-time> ]"
    ],
    "ParentView": [
        "Virtual access AP-ID view"
    ],
    "ParaDef": [
        {
            "Parameters": "holdup-time",
            "Info": "Specifies an interval for filtering delayed alarm-clear messages. (If an alarm-clear message is received within the interval, the message is filtered. Otherwise, the alarm is responded to.).\nThe value is an integer ranging from 200 to 3600000, in milliseconds. The default value is 300 ms."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ap-id 1025",
            "[*HUAWEI-ap1025] commit",
            "[~HUAWEI-ap1025] transmission-alarm holdup-timer 1000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe frequent generation of alarms causes the interface status to continuously alternate between Up and Down at the physical layer. To enable the interface to ignore alarms and clear alarms within a specified interval, run the transmission-alarm holdup-timer command to set an interval for filtering alarm-clear messages.\nPrerequisites\nThe alarm customization function has been enabled on an interface.\nConfiguration Impact\nIn VS mode, this command is supported only by the admin VS.\nConfiguration of this command in the AP view of a master device takes effect globally on the following types of interfaces: E1 interface, CPOS interface, WDM interface, and 10GE WAN interface.\nPrecautions\nSpecify the holdup-time parameter based on the flapping frequency of an interface.\nIf this command is run in the AP view and the non-default configuration of this command exists in the interface view, the configuration on the interface takes effect. If the configuration in the interface view is the default configuration, the configuration in the AP view takes effect."
}