{
    "PageTitle": "transmission-alarm threshold (Port extension interface view)",
    "FuncDef": "The transmission-alarm threshold command configures the thresholds of b1tca, b2tca, b3tca, sdbere, and sfbere alarms.\nThe undo transmission-alarm threshold command restores the default thresholds of b1tca, b2tca, b3tca, sdbere, and sfbere alarms.\nBy default, the signal failure threshold alarm indication threshold is 10-3, the signal loss threshold alarm indication threshold is 10-6, the B3 exceeded threshold alarm indication threshold is 10-6, and the regenerator section (B1) excessive alarm indication threshold is 10-6, the threshold of the multiplex section (B2) excessive bit error alarm is 10-6.",
    "CLIs": [
        "transmission-alarm threshold { sdbere <sdbere> | sfbere <sfbere> | b1tca <b1tca> | b2tca <b2tca> | b3tca <b3tca> } *",
        "undo transmission-alarm threshold"
    ],
    "ParentView": [
        "Port extension interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "sdbere sdbere",
            "Info": "Indicates the sdbere threshold. This threshold is in the format of 10-n. The value n is specified by the sdbere parameter.\nThe value n is an integer ranging from 3 to 9. The default value is 6. Therefore, the default sdbere threshold is 10-6. The value of sdbere must be greater than or equal to the value of sfbere."
        },
        {
            "Parameters": "sfbere sfbere",
            "Info": "Indicates the sfbere threshold. This threshold is in the format of 10-n. The value n is specified by the sfbere parameter.\nThe value n is an integer ranging from 3 to 9. The default value is 3. Therefore, the default sfbere threshold is 10-3. The value of sfbere must be less than or equal to the value of sdbere."
        },
        {
            "Parameters": "b1tca b1tca",
            "Info": "Indicates the b1tca threshold. This threshold is in the format of 10-n. The value n is specified by the b1tca parameter.\nThe value n is an integer ranging from 3 to 9. The default value is 6. Therefore, the default b1tca threshold is 10-6."
        },
        {
            "Parameters": "b2tca b2tca",
            "Info": "Indicates the b2tca threshold. This threshold is in the format of 10-n. The value n is specified by the b2tca parameter.\nThe value n is an integer ranging from 3 to 9. The default value is 6. Therefore, the default b2tca threshold is 10-6."
        },
        {
            "Parameters": "b3tca b3tca",
            "Info": "Indicates the b3tca threshold. This threshold is in the format of 10-n. The value n is specified by the b3tca parameter.\nThe value n is an integer ranging from 3 to 9. The default value is 6. Therefore, the default b3tca threshold is 10-6."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1025/1/0/0",
            "[~HUAWEI-GigabitEthernet1025/1/0/0] transmission-alarm threshold b3tca 7 b1tca 9 b2tca 8"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the alarm type is b1tca, b2tca, b3tca, sdbere, or sfbere, check whether the alarm threshold is reached. If the alarm threshold is reached, the alarm is reported to the system for processing. If the alarm threshold is not reached, ignore the alarm and do not perform any operation.\nPrecautions\nThe transmission-alarm damping command can be used to configure suppression enabling or disabling for all alarms, and set an alarm suppression threshold.\nThe alarm thresholds are irrelevant to the suppression threshold. They are used in different alarm processing stages.\nIf the errored block (EB) of multiplex section (B2) is too big, the statistics are incorrect. As a result, the b2tca alarm cannot be generated. Do not configure the b2tca threshold as 3, 4, or 5."
}