{
    "PageTitle": "transmission-alarm down (WDM interface view)",
    "FuncDef": "The transmission-alarm down command customizes alarms that can cause the physical status of interfaces to go Down.\nThe undo transmission-alarm down command removes the customized alarms. If no parameter is specified for the command, the default configuration is restored after the command is executed.\nBy default, r-lof and r-los alarms can cause the physical status of WDM interfaces to go Down.",
    "CLIs": [
        "transmission-alarm down { odu-ais | odu-lck | odu-oci | otu-ais | otu-lom | otu-sd-ber | otu-sf-ber | pm-bdi | pm-tim | r-lof | r-los | r-oof | sm-bdi | sm-iae | sm-tim | prefec-tca | odu-sd-ber } *",
        "undo transmission-alarm down { odu-ais | odu-lck | odu-oci | otu-ais | otu-lom | otu-sd-ber | otu-sf-ber | pm-bdi | pm-tim | r-lof | r-los | r-oof | sm-bdi | sm-iae | sm-tim | prefec-tca | odu-sd-ber } *"
    ],
    "ParentView": [
        "WDM interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "odu-ais",
            "Info": "Indicates Optical Channel Data Unit (ODU) Alarm Indication Signal.\n-"
        },
        {
            "Parameters": "odu-lck",
            "Info": "Indicates Optical Channel Data Unit (ODU) locked.\n-"
        },
        {
            "Parameters": "odu-oci",
            "Info": "Indicates Optical Channel Data Unit (ODU) Open Connection Indication.\n-"
        },
        {
            "Parameters": "otu-ais",
            "Info": "Indicates Optical Channel Transport Unit (OTU) Alarm Indication Signal.\n-"
        },
        {
            "Parameters": "otu-lom",
            "Info": "Indicates Loss of Optical Transport Network (OTN) MultiFrame Alignment Signal (MFAS).\n-"
        },
        {
            "Parameters": "otu-sd-ber",
            "Info": "Indicates Optical Channel Transport Unit (OTU) signal degrade.\n-"
        },
        {
            "Parameters": "otu-sf-ber",
            "Info": "Indicates Optical Channel Transport Unit (OTU) signal fail.\n-"
        },
        {
            "Parameters": "pm-bdi",
            "Info": "Indicates Path Monitoring (PM) backward Defect Indication (BDI).\n-"
        },
        {
            "Parameters": "pm-tim",
            "Info": "Indicates Path Monitoring (PM) Trail Trace Identifier (TTI) mismatch.\n-"
        },
        {
            "Parameters": "r-lof",
            "Info": "Indicates Loss of Optical Transport Network (OTN) Frame.\n-"
        },
        {
            "Parameters": "r-los",
            "Info": "Indicates Loss of Optical Transport Network (OTN) Signal.\n-"
        },
        {
            "Parameters": "r-oof",
            "Info": "indicates Out of Optical Transport Network (OTN) Frame.\n-"
        },
        {
            "Parameters": "sm-bdi",
            "Info": "Indicates Optical Channel Transport Unit (OTU) SM (Section Monitoring) Backward Defect Indication (BDI).\n-"
        },
        {
            "Parameters": "sm-iae",
            "Info": "Indicates Optical Channel Transport Unit (OTU) SM Incoming Alignment Error (IAE).\n-"
        },
        {
            "Parameters": "sm-tim",
            "Info": "Indicates Optical Channel Transport Unit (OTU) SM Trail Trace Identifier (TTI) mismatch.\n-"
        },
        {
            "Parameters": "prefec-tca",
            "Info": "Indicates the pre-FEC BER threshold exceeds the threshold.\n-"
        },
        {
            "Parameters": "odu-sd-ber",
            "Info": "Indicates ODU Signal Degradation (SD).\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] controller wdm 1/0/0",
            "[~HUAWEI-Wdm1/0/0] transmission-alarm down r-lof r-los otu-ais"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nFrequent generation of alarms will cause the physical status of interfaces to switch between Up and Down. You can use the transmission-alarm down command to customize alarms that can cause the status change. In this manner, IP devices can ignore the alarms that are not customized to suppress network flapping.\nPrecautions\nBy default, the r-lof and r-los alarms can change the interface status. If these types of alarms are disabled, service data cannot be forwarded correctly.After the transmission-alarm down command is run, only the alarms specified this time can cause the physical status of interfaces to go Down, and the previous configuration performed using this command is deleted. After the undo transmission-alarm down command is run, the alarms specified this time do not cause the status of interfaces to go Down.When two routers interconnect through a WDM interface, to prevent the situation that one interface is Up while the other is Down, specifying r-los, r-lof, sm-tim, otu-lom, sm-bdi, pm-tim, and pm-bdi in the transmission-alarm down command as conditions for triggering interface Down is recommended. In addition, ensure that the two directly connected interfaces (two router interfaces or one router interface and one transport interface) have the same TTI. If they have different TTIs, an hwSmTimAlarm alarm is generated, triggering interface Down."
}