{
    "PageTitle": "transmission-alarm down (Trunk serial interface view/Serial interface view)",
    "FuncDef": "The transmission-alarm down command customizes the alarm configuration. You can specify the alarms whose generation can trigger the physical status of the interface to be Down.\nThe undo transmission-alarm down command cancels the customization of the alarm configuration.\nBy default, a Trunk-Serial interface does not customize any alarm to instruct its physical status to be Down; a framed serial interface channelized from a CPOS interface customizes the OOF, PAIS, and PRDI alarms to instruct its physical status to be Down; an unframed serial interface channelized from a CPOS interface does not support the OOF or PRDI alarm, and therefore does not customize any alarm to instruct its physical status to be Down.",
    "CLIs": [
        "transmission-alarm down { pais | prdi | oof } *",
        "undo transmission-alarm down { pais | prdi | oof } *"
    ],
    "ParentView": [
        "Trunk serial interface view",
        "Serial interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "pais",
            "Info": "Indicates the path alarm indication signal.\n-"
        },
        {
            "Parameters": "prdi",
            "Info": "Indicates path remote defect indication.\n-"
        },
        {
            "Parameters": "oof",
            "Info": "Indicates out of frame. That is, the received five consecutive frames contain incorrect framing character.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Trunk-Serial 1/1:0",
            "[*HUAWEI-Trunk-Serial1/1:0] undo transmission-alarm down prdi"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn the scenario where transmission devices are connected with IP routing devices, if the network is unstable, transmission devices will generate a large number of burr alarms. As a result, the physical status of interfaces on the transmission devices will change between Up and Down. To enable the transmission devices to ignore burr alarms, run the transmission-alarm down command to specify the types of alarms that can trigger interface physical status changes.\nConfiguration Impact\nIf the transmission-alarm down command is run multiple times, all configurations take effect for the serial interface and Trunk-Serial interface.\nPrecautions\nSerial and Trunk-Serial interfaces support only the PPP and ATM protocols."
}