{
    "PageTitle": "transmission-alarm holdup-timer (interface view)",
    "FuncDef": "The transmission-alarm holdup-timer command enables the filtering function for the delay clearance alarms, and set a filtering interval.\nThe undo transmission-alarm holdup-timer command recovers the preceding function.\nBy default, the preceding function is enabled.",
    "CLIs": [
        "transmission-alarm holdup-timer [ <holdup-time> ]",
        "undo transmission-alarm holdup-timer"
    ],
    "ParentView": [
        "10G WAN interface view",
        "POS interface view",
        "WDM interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "holdup-time",
            "Info": "Indicates the interval for filtering delay clearance alarms (If alarm clearance information is received within the holdup time, alarm information is filtered. Otherwise, the alarm is responded.).\nThe value is an integer ranging from 200 to 3600000 in milliseconds. The default value is 300 milliseconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface pos 1/0/0",
            "[~HUAWEI-Pos1/0/0] transmission-alarm holdup-timer 1000"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] transmission-alarm holdup-timer 1000"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] controller wdm 1/0/0",
            "[~HUAWEI-wdm 1/0/0] transmission-alarm holdup-timer 1000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe transmission-alarm holdup-timer command can be used to enable alarm clearance filtering and set a filtering interval.\nPrerequisites\nTransmission alarm customization has been enabled on an interface.\nPrecautions\nFor 10GE-WAN and WDM ports, if the up->down of a port exceeds two times within one minute, the default value of the port up suppression time is changed to 3s. If the interface is Up and is not Down within 5 minutes, the Up suppression time of the interface is restored to 300 ms."
}