{
    "PageTitle": "transmission-alarm damping (Port extension interface view)",
    "FuncDef": "The transmission-alarm damping command enables the suppression function for all transmission alarms that affect the physical statuses of interfaces, and configures suppression parameters.\nThe undo transmission-alarm damping command disables the suppression function.\nBy default, transmission alarm suppression is disabled.",
    "CLIs": [
        "transmission-alarm damping [ suppress <suppress> | reuse <reuse> | ceiling <ceiling> | decay-ok <decay-ok> | decay-ng <decay-ng> ] *",
        "undo transmission-alarm damping"
    ],
    "ParentView": [
        "Port extension interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "suppress suppress",
            "Info": "Specifies the alarm suppression threshold.\nThe value is an integer that ranges from 2 to 19999. The default value is 2000. This value must be larger than or equal the alarm reuse threshold and smaller than the alarm upper threshold."
        },
        {
            "Parameters": "reuse reuse",
            "Info": "Specifies the alarm reuse threshold.\nThe value is an integer ranging from 1 to 19998. The default value is 750. This value must be smaller than or equal the alarm suppression threshold."
        },
        {
            "Parameters": "ceiling ceiling",
            "Info": "Specifies the alarm upper threshold.\nThe value is an integer ranging from 1001 to 20000. The default value is 6000. The value must be larger than or equal the alarm suppression threshold."
        },
        {
            "Parameters": "decay-ok decay-ok",
            "Info": "Specifies the half decay period of alarm clearance.\nThe value is an integer ranging from 500 to 10000, in milliseconds. The default value is 1000."
        },
        {
            "Parameters": "decay-ng decay-ng",
            "Info": "Specifies the half decay period of alarm generation.\nThe value is an integer ranging from 500 to 10000, in milliseconds. The default value is 1000."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet1025/1/0/0",
            "[~HUAWEI-GigabitEthernet1025/1/0/0] transmission-alarm damping suppress 1000 reuse 500 ceiling 8000 decay-ok 2000 decay-ng 2000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nFrequent generation of alarms will cause the physical status of interfaces to switch between Up and Down. You can use the transmission-alarm damping command to suppress alarms and to configure suppression parameters. In this manner, network flapping can be suppressed.\nPrerequisites\nTransmission alarm customization has been enabled on an interface."
}