{
    "PageTitle": "transmission-alarm down (Virtual access AP-ID view)",
    "FuncDef": "The transmission-alarm down command customizes alarms globally in the AP view on a 10GE WAN interface, that is, specifies which alarms cause the interface to go Down.\nThe undo transmission-alarmdown command disables the alarm customization globally in the to an AP on a 10GE WAN interface.\nBy default, only the LRDI, PAIS, PRDI, LAIS, LOF, and LOS alarms are enabled globally for a 10GE WAN interface.",
    "CLIs": [
        "transmission-alarm down wan { los | lof | lais | oof | lrdi | lcd | auais | b3tca | lom | lop | lrei | pais | prdi | prei | pplm | puneq | rdool | rrool | sdbere | sfbere | trool | b1tca | b2tca } *",
        "undo transmission-alarm down wan [ los | lof | lais | oof | lrdi | lcd | auais | b3tca | lom | lop | lrei | pais | prdi | prei | pplm | puneq | rdool | rrool | sdbere | sfbere | trool | b1tca | b2tca ] *"
    ],
    "ParentView": [
        "Virtual access AP-ID view"
    ],
    "ParaDef": [
        {
            "Parameters": "los",
            "Info": "Indicates the signal loss alarm. This alarm is caused by a poor link.\n-"
        },
        {
            "Parameters": "lof",
            "Info": "Indicates the frame loss alarm. This alarm is caused by a poor physical link or low clock precision.\n-"
        },
        {
            "Parameters": "lais",
            "Info": "Indicates the line alarm.\n-"
        },
        {
            "Parameters": "oof",
            "Info": "Indicates the frame loss alarm. If consecutive five frames are not received, an OOF alarm will be generated.\n-"
        },
        {
            "Parameters": "lrdi",
            "Info": "Indicates the line remote defect alarm.\n-"
        },
        {
            "Parameters": "lcd",
            "Info": "Indicates the alarm of code group synchronization loss.\n-"
        },
        {
            "Parameters": "auais",
            "Info": "Indicates an administrative unit alarm.\n-"
        },
        {
            "Parameters": "b3tca",
            "Info": "Indicates the B3 threshold crossing alarm.\n-"
        },
        {
            "Parameters": "lom",
            "Info": "Indicates the alarm of tributary multiframe loss.\n-"
        },
        {
            "Parameters": "lop",
            "Info": "Indicates the pointer loss alarm. If consecutive eight frames received by pointer J1 are invalid, the lop alarm will be generated.\n-"
        },
        {
            "Parameters": "lrei",
            "Info": "Indicates the line remote error alarm.\n-"
        },
        {
            "Parameters": "pais",
            "Info": "Indicates the path alarm.\n-"
        },
        {
            "Parameters": "prdi",
            "Info": "Indicates the path remote defect alarm.\n-"
        },
        {
            "Parameters": "prei",
            "Info": "Indicates the path remote error alarm.\n-"
        },
        {
            "Parameters": "pplm",
            "Info": "Indicates the path payload mismatch alarm.\n-"
        },
        {
            "Parameters": "puneq",
            "Info": "Indicates the path unequipped alarm.\n-"
        },
        {
            "Parameters": "rdool",
            "Info": "Indicates the out-of-lock alarm of received data.\n-"
        },
        {
            "Parameters": "rrool",
            "Info": "Indicates the out-of-lock alarm of the received reference clock.\n-"
        },
        {
            "Parameters": "sdbere",
            "Info": "Indicates the signal degrade threshold alarm.\n-"
        },
        {
            "Parameters": "sfbere",
            "Info": "Indicates the signal failure threshold alarm.\n-"
        },
        {
            "Parameters": "trool",
            "Info": "Indicates the out-of-lock alarm of the transmitted reference clock.\n-"
        },
        {
            "Parameters": "b1tca",
            "Info": "Indicates the B1 threshold crossing alarm.\n-"
        },
        {
            "Parameters": "b2tca",
            "Info": "Indicates the B2 threshold crossing alarm.\n-"
        },
        {
            "Parameters": "wan",
            "Info": "WAN interface.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ap-id 1025",
            "[*HUAWEI-ap1025] commit",
            "[~HUAWEI-ap1025] transmission-alarm down wan lcd lof lais los"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe frequent generation of alarms causes the physical status of an interface to continuously alternate between Up and Down and continuous network flapping. To customize alarms for 10GE WAN interfaces globally, run the transmission-alarm down command. This configuration specifies alarms that can cause a physical interface to go Down.\nConfiguration Impact\nConfiguration of this command in the AP view of a master device takes effect globally on the following types of interfaces: 10GE WAN interface.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nBy default, the LAIS, LOF, and LOS alarms can change the interface status. If these types of alarms are disabled, service data cannot be forwarded correctly.After the transmission-alarm down command is run, a 10GE WAN interface in the virtual access AP-ID view goes Down only when the specified alarm is generated, and the previous configuration performed through this command is deleted.After the undo transmission-alarm down command is run, the specific alarm generated does not cause a 10GE WAN interface in the virtual access AP-ID view globally to go Down.When alarms are customized globally in the AP view, if the non-default customization is configured on the interface, the customization configured on the interface takes effect. If the default customization is configured on the interface, the global configuration takes effect.WLNK alarms can be viewed only and cannot be configured by using this command. The WLNK alarms are always enabled and can cause the physical status of interfaces to go Down. You can run the display transmission-alarm command to view the status and statistics on the alarms."
}