{
    "PageTitle": "transmission-alarm down (E1/CE1 interface view/E3 interface view)",
    "FuncDef": "The transmission-alarm down command customizes the alarms that cause the physical status of interfaces to go Down.\nThe undo transmission-alarm down command removes the customized alarms. If no parameter is specified for the command, the default configuration is restored after the command is executed.\nBy default, LOF, and LOS alarms can cause the physical status of interfaces to go Down.",
    "CLIs": [
        "transmission-alarm down { los | lof | pais | prdi } *",
        "undo transmission-alarm down { los | lof | pais | prdi } *",
        "undo transmission-alarm down"
    ],
    "ParentView": [
        "E1/CE1 interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "los",
            "Info": "Indicates the signal loss alarm. This alarm is caused by a poor link.\n-"
        },
        {
            "Parameters": "lof",
            "Info": "Indicates the frame loss alarm. This alarm is caused by a poor physical link or low clock precision.\n-"
        },
        {
            "Parameters": "pais",
            "Info": "Indicates the path alarm.\n-"
        },
        {
            "Parameters": "prdi",
            "Info": "Indicates the path remote defect alarm.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] controller E1 1/0/0",
            "[~HUAWEI-E1 1/0/0] transmission-alarm down los"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nFrequent generation of alarms will cause the physical status of interfaces to switch between Up and Down. You can use the transmission-alarm down command to customize the alarms that cause the status change. In this manner, IP devices can ignore the alarms that are not customized to suppress network flapping.\nYou can run the display transmission-alarm command to view the status and statistics on the alarms.\nConfiguration Impact\nAfter the transmission-alarm down command is run, only the alarms specified currently can cause the physical status of interfaces to go Down, and the previous configuration performed by using this command is deleted. After the undo transmission-alarm down command is run, the alarms specified currently do not cause the status of interfaces to go Down.\nPrecautions\nFor an E1 subcard that provides 32 or 16 interfaces, disabling the LOF alarm function in the E1 interface view is not recommended."
}