{
    "PageTitle": "arp attack rate-limit-percent",
    "FuncDef": "The arp attack rate-limit-percent command sets the percentage of the bandwidth of level-2 CAR for ARP VLAN CAR in the bandwidth of CP-CAR for ARP protocol packets.\nThe undo arp attack rate-limit-percent command restores the default percentage of the bandwidth of level-2 CAR for ARP VLAN CAR in the bandwidth of CP-CAR for ARP protocol packets.\nBy default, the percentage of the bandwidth of level-2 CAR for ARP VLAN CAR in the bandwidth of CP-CAR for ARP protocol packets is 80%.",
    "CLIs": [
        "arp attack rate-limit-percent <limit-rate>",
        "undo arp attack rate-limit-percent"
    ],
    "ParentView": [
        "Slot view"
    ],
    "ParaDef": [
        {
            "Parameters": "limit-rate",
            "Info": "Specifies the percentage of the bandwidth of level-2 CAR for ARP VLAN CAR in the bandwidth of CP-CAR for ARP protocol packets.\nThe value is an integer ranging from 0 to 100, in percentage. The value 0 indicates no restriction on the bandwidth."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] slot 1",
            "[~HUAWEI-slot-1] arp attack rate-limit-percent 60"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nARP VLAN CAR is used to restrict the rate of ARP packets based on interfaces and VLANs. To further suppress excessive ARP packets, level-2 CAR is enabled for ARP packets that have experienced ARP VLAN CAR. The percentage of the bandwidth of level-2 CAR for ARP VLAN CAR in the bandwidth of CP-CAR for ARP protocol packets is 80% by default. The bandwidth of level-2 CAR for ARP VLAN CAR changes dynamically with the bandwidth of CP-CAR for ARP protocol packets. To set the percentage of the bandwidth of level-2 CAR for ARP VLAN CAR in the bandwidth of CP-CAR for ARP protocol packets, run the arp attack rate-limit-percent command.\nConfiguration Impact\nThe percentage of the bandwidth of level-2 CAR for ARP VLAN CAR in the bandwidth of CP-CAR for ARP protocol packets affects the rate at which the ARP packets are sent to the CPU. The default value 80% is a proper value. If the percentage is set high, some valid ARP protocol packets may fail to be sent to the CPU.\nPrecautions\nThe arp attack rate-limit-percent command is run in the slot view,this command can be configured only in the non-VS view and takes effect in all VSs."
}