{
    "PageTitle": "arp learning strict",
    "FuncDef": "Using the arp learning strict force-enable command, you can enable strict Address Resolution Protocol (ARP) learning in the interface view.\nUsing the arp learning strict force-disable command, you can disable strict ARP learning in the interface view.\nUsing the arp learning strict trust command, you can disable strict ARP learning configured in the interface and enable strict ARP learning configured globally.\nUsing the undo arp learning strict command, you can disable strict ARP learning configured in the interface and enable strict ARP learning configured globally.\n\nBy default, strict ARP learning is disabled.",
    "CLIs": [
        "arp learning strict { force-disable | force-enable | trust }",
        "undo arp learning strict"
    ],
    "ParentView": [
        "PW-VE interface view",
        "PW-VE sub-interface view",
        "40GE interface view",
        "Port extension interface view",
        "GE electrical interface view",
        "Remote-AP interface view",
        "Eth-Trunk sub-interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "GE sub-interface view",
        "VBDIF interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "GE interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Vbridge interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "100ge sub-interface view",
        "25GE interface view",
        "40GE sub-interface view",
        "Eth-Trunk interface view",
        "10GE sub-interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "force-disable",
            "Info": "Specifies force to disable ARP strict learning.\n-"
        },
        {
            "Parameters": "force-enable",
            "Info": "Specifies force to enable ARP strict learning.\n-"
        },
        {
            "Parameters": "trust",
            "Info": "Specifies ARP strict learning complies with the global configuration.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/3",
            "[~HUAWEI-GigabitEthernet1/0/3] arp learning strict force-enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\n\nThe attacker sends a large number of stimulate ARP request and reply messages to a device on a network. As a result, the ARP buffer is overflowed and unable to cache normal ARP entries. Enabling strict ARP learning can address such a problem. Strict ARP learning allows a device to receive only ARP reply message in response to the request sent by itself, ensuring the device security.\n\nConfiguration Impact\n\nWhen other devices send ARP request messages to a device enabled with strict ARP learning, the device responds to these devices with reply messages, but does not add MAC addresses of these devices immediately into its ARP entry (or refresh its ARP entry). Instead, the device sends an ARP request message to these devices, and adds MAC address of devices responding to the request to the ARP entry (or refresh the ARP entry).\n\nPrecautions\n\nAfter the arp learning strict force-enable command is run, the specified interface refreshes or adds ARP entries in strict ARP learning mode. If interfaces on a device have a large number of ARP entries, to simplify configurations, you can run the arp learning strict command in the global view to enable strict ARP learning globally.\nThe matching of strict ARP learning is based on the most accuracy principle.\n\nIf strict ARP learning is configured globally and in the interface view, strict ARP learning configured in the interface view is adopted.\nIf strict ARP learning is not configured in the interface view, strict ARP learning configured globally is adopted."
}