{
    "PageTitle": "arp anti-attack log-trap-timer",
    "FuncDef": "The arp anti-attack log-trap-timer command sets the interval for recording logs and generating alarms about potential attacks.\nThe undo arp anti-attack log-trap-timer command restores the default configuration.\nThe default value is 0. If the default value is used, the device does not record logs or generate alarms about potential attacks.\nThe default value is 0. If the default value is used, the device does not record logs or generate alarms about potential attacks.",
    "CLIs": [
        "arp anti-attack log-trap-timer <timer>",
        "undo arp anti-attack log-trap-timer"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "timer",
            "Info": "Specifies the interval for recording logs and generating alarms about potential attacks.\nThe value is an integer ranging from 0 to 1200, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] arp anti-attack log-trap-timer 20"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter Address Resolution Protocol (ARP) Miss message rate limit is configured, the device counts the number of received ARP Miss messages. If the number of ARP Miss messages received in a specified period exceeds a specified limit, the device discards additional ARP Miss messages. The device considers this problem as a potential attack. The device records logs and generates alarms about potential attacks.\nIf a large number of potential attacks occur, the device may record a large number of logs and generate a large number of alarms. To resolve this problem, run the arp anti-attack log-trap-timer command to configure the interval for recording logs and generating alarms about potential attacks to reduce the number of logs and alarms.\nConfiguration Impact\nAfter the interval for recording logs and generating alarms about potential attacks is configured, the device discards the logs and alarms generated within this interval. As a result, the device will not notify you of any faults that occur within this interval."
}