{
    "PageTitle": "arp-limit",
    "FuncDef": "Using the arp-limit command, you can limit the maximum number of dynamic Address Resolution Protocol (ARP) entries that an interface can learn.\nUsing the undo arp-limit command, you can restore the default setting.\n\nBy default, the maximum number of dynamic ARP entries that an interface can learn is 262144.",
    "CLIs": [
        "arp-limit maximum <limitnum>",
        "undo arp-limit"
    ],
    "ParentView": [
        "PW-VE interface view",
        "PW-VE sub-interface view",
        "40GE interface view",
        "GE electrical interface view",
        "Port extension interface view",
        "Remote-AP interface view",
        "Eth-Trunk sub-interface view",
        "400GE interface view",
        "50GE sub-interface view",
        "10GE interface view",
        "GE sub-interface view",
        "VBDIF interface view",
        "VE sub-interface view",
        "GE interface view",
        "25GE sub-interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Vbridge interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "25GE interface view",
        "100ge sub-interface view",
        "40GE sub-interface view",
        "Eth-Trunk interface view",
        "10GE sub-interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "maximum limitnum",
            "Info": "Specifies the maximum number of the ARP entries that the interface can learn.\nThe value is an integer ranging from 1 to 262144."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] arp-limit maximum 20"
        ]
    ],
    "ExtraInfo": "Usage Scenario\n\nIf an unauthorized user sends a large number of ARP messages to a device, the device learns a large number of ARP entries in a short period of time, causing the ARP buffer to overflow. As a result, normal operation of the network is affected. To address such a problem, you can set the maximum number of ARP entries that each interface can learn. The ARP entries include dynamic entries learned through ARP packets, dual-device hot backup entries, and redirection entries synchronized remotely through BGP EVPN routes.\n\nConfiguration Impact\n\nIf the number of ARP entries that an interface can learn changes, and the number of the learned ARP entries exceeds the changed value, the interface cannot learn additional ARP entries. You can delete the excess ARP entries based on the system prompt.\nIf this command is run more than once, all configurations take effect.\n\nPrecautions\n\nIf a common sub-interface is limited in ARP entry learning and configured as a QinQ sub-interface, the ARP learning limit is deleted.\nIf a QinQ sub-interface is limited in ARP entry learning and the QinQ configuration is deleted from the sub-interface, the ARP learning limit is unavailable."
}