{
    "PageTitle": "arp anti-attack gratuitous-arp drop (interface view)",
    "FuncDef": "The arp anti-attack gratuitous-arp drop command enables gratuitous ARP packet discarding.\nThe undo arp anti-attack gratuitous-arp drop command disables gratuitous ARP packet discarding.\nBy default, gratuitous ARP packet discarding is disabled.",
    "CLIs": [
        "arp anti-attack gratuitous-arp drop",
        "undo arp anti-attack gratuitous-arp drop"
    ],
    "ParentView": [
        "PW-VE interface view",
        "40GE interface view",
        "Interface group view",
        "GE interface view",
        "100GE interface view",
        "GE electrical interface view",
        "Port extension interface view",
        "VLANIF interface view",
        "Remote-AP interface view",
        "50GE interface view",
        "400GE interface view",
        "10GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Eth-Trunk interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/3",
            "[~HUAWEI-GigabitEthernet1/0/3] arp anti-attack gratuitous-arp drop"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen a device is connected to a network for the first time, the device broadcasts gratuitous ARP packets to announce its existence and checks whether its IP address conflicts with any other device IP address in the broadcast domain. Any device can send gratuitous ARP packets and receive gratuitous ARP packets without authentication. As a result, a large number of gratuitous ARP packets can be generated, causing devices to be busy processing these packets. This process overloads the CPU and affects the processing of other services. To resolve this problem, you can enable gratuitous ARP packet discarding. After gratuitous ARP packet discarding is enabled, the device discards all received gratuitous ARP packets to prevent excessive CPU consumption.\nConfiguration Impact\nAfter the arp anti-attack gratuitous-arp drop command is run, the device discards all received gratuitous ARP packets. The device is unaware of new access devices.\nPrecautions\nGratuitous ARP packet discarding can be enabled in the system view or in the interface view.\nIf the arp anti-attack gratuitous-arp drop command is enabled in the system view, the device discards gratuitous ARP packets received from all interfaces.If the arp anti-attack gratuitous-arp drop command is enabled in the interface view, the device discards gratuitous ARP packets received from a specified interface.\nGratuitous ARP request discarding enabled in the system view is independent upon that enabled in the interface view."
}