{
    "PageTitle": "display arp packet statistics",
    "FuncDef": "The display arp packet statistics command displays the statistics about Address Resolution Protocol (ARP) packets.",
    "CLIs": [
        "display arp packet statistics [ slot <slot-id> | interface [ <interface-name> | <interface-type> <interface-number> ] ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "slot slot-id",
            "Info": "Specifies the slot ID of a board. If this parameter is specified, the command displays ARP packet statistics of this board.\nIf this parameter is not specified, the command displays ARP packet statistics of all boards.\nIn VS mode, this parameter is supported only by the admin VS.\n-"
        },
        {
            "Parameters": "interface interface-type interface-number",
            "Info": "Displays the ARP packets sent and received by a specified a Layer 3 interface.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display arp packet statistics",
            "ARP Pkt Received:   sum  69278",
            "ARP-Miss Msg Received:   sum      0",
            "ARP Learnt Count:   sum      0",
            "ARP Pkt Discard For Limit:   sum      0",
            "ARP Pkt Discard For SpeedLimit:   sum      0",
            "ARP Pkt Discard For Proxy Suppress:   sum      0",
            "ARP Pkt Discard For Packet Invalid: sum 0",
            "ARP Pkt Discard For Other:   sum  69278",
            "ARP-Miss Msg Discard For SpeedLimit:   sum      0",
            "ARP-Miss Msg Discard For Other:   sum      0",
            "ARP Pkt Send Total:   sum    304",
            "ARP Pkt Send Request:   sum    304",
            "ARP Pkt Send Reply:   sum      0",
            "ARP Pkt Send Gratuitous ARP:   sum    304"
        ],
        [
            "<HUAWEI> display arp packet statistics interface",
            "Interface            R-request   R-reply  R-gratis  S-request   S-reply S-gratis",
            "--------------------------------------------------------------------------------",
            "GE1/0/0                      5          0         3          0          0      0",
            "Vlanif2                    100          0       100          0          5      5",
            "Eth-Trunk2.1               400        200       400        400        200    100"
        ],
        [
            "<HUAWEI> display arp packet statistics interface gigabitethernet 1/0/0",
            "ARP Pkt Receive Request:   sum     22",
            "ARP Pkt Receive Reply:   sum      0",
            "ARP Pkt Receive Gratuitous ARP:   sum      6",
            "ARP Pkt Receive Discard Gratuitous ARP:   sum      0",
            "ARP Pkt Send Request:   sum      3",
            "ARP Pkt Send Reply:   sum      0",
            "ARP Pkt Send Gratuitous ARP:   sum      3",
            "ARP Pkt Send Discard Gratuitous ARP:   sum      0",
            "ARP-Miss Msg Received:   sum      0",
            "ARP-Miss Msg Discard For Invalid Table:   sum      0",
            "ARP-Miss Msg Discard For SpeedLimit:   sum      0",
            "ARP-Miss Msg Discard For Other:   sum      0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo locate ARP faults, run the display arp packet statistics command to view statistics about ARP packets.\nRun the display arp packet statistics [ slot slot-id ] command to view the ARP packet statistics of a specified or all boards. The statistics include:Number of received ARP packets and ARP Miss messagesNumber of discarded ARP packets and ARP Miss messagesNumber of times that an ARP packet is learnedRun the display arp packet statistics interface command to view the statistics about the interfaces that send and receive ARP packets and ARP Miss messages and the statistics about the ARP packets. The statistics include:Number of ARP request packets sent and received by each interfaceNumber of ARP reply packets sent and received by each interfaceNumber of gratuitous ARP packets sent and received by each interfaceNumber of ARP Miss messages received by each interfaceNumber of ARP Miss messages discarded by each interfaceRun the display arp packet statistics interface interface-type interface-number command to check the statistics about ARP packets and ARP Miss messages sent and received on an interface. The statistics include:Number of ARP request packets sent and receivedNumber of ARP reply packets sent and receivedNumber of gratuitous ARP packets sent and receivedNumber of ARP Miss messages receivedNumber of ARP Miss messages discarded\n\nPrecautions\nRun the display arp packet statistics interface command to view the interfaces that send and receive ARP packets and the statistics about the ARP packets.\nThe displayed statistics on an interface are the accumulative statistics about ARP packets sent and received by this interface.For example, if an interface sends a gratuitous ARP reply packet, the interface records the packet in the statistics about ARP reply packets as well as in the statistics about gratuitous ARP packets."
}