{
    "PageTitle": "preference (VSI-BGP-SITE view)",
    "FuncDef": "The preference command configures a priority for a multi-homing site.\nThe undo preference command restores the default priority of a VPLS multi-homing site.\nBy default, the priority of VPLS multi-homing sites is 100.",
    "CLIs": [
        "preference <preference>",
        "undo preference [ preference ]"
    ],
    "ParentView": [
        "VSI-BGP-SITE view"
    ],
    "ParaDef": [
        {
            "Parameters": "preference",
            "Info": "Specifies a priority for a multi-homing site.\nThe value is an integer ranging from 1 to 65535.\nA greater priority value indicates a higher priority."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] vsi vsi1",
            "[*HUAWEI-vsi-vsi1] pwsignal bgp multi-homing",
            "[*HUAWEI-vsi-vsi1-bgp] route-distinguisher 192.168.1.1:1",
            "[*HUAWEI-vsi-vsi1-bgp] site name company1",
            "[*HUAWEI-vsi-vsi1-bgp-site-company1] site-id 20",
            "[*HUAWEI-vsi-vsi1-bgp-site-company1] preference 100"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nVPLS multi-homing prevents routing loops by adjusting link priorities to ensure that one access link of a multi-homed CE is in the active state and the other access links in the blocked state. The link-priority-affecting factors are listed in descending order of influence as follows:\nACS: AC interface status, which is determined by the physical interface statusPREF: multi-homing site priorityPE-ID: If no BGP router ID is configured, the system router ID is used by default. If a BGP router ID is configured, it is used as the PE-ID.\nBy default, no priority is configured for any multi-homing site. After you create a multi-homing site, run the preference command to configure a priority for the site.\n\nPrerequisites\nA multi-homing site ID has been configured using the site-id site-id command.\nPrecautions\nIf the preference command is run more than once, the latest configuration overrides the previous one.If a CE is multi-homed to PEs, configuring different priorities for the same multi-homing site on different PEs is recommended."
}