{
    "PageTitle": "display l2vpn ccc-interface vc-type",
    "FuncDef": "The display l2vpn ccc-interface vc-type command displays information about the interfaces used to set up an L2VPN connection.",
    "CLIs": [
        "display l2vpn ccc-interface vc-type { all | ldp-vc | ccc | vpls-vc | static-vc | bgp-vc } [ up | down ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "all",
            "Info": "Displays information about all interfaces used to set up L2VPN connections.\n-"
        },
        {
            "Parameters": "ldp-vc",
            "Info": "Displays information about all interfaces used to set up LDP L2VPN connections.\n-"
        },
        {
            "Parameters": "ccc",
            "Info": "Displays information about all interfaces used to set up CCC connections.\n-"
        },
        {
            "Parameters": "vpls-vc",
            "Info": "Displays information about all interfaces used to set up VPLS connections.\n-"
        },
        {
            "Parameters": "static-vc",
            "Info": "Displays information about all interfaces used to set up static L2VPN connections.\n-"
        },
        {
            "Parameters": "bgp-vc",
            "Info": "Displays information about all interfaces used to establish BGP L2VPN connections.\n-"
        },
        {
            "Parameters": "up",
            "Info": "Displays information about the interfaces whose L2VPN connections are in the Up state.\n-"
        },
        {
            "Parameters": "down",
            "Info": "Displays information about the interfaces whose L2VPN connections are in the Down state.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display l2vpn ccc-interface vc-type all",
            "Total ccc-interface of CCC: 2",
            "up (2), down (0)",
            "Interface                            Encap Type               State     VC Type",
            "GigabitEthernet3/0/0                 ethernet                 up        ccc",
            "GigabitEthernet3/0/2                 ethernet                 up        ccc"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo check information about the AC interfaces used to set up L2VPN connections, including the total number of AC interfaces, interface status, encapsulation types, and L2VPN connection types, run the display l2vpn ccc-interface vc-type command. The command output facilitates L2VPN fault locating."
}