{
    "PageTitle": "inclusive-provider-tunnel (VSI-AUTO view)",
    "FuncDef": "The inclusive-provider-tunnel command creates or directly displays the VSI-Inclusive view.\nThe undo inclusive-provider-tunnel command deletes the VSI-Inclusive view and all configurations in the view.\nBy default, the VSI-Inclusive view does not exist.",
    "CLIs": [
        "inclusive-provider-tunnel",
        "undo inclusive-provider-tunnel"
    ],
    "ParentView": [
        "VSI-AUTO view",
        "VSI-DEFAULT view",
        "VSI-STATIC view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] vsi vsi1",
            "[*HUAWEI-vsi-vsi1] bgp-ad",
            "[*HUAWEI-vsi-vsi1-bgpad] vpls-id 1:1",
            "[*HUAWEI-vsi-vsi1-bgpad] vpn-target 100:100 import-extcommunity",
            "[*HUAWEI-vsi-vsi1-bgpad] vpn-target 100:100 export-extcommunity",
            "[*HUAWEI-vsi-vsi1-bgpad] quit",
            "[*HUAWEI-vsi-vsi1] inclusive-provider-tunnel",
            "[*HUAWEI-vsi1-inclusive]"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIP/MPLS backbone networks carry an increasing number of multicast services, such as IPTV, video conferences, and massively multiplayer online role-playing games (MMORPGs), which all require bandwidth assurance, QoS guarantee, and high network reliability. The following multicast solutions are available, but these solutions cannot meet the requirements of multicast services or network carriers:\nIP multicast: An IP multicast network is complex to deploy and maintain. The network does not have QoS or TE capabilities and provides low reliability.Layer 2 multicast: A large Layer 2 multicast network must use the HVPLS technology and solve routing loop problems. The network is complex to deploy and its reliability scheme is hard to design.\nTo provide better multicast services with simplified deployment, configure point-to-multipoint (P2MP) tunnels on multicast VPLS networks. P2MP tunnel deployment must be performed in the VSI-Inclusive view. To create and enter the VSI-Inclusive view, run the inclusive-provider-tunnel command.\n\nPrerequisites\nA VSI has been created, and BGP AD or BGP multi-homing has been the configured as the signaling type.\nPrecautions\nAfter P2MP tunnels are configured, running the undo inclusive-provider-tunnel command deletes the VSI-Inclusive view and all configurations in the view."
}