{
    "PageTitle": "loop-detect trigger",
    "FuncDef": "The loop-detect trigger interface-down enable command configures an interface to temporarily go Down after being blocked.\nThe undo loop-detect trigger interface-down enable command restores the default configuration.\nBy default, a blocked interface does not go Down.",
    "CLIs": [
        "loop-detect trigger interface-down enable",
        "undo loop-detect trigger interface-down enable"
    ],
    "ParentView": [
        "Eth-Trunk sub-interface view",
        "Eth-Trunk interface view",
        "GE sub-interface view",
        "GE interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] loop-detection enable",
            "[*HUAWEI] interface GigabitEthernet 1/0/0.1",
            "[*HUAWEI-GigabitEthernet1/0/0.1] loop-detect enable",
            "[*HUAWEI-GigabitEthernet1/0/0.1] loop-detect trigger interface-down enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, a blocked interface stops forwarding traffic, but the physical and protocol statuses of the interface are still Up. Therefore, entries on the blocked interface, such as the MAC address entry, cannot be updated immediately, and the user traffic is still sent to the interface continuously. This leads to traffic interruption. After the loop-detect trigger interface-down enable command is configured on an interface, the interface goes Down immediately after being blocked and relevant tables on the interface are updated. After approximately 5 seconds, the interface goes Up again. In this manner, the user traffic will not be lost.\nDo not add an interface to or remove an interface from an Eth-Trunk interface when the Eth-Trunk interface alternates between Up and Down. When an Eth-Trunk interface alternates between Up and Down, all its member interfaces go Down. After the Eth-Trunk interface stops flapping, its member interfaces go Up again. Therefore:\nIf an interface joins an Eth-Trunk interface when the Eth-Trunk interface alternates between Up and Down, the interface goes Up after the Eth-Trunk interface stops flapping.If an interface leaves an Eth-Trunk interface when the Eth-Trunk interface alternates between Up and Down, the interface immediately goes Down and cannot automatically go Up.\nAfter an Eth-Trunk interface stops flapping, the status of interfaces joining or leaving the Eth-Trunk interface will not be affected."
}