{
    "PageTitle": "mpls vpls convergence separate enable",
    "FuncDef": "The mpls vpls convergence separate enable command enables the VPLS public-network-and-private-network decoupling function.\nThe undo mpls vpls convergence separate enable command disables the VPLS public-network-and-private-network decoupling function.\nThis function is disabled by default.",
    "CLIs": [
        "mpls vpls convergence separate enable",
        "undo mpls vpls convergence separate enable"
    ],
    "ParentView": [
        "VSI view",
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] commit",
            "[~HUAWEI-l2vpn] quit",
            "[~HUAWEI] vsi company1",
            "[*HUAWEI-vsi-company1] mpls vpls convergence separate enable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls vpls convergence separate enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen VPLS services recurse to a public network, public network flapping causes changes in the VPLS services. Consequently, a device updates entries, which adversely affects VPLS service convergence. To enable the VPLS private and public network decoupling function to prevent the impact on the VPLS services, run the mpls vpls convergence separate enable command.\nConfiguration Impact\nWhen the VPLS private and public network decoupling function is enabled or disabled, VPLS traffic is temporarily interrupted on the device.\nPrecautions\nAfter public-network-and-private-network decoupling for VPLS is enabled in the system view, this function takes effect in all VSIs. If this function is enabled in the VSI view, this function takes effect only in a specified VSI. The command run in the system view and that in the VSI view are mutually exclusive with each other.\nThe mpls vpls convergence separate enable command is mutually exclusive with the VPN QoS, hard pipe, configured in the VSI view.\nThe mpls vpls convergence separate enable command is mutually exclusive with the P2MP VPLS/PBB VSI.\nThe configuration fails if the following situations are met:\nA BD is bound to a VSI.The igmp-snooping enable command is run in the BD view.The forward-mode loopback command is run in the VBDIF interface view."
}