{
    "PageTitle": "protect-switch (Protection group view)",
    "FuncDef": "The protect-switch manual command forcibly performs an active/standby PW switching in a PW protection group.\nThe protect-switch clear command restores the default configuration of a PW protection group.\nThe protect-switch manual command and its undo form do not have default configurations.\nBy default, protect-switch manual command and its undo form do not have default configurations.",
    "CLIs": [
        "protect-switch { clear | manual }"
    ],
    "ParentView": [
        "Protection group view"
    ],
    "ParaDef": [
        {
            "Parameters": "clear",
            "Info": "Restores the default configuration.\n-"
        },
        {
            "Parameters": "manual",
            "Info": "Forcibly performs an active/standby PW switching.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] vsi vsi1",
            "[*HUAWEI-vsi-vsi1] pwsignal ldp",
            "[*HUAWEI-vsi-vsi1-ldp] vsi-id 100",
            "[*HUAWEI-vsi-vsi1-ldp] protect-group group1",
            "[*HUAWEI-vsi-vsi1-ldp-protect-group-group1] protect-switch manual"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf you want to maintain the device where the primary PW in a PW protection group resides, you must run the protect-switch manual command to switch traffic from the primary PW to the secondary PW first. After the device where the primary PW resides stabilizes, run the protect-switch clear command to switch traffic back from the secondary PW to the primary PW.\nPrerequisites\nA PW protection group has been created, and the PW redundancy mode has been configured as master/slave. The primary and secondary PWs have been added to the PW protection group and their status is Up.\nConfiguration Impact\nAfter you run the protect-switch manual command, traffic switches from the primary PW to the secondary PW. After you run the protect-switch clear command, traffic switches from the secondary PW to the primary PW.\nPrecautions\nThe interval between running the protect-switch manual and protect-switch clear commands must be longer than 15s."
}