{
    "PageTitle": "flow-label (PW template view)",
    "FuncDef": "The flow-label command enables flow label-based load balancing for a PW template.\nThe undo flow-label command disables flow label-based load balancing for a PW template.\nBy default, flow label-based load balancing is disabled for a PW template.",
    "CLIs": [
        "flow-label { both | send | receive } [ static ]",
        "undo flow-label { both | send | receive } [ static ]",
        "undo flow-label"
    ],
    "ParentView": [
        "PW template view"
    ],
    "ParaDef": [
        {
            "Parameters": "both",
            "Info": "Configures the local end to send and receive packets based on flow labels.\n-"
        },
        {
            "Parameters": "send",
            "Info": "Configures the local end to send packets based on flow labels.\n-"
        },
        {
            "Parameters": "receive",
            "Info": "Configures the local end to receive packets based on flow labels.\n-"
        },
        {
            "Parameters": "static",
            "Info": "Configures static flow label-based load balancing.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] pw-template pw1",
            "[*HUAWEI-pw-template-pw1] flow-label both"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen multiple links exist between Ps, you can configure flow label-based load balancing to improve L2VPN traffic forwarding efficiency. After a PE has flow label-based load balancing enabled, the PE adds flow labels to L2VPN data flows to distinguish these flows. After a P receives a flow label-carrying data packet, it selects a forwarding path based on the flow label in the data packet. Traffic load balancing is then implemented.\nIf a PW references a PW template with flow label-based load balancing enabled, the PW also supports flow label-based load balancing. To enable flow label-based load balancing for a PW template, run the flow-label command in the PW template view.\nPrerequisites\nThe PW template view has been displayed using the pw-template pw-template-name command.\nPrecautions\nFlow label-based load balancing can be enabled only when any of the following conditions is met:The receive parameter is configured on the local PE, and the send parameter is configured on the remote PE.The send parameter is configured on the local PE, and the receive parameter is configured on the remote PE.Both the send and receive parameters are configured on the local and remote PEs.\nIf the static flow label-based load balancing configuration does not match on both ends, flow label-carrying packets will be dropped, causing packet loss.Low-speed interfaces do not support flow label-based load balancing."
}