{
    "PageTitle": "reset traffic-statistics suppression vsi",
    "FuncDef": "The reset traffic-statistics suppression vsi command clears the traffic suppression statistics.",
    "CLIs": [
        "reset traffic-statistics suppression vsi name <vsi-name> [ peer <peer-address> [ [ negotiation-vc-id <negotiation-vc-id> ] | [ remote-site <rmtSiteId> ] | ldp129 ] | uni ]"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "peer peer-address",
            "Info": "Specifies the peer IP address for a PW whose traffic suppression statistics are to be cleared.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "negotiation-vc-id negotiation-vc-id",
            "Info": "Specifies the negotiation VC ID for a PW whose traffic suppression statistics are to be cleared.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "remote-site rmtSiteId",
            "Info": "Remote site ID.\nThe value is an integer ranging from 0 to 65534."
        },
        {
            "Parameters": "ldp129",
            "Info": "Clears the traffic suppression statistics of LDP FEC 129 PW.\n-"
        },
        {
            "Parameters": "uni",
            "Info": "Specifies the negotiation VSI AC whose traffic suppression statistics are to be cleared.\n-"
        },
        {
            "Parameters": "name vsi-name",
            "Info": "Specifies the VSI name for a PW whose traffic suppression statistics are to be cleared.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset traffic-statistics suppression vsi name vsi1 peer 2.2.2.2"
        ],
        [
            "<HUAWEI> reset traffic-statistics suppression vsi name yf uni"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe system starts to collect PW traffic suppression statistics after traffic suppression is enabled for the PW. To clear the traffic suppression statistics, run the reset traffic-statistics suppression vsi command. To view PW traffic suppression statistics collected during a specified period for network monitoring or troubleshooting, use the display traffic-statistics vsi and reset traffic-statistics suppression vsi commands together.\nConfiguration Impact\nAfter the reset traffic-statistics suppression vsi command is run on a device, the device clears the existing PW traffic suppression statistics and performs another collection."
}