{
    "PageTitle": "traffic-statistics enable (VSI-LDP view)",
    "FuncDef": "The traffic-statistics enable command enables the function to collect statistics about the VSI-based global traffic in VSI LDP mode.\nThe undo traffic-statistics enable command disables the function to collect statistics about the VSI-based global traffic in VSI LDP mode.\nBy default, the function to collect statistics about the VSI-based global traffic in VSI LDP mode is disabled.",
    "CLIs": [
        "traffic-statistics enable",
        "undo traffic-statistics enable"
    ],
    "ParentView": [
        "VSI-LDP view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] vsi 1",
            "[*HUAWEI-vsi-1] pwsignal ldp",
            "[*HUAWEI-vsi-1-ldp] vsi-id 10",
            "[*HUAWEI-vsi-1-ldp] traffic-statistics enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo enable the function to collect statistics about the VSI-based global traffic in VSI LDP mode, run the traffic-statistics enable command.\nNote that:\nThe traffic-statistics peer enable command enables the function to collect statistics about the public traffic on a specific LDP VPLS PW. This command takes precedence over the undo traffic-statistics enable command. After running this command, you can view statistics about the public traffic on a specific LDP VPLS PW no matter whether you have run the undo traffic-statistics enable command to disable the function to collect statistics about the VSI-based global traffic in VSI LDP mode.The traffic-statistics peer disable command disables the function to collect statistics about the public traffic on a specific LDP VPLS PW. This command takes precedence over the traffic-statistics enable command. After running this command, you cannot view statistics about the public traffic on a specific LDP VPLS PW no matter whether you have run the traffic-statistics enable command to enable the function to collect statistics about the VSI-based global traffic in VSI LDP mode.The undo traffic-statistics peer enable command deletes the configuration of the traffic-statistics peer [ negotiation-vc-id ] enable command. After this command is run, the function to collect statistics about the public traffic on a specific LDP VPLS PW inherits the status of the function to collect statistics about the VSI-based global traffic in VSI LDP mode. For example, if you have run the traffic-statistics enable command to enable the function to collect statistics about the VSI-based global traffic in VSI LDP mode, the statistics about the public traffic on a specific LDP VPLS PW can be viewed.The undo traffic-statistics peer disable command deletes the configuration of the traffic-statistics peer [ negotiation-vc-id ] disable command. After this command is run, the function to collect statistics about the public traffic on a specific LDP VPLS PW inherits the status of the function to collect statistics about the VSI-based global traffic in VSI LDP mode. For example, if you have run the undo traffic-statistics enable command to disable the function to collect statistics about the VSI-based global traffic in VSI LDP mode, the statistics about the public traffic on a specific LDP VPLS PW cannot be viewed."
}