{
    "PageTitle": "encapsulation rfc4761-compatible",
    "FuncDef": "The encapsulation rfc4761-compatible command configures a Huawei device to use the encapsulation type defined in relevant standards for BGP VPLS packets.\nThe undo encapsulation rfc4761-compatible command restores the default configuration.\nBy default, a Huawei device uses encapsulation type 4 or 5 for BGP VPLS packets, depending on whether the user access mode is VLAN or Ethernet.",
    "CLIs": [
        "encapsulation rfc4761-compatible",
        "undo encapsulation rfc4761-compatible"
    ],
    "ParentView": [
        "VSI-BGP-MH view",
        "VSI-BGP view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] vsi bgp1 auto",
            "[*HUAWEI-vsi-bgp1] pwsignal bgp",
            "[*HUAWEI-vsi-bgp1-bgp] encapsulation rfc4761-compatible"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nRelevant standards defines encapsulation type 19 for BGP VPLS packets, but a Huawei device uses encapsulation type 4 or 5 for BGP VPLS packets. To enable a Huawei device to communicate with a non-Huawei device on a BGP VPLS network, run the encapsulation rfc4761-compatible command for the Huawei device to use encapsulation type 19 for outgoing BGP VPLS packets.\nAfter a Huawei device receives BGP VPLS packets from a non-Huawei device, the Huawei device automatically converts encapsulation type 19 to encapsulation type 4 or 5, depending on the user access mode.\nThe user access mode is either VLAN or Ethernet:\nIn VLAN access mode, the frames transmitted between CEs and PEs carry VLAN tags in Ethernet headers. These VLAN tags are service delimiters used by ISPs to differentiate users. This type of VLAN tag is called the P-tag.In Ethernet access mode, the Ethernet headers of frames transmitted between CEs and PEs do not carry service delimiters. The VLAN tags carried in Ethernet headers are the internal VLAN tags of user packets, and these tags are meaningless to PEs. This type of VLAN tag is called the U-tag.\n\nPrerequisites\nThe VSI-BGP view has been displayed using the pwsignal bgp command.\nPrecautions\nThe encapsulation rfc4761-compatible command applies only to scenarios where Huawei devices need to communicate with non-Huawei devices on a BGP VPLS network."
}