{
    "PageTitle": "stream-dual-receiving",
    "FuncDef": "The stream-dual-receiving command configures both the active and standby PWs in a protection group to receive packets.\nThe undo stream-dual-receiving command restores the default configuration.\nBy default, the standby PW cannot receive packets.",
    "CLIs": [
        "stream-dual-receiving",
        "undo stream-dual-receiving"
    ],
    "ParentView": [
        "Protection group view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] vsi test",
            "[*HUAWEI-vsi-test] pwsignal ldp",
            "[*HUAWEI-vsi-test-ldp] vsi-id 100",
            "[*HUAWEI-vsi-test-ldp] protect-group GroupA",
            "[*HUAWEI-vsi-test-ldp-protect-group-GroupA] protect-mode pw-redundancy master",
            "[*HUAWEI-vsi-test-ldp-protect-group-GroupA] stream-dual-receiving"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn a network that has PW redundancy configured, to prevent packet loss during a traffic switchback, run the stream-dual-receiving command on a single-homing PE to configure both the active and standby PWs in a protection group to receive packets.\nIf this command is not run, only the active PW can receive packets. After the primary PW recovers and a traffic switchback is triggered, the secondary PW on the single-homing PE becomes the standby PW and the PE notifies the peer of the status change. As there is a delay in signaling transmission, before the peer PE receives the signaling packet, the peer PE still sends packets along the secondary PW. After the single-homing PE receives packets from the secondary PW, the PE discards the packets.\nPrerequisites\nThe primary and secondary PWs have been configured.\nPrecautions\nThis command can be run only when both the primary and secondary PWs exist."
}