{
    "PageTitle": "ignore-stp-loopcheck",
    "FuncDef": "The ignore-stp-loopcheck command disables STP loop detection of a PW so that the PW is not blocked by STP.\nThe undo ignore-stp-loopcheck command enables STP loopback detection for a PW.\nBy default, STP loopback detection is enabled for PWs.",
    "CLIs": [
        "ignore-stp-loopcheck",
        "undo ignore-stp-loopcheck"
    ],
    "ParentView": [
        "VSI-LDP-PW view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] vsi vsi1 static",
            "[*HUAWEI-vsi1] pwsignal ldp",
            "[*HUAWEI-vsi1-ldp] vsi-id 1",
            "[*HUAWEI-vsi1-ldp] peer 1.1.1.1",
            "[*HUAWEI-vsi1-ldp] peer 1.1.1.1 pw pw1",
            "[*HUAWEI-vsi1-ldp-pw1] ignore-stp-loopcheck"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nSTP, a management protocol at the data link layer, is used to detect and prevent loops on a Layer 2 network. STP blocks redundant links on a Layer 2 network and trims a network into a loop-free tree topology.\nAfter service PWs are bound to an mPW, to prevent loops, run the undo ignore-stp-loopcheck command to enable STP loopback detection for the mPW. After STP of the mPW detects a loop, the STP status of the mPW is set to blocked, and accordingly the STP status of all service PWs bound to the mPW is set to blocked. If some service PWs do not need to have the same STP status as the mPW, run the ignore-stp-loopcheck command to disable STP loopback detection of these service PWs. Then the STP status change of the mPW will not affect the status of these service PWs.\nPrerequisites\nMPLS L2VPN has been enabled using the mpls l2vpn command.\nConfiguration Impact\nAfter the ignore-stp-loopcheck command is run for a service PW, the STP status of the service PW is not affected by the STP status change of the mPW to which it is bound.After the undo ignore-stp-loopcheck command is run for a service PW, the STP status of the service PW is consistent with that of the mPW to which it is bound.\n\nPrecautions\nThe ignore-stp-loopcheck command applies only to service PWs."
}