{
    "PageTitle": "peer remote-site pw",
    "FuncDef": "The peer remote-site pw command creates a PW in the VSI-BGP view and displays the VSI-BGP-PW view of the PW.\nThe undo peer remote-site pw command deletes a PW in the VSI-BGP view.\nBy default, no PW is created in the VSI-BGP view.",
    "CLIs": [
        "peer <peer-address> remote-site <remote-site-id> pw <pw-name>",
        "undo peer <peer-address> remote-site <remote-site-id> pw"
    ],
    "ParentView": [
        "VSI-BGP view"
    ],
    "ParaDef": [
        {
            "Parameters": "remote-site remote-site-id",
            "Info": "specifies the remote site ID.\nThe value is an integer ranging from 0 to 65534."
        },
        {
            "Parameters": "pw pw-name",
            "Info": "Specifies the name of a PW.\nThe value is a string of 1 to 15 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "peer peer-address",
            "Info": "Specifies the IPv4 address of a VSI peer, which is generally the IPv4 address of a VSI peer's loopback interface.\nThe value is an IPv4 address, in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] vsi 2",
            "[*HUAWEI-vsi-2] pwsignal bgp",
            "[*HUAWEI-vsi-2-bgp] route-distinguisher 100:1",
            "[*HUAWEI-vsi-2-bgp] peer 2.2.2.2 remote-site 2 pw bgp"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo create a PW in the VSI-BGP view and enter the VSI-BGP-PW view of the PW, run the peer remote-site pw command.\nIn a BGP VPLS scenario, you can run one of the following commands in the VSI-BGP-PW view to configure BUM traffic suppression for the BGP VPLS PW:\nTo configure the maximum broadcast traffic rate that is allowed, run the broadcast-suppression cir [ cbs ] command.To configure the maximum multicast traffic rate that is allowed, run the multicast-suppression cir [ cbs ] command.To configure the maximum unknown unicast traffic rate that is allowed, run the unknown-unicast-suppression cir [ cbs ] command."
}