{
    "PageTitle": "protect-mode pw-redundancy",
    "FuncDef": "The protect-mode pw-redundancy command specifies the PW redundancy mode for a PW protection group.\nThe undo protect-mode command deletes the PW redundancy mode of a PW protection group.\nBy default, a PW protection group does not have a PW redundancy mode.",
    "CLIs": [
        "protect-mode pw-redundancy { master | independent }",
        "undo protect-mode"
    ],
    "ParentView": [
        "Protection group view"
    ],
    "ParaDef": [
        {
            "Parameters": "master",
            "Info": "Specifies the PW redundancy mode of a PW protection group as master/slave.\n-"
        },
        {
            "Parameters": "independent",
            "Info": "Specifies the PW redundancy mode of a PW protection group as independent.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] vsi vsi1",
            "[*HUAWEI-vsi-vsi1] pwsignal ldp",
            "[*HUAWEI-vsi-vsi1-ldp] vsi-id 100",
            "[*HUAWEI-vsi-vsi1-ldp] protect-group group1",
            "[*HUAWEI-vsi-vsi1-ldp-protect-group-group1] protect-mode pw-redundancy master"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nPW pairs in a VSI can be added to a PW protection group to protect each other. After the PW protection group is configured, you must specify the protection mode. Currently, only PW redundancy is supported. PW redundancy has two modes: master/slave and independent. The PW redundancy mode must be specified when PW redundancy is used:\nIn master/slave mode, a UPE determines the active/standby status of PWs. This mode applies to scenarios in which the PW status cannot be determined by remote signaling, such as HVPLS scenarios and VPLS accessing VLL scenarios. In these scenarios, a bypass PW must also be configured.In independent mode, the PW status is determined by the remote signaling. This mode applies to VPLS accessing VLL scenarios in which a CE is dual-homed to two PEs between which E-Trunk is configured.\n\nPrerequisites\nThe VSI ID and PW protection group have been configured.\nConfiguration Impact\nIf the PW redundancy mode of a PW protection group is master/slave, the local UPE determines the active/standby status of PWs based on local configurations.\nFollow-up Procedure\nConfigure a revertive switching policy for the PW protection group and add PWs to the group.\nPrecautions\nAfter a PW protection group is configured, you must specify the PW redundancy mode before configuring other parameters. Deleting the PW redundancy mode of a PW protection group will clear all the configurations of the group."
}