{
    "PageTitle": "control-word (VSI-LDP-PW view)",
    "FuncDef": "The control-word enable command enables the control word function for a PW.\nThe undo control-word command restores the default control word function of a PW.\nThe control-word disable command disables the control word function of a PW.\nBy default, a PW has the same control word function as the VSI to which the PW belongs.",
    "CLIs": [
        "control-word { enable | disable }",
        "undo control-word",
        "undo control-word enable",
        "undo control-word disable"
    ],
    "ParentView": [
        "VSI-LDP-PW view"
    ],
    "ParaDef": [
        {
            "Parameters": "enable",
            "Info": "Enables the control word function.\n-"
        },
        {
            "Parameters": "disable",
            "Info": "Disables the control word function.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] vsi vsi1",
            "[*HUAWEI-vsi-vsi1] pwsignal ldp",
            "[*HUAWEI-vsi-vsi1-ldp] vsi-id 10",
            "[*HUAWEI-vsi-vsi1-ldp] peer 2.2.2.2 encapsulation vlan",
            "[*HUAWEI-vsi-vsi1-ldp] peer 2.2.2.2 pw pw1",
            "[*HUAWEI-vsi-vsi1-ldp-pw] control-word enable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] vsi vsi1",
            "[*HUAWEI-vsi-vsi1] pwsignal ldp",
            "[*HUAWEI-vsi-vsi1-ldp] vsi-id 10",
            "[*HUAWEI-vsi-vsi1-ldp] peer 2.2.2.2 encapsulation vlan",
            "[*HUAWEI-vsi-vsi1-ldp] peer 2.2.2.2 pw pw1",
            "[*HUAWEI-vsi-vsi1-ldp-pw] control-word disable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nVirtual circuit connectivity verification (VCCV) is an E2E PW fault detection and diagnosis mechanism. VCCV is a control channel used to send connection verification messages between the ingress and egress of a PW. VCCV control channels working in label alert mode or control word modes. The label alert mode is used by default. To check the connectivity of a VPLS PW, run the control-word enable command to enable the control word detection function.\nConfiguration Impact\nAfter the control-word enable command is configured on a device, the device sets the control word flag in Label Mapping messages. A PW can be successfully negotiated only if the control word function is enabled on both ends of the PW.\nFollow-up Procedure\nPerform a ping operation to detect VPLS PW connectivity.\nPrecautions\nIf the control-word enable or control-word disable command has been run in the VSI-LDP-PW view, the undo control-word command restores the default control word function of the PW, meaning that the PW has the same control word function as the VSI to which the PW belongs.\nIf the control-word enable command has been run in the VSI-LDP view to enable the control word function for all PWs in a VSI, but a PW does not need the control word function, run the control-word disable command in the VSI-LDP-PW view to disable the control word function for the PW."
}