{
    "PageTitle": "p2mp te-template",
    "FuncDef": "The p2mp te-template command creates a P2MP TE tunnel of a specified type.\nThe undo p2mp te-template command deletes a P2MP TE tunnel.\nBy default, P2MP tunnels are not created.",
    "CLIs": [
        "p2mp te-template <template-name>",
        "undo p2mp te-template"
    ],
    "ParentView": [
        "VSI-inclusive-root-MPLS-TE view"
    ],
    "ParaDef": [
        {
            "Parameters": "te-template template-name",
            "Info": "Specifies the name of the template to be referenced by a static P2MP TE tunnel.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported.\nThe string can contain spaces if it is enclosed in double quotation marks (\")."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] vsi vsi2",
            "[*HUAWEI-vsi-vsi2] bgp-ad",
            "[*HUAWEI-vsi-vsi2-bgpad] vpls-id 2:2",
            "[*HUAWEI-vsi-vsi2-bgpad] vpn-target 2:2 import-extcommunity",
            "[*HUAWEI-vsi-vsi2-bgpad] vpn-target 2:2 export-extcommunity",
            "[*HUAWEI-vsi-vsi2-bgpad] quit",
            "[*HUAWEI-vsi-vsi2] inclusive-provider-tunnel",
            "[*HUAWEI-vsi2-inclusive] root",
            "[*HUAWEI-vsi2-inclusive-root] mpls-te",
            "[*HUAWEI-vsi2-inclusive-root-mplste] p2mp te-template pt1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn multicast VPLS networks, P2MP TE tunnels are classified as automatic or static P2MP TE tunnels:\nTo configure a static P2MP TE tunnel, run the p2mp te-template template-name command to specify the template to be referenced so that template attributes can be customized.\n\nPrerequisites\nThe tunnel type has been specified as P2MP TE, and the VSI-Inclusive-Root-MPLSTE view is displayed using the mpls-te command.A P2MP tunnel template has been created using the mpls te p2mp-template command before the static P2MP TE tunnels are configured.\n\nPrecautions\nStatic P2MP TE tunnels can reference a TE template only after the TE template is configured."
}