{
    "PageTitle": "mpls-te (VSI-inclusive-root view)",
    "FuncDef": "The mpls-te command specifies the tunnel type for the local VSI as P2MP TE and displays the VSI-Inclusive-Root-MPLSTE view.\nThe undo mpls-te command restores the default configuration.\nBy default, the tunnel type for the local VSI is not specified.",
    "CLIs": [
        "mpls-te",
        "undo mpls-te"
    ],
    "ParentView": [
        "VSI-inclusive-root view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] vsi vsi1",
            "[*HUAWEI-vsi-vsi1] bgp-ad",
            "[*HUAWEI-vsi-vsi1-bgpad] vpls-id 1:1",
            "[*HUAWEI-vsi-vsi1-bgpad] vpn-target 1:1 import-extcommunity",
            "[*HUAWEI-vsi-vsi1-bgpad] vpn-target 1:1 export-extcommunity",
            "[*HUAWEI-vsi-vsi1-bgpad] quit",
            "[*HUAWEI-vsi-vsi1] inclusive-provider-tunnel",
            "[*HUAWEI-vsi1-inclusive] root",
            "[*HUAWEI-vsi1-inclusive-root] mpls-te",
            "[*HUAWEI-vsi1-inclusive-root-mplste]"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIP/MPLS backbone networks carry an increasing number of multicast services, such as IPTV, video conferences, and massively multiplayer online role-playing games (MMORPGs), which all require bandwidth assurance, QoS guarantee, and high network reliability. The following multicast solutions are available, but these solutions cannot meet the requirements of multicast services or network carriers:\nIP multicast: An IP multicast network is complex to deploy and maintain. The network does not have QoS or TE capabilities and provides low reliability.Layer 2 multicast: A large Layer 2 multicast network must use the HVPLS technology and solve routing loop problems. The network is complex to deploy and its reliability scheme is hard to design.\nTo provide better multicast services with simplified deployment, configure P2MP tunnels on multicast VPLS networks. P2MP tunnels are classified as mLDP P2MP tunnels or P2MP TE tunnels. To use P2MP TE tunnels on a multicast VPLS network, run the mpls-te command.\n\nPrerequisites\nThe VSI-Inclusive-Root view has been displayed using the root command.\nFollow-up Procedure\nRun the p2mp command to create a P2MP TE tunnel of a specified type.\nPrecautions\nP2MP TE and mLDP P2MP tunnels are mutually exclusive in a VSI."
}