{
    "PageTitle": "ignore-ac-state",
    "FuncDef": "The ignore-ac-state command configures the VSI status not to be affected by AC status changes.\nThe undo ignore-ac-state command restores the default configuration.\nBy default, AC status changes affect the VSI status.",
    "CLIs": [
        "ignore-ac-state",
        "undo ignore-ac-state"
    ],
    "ParentView": [
        "VSI-STATIC view",
        "VSI-BD view",
        "VSI-AUTO view",
        "VSI-BVSI view",
        "VSI-IVSI-P2P view",
        "VSI-IVSI-BEVPNINTERWORK view",
        "VSI-DEFAULT view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] vsi vsi1 static",
            "[*HUAWEI-vsi-vsi1] ignore-ac-state"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBefore the replacement of CEs, you can configure VSIs on UPEs to temporarily ignore the AC status check. Then, check whether VSIs on UPEs can work properly after new CEs are deployed. A VSI can be Up only if at least one AC interface or one UPE PW is Up. After you configure a VSI to ignore the AC status check, the VSI remains Up as long as one UPE PW is Up, regardless of whether the AC interface is Up or Down.\nThe AC status has two meanings:\nStatus of a physical AC interface or logical AC interface that is bound to the VSIUPE PW status in the scenario of VLL accessing VPLS\nIf your want to prevent the status of all the VSIs from being affected by AC status changes, run the vpls ignore-ac-state command.\nIf your want to prevent the status of one VSI from being affected by AC status changes, run the ignore-ac-state command.\n\nConfiguration Impact\nAfter the ignore-ac-state command is configured, the VSI status will not be affected by AC status changes. A VSI can go Up even if no AC is connected to the VSI.\nFollow-up Procedure\nAfter service switching, run the undo ignore-ac-state command to restore the default configuration."
}