{
    "PageTitle": "mac-withdraw propagate enable",
    "FuncDef": "The mac-withdraw propagate enable command enables a PE to forward a received MAC Withdraw message to its peers.\nThe undo mac-withdraw propagate enable command disables a PE from forwarding a received MAC Withdraw message to its peers.\nBy default, a PE does not forward a received MAC Withdraw message.",
    "CLIs": [
        "mac-withdraw propagate enable",
        "undo mac-withdraw propagate enable"
    ],
    "ParentView": [
        "VSI-STATIC view",
        "VSI-BD view",
        "VSI-AUTO view",
        "VSI-BVSI view",
        "VSI-IVSI-P2P view",
        "VSI-DEFAULT view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] vsi vsi100",
            "[*HUAWEI-vsi-vsi100] mac-withdraw propagate enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn an LDP or BGP AD VPLSnetwork, after a local PE receives a MAC Withdraw message, the local PE needs to forward the MAC Withdraw message to its peers. Otherwise, its peers cannot detect network topology changes or learn new MAC addresses in a timely manner. As a result, traffic loss caused by invalid MAC addresses will occur. To enable a PE to forward a received MAC Withdraw message to its peers, run the mac-withdraw propagate enable command.\nPrecautions\nAfter you run the mac-withdraw propagate enable command on a PE, the PE forwards a received MAC Withdraw message to its peers according to the split horizon principle:The MAC Withdraw message received from a UPE will be forwarded to NPEs and other UPEs.The MAC Withdraw message received from an NPE will be forwarded to UPEs, but will not be forwarded to other NPEs.\nThe mac-withdraw propagate enable command applies to MAC Withdraw messages carrying either the FEC 128 TLV or the FEC 129 TLV. The upe-upe mac-withdraw enable, upe-npe mac-withdraw enable, and npe-upe mac-withdraw enable commands apply only to MAC Withdraw messages carrying the FEC 128 TLV. The mac-withdraw propagate enable command cannot be used with the upe-upe mac-withdraw enable, upe-npe mac-withdraw enable, or npe-upe mac-withdraw enable command in the same VSI."
}