{
    "PageTitle": "unknown-frame",
    "FuncDef": "The unknown-frame command specifies the processing mode for received unknown frames.\nThe unknown-frame command restores the default configuration.\nBy default, the system broadcasts unknown unicast and multicast frames.",
    "CLIs": [
        "unknown-frame { unicast { broadcast | drop [ mac-learning ] } | multicast { broadcast | drop } }",
        "undo unknown-frame { unicast | multicast } { drop }"
    ],
    "ParentView": [
        "VSI-AUTO view",
        "VSI-BVSI view",
        "VSI-DEFAULT view",
        "VSI-IVSI-BEVPNINTERWORK view",
        "VSI-IVSI-P2P view",
        "VSI-STATIC view"
    ],
    "ParaDef": [
        {
            "Parameters": "unicast",
            "Info": "Specifies the processing mode for received unknown unicast frames.\n-"
        },
        {
            "Parameters": "broadcast",
            "Info": "Broadcasts the received unknown frames.\n-"
        },
        {
            "Parameters": "drop",
            "Info": "Drops the received unknown frames.\n-"
        },
        {
            "Parameters": "mac-learning",
            "Info": "Drops the received unknown unicast frames and learns their MAC addresses.\n-"
        },
        {
            "Parameters": "multicast",
            "Info": "Specifies the processing mode for received unknown multicast frames.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] vsi company1",
            "[*HUAWEI-vsi-company1] unknown-frame unicast drop"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a VSI cannot find the entry that matches the destination address of the received frame in the MAC address table, the frame is considered an unknown frame.\nAfter the unknown-frame command is run, unknown frames are divided into unknown unicast frames and unknown multicast frames for processing. The processing modes include drop and broadcast.\nSometimes, you are advised to set the processing mode to drop to avoid attacks or to save system resources and network bandwidth.\nPrecautions\nThe unknown-frame unicast drop command discards the received unknown unicast frames and disables MAC address learning."
}