{
    "PageTitle": "encapsulation (VSI-BD view)",
    "FuncDef": "The encapsulation command configures the encapsulation type of a VSI.\nThe undo encapsulation command restores the default configuration.\nBy default, the encapsulation type of a VSI is VLAN.",
    "CLIs": [
        "encapsulation vlan",
        "encapsulation ethernet",
        "undo encapsulation [ ethernet ]"
    ],
    "ParentView": [
        "VSI-AUTO view",
        "VSI-BD view",
        "VSI-BVSI view",
        "VSI-DEFAULT view",
        "VSI-IVSI-BEVPNINTERWORK view",
        "VSI-IVSI-P2P view",
        "VSI-STATIC view"
    ],
    "ParaDef": [
        {
            "Parameters": "ethernet",
            "Info": "Indicates that the encapsulation type of the VSI is Ethernet.\n-"
        },
        {
            "Parameters": "vlan",
            "Info": "Indicates that the encapsulation type of the VSI is VLAN.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] vsi company1",
            "[*HUAWEI-vsi-company1] encapsulation ethernet"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn a VPLS network, both tagged or untagged packets may be sent from CEs to PEs. In this case, specifying an encapsulation type on a PE affects the tag-specific forwarding behavior.\nConfiguration Impact\nThe encapsulation type of a VSI determines whether a packet carries a tag.\nPrecautions\nThe encapsulation types of the VSIs bound to the two ends of a PW must be consistent.The encapsulation type of a VSI and the encapsulation type of the AC interface are not closely related. You only need to ensure that the encapsulation types of the VSIs bound to the two ends of a PW are consistent.Changing the B-VSI encapsulation type will change the encapsulation types of all I-VSIs bound to the B-VSI.After a VSI in BD mode is configured, PEs with the Ethernet encapsulation type process VLAN tags in compliance with the traffic behaviors of EVC sub-interfaces."
}