{
    "PageTitle": "mac-address aging-time",
    "FuncDef": "The mac-address aging-time command configures the aging time of dynamic MAC address entries in a specified VLAN.\nThe undo mac-address aging-time command restores the default aging time.\nThe default aging time of dynamic MAC address entries is 300 seconds.",
    "CLIs": [
        "mac-address aging-time <interval>",
        "mac-address aging-time local <local-seconds>",
        "mac-address aging-time remote <remote-seconds>",
        "undo mac-address aging-time",
        "undo mac-address aging-time local",
        "undo mac-address aging-time remote"
    ],
    "ParentView": [
        "VSI-AUTO view",
        "VSI-BVSI view",
        "VSI-DEFAULT view",
        "VSI-IVSI-BEVPNINTERWORK view",
        "VSI-IVSI-P2P view",
        "VSI-STATIC view"
    ],
    "ParaDef": [
        {
            "Parameters": "interval",
            "Info": "Specifies the aging time of dynamic MAC address entries.\nThe value is an integer that can be 0, or ranges from 60 to 1,000,000, in seconds.\nIf the aging time is set to 0, all the dynamic entries are not aged."
        },
        {
            "Parameters": "local local-seconds",
            "Info": "Indicates the aging time of local dynamic MAC address entries in a VSI.\nThe value is an integer that can be 0, or ranges from 60 to 1,000,000, in seconds.\nIf the aging time is set to 0, all the dynamic entries are not aged."
        },
        {
            "Parameters": "remote remote-seconds",
            "Info": "Indicates the aging time of dynamic MAC address entries remotely learned by a VSI.\nThe value is an integer that can be 0, or ranges from 60 to 1,000,000, in seconds.\nIf the aging time is set to 0, all the dynamic entries are not aged."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] vsi vsi1",
            "[*HUAWEI-vsi-vsi1] mac-address aging-time 0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAs network topologies change constantly, a device learns more and more MAC addresses. To avoid the explosive growth of MAC address entries, you can use the mac-address aging-time command to set a proper aging time to have the invalid MAC address entries deleted in time.\nThe system starts an aging timer for each dynamic MAC address entry. If the MAC address entry is not updated before the aging time expires, the entry will be deleted. If the MAC address entry is updated before the aging time expires, the aging time of the MAC address entry will be recalculated. The shorter the aging time is, the more sensitive a device is to the network changes.\nThe aging time of dynamic MAC address entries should be set based on the network condition and device performance.\nThe aging time of dynamic MAC address entries in a stable network can be set longer. The aging time of dynamic MAC address entries in a constantly changing network can be set shorter.The capacity of the MAC address table on a low-end device is set smaller than that of the MAC address table on a high-end device. The aging time of MAC address entries on the low-end device can be set shorter to speed up entry aging and save space of the MAC address table.\n\nPrecautions\nAfter the system resets, dynamic MAC address entries are lost, whereas static MAC address entries and blackhole MAC address entries are neither aged nor lost."
}