{
    "PageTitle": "p2p-vsi enable",
    "FuncDef": "The p2p-vsi enable command configures a local VPLS connection between two CEs connecting to the same PE.\nThe undo p2p-vsi enable command deletes a local VPLS connection.\nBy default, no local VPLS connection is configured.",
    "CLIs": [
        "p2p-vsi enable",
        "undo p2p-vsi enable"
    ],
    "ParentView": [
        "VSI-AUTO view",
        "VSI-DEFAULT view",
        "VSI-STATIC view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] vsi vsi1",
            "[*HUAWEI-vsi-vsi1] pwsignal ldp",
            "[*HUAWEI-vsi-vsi1-ldp] vsi-id 2",
            "[*HUAWEI-vsi-vsi1-ldp] quit",
            "[*HUAWEI-vsi-vsi1] mac-learning disable",
            "[*HUAWEI-vsi-vsi1] p2p-vsi enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nLocal VPLS connections apply to small MPLS networks with simple topologies. Because a local VPLS connection does not require signaling negotiation or control packet exchange, it does not consume many resources. However, it requires manual configuration by network administrators and therefore has poor expansibility and is difficult to maintain.\nTo enable two CEs connecting to the same PE to communicate, run the p2p-vsi enable command to establish a local VPLS connection between the two CEs for them to communicate.\nPrerequisites\nA VSI has been created and the VSI view displayed using the vsi [ static ] command.MAC address learning of the VSI has been disabled using the mac-learning disable command.\n\nPrecautions\nThe p2p-vsi enable command must be run before the l2 binding vsi command is run.A local VPLS connection configured using the p2p-vsi enable command does not require any public network tunnel. After a device has the p2p-vsi enable command configured, the device does not support the peer (VSI-LDP view) command any longer.mVSIs and PBB VSIs do not support the p2p-vsi enable command.\nAfter the p2p-vsi enable command is run, the configured broadcast and multicast features do not take effect."
}