{
    "PageTitle": "tnl-policy (VSI-BD view)",
    "FuncDef": "The tnl-policy command configures a VSI to reference a tunnel policy.\nThe undo tnl-policy command restores the default configuration.\nBy default, no tunnel policy is configured for a VSI.",
    "CLIs": [
        "tnl-policy <policy-name>",
        "undo tnl-policy"
    ],
    "ParentView": [
        "VSI-AUTO view",
        "VSI-BD view",
        "VSI-BVSI view",
        "VSI-DEFAULT view",
        "VSI-IVSI-BEVPNINTERWORK view",
        "VSI-STATIC view"
    ],
    "ParaDef": [
        {
            "Parameters": "policy-name",
            "Info": "Specifies the name of a tunnel policy.\nThe value is a string of 1 to 39 case-sensitive characters without spaces."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] tunnel-policy policy1",
            "[~HUAWEI-tunnel-policy-policy1] quit",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] vsi company1",
            "[*HUAWEI-vsi-company1] tnl-policy policy1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, VPLS forwards packets over LDP LSPs on the public network, and load balancing is performed if there are more than one LDP LSP to the same destination address.\nIf you want to change the type of the public network tunnel used for packet forwarding or if you want to enable load balancing among multiple tunnels, you can run the tunnel-policy command in the system view to configure a tunnel policy and the tnl-policy command in the VSI view to reference this tunnel policy.\nPrerequisites\nThe tunnel policy to be referenced has been created.\nConfiguration Impact\nAfter a tunnel policy is referenced, the VPLS traffic is forwarded on the public network using the tunnel specified in the tunnel policy.The undo tnl-policy command restores the default tunnel (LDP LSP) used for packet forwarding.\n\nPrecautions\nIn addition to running this command to reference a tunnel policy, you can run the peer command in the VSI view to specify the peer address and the tunnel policy to be referenced by the VSI. The tunnel policy specified in the peer command has a higher priority than that specified in the tnl-policy command in the VSI view. If tunnel policies are specified in both the tnl-policy and peer commands, the tunnel policy specified in the peer command is preferred."
}