{
    "PageTitle": "mac-learn-style",
    "FuncDef": "The mac-learn-style command configures the MAC address learning mode of a VSI.\nThe undo mac-learn-style qualify command restores the default MAC address learning mode of a VSI.\nBy default, the MAC address learning mode is unqualify.",
    "CLIs": [
        "mac-learn-style { qualify | unqualify }",
        "undo mac-learn-style qualify"
    ],
    "ParentView": [
        "VSI-STATIC view",
        "VSI-AUTO view",
        "VSI-DEFAULT view"
    ],
    "ParaDef": [
        {
            "Parameters": "qualify",
            "Info": "Specifies the MAC address learning mode as qualify.\n-"
        },
        {
            "Parameters": "unqualify",
            "Info": "Specifies the MAC address learning mode as unqualify.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] quit",
            "[*HUAWEI] mpls l2vpn",
            "[*HUAWEI-l2vpn] quit",
            "[*HUAWEI] vsi vsi1",
            "[*HUAWEI-vsi-vsi1] mac-learn-style qualify"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA characteristic of the Ethernet service is that broadcast, multicast, and unknown unicast frames are flooded to all interfaces. This characteristic is called flooding. To achieve flooding within the service provider network, Ethernet-based VPLS floods all unknown unicast, broadcast, and multicast frames over the corresponding PWs to all PEs participating in the VPLS, as well as to all ACs. However, multicast frames do not necessarily have to be sent to all VPN members. To prevent unnecessary multicast frame forwarding, a PE must be able to associate a destination MAC address with a PW. Since it is impossible to require that PEs statically associate every possible destination MAC address with a PW, VPLS-capable PEs must have the capability to dynamically learn MAC addresses from both ACs and PWs. To configure the MAC address learning mode of a VSI, run the\nmac-learn-style command. In this command, either of the following parameters can be configured:\nqualify: In qualified learning, each customer VLAN has its own broadcast domain and MAC address space. A PE learns both the MAC addresses and VLAN tags of received frames.unqualify: In unqualified learning, all the VLANs of a single customer are handled by a single VPLS service, which means they all share a single broadcast domain and a single MAC address space. The MAC addresses need to be unique and non-overlapping among customer VLANs. A PE learns only the MAC addresses of received frames.\n\nPrerequisites\nA VSI has been created or the VSI view is displayed using the vsi command.\nPrecautions\nAfter the VSI MAC address learning mode is set to IVL using the mac-learn-style qualify command, only the AC interface of the QinQ Stacking, QinQ Mapping, or dot1q VLAN tag termination type can be bound.\nThe LPUI-21-L/LPUI-51-L/LPUI-51/LPUI-51-B/LPUI-101/LPUI-101-B does not support MAC address learning (IVL) in the qualify mode.\nAfter the VSI MAC address learning mode is set to IVL using the mac-learn-style qualify command, only the AC interface of the QinQ Stacking, QinQ Mapping, or dot1q VLAN tag termination type can be bound.\nThe LPUF-50/LPUF-50-L/LPUF-51/LPUF-51-B/LPUS-51/LPUF-101/LPUF-101-B/LPUS-101 does not support MAC address learning (IVL) in the qualify mode."
}