{
    "PageTitle": "pim mib-notification interval",
    "FuncDef": "The pim mib-notification interval command sets the interval for PIM to send trap messages about various events.\nThe undo pim mib-notification interval command restores the default interval for PIM to send various trap messages.\nBy default, an alarm is generated only when a neighbor loss event or a neighbor addition event occurs. No alarm is generated when the other events occur.",
    "CLIs": [
        "pim mib-notification interval { interface-election-dr <election-value> | invalid-join-prune <jp-value> | invalid-register <register-value> | neighbor-loss <loss-value> | new-neighbor <new-value> | rp-mapping-change <change-value> }",
        "undo pim mib-notification interval all",
        "undo pim mib-notification interval interface-election-dr",
        "undo pim mib-notification interval invalid-join-prune",
        "undo pim mib-notification interval invalid-register",
        "undo pim mib-notification interval neighbor-loss",
        "undo pim mib-notification interval new-neighbor",
        "undo pim mib-notification interval rp-mapping-change"
    ],
    "ParentView": [
        "Multicast MIB view"
    ],
    "ParaDef": [
        {
            "Parameters": "interface-election-dr election-value",
            "Info": "Specifies the minimum interval for sending trap messages about designated router (DR) election.\nThe value is an integer that ranges from 0 to 65535, in seconds. The default value is 65535 seconds."
        },
        {
            "Parameters": "invalid-join-prune jp-value",
            "Info": "Specifies the minimum interval for sending trap messages about invalid Join/Prune messages.\nThe value is an integer that ranges from 10 to 65535, in seconds. The default value is 65535 seconds."
        },
        {
            "Parameters": "invalid-register register-value",
            "Info": "Specifies the minimum interval for sending trap messages about invalid Register messages.\nThe value is an integer that ranges from 10 to 65535, in seconds. The default value is 65535 seconds."
        },
        {
            "Parameters": "neighbor-loss loss-value",
            "Info": "Specifies the minimum interval for sending trap messages about neighbor loss.\nThe value is an integer that ranges from 0 to 65535, in seconds. The default value is 0 seconds."
        },
        {
            "Parameters": "new-neighbor new-value",
            "Info": "Specifies the minimum interval for sending trap messages about neighbor addition.\nThe value is an integer that ranges from 0 to 65535, in seconds. The default value is 0 seconds."
        },
        {
            "Parameters": "rp-mapping-change change-value",
            "Info": "Specifies the minimum interval for sending trap messages about the Rendezvous Point (RP)-mapping change.\nThe value is an integer that ranges from 0 to 65535, in seconds. The default value is 65535 seconds."
        },
        {
            "Parameters": "all",
            "Info": "Specifies to undo all the minimum intervals for sending trap messages.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast-mib",
            "[*HUAWEI-multicast-mib] pim mib-notification interval invalid-join-prune 50"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe pim mib-notification interval command sets the interval for sending trap messages. When an event occurs, if the period since the last time for sending the trap message is shorter than the configured interval, the system does not send any trap message.\nIf the default interval is 0, it indicates that a trap message is sent immediately after an event occurs.If the default interval is 65535, it indicates that no trap message is sent after an event occurs. Then run this command to adjust the interval to a smaller value so that a trap message can be sent after an event occurs."
}