{
    "PageTitle": "display l2protocol-tunnel statistics",
    "FuncDef": "The display l2protocol-tunnel statistics command displays statistics about tunneled Layer 2 protocol data units (PDUs) on an interface.",
    "CLIs": [
        "display l2protocol-tunnel statistics { <interface-type> <interface-number> | <interface-name> } [ { <protocol> } &<1-19> ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "interface-type",
            "Info": "Specifies the interface type.\nThe value is a string of 1 to 63 case-insensitive characters, spaces not supported."
        },
        {
            "Parameters": "interface-number",
            "Info": "Specifies the interface number.\n-"
        },
        {
            "Parameters": "interface-name",
            "Info": "Specifies the interface name.\nThe value is a string of 1 to 63 case-insensitive characters, spaces not supported."
        },
        {
            "Parameters": "protocol",
            "Info": "Displays statistics about tunneled Layer 2 PDUs of a specified protocol on an interface.\nThe protocol as follows:\nstplacpdtpgmrpgvrplldpvtpudldpagpcdpeoam3ahdldpmvrpmmrpe-lmisstp\nOne or up to all of the preceding Layer 2 protocols can be specified."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display l2protocol-tunnel statistics GigabitEthernet 1/0/1 stp",
            "-------------------------------------------------------------------",
            "Port      Protocol Input   Output  Drop",
            "                   Packets Packets Packets ",
            "-------------------------------------------------------------------",
            "GE1/0/1   stp      12345   67890   1235"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter you configure Layer 2 protocol tunneling, run the display l2protocol-tunnel statistics command to view statistics about tunneled Layer 2 PDUs on an interface. The statistics include:\nNumber of incoming Layer 2 PDUsNumber of outgoing Layer 2 PDUsNumber of dropped Layer 2 PDUs that exceed the configured drop threshold\nThe proceeding statistics serve as a reference for traffic statistics and fault diagnosis.\n\nPrecautions\nWhen tunneling is enabled on an interface for more than one Layer 2 protocol, specifying protocol or user-defined-protocol in this command is recommended. Otherwise, the following problems may occur due to excessive output information:\nThe output information is repeatedly refreshed, and therefore it is difficult to locate your desired information.The system fails to respond to other requests because it is busy searching information."
}