{
    "PageTitle": "bpdu-tunnel enable",
    "FuncDef": "The bpdu-tunnel enable command enables bridge protocol data unit (BPDU) tunneling on an interface to transparently transmit BPDUs from user networks.\nThe bpdu-tunnel disable command disables BPDU tunneling on an interface.\nThe undo bpdu-tunnel enable or bpdu-tunnel disable command disables BPDU tunneling on an interface.\nBy default, BPDU tunneling is disabled on an interface.",
    "CLIs": [
        "bpdu-tunnel enable",
        "bpdu-tunnel disable",
        "undo bpdu-tunnel enable"
    ],
    "ParentView": [
        "Layer 2 100GE interface view",
        "Layer 2 10GE interface view",
        "25GE-L2 view",
        "400GE-L2 view",
        "Layer 2 40GE interface view",
        "Layer 2 50GE interface view",
        "Layer 2 50|100GE interface view",
        "Layer 2 Eth-Trunk interface view",
        "Layer 2 GE interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] portswitch",
            "[*HUAWEI-GigabitEthernet1/0/1] bpdu-tunnel enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen user networks need to send BPDUs over a carrier network to perform the spanning tree calculation, run the bpdu-tunnel enable command to enable BPDU tunneling on user-side interfaces of the PEs on the carrier network. In this situation, the PEs do not send BPDUs to their CPUs for processing. Instead, they transparently transmit the BPDUs through BPDU tunnels over the carrier network to user networks.\nPrerequisites\nIf the interface is a Layer 3 interface, it must have been switched to a Layer 2 interface using the portswitch command.\nFollow-up Procedure\nIf a spanning tree protocol is enabled on the interface, run the stp disable command to disable the spanning tree protocol.\nPrecautions\nThe bpdu-tunnel stp vlan and bpdu-tunnel enable commands cannot be both configured on the same interface. If they are both configured, the system prompts a configuration conflict."
}