{
    "PageTitle": "hvrp-transport",
    "FuncDef": "The hvrp-transport command enables an interface to transparently transmit HVRP packets.\nThe undo hvrp-transport command disables an interface from transparently transmitting HVRP packets.\nBy default, an interface is disabled from transparently transmitting HVRP packets.",
    "CLIs": [
        "hvrp-transport",
        "undo hvrp-transport"
    ],
    "ParentView": [
        "GE optical interface view",
        "Port extension interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] stp enable",
            "[*HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet 1/0/0] portswitch",
            "[*HUAWEI-GigabitEthernet 1/0/0] hvrp-transport"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nHVRP is introduced to resolve MAC addresses insufficiency. It tries to allow each VLAN broadcast domain to have at most two ports. In this way, MAC entries do not need to be searched for before packets are broadcast. On a special network where some devices support HVRP while others do not, run the hvrp-transport command to enable an interface on the device that does not support HVRP to transparently transmit HVRP packets. This function ensures normal packet forwarding on the entire network and ensures that the device that supports HVRP learns MAC addresses properly.In the HVRP networking, if a device directly connects to another device rather than a user, this device does not need to support HVRP, but only needs to transparently transmit HVRP packets.Before running the hvrp-transport command on an interface, ensure that the interface is a Layer 2 interface and has STP enabled.After this command is run on an interface, if this interface in an STP domain receives an HVRP packet, it transparently transmits the packet to the root interface. If the root interface receives an HVRP packet, it directly discards the packet.\n\nPrerequisites\nTo set the hvrp-transport command, run the stp enable command on the interface to enable STP."
}