{
    "PageTitle": "l2protocol-tunnel drop-threshold (Layer 2 sub-interface view)",
    "FuncDef": "The l2protocol-tunnel drop-threshold command configures a drop threshold for Layer 2 protocol data units (PDUs) on an interface enabled with Layer 2 protocol tunneling.\nThe undo l2protocol-tunnel drop-threshold command restores the default drop threshold for Layer 2 PDUs on an interface enabled with Layer 2 protocol tunneling.\nBy default, the drop threshold is 0, meaning that the drop threshold for Layer 2 protocol data units (PDUs) on an interface enabled with Layer 2 protocol tunneling is not set.",
    "CLIs": [
        "l2protocol-tunnel drop-threshold <rate> [ { <protocol> } &<1-19> ]",
        "undo l2protocol-tunnel drop-threshold [ { <rate> <protocol> } | { <protocol> } &<1-19> ]"
    ],
    "ParentView": [
        "Layer 2 40GE interface view",
        "50GE Layer 2 sub-interface view",
        "Eth-Trunk Layer 2 sub-interface view",
        "40GE interface view",
        "GE Layer 2 sub-interface view",
        "Port extension interface view",
        "GE electrical interface view",
        "Port extension Layer 2 interface view",
        "Layer 2 10GE interface view",
        "Layer 2 Eth-Trunk interface view",
        "Layer 2 GE interface view",
        "400GE interface view",
        "10GE interface view",
        "Layer 2 100GE interface view",
        "Layer 2 50|100GE interface view",
        "25GE-L2 view",
        "400GE-L2 view",
        "Layer 2 sub-interface view",
        "Interface group view",
        "GE interface view",
        "Layer 2 50GE interface view",
        "100GE interface view",
        "Sub-interface view",
        "50GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Eth-Trunk interface view",
        "400GE Layer 2 sub-interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "rate",
            "Info": "Specifies the threshold for dropping Layer 2 PDUs per second on an interface enabled with Layer 2 protocol tunneling.\nThe value is an integer ranging from 1 to 4096, in packets per second."
        },
        {
            "Parameters": "protocol",
            "Info": "Specifies the Layer 2 protocol of which the drop threshold is configured for Layer 2 PDUs.\nThe protocol as follows:\nstplacpdtpgmrpgvrplldpvtpudldpagpcdpeoam3ahdldpmvrpmmrpe-lmisstp\nOne or up to all of the preceding Layer 2 protocols can be specified."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/1",
            "[~HUAWEI-GigabitEthernet1/0/1] portswitch",
            "[*HUAWEI-GigabitEthernet1/0/1] l2protocol-tunnel stp enable",
            "[~HUAWEI-GigabitEthernet1/0/1] l2protocol-tunnel drop-threshold 10 stp"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo protect interfaces enabled with Layer 2 protocol tunneling against protocol packet attacks, run the l2protocol-tunnel drop-threshold command to configure a drop threshold for Layer 2 PDUs on the interfaces.\nThe interfaces drop excess Layer 2 PDUs when the number of Layer 2 PDUs received in 1s exceeds the configured drop threshold.\nPrerequisites\nLayer 2 protocol tunneling has been enabled using the l2protocol-tunnel vlan or l2protocol-tunnel enable command.\nFollow-up Procedure\nRun the display l2protocol-tunnel statistics command to view statistics about tunneled Layer 2 PDUs on an interface enabled with Layer 2 protocol tunneling and use the statistics as a reference for traffic statistics and fault diagnosis.\nPrecautions\nBefore using the l2protocol-tunnel drop-threshold command, note the following:\nIf no protocol is specified, the configured drop threshold applies to all tunneled Layer 2 protocols on the interface enabled with Layer 2 protocol tunneling.If a protocol is specified, the interface drops the excess Layer 2 PDUs of this specified protocol when the configured drop threshold is exceeded.If you do not specify any protocol when configuring a drop threshold and then you specify a protocol when configuring a drop threshold, the latest configuration takes effect."
}