{
    "PageTitle": "link-protocol forwarding",
    "FuncDef": "The link-protocol forwarding command enables an interface to forward the specific packets.\nThe undo link-protocol forwarding command deletes the specific packets forwarding configuration. That means that an interface is enabled to discard the specific packets again after the undo link-protocol forwarding command is run.\nBy default, interfaces configured discard received lacp, lamp, c-stp, s-stp, port-authentication, link-oam, eoam3ah, e-lmi and ptp-peer-delay packets.",
    "CLIs": [
        "link-protocol forwarding { c-stp | s-stp | eoam3ah | e-lmi | ptp-peer-delay }",
        "undo link-protocol forwarding { c-stp | s-stp | eoam3ah | e-lmi | ptp-peer-delay }"
    ],
    "ParentView": [
        "Layer 2 Eth-Trunk interface view",
        "Eth-Trunk interface view",
        "Layer 2 GE interface view",
        "GE interface view",
        "GE electrical interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "c-stp",
            "Info": "Configures interfaces to forward Layer 2 control protocol packets c-stp with the destination MAC address of 01-80-c2-00-00-00.\n-"
        },
        {
            "Parameters": "s-stp",
            "Info": "Configures interfaces to forward Layer 2 control protocol packets s-stp with the destination MAC address of 01-80-c2-00-00-08.\n-"
        },
        {
            "Parameters": "e-lmi",
            "Info": "Configures interfaces to forward Layer 2 control protocol packets e-lmi.\n-"
        },
        {
            "Parameters": "ptp-peer-delay",
            "Info": "Configures interfaces to forward Layer 2 control protocol packets ptp-peer-delay.\n-"
        },
        {
            "Parameters": "eoam3ah",
            "Info": "Configures interfaces to forward Layer 2 control protocol packets eoam3ah.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface eth-trunk 1",
            "[*HUAWEI-Eth-Trunk1] link-protocol forwarding c-stp"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThis command enables an interface to forward the specific packets.\nThe protocol of lacp, lamp, c-stp, s-stp, port-authentication, e-lmi, eoam3ah cannot be run on Eth-Trunk member interfaces. A GE interface that has this command run cannot be added to an Eth-Trunk interface.\nThe protocol of link-oam and ptp-peer-delay cannot be configured on an Eth-Trunk interface, but can be configured on an Eth-Trunk member interface."
}