{
    "PageTitle": "reset l2protocol-tunnel statistics",
    "FuncDef": "The reset l2protocol-tunnel statistics command deletes statistics about tunneled Layer 2 protocol data units (PDUs) on a specified interface.",
    "CLIs": [
        "reset l2protocol-tunnel statistics { <interface-type> <interface-number> | <interface-name> } [ { <protocol> } &<1-19> ]"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "interface-type",
            "Info": "Specifies the interface type.\nThe value is a string of 1 to 63 case-insensitive characters, spaces not supported."
        },
        {
            "Parameters": "interface-number",
            "Info": "Specifies the interface number.\n-"
        },
        {
            "Parameters": "interface-name",
            "Info": "Specifies the interface name.\nThe value is a string of 1 to 63 case-insensitive characters, spaces not supported."
        },
        {
            "Parameters": "protocol",
            "Info": "Deletes statistics about tunneled Layer 2 PDUs of a specified protocol on an interface.\nThe protocol as follows:\nstplacpdtpgmrpgvrplldpvtpudldpagpcdpeoam3ahdldpmvrpmmrpe-lmisstp\nOne or up to all of the preceding Layer 2 protocols can be specified."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset l2protocol-tunnel statistics GigabitEthernet 1/0/1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBefore collecting statistics about tunneled Layer 2 PDUs on an interface, run the reset l2protocol-tunnel statistics command to delete the existing statistics so that the interface can re-collect the statistics.\nFollow-up Procedure\nRun the display l2protocol-tunnel statistics command to check whether statistics are deleted.\nPrecautions\nThe statistics about tunneled Layer 2 PDUs cannot be restored after they are cleared. Exercise caution when running the reset l2protocol-tunnel statistics command.\nBefore using the reset l2protocol-tunnel statistics command, note the following:\nIf no protocol is specified, this command deletes the statistics about all tunneled Layer 2 PDUs on a specified interface.If a protocol is specified, this command deletes the statistics about tunneled Layer 2 PDUs of this specified protocol on a specified interface."
}