{
    "PageTitle": "bpdu-tunnel stp group-mac",
    "FuncDef": "The bpdu-tunnel stp group-mac command replaces the well-known destination MAC address of bridge protocol data units (BPDUs) generated by a spanning tree protocol with a multicast MAC address.\nThe undo bpdu-tunnel stp group-mac command restores the default multicast MAC address of BPDUs.\nBy default,the multicast destination MAC address of BPDUs is 0100-0ccd-cdd0.",
    "CLIs": [
        "bpdu-tunnel stp group-mac <group-mac>",
        "undo bpdu-tunnel stp group-mac"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "group-mac",
            "Info": "Specifies a multicast MAC address that replaces the well-known destination MAC address of BPDUs.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] bpdu-tunnel stp group-mac 0100-0ccf-ffff"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA user network is connected to each interface of PEs on the carrier network, but all user networks do not belong to the same LAN. Bridge protocol data units (BPDUs) sent from the user networks to PEs are untagged. The PEs, however, need to identify the LANs to which the BPDUs belong. For example, BPDUs from a user network in LAN A must be forwarded to other user networks in LAN A, rather than user networks in LAN B. In addition, BPDUs sent from user networks must not be processed by the CPUs of the PEs on the carrier network.\nThe following methods can address this problem:\nConfigure different roles for devices to identify BPDUs.Run the bpdu-tunnel stp bridge role provider command to configure PEs on the carrier network as providers. The well-known destination MAC address of BPDUs sent by the PEs (providers) is 01-80-C2-00-00-08. The PEs do not send BPDUs from customers to their CPUs for processing. Instead, the PEs directly forward the BPDUs.Run the undo bpdu-tunnel stp bridge role provider command to configure devices on user networks as customers. The well-known destination MAC address of BPDUs sent by the devices (customers) is 01-80-C2-00-00-00.Configure the same role for devices both on the carrier network and user networks. Specifically, configure them as customers. Then, run the bpdu-tunnel stp group-mac command on the devices of the carrier network to replace the well-known destination MAC address of BPDUs from user networks to a specified multicast MAC address.\n\nPrecautions\nThe well-known MAC address of BPDUs can be changed only to a multicast MAC address, which cannot be a reserved multicast MAC address in the range of 0180-C200-0000 to 0180-C200-002F.\nIn VS mode, this command is supported only by the admin VS."
}