{
    "PageTitle": "ip address unnumbered (Mtunnel view)",
    "FuncDef": "The ip address unnumbered command enables an interface to borrow an IP address from another interface.\nThe undo ip address unnumbered command disables an interface from borrowing an IP address from another interface.\nBy default, an interface is disabled from borrowing an IP address from another interface.",
    "CLIs": [
        "ip address unnumbered interface { <unnumif-type> <unnumif-num> | <unnumif-name> }",
        "undo ip address unnumbered"
    ],
    "ParentView": [
        "MTI interface view",
        "Mtunnel view"
    ],
    "ParaDef": [
        {
            "Parameters": "unnumif-name",
            "Info": "Specifies the name of an interface whose IP address is borrowed.\n-"
        },
        {
            "Parameters": "interface unnumif-type unnumif-num",
            "Info": "Specifies the type and number of an interface whose IP address is borrowed.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface LoopBack 0",
            "[*HUAWEI-LoopBack0] ip address 1.1.1.1 24",
            "[*HUAWEI-LoopBack0] quit",
            "[*HUAWEI] interface Tunnel 10",
            "[*HUAWEI-Tunnel10] ip address unnumbered interface loopback 0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo save IP address resources, run the ip address unnumbered command to configure an interface to borrow an IP address from another interface. If an interface is only occasionally used, it is unnecessary to configure an IP address for the interface. Instead, configure the interface to borrow an IP address from another interface.\nThe following interfaces support IP borrowing from other interfaces such as Ethernet and loopback interfaces:\nInterfaces encapsulated with PPPTunnel interfacesGlobal-VE sub-interfaces and VE sub-interfacesEthernet interfaces and GE sub-interfacesVlanif interfacesEth-Trunk sub-interfacesMtunnel interfaces\n\nPrerequisites\nThe numbered interface has been configured with an IP address using the ip address command or has obtained an IP address through negotiation.\nConfiguration Impact\nAfter an unnumbered interface borrows an IP address, the interface can use this IP address to communicate with other devices. The display interface command displays the borrowed IP address and its subnet mask.\nPrecautions\nBecause an interface with a borrowed IP address does not have its own IP address, the system cannot generate any route for the interface. Therefore, you need to manually configure the route to implement interconnection between Routers.\nWhen configuring IP address unnumbered on an interface, note the following:\nThe IP address of the numbered interface cannot be a borrowed IP address.The IP address of the numbered interface can be lent to multiple interfaces.If the numbered interface has multiple IP addresses, only the primary IP address can be lent.If the numbered interface is not configured with any IP address, the IP address 0.0.0.0 is borrowed.The IP address of the virtual loopback interface can be lent to other interfaces, but the virtual loopback interface cannot borrow an IP address from another interface.\nIf a tunnel interface is not configured to borrow IP addresses of other interfaces, the tunnel interface does not have an IP address by default."
}