{
    "PageTitle": "group source wildcard",
    "FuncDef": "The group source wildcard command configures an address pool range and switching criteria for (*, G) S-PMSI tunnels.\nThe undo group source wildcard command restores the default configuration.\nBy default, no address pool range or criteria are configured for switching between I-PMSI and S-PMSI tunnels.",
    "CLIs": [
        "group <group-address> { <group-mask> | <group-mask-length> } source wildcard { mldp | rsvp-te p2mp-template <p2mp-te-template-name> | bier [ sub-domain <sub-domain-val> ] [ bsl { 64 | 128 | 256 } ] } [ limit <number> ]",
        "undo group <group-address> { <group-mask> | <group-mask-length> } source wildcard"
    ],
    "ParentView": [
        "IPv4 address family MVPN-SPMSI view"
    ],
    "ParaDef": [
        {
            "Parameters": "group-address",
            "Info": "Specifies a group address for switching between I-PMSI and S-PMSI tunnels.\nThe value ranges from 224.0.0.0 to 239.255.255.255, in dotted decimal notation."
        },
        {
            "Parameters": "group-mask",
            "Info": "Specifies a mask for a group address.\nThe value ranges from 240.0.0.0 to 255.255.255.255, in dotted decimal notation."
        },
        {
            "Parameters": "group-mask-length",
            "Info": "Specifies mask length for a group address.\nThe value is an integer ranging from 4 to 32."
        },
        {
            "Parameters": "mldp",
            "Info": "Specifies the S-PMSI tunnel type as mLDP.\n-"
        },
        {
            "Parameters": "rsvp-te",
            "Info": "Specifies the S-PMSI tunnel type as RSVP-TE.\n-"
        },
        {
            "Parameters": "p2mp-template p2mp-te-template-name",
            "Info": "Specifies the name of a tunnel template to be referenced by an RSVP-TE P2MP tunnel.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "bier",
            "Info": "Indicates a BIER tunnel.\n-"
        },
        {
            "Parameters": "sub-domain sub-domain-val",
            "Info": "Specifies the ID of a BIER subdomain.\nThe value is an integer ranging from 0 to 255."
        },
        {
            "Parameters": "bsl",
            "Info": "Specifies a BSL.\nThe values are as follows: 64,128 and 256\nThe default value is 256."
        },
        {
            "Parameters": "limit number",
            "Info": "Specifies the maximum number of S-PMSI tunnels allowed.\nThe value is an integer ranging from 1 to 8192, and the default value is 16.\nAfter limit number is changed to a larger value, the traffic of newly added multicast groups will preferentially be switched to idle S-PMSI tunnels.After limit number is changed to a smaller value, the traffic of all multicast groups will be switched first to the I-PMSI tunnel and then to specific S-PMSI tunnels."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast mvpn 2.2.2.2",
            "[*HUAWEI] ip vpn-instance mcast1",
            "[*HUAWEI-vpn-instance-mcast1] ipv4-family",
            "[*HUAWEI-vpn-instance-mcast1-af-ipv4] route-distinguisher 22:1",
            "[*HUAWEI-vpn-instance-mcast1-af-ipv4] multicast routing-enable",
            "[*HUAWEI-vpn-instance-mcast1-af-ipv4] mvpn",
            "[*HUAWEI-vpn-instance-mcast1-af-ipv4-mvpn] ipmsi-tunnel",
            "[*HUAWEI-vpn-instance-mcast1-af-ipv4-mvpn-ipmsi] mldp",
            "[*HUAWEI-vpn-instance-mcast1-af-ipv4-mvpn-ipmsi] quit",
            "[*HUAWEI-vpn-instance-mcast1-af-ipv4-mvpn] spmsi-tunnel",
            "[*HUAWEI-vpn-instance-mcast1-af-ipv4-mvpn-spmsi] group 225.1.1.1 24 source wildcard threshold mldp 10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAn NG MVPN uses the I-PMSI tunnel to send multicast data to receivers. The I-PMSI tunnel connects to all PEs on the MVPN and sends multicast data to these PEs regardless of whether these PEs have receivers. If some PEs do not have receivers, this implementation will cause redundant traffic, wasting bandwidth resources and increasing PEs' burdens.\nS-PMSI tunnels solve this problem by sending multicast data only to PEs interested in the data.\nTo configure the address pool range and criteria for switching between I-PMSI and S-PMSI tunnels, run the group command.\nThe restrictions on the wildcard parameter are as follows:\nSource Wildcard (*, G):\nWildcard (*, G) and I-PMSI cannot be configured together.Wildcard (*, G) is mutually exclusive with S-PMSI (S, G) in the same group. That is, group addresses cannot overlap.Wildcard (*, G) and wildcard (*, *) cannot be configured together.Wildcard (*, G) does not support threshold configurations.\n\nPrecautions\nUp to 1024 such commands can be configured for each VPN, and up to 16384 such commands can be configured on an entire device, and the maximum limit value in a group command configuration is 8192.Up to 8192 S-PMSI tunnels can be configured for each VPN instance.If the address pool range specified in a group command overlaps with a previously configured address pool range, the command cannot be configured.If you want to change the tunnel type configured for an address pool range, you must delete the existing group command configuration and then run the group command with the desired tunnel type."
}