{
    "PageTitle": "mvpn",
    "FuncDef": "The mvpn command enables multicast virtual private network (MVPN) and displays the VPN instance IPv4 address family MVPN view.\nThe undo mvpn command deletes all VPN instance IPv4 address family MVPN configurations.\nBy default, MVPN is disabled.",
    "CLIs": [
        "mvpn",
        "undo mvpn"
    ],
    "ParentView": [
        "VPN instance IPv4 address family view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast mvpn 2.2.2.2",
            "[*HUAWEI] ip vpn-instance mcast1",
            "[*HUAWEI-vpn-instance-mcast1] ipv4-family",
            "[*HUAWEI-vpn-instance-mcast1-af-ipv4] route-distinguisher 10:10",
            "[*HUAWEI-vpn-instance-mcast1-af-ipv4] multicast routing-enable",
            "[*HUAWEI-vpn-instance-mcast1-af-ipv4] mvpn"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA Next Generation MVPN (NG MVPN) is a new framework designed to transmit IP multicast traffic across a BGP/MPLS IP VPN. An NG MVPN uses BGP to transmit signaling information, and uses PIM-SM, Protocol Independent Multicast-Source-Specific Multicast (PIM-SSM), point-to-multipoint (P2MP) TE, or multipoint extensions for LDP (mLDP) to transmit data. The NG MVPN enables unicast and multicast services to be delivered using the same VPN architecture.\nAll NG MVPN configurations are performed in the VPN instance IPv4 address family MVPN view. Before deploying an NG MVPN, run the mvpn command to enable MVPN so that configurations can be performed in the VPN instance IPv4 address family MVPN view.\nPrerequisites\nAn MVPN ID has been configured using the multicast mvpn command. The mvpn command cannot be executed if an MVPN ID has not been configured.\nPrecautions\nRunning the undo mvpn command deletes all configurations in the VPN instance IPv4 address family MVPN view. Exercise caution when running the command.\nIf MVPN has been enabled using the mvpn command, the undo multicast mvpn command cannot be executed. Before using the undo multicast mvpn command, run the undo mvpn command to disable MVPN of all VPN instances.\nThe mvpn command is mutually exclusive with the multicast-domain share-group command.\nThe mvpn command is mutually exclusive with the multicast-domain source-interface command."
}