{
    "PageTitle": "auto-discovery inter-as",
    "FuncDef": "The auto-discovery inter-as command enables the auto-discovery mode for inter autonomous system (inter-AS).\nThe undo auto-discovery inter-as command disables the auto-discovery mode for inter-AS.\nBy default, the A-D mode for inter-AS is disabled.",
    "CLIs": [
        "auto-discovery inter-as",
        "undo auto-discovery inter-as"
    ],
    "ParentView": [
        "VPN instance IPv4 address family MVPN view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast mvpn 4.4.4.4",
            "[*HUAWEI] ip vpn-instance 1",
            "[*HUAWEI-vpn-instance-1] route-distinguisher 4:4",
            "[*HUAWEI-vpn-instance-1] multicast routing-enable",
            "[*HUAWEI-vpn-instance-1-af-ipv4] mvpn",
            "[*HUAWEI-vpn-instance-1-af-ipv4-mvpn] auto-discovery inter-as"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn a network with multiple autonomous systems (ASs), run the auto-discovery inter-as command to enable the auto-discovery function for inter-AS.\nFor the scenario configured with inter-AS Option C, the auto-discovery inter-as command is not influenced by the peer advertise-community command.\nAfter the auto-discovery inter-as command is deployed to a PE, the local attribute of the PE does not have the no-export limit, which means the routes are established to EBGP peers. The network can be properly connected.When the auto-discovery inter-as command is not configured on a PE, then the local attribute of the PE has the no-export limit, which means the routers cannot be established to EBGP peers. The network cannot work properly.\nFor the scenario configured with inter-AS Option B, the auto-discovery inter-as command is influenced by the peer advertise-community command.\nIf the peer advertise-community command is not configured, the peer ASBRs receive routes information without the no-export attribute, so the network can be properly connected, no matter whether the auto-discovery inter-as command is configured or not.After the auto-discovery inter-as command is deployed to a PE, the local attribute of the PE does not have the no-export limit, and the routes established to peer ASBRs do not contain the no-export attribute. The ASBRs can send the received routes to other EBGP peers, so the network can be properly connected.When the auto-discovery inter-as command is not configured on a PE, then the local attribute of the PE has the no-export limit, but the routers established to peer ASBRs do not contain the no-export attribute. The ASBRs can send the received routes to other EBGP peers, so the network can work properly.If the peer advertise-community command is configured, the auto-discovery inter-as command determines whether the routes established to ASBRs contains the no-export attribute or not.After the auto-discovery inter-as command is deployed to a PE, the local attribute of the PE does not have the no-export limit, and the routes established to peer ASBRs do not contain the no-export attribute. The ASBRs can send the received routes to other EBGP peers, so the network can be properly connected.When the auto-discovery inter-as command is not configured on a PE, then the local attribute of the PE has the no-export limit, the routers established to peer ASBRs also contain the no-export attribute. The ASBRs cannot send the received routes to other EBGP peers, so the network cannot work properly.\n\nPrerequisites\nThe multicast function has been enabled in the VPN.\nPrecautions\nAfter the auto-discovery inter-as command is deployed, the intra-AD routes and SPMSI-AD routes sent to BGP do not contain the no-export attribute, so that the routes can be sent to inter-AS network to perform auto discovery."
}