{
    "PageTitle": "p2mp-template",
    "FuncDef": "The p2mp-template command specifies the tunnel template to be referenced by a Resource Reservation Protocol-Traffic Engineering (RSVP-TE) point-to-multipoint (P2MP) LSP.\nThe undo p2mp-template command deletes the configuration.\nBy default, an RSVP-TE P2MP LSP is established without referencing a tunnel template.",
    "CLIs": [
        "p2mp-template <template-name>",
        "undo p2mp-template"
    ],
    "ParentView": [
        "I-PMSI MPLS TE view"
    ],
    "ParaDef": [
        {
            "Parameters": "template-name",
            "Info": "Specifies the name of a tunnel template to be referenced by an RSVP-TE P2MP LSP.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] mpls",
            "[*HUAWEI-mpls] mpls te",
            "[*HUAWEI] quit",
            "[*HUAWEI] mpls te p2mp-template P1",
            "[*HUAWEI-te-p2mp-template-P1] quit",
            "[*HUAWEI] multicast mvpn 2.2.2.2",
            "[*HUAWEI] ip vpn-instance mcast1",
            "[*HUAWEI-vpn-instance-mcast1] ipv4-family",
            "[*HUAWEI-vpn-instance-mcast1-af-ipv4] route-distinguisher 1:1",
            "[*HUAWEI-vpn-instance-mcast1-af-ipv4] multicast routing-enable",
            "[*HUAWEI-vpn-instance-mcast1-af-ipv4] mvpn",
            "[*HUAWEI-vpn-instance-mcast1-af-ipv4-mvpn] ipmsi-tunnel",
            "[*HUAWEI-vpn-instance-mcast1-af-ipv4-mvpn-ipmsi] mpls te",
            "[*HUAWEI-vpn-instance-mcast1-af-ipv4-mvpn-ipmsi-mpls-te] p2mp-template P1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn a next-generation multicast virtual private network (NG MVPN), the MPLS module automatically establishes an RSVP-TE P2MP LSP. An automatically established RSVP-TE P2MP LSP, however, does not have a tunnel interface on which tunnel attributes can be configured. To allow automatically established RSVP-TE P2MP LSPs to have tunnel attributes, run the p2mp-template command to specify a tunnel template and configure tunnel attributes in the template. Then automatically established RSVP-TE P2MP LSPs that reference this tunnel template can have all tunnel attributes configured in the tunnel template.\nPrecautions\nIf the tunnel template specified in the p2mp-template command does not exist, the RSVP-TE P2MP LSP cannot be established. Before running the p2mp-template command, ensure that the mpls te p2mp-template command has been run."
}