{
    "PageTitle": "multicast-list ipv6",
    "FuncDef": "The multicast-list ipv6 command configures an IPv6 multicast list.\nThe undo multicast-list ipv6 command deletes the configured IPv6 multicast list.\nBy default, no IPv6 multicast list is configured.",
    "CLIs": [
        "multicast-list ipv6 <list-name> [ index <index> ] [ source-ipv6-address <ipv6-addr> [ <ipv6-prefix> ] ] group-ipv6-address <ipv6-addr> [ <group-ipv6-prefix> ] [ vpn-instance <vpn-instance-name> ]",
        "multicast-list ipv6 <list-name> index <index> [ source-ipv6-address <ipv6-addr> <ipv6-prefix> ] group-ipv6-address <ipv6-addr> <group-ipv6-prefix> [ vpn-instance <vpn-instance-name> ]",
        "undo multicast-list ipv6 <list-name>"
    ],
    "ParentView": [
        "AAA view"
    ],
    "ParaDef": [
        {
            "Parameters": "list-name",
            "Info": "Specifies the name of an IPv6 multicast list.\nThe value is a string of 1 to 32 characters."
        },
        {
            "Parameters": "index index",
            "Info": "Specifies the index of an IPv6 multicast list.\nThe value is an integer that ranges from 0 to 8191."
        },
        {
            "Parameters": "source-ipv6-address ipv6-addr",
            "Info": "Specifies an IPv6 multicast source address. It designates a multicast source for the specified multicast group.\nThe address is in hexadecimal notation."
        },
        {
            "Parameters": "ipv6-prefix",
            "Info": "Specifies the length of the prefix of the IPv6 multicast source address.\nThe value is an integer that ranges from 8 to 128."
        },
        {
            "Parameters": "group-ipv6-address ipv6-addr",
            "Info": "Specifies an IPv6 multicast group address. It designates an IPv6 multicast group.\nThe address is in hexadecimal notation, ranging from FF00::0 to FFFF:FFFF:FFFF:FFFF:FFFF:FFFF:FFFF:FFFF."
        },
        {
            "Parameters": "group-ipv6-prefix",
            "Info": "Specifies the length of the prefix of the IPv6 multicast group address.\nThe value is an integer that ranges from 8 to 128."
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies the VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] multicast-list ipv6 cctv index 2 source-ipv6-address 2001:DB8:11::1 64 group-ipv6-address ff08::1 64"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nMultiple IPv6 multicast programs can be configured using group-ipv6-prefix. If group-ipv6-prefix is not specified, the default value is 128, indicating that only one IPv6 multicast program is configured. After a user (for example, an IPTV STB user) goes online, when the user wants to watch a multicast program, the user needs to send an MLD Report message to request the multicast program.\nPrecautions\nAn IPv6 multicast program list cannot be modified or deleted after being bound to an IPv6 multicast profile."
}