{
    "PageTitle": "multicast max-list",
    "FuncDef": "The multicast max-list command sets the total maximum number of IPv4 and IPv6 multicast programs that a user is allowed to access at a time.\nThe undo multicast max-list command cancels the configured total maximum number of multicast programs that a user is allowed to access at a time.\nBy default, a user is allowed to access a maximum number of 4 multicast programs at a time.",
    "CLIs": [
        "multicast max-list <max-num>",
        "undo multicast max-list"
    ],
    "ParentView": [
        "AAA domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "max-num",
            "Info": "Specifies the maximum number of multicast programs that a user is allowed to access at a time.\nThe value is an integer that ranges from 1 to 512."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] domain isp1",
            "[~HUAWEI-aaa-domain-isp1] commit",
            "[~HUAWEI-aaa-domain-isp1] multicast max-list 5"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo set the total maximum number of IPv4 and IPv6 multicast programs that a user is allowed to access at a time, run the multicast max-list.\nPrecautions\nIf the configured number of multicast programs is greater than 64, the default host CAR values may not meet requirements. You must run the  hostcar cir command to configure a CIR and CBS for host CAR based on the configured number of multicast groups, and run the undo hostcar enable command to disable automatic bandwidth adjustment for user login. The CIR and CBS are calculated using the following formulas: CBS (unit: bytes) = MAX (maxnum x packetlen x ratio, 32000). CIR (unit: kbit/s) = MAX (maxnum x packetlen x ratio x 8 divide 1000 divide interval, 32). In the formulas, maxnum indicates the maximum number of multicast groups that a user can join in a domain. packetlen indicates the packet length, in bytes. The maximum packet length is 140 bytes. ratio indicates the adjustment coefficient, which is 7.5. interval is related to the device configuration. In IGMP scenarios, run the display igmp interface command to query the value of Value of startup query interval. In PIM scenarios, run the display pim neighbor command to query the value of Holdtime."
}