{
    "PageTitle": "multicast-list (AAA view)",
    "FuncDef": "The multicast-list command configures the multicast list.\nThe undo multicast-list command cancels the configured multicast list.\nBy default, no multicast program list is configured in the AAA view.",
    "CLIs": [
        "multicast-list <list-name> [ index <list-index> ] [ source-address <source-address> [ <source-mask-len> | <source-mask> ] ] group-address <group-address> [ <group-mask-length> | <group-mask> ] [ vpn-instance <vpn-instance-name> ]",
        "undo multicast-list <list-name>"
    ],
    "ParentView": [
        "AAA view"
    ],
    "ParaDef": [
        {
            "Parameters": "list-name",
            "Info": "Specifies the name of a multicast list.\nThe value is a string of 1 to 32 characters."
        },
        {
            "Parameters": "index list-index",
            "Info": "Specifies the index of a multicast list.\nThe value is an integer that ranges from 0 to 8191."
        },
        {
            "Parameters": "source-address source-address",
            "Info": "Specifies the multicast source address, expressed in dotted decimal notation.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "source-mask-len",
            "Info": "Specifies the length of the mask of the multicast source IP address.\nThe value is an integer that ranges from 0 to 32."
        },
        {
            "Parameters": "source-mask",
            "Info": "Specifies the mask of the multicast source IP address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "group-address group-address",
            "Info": "Specifies the multicast group IP address, expressed in dotted decimal notation.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "group-mask-length",
            "Info": "Specifies the length of the mask of the multicast group IP address.\nThe value is an integer ranging from 0 to 32."
        },
        {
            "Parameters": "group-mask",
            "Info": "Specifies the mask of the multicast group IP address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] multicast-list l20 group-address 239.0.0.2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nYou can configure multiple multicast programs with parameter group-mask or group-mask-length. If the parameter group-mask or group-mask-length is not selected, the default value of group-mask is 255.255.255.255,that is, the value of group-mask-length is 32,indicating that only one multicast program is configured.\nFor example, the address of a multicast program list is 239.1.1.4 and the value of group-mask-length is 30. The multicast program list contains four program addresses, namely, 239.1.1.4, 239.1.1.5,\n239.1.1.6, and 239.1.1.7. The four addresses can be considered as four IPTV channels or programs.\nPrecautions\nAfter a configured multicast list is deleted, it does not take effect for subsequent users that go online after the command is run, but online users are not affected.\nAn IPv4 multicast program list cannot be modified or deleted after being bound to an IPv4 multicast profile."
}