{
    "PageTitle": "group mask",
    "FuncDef": "The group mask command defines an any-source or source-specific group range, bandwidth occupied by each group, and level of bandwidth resources that a group consumes.\nThe undo group mask command deletes an any-source or source-specific group range, bandwidth occupied by each group, and level of bandwidth resources that a group consumes.\nBy default, an any-source or source-specific group range, bandwidth occupied by each group, and level of bandwidth resources that a group consumes are not defined.",
    "CLIs": [
        "group <group-address> mask { <group-mask-length> | <group-mask> } [ source <source-address> mask { <source-mask-length> | <source-mask> } ] { per-bandwidth <traffic-rate> { level-1 | level-2 } }",
        "undo group <group-address> mask { <group-mask-length> | <group-mask> } [ source <source-address> mask { <source-mask-length> | <source-mask> } ] { per-bandwidth <traffic-rate> { level-1 | level-2 } }"
    ],
    "ParentView": [
        "Channel view"
    ],
    "ParaDef": [
        {
            "Parameters": "group-address",
            "Info": "Specifies a multicast group address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "group-mask-length",
            "Info": "Specifies a mask length for a multicast group address.\nThe value is an integer ranging from 4 to 32."
        },
        {
            "Parameters": "group-mask",
            "Info": "Specifies a mask for a multicast group address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "source source-address",
            "Info": "Specifies a multicast source address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "source-mask-length",
            "Info": "Specifies a mask length for a multicast source address.\nThe value is an integer ranging from 8 to 32."
        },
        {
            "Parameters": "source-mask",
            "Info": "Specifies a mask for a multicast source address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "per-bandwidth traffic-rate",
            "Info": "Specifies the bandwidth occupied by each group.\nThe value is an integer ranging from 1 to 1048576, in kbit/s."
        },
        {
            "Parameters": "level-1",
            "Info": "Indicates that a multicast group consumes the level-1 bandwidth resources.\nBandwidth resource levels are categorized as level-1 or level-2."
        },
        {
            "Parameters": "level-2",
            "Info": "Indicates that a multicast group consumes the level-2 bandwidth resources.\nBandwidth resource levels are categorized as level-1 or level-2."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast bas-policy",
            "[~HUAWEI-multicast-bas-policy] policy policy1",
            "[~HUAWEI-multicast-bas-policy-policy1] channel SDTV",
            "[~HUAWEI-multicast-bas-policy-policy1-channel-SDTV] group 225.0.0.1 mask 32 source 10.1.1.1 mask 32 per-bandwidth 100 level-1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo define an any-source or source-specific group range, bandwidth occupied by each group, and level of bandwidth resources that a group consumes, run the group mask command.\nIf a multicast source is specified, the command configuration applies only to the groups with the specified multicast source address.If a multicast source is not specified, the command configuration applies to all multicast groups within the specified range.\n\nPrerequisites\nThe multicast bas-policy command has been run in the system view.\nThe policy command has been run in the multicast BAS policy view.\nThe channel command has been run in the multicast bandwidth limit policy view.\nPrecautions\nA multicast group cannot be specified in different multicast channel views.A multicast bandwidth limit policy does not allow you to configure (*, Group1/Mask) and (*, Group2/Mask) addresses in the same or different multicast channel views if they overlap with each other.A multicast bandwidth limit policy does not allow you to configure (Source1/Mask, Group1/Mask) and (Source2/Mask, Group2/Mask) addresses in the same or different multicast channel views if Group2/Mask overlaps with Group1/Mask and Source2/Mask overlaps with Source1/Mask.A channel allows you to specify a maximum of 16 any-source or source-specific programs.The device supports a maximum of 128K (*, G) and (S, G) multicast groups, where K equals 1024.This command is supported only on the admin VS."
}