{
    "PageTitle": "multicast binding vpn-instance",
    "FuncDef": "The multicast binding vpn-instance command binds an interface to a multicast VPN instance.\nThe undo multicast binding vpn-instance command unbinds an interface from a multicast VPN instance.\nBy default, an interface is not bound to any multicast VPN instance.",
    "CLIs": [
        "multicast binding vpn-instance <vpn-instance-name>",
        "undo multicast binding vpn-instance <vpn-instance-name>"
    ],
    "ParentView": [
        "Virtual template view",
        "40GE interface view",
        "GE interface view",
        "100GE interface view",
        "GE electrical interface view",
        "50GE interface view",
        "400GE interface view",
        "10GE interface view",
        "GE optical interface view",
        "25GE interface view",
        "Eth-Trunk interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance-name",
            "Info": "Binds an interface to a specified VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance red",
            "[*HUAWEI-vpn-instance-red] route-distinguisher 1:1",
            "[*HUAWEI-vpn-instance-red-ipv4] quit",
            "[*HUAWEI-vpn-instance-red] quit",
            "[*HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] multicast binding vpn-instance red"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nUser-side multicast for a VPN enables a device to identify users of multicast programs in the VPN, thus allowing for refined management of the users. Before configuring user-side multicast for a VPN, run the multicast binding vpn-instance command to bind an interface to the multicast VPN instance. A BAS interface can be bound to multiple multicast VPN instances, and the binding configurations apply to all sub-interfaces of the BAS interface. In this manner, when users send Join messages, the device can identify the VPN information of the users on each sub-interface and forward the messages to the corresponding VPNs. If a user does not belong to any VPN instance configured on the BAS interface, the device drops the multicast messages sent by this user.\nPrerequisites\nThe VPN instance specified in the command has been configured, and multicast routing has been enabled using the multicast routing-enable command for the VPN instance.\nPrecautions\nThe multicast binding vpn-instance command can be run for main interfaces, but not for sub-interfaces.\nA main interface can be bound to multiple multicast VPN instances.\nIn VS mode, this command is supported only by the admin VS."
}