{
    "PageTitle": "multicast ipv6 binding vpn-instance",
    "FuncDef": "The multicast ipv6 binding vpn-instance command binds an interface to an IPv6 multicast VPN instance.\nThe undo multicast ipv6 binding vpn-instance command unbinds an interface from an IPv6 multicast VPN instance.\nBy default, an interface is not bound to any IPv6 multicast VPN instance.",
    "CLIs": [
        "multicast ipv6 binding vpn-instance <vpn-instance-name>",
        "undo multicast ipv6 binding vpn-instance <vpn-instance-name>"
    ],
    "ParentView": [
        "Virtual template view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance-name",
            "Info": "Binds an interface to a specified VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast ipv6 routing-enable",
            "[*HUAWEI] ip vpn-instance v6vpn",
            "[*HUAWEI-vpn-instance-v6vpn] ipv6-family",
            "[*HUAWEI-vpn-instance-v6vpn-af-ipv6] route-distinguisher 1:1",
            "[*HUAWEI-vpn-instance-v6vpn-af-ipv6] quit",
            "[*HUAWEI-vpn-instance-v6vpn] commit",
            "[~HUAWEI-vpn-instance-v6vpn] quit",
            "[~HUAWEI] interface Virtual-Template 1",
            "[*HUAWEI-Virtual-Template1] multicast ipv6 binding vpn-instance v6vpn"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nUser-side multicast for a VPN enables a device to identify users of multicast programs in the VPN, thus allowing for refined management of the users. Before configuring user-side multicast for a VPN, run the multicast ipv6 binding vpn-instance command to bind an interface to the multicast VPN instance. In this manner, when users send Join messages, the device can identify the VPN information of the users on each sub-interface and forward the messages to the corresponding VPNs.\nPrerequisites\nThe VPN instance specified in the command has been configured, and multicast routing has been enabled using the multicast ipv6 routing-enable command for the VPN instance.\nPrecautions\nAn interface can be bound to multiple multicast VPN instances.\nIn VS mode, this command is supported only by the admin VS."
}