{
    "PageTitle": "multicast authorization-enable",
    "FuncDef": "The multicast authorization-enable command enables controllable multicast on an interface.\nThe undo multicast authorization-enable command disables controllable multicast on an interface.\n\nBy default, controllable multicast is disabled on an interface.",
    "CLIs": [
        "multicast authorization-enable",
        "undo multicast authorization-enable"
    ],
    "ParentView": [
        "Virtual template view",
        "PW-VE sub-interface view",
        "40GE interface view",
        "GE electrical interface view",
        "Port extension interface view",
        "Eth-Trunk sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "50GE sub-interface view",
        "GE sub-interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "GE interface view",
        "100GE interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "25GE interface view",
        "100ge sub-interface view",
        "40GE sub-interface view",
        "Eth-Trunk interface view",
        "10GE sub-interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[~HUAWEI-GigabitEthernet1/0/0] multicast authorization-enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\n\nTo control the access permissions of multicast programs that users can order on an interface, run the multicast authorization-enable command to enable the controllable multicast function on the interface first. This function enables the device to implement authentication control over multicast programs that users order on this interface. The control is based on a specified multicast policy.\n\nIf an ordered multicast program is permitted by the multicast policy, the user is allowed to order the program.\nIf an ordered multicast program is denied by the multicast policy, the user is not allowed to order the program.\n\n\nPrecautions\n\nThe command configuration does not take effect for multicast programs that users have ordered before the command is run, but takes effect only for new multicast programs.\n\nIn VS mode, this command is supported only by the admin VS."
}