{
    "PageTitle": "multicast copy by-vlan",
    "FuncDef": "The multicast copy by-vlan command enables multicast replication by interface + VLAN on a BAS interface.\nThe undo multicast copy by-vlan command restores the default configuration.\nBy default, multicast replication by interface + VLAN is disabled, and multicast replication by interface is used.",
    "CLIs": [
        "multicast copy by-vlan",
        "undo multicast copy by-vlan"
    ],
    "ParentView": [
        "10GE interface view",
        "BAS interface view",
        "Eth-Trunk interface view",
        "GE optical interface view",
        "GE electrical interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet 1/0/0.1",
            "[*HUAWEI-GigabitEthernet1/0/0.1] bas",
            "[*HUAWEI-GigabitEthernet1/0/0.1] access-type layer2-subscriber",
            "[*HUAWEI-GigabitEthernet1/0/0.1-bas] multicast copy by-vlan"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn a scenario where multiple users order a multicast program through the same interface and VLAN and MLD snooping is enabled on the downstream Layer 2 device, after multicast replication by interface + VLAN is configured, the BRAS replicates only one copy of a multicast traffic flow for the downstream Layer 2 device. Then, the downstream Layer 2 device replicates multicast data packets based on needs. To enable multicast replication by interface + VLAN, run the multicast copy by-vlan command. This replication mode reduces the burden on the BRAS and the bandwidth consumption. This mode applies to scenarios where user packets carry VLAN tags and inter-VLAN traffic forwarding is not needed.\nPrerequisites\nIGMP or MLD has been enabled using the igmp enable or mld enable command for the BAS interface. Otherwise, multicast replication by interface + VLAN does not take effect.\nConfiguration Impact\nIf you run the multicast copy by-vlan or its undo from on an interface, the users who have gone online from the interface automatically leave multicast groups. As a result, the users' services are interrupted. The users can join multicast groups only after they re-order programs.\nPrecautions\nBAS interfaces support the following types of multicast replication modes, with their priorities being in descending order:\nMulticast replication by interface + VLAN: To enable this mode, run the multicast copy by-vlan command in the BAS interface view.Multicast replication by session: To configure this mode, run the multicast copy by-session command in the BAS interface view.Multicast replication by multicast VLAN: To configure this mode, run the multicast user-aggregation command in the GE interface view, Eth-Trunk interface view, or Eth-Trunk sub-interface view.Multicast replication by interface: This is the default mode and does not need to be configured.\nIn VS mode, this command is supported only by the admin VS."
}