{
    "PageTitle": "multicast bas-policy out enable interface gigabitethernet",
    "FuncDef": "The multicast bas-policy out enable interface gigabitethernet command enables user-side multicast CAC on a specific interface board.\nThe undo multicast bas-policy out enable interface gigabitethernet command disables user-side multicast CAC on a specific interface board.\nBy default, user-side multicast CAC is disabled on an interface board.",
    "CLIs": [
        "multicast bas-policy out enable interface gigabitethernet",
        "undo multicast bas-policy out enable interface gigabitethernet"
    ],
    "ParentView": [
        "Slot view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] slot 1",
            "[*HUAWEI-slot-1] multicast bas-policy out enable interface GigabitEthernet",
            "[*HUAWEI-slot-1] quit",
            "[*HUAWEI] multicast bas-policy",
            "[*HUAWEI-multicast-bas-policy] policy policy1",
            "[*HUAWEI-multicast-bas-policy-policy1] quit",
            "[*HUAWEI-multicast-bas-policy] quit",
            "[*HUAWEI] interface GigabitEthernet 2/0/0",
            "[*HUAWEI-GigabitEthernet2/0/0] multicast bas-policy policy1 out bandwidth 10000 level-1 8000",
            "[*HUAWEI-GigabitEthernet2/0/0] quit",
            "[*HUAWEI] aaa",
            "[*HUAWEI-aaa] domain huawei",
            "[*HUAWEI-aaa] commit",
            "[*HUAWEI-domain-huawei] multicast bas-policy policy1 out bandwidth 10000 level-1 8000 interface GigabitEthernet"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter user-side multicast CAC is configured in the system view, run the multicast bas-policy out enable command to enable user-side multicast CAC on the target interface board.\nPrecautions\nThis command must be used together with the multicast bas-policy out bandwidth level-1 interface GigabitEthernet command in the AAA domain view or the multicast bas-policy out bandwidth level-1 command in the physical interface view.\nThe multicast bas-policy out enable command can be run either before or after the preceding command in the AAA domain or physical interface view.\nThe multicast bas-policy out enable command configuration is effective only for GE interfaces on the interface board.\nThis command is supported only on the admin VS."
}