{
    "PageTitle": "policy",
    "FuncDef": "The policy command creates a multicast bandwidth limit policy and displays the policy view.\nThe undo policy command deletes a specified multicast bandwidth limit policy.\nBy default, no multicast bandwidth limit policy is configured.",
    "CLIs": [
        "policy <policy-name>",
        "undo policy <policy-name>"
    ],
    "ParentView": [
        "Multicast BAS view"
    ],
    "ParaDef": [
        {
            "Parameters": "policy-name",
            "Info": "Sets a name for a multicast bandwidth limit policy.\nThe value is a string of 1 to 15 case-sensitive characters. Digits, letters, and underscores (_) are supported, but spaces are not."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast bas-policy",
            "[~HUAWEI-multicast-bas-policy] policy policy1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo create a multicast bandwidth limit policy and display the policy view, run the policy command. In the policy view, you can specify the channel for which user-side multicast CAC is to be implemented.\nAfter a multicast bandwidth limit policy name is specified for a BAS physical main interface or an AAA domain, the device checks the remaining bandwidth allowed by this policy when a user joins a multicast program through the specified interface or domain. If the remaining bandwidth is insufficient, the device denies the user request.\nPrerequisites\nThe multicast bas-policy command has been run in the system view.\nConfiguration Impact\nRunning the undo policy command will delete information about the channel and group configured for the policy.\nFollow-up Procedure\nA multicast bandwidth limit policy takes effect only after the multicast bas-policy out bandwidth level-1 command is run in the physical main interface view or the multicast bas-policy out bandwidth level-1 interface GigabitEthernet command is run in the AAA domain view to bind the policy and enable the multicast bandwidth limit function on the user login board.\nPrecautions\nA device allows you to configure a maximum of 1024 multicast bandwidth limit policies.\nThe undo policy command fails to be run if the multicast bandwidth limit policy is being used by any interface or AAA domain."
}