{
    "PageTitle": "aaa-said check-rule reduce-ratio",
    "FuncDef": "The aaa-said check-rule flow-speed reduce-ratio command sets a traffic reduction rate threshold over which fault diagnosis and self-healing are triggered on SAID nodes.\nThe undo aaa-said check-rule flow-speed reduce-ratio command restores the default setting.\nThe aaa-said check-rule user-number reduce-ratio command sets a user reduction rate threshold over which fault diagnosis and self-healing are triggered on SAID nodes.\nThe undo aaa-said check-rule user-number reduce-ratio command restores the default setting.\nBy default, the traffic reduction rate threshold is 50% and the user reduction rate threshold is 50%.",
    "CLIs": [
        "aaa-said check-rule flow-speed reduce-ratio <reduce-ratio>",
        "aaa-said check-rule user-number reduce-ratio <reduce-ratio>",
        "undo aaa-said check-rule user-number reduce-ratio",
        "undo aaa-said check-rule flow-speed reduce-ratio"
    ],
    "ParentView": [
        "AAA view"
    ],
    "ParaDef": [
        {
            "Parameters": "reduce-ratio reduce-ratio",
            "Info": "Specifies a user or traffic reduction rate threshold over which fault diagnosis and self-healing are triggered on SAID nodes.\nThe value is an integer ranging from 0 to 100, in percentage. The default value is 50."
        },
        {
            "Parameters": "user-number",
            "Info": "Indicates the number of users.\n-"
        },
        {
            "Parameters": "flow-speed",
            "Info": "Indicates a traffic rate.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] aaa-said check-rule flow-speed reduce-ratio 80"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] undo aaa-said check-rule user-number reduce-ratio"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe SAID is used to identify typical faults and automatically diagnose and rectify the faults. The BRAS collects SAID information based on traffic scenarios and records traffic information and information about the number of users in specified periods.The SAID compares the traffic rate or the number of users in the current period with that in the previous period and determines whether faults are present based on the traffic or the user reduction rate of the neighboring periods. By default, the SAID considers that faults have occurred when the traffic rate or the number of users decreases by more than 50% in the current period. Self-healing is then performed if self-healing conditions are met.To set a traffic reduction rate threshold based on the actual situation, run the aaa-said check-rule flow-speed reduce-ratio command.To set a user reduction rate threshold based on the actual situation, run the aaa-said check-rule user-number reduce-ratio command.\nPrecautions\nThe aaa-said check-rule flow-speed reduce-ratio command takes effect for only access-side users. The SAID determines whether a fault arises based on the traffic reduction rate of neighboring periods. A fault is diagnosed when the traffic reduction rate exceeds the specified threshold. The subcard is then reset if self-healing conditions are met.\nThe aaa-said check-rule user-number reduce-ratio command takes effect for only access-side users. The SAID determines whether a fault arises based on the user reduction rate of neighboring periods. A fault is diagnosed if the user reduction rate exceeds the specified threshold. The subcard is then reset if self-healing conditions are met."
}