{
    "PageTitle": "aaa-said check-rule online-fail-reason exclude",
    "FuncDef": "The aaa-said check-rule online-fail-reason exclude command excludes login failures with a specified cause code from being detected or diagnosed by SAID AAA nodes.\nThe undo aaa-said check-rule online-fail-reason exclude command restores the default configuration.\nBy default, a login failure is not excluded from the detection or diagnosis of SAID AAA nodes.",
    "CLIs": [
        "aaa-said check-rule online-fail-reason exclude fail-code <fail-code>",
        "undo aaa-said check-rule online-fail-reason exclude fail-code <fail-code>"
    ],
    "ParentView": [
        "AAA view"
    ],
    "ParaDef": [
        {
            "Parameters": "fail-code fail-code",
            "Info": "Specifies a cause code of login failures.Two types of login failure cause codes are available:\nFor login failure cause codes that can be viewed using the display aaa online-fail-record command, the value is an integer ranging from 1 to 741.For internal login failure cause codes invisible to users, the value ranges from #0 to #62.\nFor login failure cause codes visible to users, the value is an integer ranging from 1 to 741.For internal login failure cause codes invisible to users, the value ranges from #0 to #62."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] aaa-said check-rule online-fail-reason exclude fail-code 10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn user access scenarios, SAID nodes can detect and diagnose user login failures.\nHowever, if you do not want SAID nodes to consider login failures with a specified cause code as faults, run the aaa-said check-rule online-fail-reason exclude command to exclude the login failures with the specified cause code, so that SAID nodes do not detect or diagnose the login failures with the specified cause code. If the aaa-said check-rule online-fail-reason exclude command is run more than once, the later configurations will not override the previous ones and all configurations take effect.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}