{
    "PageTitle": "aaa-said diag-rule",
    "FuncDef": "The aaa-said diag-rule online-fail-num command sets the user login failure increment within 10 minutes, number of online users reduced, and login success ratio reduced that can trigger fault diagnosis on SAID AAA nodes.\nThe undo aaa-said diag-rule command restores the default settings.\nBy default, the fault diagnosis on SAID nodes is triggered when the login failure increment exceeds 10000 within 10 minutes, the number of online users is reduced by 1000, and the login success ratio is reduced by 30%.",
    "CLIs": [
        "aaa-said diag-rule online-fail-num increase <increase-num> user-num reduce user-num online-success-ratio below <succ-rate>",
        "undo aaa-said diag-rule [ online-fail-num increase <increase-num> user-num reduce user-num online-success-ratio below <succ-rate> ]"
    ],
    "ParentView": [
        "AAA view"
    ],
    "ParaDef": [
        {
            "Parameters": "user-num",
            "Info": "Online-user number.\n-"
        },
        {
            "Parameters": "reduce user-num",
            "Info": "Specifies the number of online users reduced.\nThe value is an integer ranging from 1 to 256000. The default value is 1000."
        },
        {
            "Parameters": "online-success-ratio",
            "Info": "Rate of online success.\n-"
        },
        {
            "Parameters": "below succ-rate",
            "Info": "Specifies the login success ratio reduced, in percentage.\nThe value is an integer ranging from 1 to 100. The default value is 30."
        },
        {
            "Parameters": "increase increase-num",
            "Info": "Specifies the login failure increment.\nThe value is an integer ranging from 1 to 256000. The default value is 10000."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] aaa-said diag-rule online-fail-num increase 120 user-num reduce 200 online-success-ratio below 10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn user access scenarios, SAID nodes can detect and diagnose user login failures.\nA SAID node in the diagnosing state compares the login failure quantity, online user quantity, and login success ratio in the current period with those in the previous period, same period in the previous day, and same periods in the previous two days. The SAID node determines whether user access is normal based on the comparison result. By default, the SAID node considers that faults have occurred and enters the recovering state when the login failure increment exceeds 10000, the number of online users is reduced by 1000, and the login success ratio is reduced by 30%.\nIf those default values do not meet actual needs, run the aaa-said diag-rule online-fail-num command to adjust those parameter values.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}