{
    "PageTitle": "aaa-said recover interval",
    "FuncDef": "The aaa-said recover interval command sets an interval between two same SAID recovery operations.\nThe undo aaa-said recover interval command deletes an interval.\nBy default, the SAID fault recovery function is disabled.",
    "CLIs": [
        "aaa-said recover interval <interval-time>",
        "undo aaa-said recover interval"
    ],
    "ParentView": [
        "AAA view"
    ],
    "ParaDef": [
        {
            "Parameters": "interval interval-time",
            "Info": "Specifies an interval between two same SAID recovery operations.\nThe value is an integer ranging from 1 to 180, in days."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] aaa-said recover interval 1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] undo aaa-said recover interval"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe SAID is used to identify typical faults and automatically diagnose and rectify the faults. The SAID fault recovery operations are added in typical BRAS scenarios. After faults are diagnosed, the SAID determines whether to perform self-healing and controls the impact of the recovery operations. To control the frequency for performing recovery operations, run the aaa-said recover interval command to set an interval so that the same recovery operation can be performed only once during the specified interval.\nConfiguration Impact\nAfter faults are diagnosed, the SAID determines whether the conditions are met for performing fault recovery operations, which include master/backup switchovers and restart of boards. Before performing a recovery operation, the SAID checks whether the operation has been performed during the specified interval. If the operation has been performed, the SAID will not perform the operation again during the specified interval. If the operation has not been performed, the SAID will perform the recovery operation. The SAID recovery function is disabled by default, indicating that no recovery operation will be performed.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nThe aaa-said recover interval command takes effect for only access-side users."
}