{
    "PageTitle": "access backup-check detect-interval",
    "FuncDef": "The access backup-check detect-interval command configures the backup detection interval and number of detections on an interface.\nThe undo access backup-check detect-interval command cancels the configuration.\nBy default, the backup detection interval is 8 hours, total number of detections is 21, and number of detection failures is 14 on an interface.",
    "CLIs": [
        "access backup-check detect-interval <detect-interval> detect-count <detect-count> fail-count <fail-count>",
        "undo access backup-check detect-interval <detect-interval> detect-count <detect-count> fail-count <fail-count>"
    ],
    "ParentView": [
        "AAA view"
    ],
    "ParaDef": [
        {
            "Parameters": "detect-interval detect-interval",
            "Info": "Specifies a backup detection interval.\nThe value is an integer ranging from 0 to 24, in hours. The default value is 8h."
        },
        {
            "Parameters": "detect-count detect-count",
            "Info": "Specifies the total number of detections.\nThe value is an integer ranging from 1 to 255. The default value is 21."
        },
        {
            "Parameters": "fail-count fail-count",
            "Info": "Specifies the number of detection failures on an interface. In other words, the number of times that the system detects that no backup protection is configured on an interface.\nThe value is an integer ranging from 1 to 255. The default value is 14."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] access backup-check detect-interval 8 detect-count 20 fail-count 15"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe system detects the number of users on interfaces at the interval specified by detect-interval. If no backup protection is configured on a physical interface (sub-interfaces included), an intra-board Eth-Trunk interface (sub-interfaces included), or an interface with access response delay based on odd and even MAC addresses configured but load imbalance occurs (for example, access response delay based on odd and even MAC addresses fails to take effect due to an interface fault), a large number of users may fail to go online in case of a board fault. To configure the backup detection interval and number of detections on an interface, run the access backup-check detect-interval command. Then, an alarm is generated when the number of detection failures exceeds that specified by fail-count after the total number of backup detections performed reaches that specified by detect-count.\nPrecautions\nThis command is supported only on the admin VS.\nThe value of fail-count must be less than or equal to that of detect-count. Otherwise, the configuration fails."
}