{
    "PageTitle": "access user-statistic complete-kpi enable",
    "FuncDef": "The access user-statistic complete-kpi enable command enables the function to report the number of login successes, the number of login failures, and the login success rate as KPIs by domain, outer VLAN ID, or sub-interface.\nThe undo access user-statistic complete-kpi enable command disables the function to report the number of login successes, the number of login failures, and the login success rate as KPIs by domain, outer VLAN ID, or sub-interface.\nBy default, the function to report the number of login successes, the number of login failures, and the login success rate as KPIs by domain, outer VLAN ID, or sub-interface is not enabled.",
    "CLIs": [
        "access user-statistic complete-kpi enable",
        "undo access user-statistic complete-kpi enable"
    ],
    "ParentView": [
        "AAA view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] access user-statistic complete-kpi enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo record the number of login successes, the number of login failures, and the login success rate in real time in the KPI system, run the access user-statistic complete-kpi enable command in the AAA view to enable the function to report the number of login successes, the number of login failures, and the login success rate as KPIs by domain, outer VLAN ID, or sub-interface. This function effectively enhances network maintainability and reduces maintenance costs. The KPIs are reported every 15 minutes. In each period, only the user access statistics within this period are reported.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nIf the reporting is based on sub-interfaces, only the information of PPPoE users is reported.\nIf the reporting is based on domains or outer VLAN IDs, information of all types of users is reported."
}