{
    "PageTitle": "access enable python extend script-package",
    "FuncDef": "The access enable python extend script-package command enables the python script extension function.\nThe undo access enable python extend script-package command disables this function.\nBy default, the python script extension function is disabled.",
    "CLIs": [
        "access enable python extend script-package <script-package-name>",
        "undo access enable python extend script-package <script-package-name>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "script-package-name",
            "Info": "Specifies the name of a python script package. The name suffix must be .zip.\nThe value is a string of 1 to 64 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] access enable python extend script-package NE40E_V800R010C10SPC200_pythonpackage_V1.0.zip"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen a Huawei device interoperates with RADIUS servers of different vendors, the usage scenarios of supported RADIUS attributes may be different. Therefore, you need to run commands to meet the requirements of different vendors. To allow the device to flexibly interoperate with RADIUS servers by calling python scripts, run the access enable python extend script-package command to enable the python script extension function.\nPrerequisites\nThe python script package has been uploaded to the cfcard: directory on the device.\nPrecautions\nIf a script package (for example, a.zip) has been loaded successfully, the device traverses each script file in the current script package when a new script package (for example, b.zip) is loaded. If a script file (for example, aa.py) in a.zip is bound to a python policy but b.zip does not contain this script file, the new script package fails to be loaded.When the undo form of the command is run to uninstall a script package, the device checks whether any script files in the package are bound to python policies. If one or more script files are bound to python policies, the device does not allow for the uninstallation.When the python script extension function is enabled on a device of which the main control board does not support this function, the function fails to be enabled.Before a version upgrade, block the domain to which a script package is applied. Unblock the domain after the upgrade is complete, the target script package is loaded, and the python script extension function is configured. Users are then allowed to log in. If the domain is not blocked and then unblocked in a version upgrade, services will be affected."
}