{
    "PageTitle": "access-trigger loose infinite-lease(AAA domain view)",
    "FuncDef": "The access-trigger loose infinite-lease command enables users with an infinite lease in the authentication domain bound to the BAS interface to go online by sending IP/ARP packets when no abnormal logout backup entry is generated.\nThe undo access-trigger loose command disables users with an infinite lease in the authentication domain bound to the BAS interface from going online by sending IP/ARP packets when no abnormal logout backup entry is generated.\nBy default, users with an infinite lease in the authentication domain bound to the BAS interface cannot go online by sending IP/ARP packets when no abnormal logout backup entry is generated.",
    "CLIs": [
        "access-trigger loose infinite-lease",
        "undo access-trigger loose [ infinite-lease ]"
    ],
    "ParentView": [
        "AAA domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "loose",
            "Info": "Indicates the loose mode for getting online after the system restarts.\n-"
        },
        {
            "Parameters": "infinite-lease",
            "Info": "Indicates an infinite lease.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] domain domain1",
            "[*HUAWEI-aaa-domain-domain1] commit",
            "[~HUAWEI-aaa-domain-domain1] access-trigger loose infinite-lease"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo enable users with an infinite lease in the authentication domain bound to the BAS interface to go online by sending IP/ARP packets when no abnormal logout backup entry is generated, run the access-trigger loose infinite-lease command.\nPrerequisites\nUser access triggered by IP/ARP packets has been enabled on the BAS interface.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nYou need to check whether user access in loose mode is enabled for users with an infinite lease in the authentication domain (pre-authentication domain for web and fast authentication users, and default authentication domain if no authentication domain is configured) bound the BAS interface through which users are triggered to go online by sending IP/ARP packets."
}