{
    "PageTitle": "access backup-check interface-type",
    "FuncDef": "The access backup-check interface-type command configures minor and major alarm thresholds for the number of users on an interface with no backup protection configured during backup detections.\nThe undo access backup-check interface-type command cancels the configuration.\nBy default, the minor and major alarm thresholds for the number of users on an interface with no backup detection configured are 1000 and 10000, respectively.",
    "CLIs": [
        "access backup-check interface-type <interface-type> minor-trap-usernum <minor-trap-usernum> major-trap-usernum <major-trap-usernum>",
        "undo access backup-check interface-type <interface-type> minor-trap-usernum <minor-trap-usernum> major-trap-usernum <major-trap-usernum>"
    ],
    "ParentView": [
        "AAA view"
    ],
    "ParaDef": [
        {
            "Parameters": "interface-type interface-type",
            "Info": "Specifies the type of an interface.\nThe value can be:\n50GE50|100GEGigabitEthernetGigabitEthernet100GEGigabitEthernet10GEXGigabitetherneteth-trunk"
        },
        {
            "Parameters": "minor-trap-usernum minor-trap-usernum",
            "Info": "Specifies a minor alarm threshold for the number of users on an interface with no backup protection configured.\nThe value is an integer ranging from 1 to 65535. The default value is 1000."
        },
        {
            "Parameters": "major-trap-usernum major-trap-usernum",
            "Info": "Specifies a major alarm threshold for the number of users on an interface with no backup protection configured.\nThe value is an integer ranging from 1 to 65535. The default value is 10000."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] access backup-check interface-type eth-trunk minor-trap-usernum 1500 major-trap-usernum 20000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe system detects the number of users on interfaces at configured intervals. If no backup protection is configured on a physical interface (sub-interfaces included), an intra-board Eth-Trunk interface (sub-interfaces included), or an interface with access response delay based on odd and even MAC addresses configured but load imbalance occurs (for example, access response delay based on odd and even MAC addresses fails to take effect due to an interface fault), a large number of users may fail to go online in case of a board fault. To configure minor and major alarm thresholds for the number of users on an interface with no backup protection configured, run the access backup-check interface-type command. Then, a minor or major alarm is generated when the number of users on an interface reaches the configured minor or major alarm threshold.\nPrecautions\nThis command is supported only on the admin VS.\nThe value of minor-trap-usernum must be less than or equal to that of major-trap-usernum. Otherwise, the configuration fails."
}