{
    "PageTitle": "access-speed adjustment system-state floor-level",
    "FuncDef": "The access-speed adjustment system-state floor-level threshold command sets a minimum adjustable threshold for CP-CAR and intervals for decreasing the CP-CAR value from the minimum adjustable threshold to extremely low threshold and for restoring the value to the minimum adjustable threshold.\nThe undo access-speed adjustment system-state floor-level threshold command cancels the configuration.\nBy default, the minimum adjustable threshold for CP-CAR is 10%, the interval for decreasing the CP-CAR value from the minimum adjustable threshold to extremely low threshold is 10s, and the interval for restoring the value to the minimum adjustable threshold is 60s.",
    "CLIs": [
        "access-speed adjustment system-state floor-level threshold <threshold-value> interval <interval-value> resume-interval <resume-interval-value>",
        "undo access-speed adjustment system-state floor-level [ threshold <threshold-value> interval <interval-value> resume-interval <resume-interval-value> ]"
    ],
    "ParentView": [
        "AAA view"
    ],
    "ParaDef": [
        {
            "Parameters": "interval interval-value",
            "Info": "Specifies an interval for decreasing the CP-CAR value from the minimum adjustable threshold to extremely low threshold.\nThe value is an integer ranging from 10 to 600, in seconds. The default value is 10s."
        },
        {
            "Parameters": "resume-interval resume-interval-value",
            "Info": "Specifies an interval for restoring the CP-CAR value from the extreme threshold to minimum adjustable threshold.\nThe value is an integer ranging from 60 to 1800, in seconds. The default value is 60s."
        },
        {
            "Parameters": "threshold threshold-value",
            "Info": "Specifies a minimum adjustable threshold.\nThe value is an integer ranging from 2 to 20, in percentage. The default value is 10%."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] access-speed  adjustment system-state floor-level threshold  10 interval 60 resume-interval 300"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo ensure system health, when the CP-CAR value (rate limit for sending packets to the CPU) is set to the minimum adjustable threshold specified by and remains unchanged for the period specified by , the system forcibly sets the CP-CAR value to the extremely low threshold (1%). If the CP-CAR value remains unchanged for the period specified by , the system then forcibly restores the CP-CAR value to the minimum adjustable threshold. To set a minimum adjustable threshold for CP-CAR and intervals for decreasing the CP-CAR value from the minimum adjustable threshold to extremely low threshold and for restoring the value to the minimum adjustable threshold, run the access-speed adjustment system-state floor-level threshold command.\nPrecautions\nThis command is supported only on the admin VS."
}