{
    "PageTitle": "access-speed cu adjustment system-state time",
    "FuncDef": "The access-speed cu adjustment system-state time command configures an interval at which the control channel status is detected for adjusting the user access rate and the minimum number of detection intervals after which the user access rate is increased.\nThe undo access-speed cu adjustment system-state time command restores the default configuration.\nBy default, the interval at which the control channel status is detected for adjusting the user access rate is 1s, and the minimum number of detection intervals after which the user rate is increased is 2. (The minimum time after which the user rate is increased is 1s x 2 = 2s.)",
    "CLIs": [
        "access-speed cu adjustment system-state time interval <adjust-interval> delay-count <adjust-delay-count>",
        "undo access-speed cu adjustment system-state time"
    ],
    "ParentView": [
        "AAA view"
    ],
    "ParaDef": [
        {
            "Parameters": "delay-count adjust-delay-count",
            "Info": "Specifies the minimum number of detection intervals after which the user access rate is increased. The minimum time after which the user access rate is increased equals <adjust-interval> multiplied by <adjust-delay-count>.\nThe value is an integer ranging from 1 to 300. The default value is 2."
        },
        {
            "Parameters": "interval adjust-interval",
            "Info": "Specifies the interval at which the control channel status is detected for adjusting the user access rate.\nThe value is an integer that ranges from 1 to 60, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] access-speed cu adjustment system-state time interval 1 delay-count 2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the control channel is overloaded, for example, the CUSP queue depth usage is high, the user access rate is reduced. If the control channel is light-loaded and the conditions for increasing the user access rate are met, the user access rate is increased. To configure an interval at which the control channel status is detected for adjusting the user access rate and the minimum number of detection intervals after which the user access rate is increased, run the access-speed cu adjustment system-state time command.\nPrerequisites\nThe CUSP has been configured on the CP. For details, see Configuring a CUSP controller (CP).\nConfiguration Impact\nAfter the access-speed cu adjustment system-state time command is run, the device detects the control channel status at an interval specified by adjust-interval. If the CUSP queue depth usage is high, the device immediately decreases the user access rate. If the CUSP queue depth usage has been normal within the consecutive detection intervals specified by adjust-delay-count since the user access rate was adjusted last time, the device increases the user access rate."
}