{
    "PageTitle": "access-trigger(AAA domain view)",
    "FuncDef": "The access-trigger command changes the period during which users can get online in loose mode after the system restarts.\nThe undo access-trigger command restores the default period during which users can get online in loose mode after the system restarts.\nBy default, users can get online in loose mode within 0 minute after the system restarts.",
    "CLIs": [
        "access-trigger loose { <loose-time> | all-time }",
        "undo access-trigger loose [ <loose-time> | all-time ]"
    ],
    "ParentView": [
        "AAA domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "loose-time",
            "Info": "Period during which users can get online in loose mode after the system restarts.\nThe value is an integer ranging from 0 to 1440, in minutes. The default value is 0. 0 indicates that users cannot get online in loose mode after the system restarts."
        },
        {
            "Parameters": "all-time",
            "Info": "Always loose mode for getting online after the system restarts.\n-"
        },
        {
            "Parameters": "loose",
            "Info": "Loose mode for getting online after the system restarts.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] domain huawei",
            "[~HUAWEI-aaa-domain-huawei] access-trigger loose all-time"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf getting online in loose mode is not enabled, after the device restarts due to an exception, users can get online again only after lease renewal fails (after the lease expires) or users' terminals restart.\nPrerequisites\nGetting online triggered by IP/ARP packets has been enabled on a BAS interface.\nConfiguration Impact\nAfter this command is executed, the filtering function of the user information backup table does not take effect, and IP/ARP packets sent by users will trigger getting online requests. As a result, the device needs to process a large number of getting online request packets, which uses a lot of resources and affects common users' access.\nAfter the device restarts, a large number of getting online request packets will increase the pressure on the DHCP server and RADIUS server.\nPrecautions\nYou need to check whether user access in loose mode is enabled for users in the authentication domain (pre-authentication domain for web and fast authentication users, and default authentication domain if no authentication domain is configured) bound to the BAS interface through which users are triggered to go online by sending IP/ARP packets."
}