{
    "PageTitle": "access-user exhaust warning enable",
    "FuncDef": "The access-user exhaust warning enable command enables the system to generate an alarm when the user resource or CPU usage reaches an alarm threshold and to generate a clear alarm when the user resource or CPU usage falls below a clear alarm threshold.\nThe undo access-user exhaust warning enable command restores the default configuration and triggers the generation of a clear alarm.\nBy default, the system does not generate an alarm when the user resource or CPU usage reaches an alarm threshold or generate a clear alarm when the user resource or CPU usage falls below a clear alarm threshold.",
    "CLIs": [
        "access-user exhaust warning enable",
        "undo access-user exhaust warning enable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] access-user exhaust warning enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a large number of online users exist, system resources may become insufficient and the CPU usage may go high, causing device failures.\nBy default, the alarm and clear alarm thresholds are respectively 85% and 75% for the user resource and CPU usage. The alarm and clear alarm thresholds for the user resource or CPU usage can be configured using the access-user exhaust threshold-alarm command.\nConfigure the system to generate an alarm when the user resource or CPU usage exceeds the alarm threshold, so that device maintenance engineers can take measures to prevent device failures.Configure the system to generate a clear alarm when the user resource usage and the CPU usage both fall below the clear alarm threshold, so that the device maintenance engineers are informed of the clearance of the alarm.\n\nConfiguration Impact\nAfter the access-user exhaust warning enable command is run, an alarm is generated when the user resource usage on a board/device or the CPU usage on an interface board/the main control board reaches the configured alarm threshold. A clear alarm is generated when the user resource usage and the CPU usage both fall below the configured clear alarm threshold.\nFollow-up Procedure\nRun the access-user exhaust threshold-alarm command to configure the alarm and clear alarm thresholds for the user resource or CPU usage on the main control board or interface boards. If no alarm or clear alarm threshold is configured, the default alarm and clear alarm thresholds are used.\nPrecautions\nIf an alarm is generated and persists, the alarm will not be repeatedly generated in 30 minutes.\nIn VS mode, this command is supported only by the admin VS."
}