{
    "PageTitle": "access-speed",
    "FuncDef": "The access-speed command sets the access rate limitation on the device.\nThe undo access-speed command cancels the access rate limitation.\n\nBy default, users access the device at a lower rate between that limited by the CPU usage and that limited by the memory usage. The limitations on the user access rate can be as follows:\n\n\nCPU usage < 85%: subject to the device specification; 85% <= CPU usage < 100%: 100 per second; CPU usage = 100%: 20 per second.\n\nMemory usage < 65%: subject to the device specification; 65% <= CPU usage < 75%: 200 per second; 75% <= Memory usage < 85%: 100 per second; Memory usage >= 85%: 20 per second.",
    "CLIs": [
        "access-speed <access-number> <access-period> [ forced | adjustment system-state level <level> ]",
        "undo access-speed"
    ],
    "ParentView": [
        "AAA view"
    ],
    "ParaDef": [
        {
            "Parameters": "access-number",
            "Info": "Specifies the number of access users during the statistics period.\nThe value ranges from 1 to 65535."
        },
        {
            "Parameters": "access-period",
            "Info": "Specifies the period of access user statistics.\nThe value ranges from 1 to 65535, in seconds."
        },
        {
            "Parameters": "forced",
            "Info": "Indicates that users access the device at the configured access rate, regardless of the CPU or memory usage.\n-"
        },
        {
            "Parameters": "adjustment",
            "Info": "Adjust the user access rate.\n-"
        },
        {
            "Parameters": "system-state",
            "Info": "Indicates that the device adjusts the user access rate based on the system status.\n-"
        },
        {
            "Parameters": "level level",
            "Info": "Indicates the level based on which the device adjusts the user access rate. level1 indicates that the access rate is limited by the memory usage. Memory usage < 65%: not limited; 65% <= Memory usage < 80%: 500 per second; 80% <= Memory usage < 85%: 450 per second; 85% <= Memory usage <= 90%: 400 per second; Memory usage > 90%: 100 per second.\nThe value is 1."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] access-speed 500 5"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo protect the AAA server, the rate of user access to the AAA server should be limited because:\nThe AAA server needs to provide authentication and accounting for multiple access servers at the same time.The performance of the AAA server is lower than that of the device.\nIf you run the access-speed access-number access-period command, the user access rate is the lowest among that limited by the CPU usage, by the memory usage, and the configured one.\nIf you run the access-speed access-number access-period forced command, the user access rate is the configured one, regardless of the CPU and memory usage.\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}