{
    "PageTitle": "access-user exhaust threshold-alarm",
    "FuncDef": "The access-user exhaust threshold-alarm command configures the alarm and clear alarm thresholds for the user resource or CPU usage.\nThe undo access-user exhaust threshold-alarm command restores the default alarm and clear alarm thresholds of the user resource or CPU usage.\nBy default, the alarm and clear alarm thresholds are respectively 85% and 75% for the user resource and CPU usage.",
    "CLIs": [
        "access-user exhaust threshold-alarm { main-resource-usage | main-cpu-usage } upper-limit <upper-limit> lower-limit <lower-limit>",
        "access-user exhaust threshold-alarm { slot-resource-usage | slot-cpu-usage } upper-limit <upper-limit> lower-limit <lower-limit>",
        "undo access-user exhaust threshold-alarm { slot-resource-usage | slot-cpu-usage } upper-limit <upper-limit> lower-limit <lower-limit>",
        "undo access-user exhaust threshold-alarm { main-resource-usage | main-cpu-usage } upper-limit <upper-limit> lower-limit <lower-limit>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "main-resource-usage",
            "Info": "Indicates the resource usage of.\nthe main control board.\n-"
        },
        {
            "Parameters": "main-cpu-usage",
            "Info": "Indicates the CPU usage of the main control board.\n-"
        },
        {
            "Parameters": "upper-limit upper-limit",
            "Info": "Specifies an alarm threshold, in percentage.\nThe value is an integer ranging from 1 to 100.\nFor example, when the alarm threshold is set to 80 and the user resource or CPU usage reaches 80%, the device generates an alarm."
        },
        {
            "Parameters": "lower-limit lower-limit",
            "Info": "Specifies a clear alarm threshold, in percentage.\nThe value is an integer ranging from 1 to 100.\nFor example, when the clear alarm threshold is set to 70 and the user resource or CPU usage falls below 70%, the device generates a clear alarm. lower-limit must be smaller than upper-limit."
        },
        {
            "Parameters": "slot-resource-usage",
            "Info": "Indicates the resource usage of an interface board.\n-"
        },
        {
            "Parameters": "slot-cpu-usage",
            "Info": "Indicates the CPU usage of an interface board.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] access-user exhaust threshold-alarm main-resource-usage upper-limit 95 lower-limit 85"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a large number of online users exist, system resources may become insufficient and the CPU usage may go high, causing device failures. If the access-user exhaust warning enable command has been run, the system will generate an alarm when the user resource or CPU usage exceeds an alarm threshold so that device maintenance engineers can take measures to prevent device failures. When the user resource or CPU usage falls below a clear alarm threshold, the system will generate a clear alarm.\nTo configure the alarm and clear alarm thresholds for the user resource or CPU usage of the main control board or an interface board, run the access-user exhaust threshold-alarm command.\nPrerequisites\nThe access-user exhaust warning enable command has been run. The alarm and clear alarm thresholds configured in the access-user exhaust threshold-alarm command take effect only when the access-user exhaust warning enable command has been run.\nConfiguration Impact\nTo configure the alarm and clear alarm thresholds for the user resource or CPU usage of the main control board or an interface board, run the access-user exhaust threshold-alarm command.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}