{
    "PageTitle": "accounting-copy-group(AAA view)",
    "FuncDef": "The accounting-copy-group command creates an accounting copy group in the AAA view and enters the accounting copy group view. If the accounting copy group already exists, the view of the existing accounting copy group is displayed.\nThe undo accounting-copy-group command deletes an existing accounting copy group in the AAA view.\nBy default, no accounting copy group is created in the AAA view.",
    "CLIs": [
        "accounting-copy-group <group-name>",
        "undo accounting-copy-group <group-name>"
    ],
    "ParentView": [
        "AAA view"
    ],
    "ParaDef": [
        {
            "Parameters": "group-name",
            "Info": "Specifies the name of an accounting copy group.\nThe value is a string of 1 to 32 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] accounting-copy-group test"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWith regard to the fact that operators may run their business in integrated and hierarchical mode, multiple copies of CDRs, as original accounting information, need to be sent to different parties as the basis of settlement. When the original accounting information needs to be sent to multiple parties, run the accounting-copy-group command in the AAA view to create an accounting copy group and enter the accounting copy group view, run the radius-server group interval command to configure an accounting copy server group and the interval for sending accounting information to the accounting copy server group, and then run the accounting-copy-group command to bind the AAA domain to the accounting copy group. In this way, the accounting packets are sent to the accounting copy server group and used as the original accounting information in subsequent settlement.\nPrecautions\nIn the AAA view, a maximum of 1k (k=1000) accounting copy groups can be configured.\nIn VS mode, this command is supported only by the admin VS."
}