{
    "PageTitle": "accounting-copy-group(AAA domain view)",
    "FuncDef": "The accounting-copy-group command configures the accounting copy group bound to the domain.\nThe undo accounting-copy-group command deletes the accounting copy group bound to the domain.\nBy default, no accounting copy group is bound to the domain.",
    "CLIs": [
        "accounting-copy-group <group-name>",
        "undo accounting-copy-group <group-name>"
    ],
    "ParentView": [
        "AAA domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "group-name",
            "Info": "Specifies the name of the accounting copy group bound to the domain.\nThe value is a string of 1 to 32 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] accounting-copy-group huawei",
            "[*HUAWEI-aaa-accounting-copy-group-huawei] commit",
            "[~HUAWEI-aaa-accounting-copy-group-huawei] quit",
            "[~HUAWEI-aaa] domain isp1",
            "[*HUAWEI-aaa-domain-isp1] commit",
            "[~HUAWEI-aaa-domain-isp1] accounting-copy-group huawei"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWith regard to the fact that operators may run their business in integrated and hierarchical mode, multiple copies of CDRs, as original accounting information, need to be sent to different parties as the basis of settlement. When the original accounting information needs to be sent to multiple parties, run the accounting-copy-group command in the AAA view to create an accounting copy group and enter the accounting copy group view, run the radius-server group interval command to configure an accounting copy server group and the interval for sending accounting information to the accounting copy server group, and then run the accounting-copy-group command to bind the AAA domain to the accounting copy group. In this way, the accounting packets are sent to the accounting copy server group and used as the original accounting information in subsequent settlement.\nPrerequisites\nBefore binding an accounting copy group to the domain, create an accounting copy group in the AAA view.\nPrecautions\nIf the servers configured for the level-2 accounting packet copy, physical accounting packet copy, QoE accounting packet copy, and multi-level accounting packet copy are the same, only the level-2 accounting copy packets are sent. Given the same accounting copy server, packets are sent based on priorities in the following order: level-2 accounting copy packets, physical accounting copy packets, QoE accounting copy packets, and multi-level accounting copy packets.\nIn VS mode, this command is supported only by the admin VS."
}