{
    "PageTitle": "radius-server group(Accounting-copy-group view)",
    "FuncDef": "The radius-server group interval command configures an accounting copy server group in the accounting copy group view and configures the interval for copying accounting packets to the accounting copy server group.\nThe undo radius-server group interval command deletes the accounting copy server group in the accounting copy group view and the interval for copying accounting packets to the accounting copy server group.\nBy default, no accounting copy server group is configured in the accounting copy group view, and the interval for copying accounting packets to the accounting copy server group is not configured.",
    "CLIs": [
        "radius-server group <name> [ interval <interval-value> ]",
        "undo radius-server group <name> [ interval <interval-value> ]"
    ],
    "ParentView": [
        "Accounting-copy-group view"
    ],
    "ParaDef": [
        {
            "Parameters": "interval interval-value",
            "Info": "Specifies the interval for sending accounting packets to the accounting copy server group.\nThe value is an integer that ranges from 1 to 65535, in minutes."
        },
        {
            "Parameters": "group name",
            "Info": "Specifies the name of the accounting copy server group.\nThe value is a string of 1 to 32 case-insensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] radius-server group test",
            "[*HUAWEI-radius-test] commit",
            "[~HUAWEI-radius-test] quit",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] accounting-copy-group test",
            "[*HUAWEI-aaa-accounting-copy-group-test] commit",
            "[~HUAWEI-aaa-accounting-copy-group-test] radius-server group test interval 60"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWith regard to the fact that operators may run their business in integrated and hierarchical mode, multiple copies of CDRs, as original accounting information, need to be sent to different parties as the basis of settlement. When the original accounting information needs to be sent to multiple parties, run the accounting-copy-group command in the AAA view to create an accounting copy group and enter the accounting copy group view, run the radius-server group interval command to configure an accounting copy server group and the interval for sending accounting information to the accounting copy server group, and then run the accounting-copy-group command to bind the AAA domain to the accounting copy group. In this way, the accounting packets are sent to the accounting copy server group and used as the original accounting information in subsequent settlement.\nPrecautions\nThe RADIUS server group has been created in the system view before the accounting copy server group is configured.\nAn accounting copy group can be configured with a maximum of eight accounting copy server groups.\nIf the interval for copying accounting packets to the accounting copy server group is less than 1 hour, the pressure on the system may be increased, leading to increasing CPU usage.\nIn VS mode, this command is supported only by the admin VS."
}