{
    "PageTitle": "accounting exclude-type vlan access-user",
    "FuncDef": "The accounting exclude-type vlan access-user command configures the device to exclude VLAN header length from packet length when collecting statistics about user packet bytes. This command applies to both IPv4 and IPv6 packet statistics.\nThe undo accounting exclude-type vlan access-user command restores the default configuration.\nBy default, VLAN header length is also counted into packet length in the statistics about user packet bytes.",
    "CLIs": [
        "accounting exclude-type vlan access-user layer2 { ipoe | pppoe }",
        "undo accounting exclude-type vlan access-user [ layer2 [ ipoe | pppoe ] ]"
    ],
    "ParentView": [
        "AAA domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipoe",
            "Info": "Indicates IPoE user.\n-"
        },
        {
            "Parameters": "pppoe",
            "Info": "Indicates PPPoE user.\n-"
        },
        {
            "Parameters": "layer2",
            "Info": "Indicates Layer 2 access user.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] domain huawei",
            "[*HUAWEI-aaa-domain-huawei] commit",
            "[~HUAWEI-aaa-domain-huawei] accounting exclude-type vlan access-user layer2 ipoe"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOne or two layers of VLAN tags are added to each user packet transmitted over a MAN. The device counts VLAN header length into packet length when collecting statistics about user packet bytes. As a result, the number of bytes sent by a user terminal greatly deviates from the number of bytes in the statistics collected by the device. To improve accounting accuracy, you can run the accounting exclude-type vlan command to configure the device to exclude VLAN header length from packet length when collecting statistics about user packet bytes.\nThis function is applicable only to Layer 2 IPoEoVLAN, IPoEoQ, PPPoEoVLAN, PPPoEoQusers.\nConfiguration Impact\nAfter the accounting exclude-type vlan command is configured, the number of bytes sent by the user terminal deviates little from the number of bytes in the statistics collected by the device. If no packet is lost, the two numbers are the same.\nPrecautions\nThe accounting exclude-type vlan command applies only if the qos link-adjustment link-layer-exclude command is not configured. After the qos link-adjustment link-layer-exclude command is configured, only statistics about Layer 3 packets will be collected."
}