{
    "PageTitle": "bill-server",
    "FuncDef": "The bill-server command enables the Router to automatically transfer local bills to a specified bill server.\nThe undo bill-server command cancels the configuration.\nBy default, no bill server is configured, so that the device cannot automatically transfer local bills to a bill server.",
    "CLIs": [
        "bill-server <ip-address> filename <file-name> [ user-name <user-name> password cipher <cipher-password> <port> ]",
        "undo bill-server"
    ],
    "ParentView": [
        "Local AAA server view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address",
            "Info": "Specifies the IP address of a bill server.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "filename file-name",
            "Info": "Specifies a file used to store bills on a bill server.\nThe value is a string of 1 to 30 characters."
        },
        {
            "Parameters": "user-name user-name",
            "Info": "Sets a user name used to set up an SFTP session with a bill server.\nThe value is a string of 1 to 64 characters."
        },
        {
            "Parameters": "cipher cipher-password",
            "Info": "Sets a password used to set up an SFTP session with a bill server. Only cipher-text passwords are supported.\nThe value is a character string. If the input string is not encrypted, the string can contain 1 to 16 characters. If the input string is encrypted, the string can contain 1 to 128 characters"
        },
        {
            "Parameters": "port",
            "Info": "Sets a port number used to set up an SFTP session with a bill server.\nThe value is an integer ranging from 1 to 65535."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] local-aaa-server",
            "[~HUAWEI-local-aaa-server] bill-server 10.10.10.1 filename billfile user-name huawei password cipher Root@123 22"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nLocal bills are stored in the bill pool or CF card. Due to their limited capacities, newly generated bills will not be saved when the local storage space is full. To resolve this issue, run the bill-server command to enable the device to automatically transfer local bills to a bill server. Then, local bills will be deleted from the bill pool or CF card to release storage space.\nBoth TFTP and SFTP bill transfer modes are supported. The SFTP mode is recommended, because the TFTP mode is insecure.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nTo use the SFTP bill transfer mode, you must specify the user-name user-name, password cipher cipher-password, and port parameters."
}