{
    "PageTitle": "clear ip routes aaa-download",
    "FuncDef": "The clear ip routes aaa-download command clears static routes delivered by the RADIUS server.",
    "CLIs": [
        "clear ip routes aaa-download all",
        "clear ip routes aaa-download [ vpn-instance <vpn-name> ] [ <ip-address> <mask-len> | <ipv6-address> <prefix-length> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance vpn-name",
            "Info": "Clears RADIUS server delivered static routes of the specified VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters."
        },
        {
            "Parameters": "ip-address",
            "Info": "Clears the RADIUS server delivered static route with a specified destination IPv4 address.\nThis value is in dotted decimal notation."
        },
        {
            "Parameters": "mask-len",
            "Info": "Specifies the mask length.\nThe value is an integer ranging from 1 to 32."
        },
        {
            "Parameters": "ipv6-address",
            "Info": "Clears the RADIUS server delivered static route with a specified destination IPv6 address.\nThe address is a 32-digit hexadecimal number in the X:X:X:X:X:X:X:X format."
        },
        {
            "Parameters": "prefix-length",
            "Info": "Specifies the prefix length.\nIt is an integer ranging from 1 to 128."
        },
        {
            "Parameters": "all",
            "Info": "Clears all the RADIUS server delivered static route.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] clear ip routes aaa-download all"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo delete static routes delivered by the RADIUS server, run the clear ip routes aaa-download command.\nIn BRAS multi-device backup scenarios, if the aaa route-download command has been run to enable the device to download static routes from a RADIUS server at an interval, you must run the clear ip routes aaa-download command to clear static routes delivered from the RADIUS server before users are logged out due to a master/slave device upgrade. This configuration prevents a traffic bypass or packet loss during the period when users are logged out but before the device is restarted.\nConfiguration Impact\nIf no parameters are specified, the clear ip routes aaa-download command clears all static routes delivered by the RADIUS server. Therefore, static routes delivered by the RADIUS server will be imported to the device only after the device periodically or immediately synchronizes static routes with those delivered by the RADIUS server.\nPrecautions\nThe clear ip routes aaa-download command takes effect only when the delivery status of the static routes is ready. This command does not take effect when the delivery status of the static routes is downloading. To view the delivery status of static routes, run the display aaa route-download config command.\nIn VS mode, this command is supported only by the admin VS."
}