{
    "PageTitle": "default-password",
    "FuncDef": "The default-password command sets the password of an IPoX user.\nThe undo default-password command restores the default configuration.\nBy default, the password of an IPoX user is not configured.",
    "CLIs": [
        "default-password [ template <template-name> ] { simple <simple-password> | cipher <cipher-password> | { option60 | vendor-class } [ cn | [ offset <offset> ] { length <length> | sub-option <sub-option-code> [ sub-offset <sub-offset> ] [ sub-length <sub-length> ] } ] [ md5-encrypt ] [ support hex ] | { option77 | user-class } }",
        "undo default-password [ template <template-name> ]"
    ],
    "ParentView": [
        "AAA view"
    ],
    "ParaDef": [
        {
            "Parameters": "template template-name",
            "Info": "Specifies the name of the template used to determine the user password generation mode.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "simple simple-password",
            "Info": "Indicates that the user password is in simple text.\nThe value is a string of 1 to 128 characters. The password is case sensitive and cannot contain command line characters such as blanks and question mark.\nThe new password is at least eight characters long and contains at least two of upper-case letters, lower-case letters, digits, and special characters.When configuring an authentication password, select the ciphertext mode because the password is saved in configuration files in simple text if you select simple text mode, which has a high risk. To ensure device security, change the password periodically."
        },
        {
            "Parameters": "cipher cipher-password",
            "Info": "Indicates that the user password is in cipher text.Specifies a cipher-text password. The password is case sensitive and does not contain command line characters such as blanks and question mark.\nThe value is a character string. If the input string is not encrypted, the string can contain 1 to 16 characters. If the input string is encrypted, the string can contain 1 to 268 characters."
        },
        {
            "Parameters": "vendor-class",
            "Info": "Indicates that the system uses the vendor-class attribute as the user password.\n-"
        },
        {
            "Parameters": "cn",
            "Info": "Indicates that the system uses the vendor-class attribute of the China Telecom format as the user password.\n-"
        },
        {
            "Parameters": "offset offset",
            "Info": "Configures the offset of a vendor-class option as the user password.\nThe value is an integer ranging from 0 to 255."
        },
        {
            "Parameters": "length length",
            "Info": "Configures the field length of the vendor-class attribute as the user password.\nThe value is an integer ranging from 0 to 255."
        },
        {
            "Parameters": "sub-option sub-option-code",
            "Info": "Configures the suboption code of the vendor-class attribute as the user password.\nThe value is an integer ranging from 0 to 255."
        },
        {
            "Parameters": "sub-offset sub-offset",
            "Info": "Configures the offset of a vendor-class sub-option code as the user password.\nThe value is an integer ranging from 0 to 255."
        },
        {
            "Parameters": "sub-length sub-length",
            "Info": "Configures the field length of a vendor-class sub-option as the user password.\nThe value is an integer ranging from 0 to 255."
        },
        {
            "Parameters": "md5-encrypt",
            "Info": "Indicates that the system uses the MD5 algorithm to encrypt the user password.The encryption algorithm used for MD5 authentication poses security risks.\n-"
        },
        {
            "Parameters": "hex",
            "Info": "Indicates that the system parses the Option 60 based on the hexadecimal format.\n-"
        },
        {
            "Parameters": "user-class",
            "Info": "Indicates that the system uses the user-class attribute as the user password.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] default-password cipher test@123"
        ]
    ],
    "ExtraInfo": "The differences between the cipher and simple keywords are as follows:\nIf cipher is specified, you can enter an encrypted password. If simple is specified, you can enter only the original (non-encrypted) password. The cipher keyword supports longer passwords because encrypted passwords are longer than non-encrypted ones.\nIf the cipher keyword is selected, the input encrypted password must be the same as the encrypted password generated by the system. You can enter a non-encrypted password and view the configuration file to obtain the encrypted password generated by the system. The encrypted password is complicated and errors may occur when you enter the encrypted password. Therefore, it is not recommended to enter the encrypted password."
}