{
    "PageTitle": "dhcp through-packet (AAA domain view)",
    "FuncDef": "The dhcp through-packet disable command disables transparent transmission of DHCPv4 packets. Specifically, if the device receives DHCPv4 Discover, Offer, or Request packets for which the user entries exist, the device does not transparently transmit the packets to the DHCPv4 server or users.\nThe undo dhcp through-packet disable command enables transparent transmission of DHCPv4 packets.\nBy default, the status of transparent transmission of DHCPv4 packets is consistent with that of the dhcp through-packet command in the system view.",
    "CLIs": [
        "dhcp through-packet disable",
        "undo dhcp through-packet disable"
    ],
    "ParentView": [
        "AAA domain view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[*HUAWEI] aaa",
            "[*HUAWEI-aaa] domain huawei",
            "[*HUAWEI-aaa-domain-huawei] dhcp through-packet disable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen a user shuts down the STB and then restarts it immediately, the device cannot detect that the user goes offline and retains the user entry. When receiving the DHCPv4 Discover packet that the STB sends after restart, the device logs out the user and waits until the user sends a DHCPv4 Discover packet to obtain the address through DHCPv4. In this scenario, run the dhcp through-packet disable command to disable transparent transmission of DHCPv4 packets.\nSome STBs, however, send only one DHCPv4 Discover packet after they restart. In this case, the users cannot go online after shutting down their STBs.\nTo address this problem, run the dhcp through-packet command to enable transparent transmission of DHCPv4 packets.\nThe relationship between transparent transmission of DHCP packets in a domain and that in the system view is as follows:\nTransparent transmission of DHCP packets is enabled in a domain by default. To disable this function in a domain, run the undo dhcp through-packet command in the domain view.Transparent transmission of DHCP packets is enabled globally by default. To disable this function globally, run the undo dhcp through-packet command in the system view.If transparent transmission of DHCP packets is disabled in a domain, DHCP packets cannot be transparently transmitted in the domain, irrespective of whether this function is enabled globally.If transparent transmission of DHCP packets is enabled in a domain and also enabled globally, DHCP packets can be transparently transmitted in the domain. However, if transparent transmission of DHCP packets is enabled in a domain but disabled globally, DHCP packets cannot be transparently transmitted in the domain.\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}