{
    "PageTitle": "dhcp user offline",
    "FuncDef": "The dhcp discover user offline command enables a device to log out an online user when a Discover message from a client with the same MAC address as the online user is received.\nThe undo dhcp discover user offline command disables a device from logging out an online user when a Discover message from a client with the same MAC address as the online user is received.\nThe dhcp reboot-request user offline command enables a device to log out an online user when a Request message from a client with the same MAC address as the online user is received.\nThe undo dhcp reboot-request user offline command disables a device from logging out an online user when a Request message from a client with the same MAC address as the online user is received.\nBy default, a device responds with an ACK message when a Discover or Request message from a client with the same MAC address as an online user is received so that the user goes online from the initial domain.",
    "CLIs": [
        "dhcp { discover | reboot-request } * user offline",
        "undo dhcp { discover | reboot-request } * user offline"
    ],
    "ParentView": [
        "AAA domain view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] domain huawei",
            "[*HUAWEI-aaa-domain-huawei] commit",
            "[~HUAWEI-aaa-domain-huawei] dhcp discover user offline"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen an STB is quickly powered off and then restarted, the device cannot detect the user logout, and the user entry is still available. After the STB restarts, the user goes online again. The STB obtains a new account from the NMS in which the online domain may have changed and sends a Discover or Request message to the device. Upon receipt of the Discover or Request message, the device does not check the Option 60 field because a user entry with the same MAC address already exists. The device responds with an ACK message. As a result, the user always goes online from the initial domain and cannot access the network normally.\nConfiguration Impact\nAfter the dhcp discover user offline or dhcp reboot-request user offline command is run, the device logs out an online user and deletes the user entry when a Discover or Request message from a client with the same MAC address as the online user is received. The user can go online again by sending a Discover or Request message.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}