{
    "PageTitle": "diameter-server group",
    "FuncDef": "The diameter-server group command creates a Diameter server group or displays the view of an existing Diameter server group.\nThe undo diameter-server group command deletes a Diameter server group.\nBy default, Diameter server groups are not configured.",
    "CLIs": [
        "diameter-server group <diameter-group-name>",
        "undo diameter-server group <diameter-group-name>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "group diameter-group-name",
            "Info": "Specifies the name of a Diameter server group.\nThe name is a string of 1 to 32 case-insensitive characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] diameter enable",
            "[~HUAWEI] diameter-server group huawei"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe device can manage users based on a policy delivered by a policy server. Policy delivery is implemented by the Diameter protocol running between the NE40E and the policy server. Before using the Diameter protocol for policy delivery, you need to configure some basic information about the Diameter client and server.\nThe diameter-server group command is used to create a Diameter server group and display its view. A link between the Diameter client and the Diameter server needs to be set up in that view.\nPrerequisites\nThe Diameter protocol has been enabled on the device.\nConfiguration Impact\nIf no Diameter server group has been configured, run the diameter-server group command to create one. If a Diameter server group has been configured, run the same command to enter the view of the group.\nFollow-up Procedure\nSet up a link between the Diameter client and the Diameter server.\nPrecautions\nA maximum of 1024 Diameter server groups can be configured on the device. If a Diameter server group is bound to an AAA domain, it cannot be deleted unless it is unbound from the AAA domain.\nIn VS mode, this command is supported only by the admin VS."
}