{
    "PageTitle": "diameter subscription-id include",
    "FuncDef": "The diameter subscription-id include command sets a format for the Subscription-ID attribute to be sent to the Diameter server.\nThe undo diameter subscription-id include command restores the default format of the Subscription-ID attribute to be sent to the Diameter server.\nBy default, the system uses the original user name in the user table as the value of the Subscription-ID attribute to be sent to the Diameter server.",
    "CLIs": [
        "diameter subscription-id include { mac-address { <macaddr_separator> | noseparator } [ <subscription-separator> ] | username [ <subscription-separator> ] | circuit-id [ <subscription-separator> ] } *",
        "undo diameter subscription-id include [ { mac-address { <macaddr_separator> | noseparator } [ <subscription-separator> ] | username [ <subscription-separator> ] | circuit-id [ <subscription-separator> ] } * ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "mac-address",
            "Info": "Uses the MAC address carried in each user login request packet as a component in the value of the Subscription-ID attribute.\n-"
        },
        {
            "Parameters": "macaddr_separator",
            "Info": "Specifies a separator for MAC addresses. The value is a character.\nThe value is a character."
        },
        {
            "Parameters": "noseparator",
            "Info": "Uses MAC addresses without separators.\n-"
        },
        {
            "Parameters": "subscription-separator",
            "Info": "Specifies a separator to be used between adjacent components (user name, MAC address, and circuit ID).\nThe value is a character."
        },
        {
            "Parameters": "username",
            "Info": "Uses the original user name in the user table as a component in the value of the Subscription-ID attribute.\n-"
        },
        {
            "Parameters": "circuit-id",
            "Info": "Uses the circuit ID as a component in the value of the Subscription-ID attribute.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] diameter subscription-id include mac-address -"
        ]
    ],
    "ExtraInfo": "In value-added service scenarios, original user names that are identical may exist in the user table. By default, the device sends the original user name of each user in the user table as the value of the Subscription-ID attribute to be sent to the Diameter server. In this case, the Diameter server cannot distinguish users based on the Subscription-ID attribute value. To address this problem, you can run the diameter subscription-id include command to set a format for the Subscription-ID attribute to be sent to the Diameter server. The Subscription-ID attribute value can be a combination of the user name, MAC address, circuit ID, and separators."
}