{
    "PageTitle": "diameter enable",
    "FuncDef": "The diameter enable command enables the Diameter protocol.\nThe undo diameter enable command disables the Diameter protocol.\nBy default, the Diameter protocol is disabled.",
    "CLIs": [
        "diameter enable",
        "undo diameter enable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] diameter enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA connection can be set up between the NE40E and other network elements to exchange messages. By default, Diameter is disabled. Run the diameter enable command to enable the Diameter protocol on the device.\nPrerequisites\nTo customize the Diameter dictionary file, upload the diamgxdict.zip package related to Diameter to the cfcard: directory of the device. If the dictionary file does not need to be customized, the dictionary file in the system software package is used by default. There is a possibility that the Diameter server fails to identify the packets encapsulated based on the fixed format in the default dictionary file.\nImplementation Procedure\nWhen the Diameter protocol is being enabled, the Router displays the following information:If succeeded, displays Info: This process may take a few minutes, please wait......................done!If failed, displays Info: This process may take a few minutes, please wait......................Failed!\nIf you run the undo diameter enable command to disable the Diameter protocol on the Router, the Router deletes all Diameter server configurations after your confirmation.To disable the Diameter protocol on the Diameter server, if a Diameter server group is bound to the domain, the system prompts you to unbind the Diameter server group from the domain before disabling the Diameter protocol.The device displays the following information:\n\nWarning: Diameter-server group is referenced, can't be deleted. Please cancel the binding first.If sucessed, displays Warning: Undo Diameter enable will invalidate all the configuration of Diameter,Continue? [y/n]y.....OK!If failed, displays Warning: Undo Diameter enable will invalidate all the configuration of Diameter,Continue? [y/n]y.....Failed!\n\nThe minimum interval for running the diameter enable and undo diameter enable commands continuously is 20 seconds.\n\nConfiguration Impact\nAfter the diameter enable command is run, the device is able to support the Diameter protocol and reserves the resources for establishing a connection with a policy server.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}