{
    "PageTitle": "diameter-peer",
    "FuncDef": "The diameter-peer command creates a Diameter server entity and configures the entity information such as the domain name, host IP address, local port number, and client port number.\nThe undo diameter-peer command deletes a Diameter server entity.\nBy default, the device does not have Diameter server entities.",
    "CLIs": [
        "diameter-peer <peername> { ip <ip-address> | ipv6 <ipv6-address> } [ vpn-instance <vpn-instance> ] port <port-number> [ host <host-name> | realm <realm-name> ] *",
        "undo diameter-peer <peername>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "peername",
            "Info": "Specifies the server name.\nThe name is a string of 1 to 32 case-insensitive characters."
        },
        {
            "Parameters": "ip ip-address",
            "Info": "Specifies the host IP addresses of the Diameter server.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "ipv6 ipv6-address",
            "Info": "Specifies the host IPv6 addresses of the Diameter server.You can configure IPv4 or IPv6 addresses for different servers in the same server group, but you can configure only one stack address for the same server.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "vpn-instance vpn-instance",
            "Info": "Specifies the vpn-instance name of the VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "port port-number",
            "Info": "Specifies the port number on the Diameter server.\nThe value is an integer that ranges from 1 to 49151."
        },
        {
            "Parameters": "host host-name",
            "Info": "Specifies the host name of the Diameter server.\nThe name is a string of 1 to 127 case-insensitive characters."
        },
        {
            "Parameters": "realm realm-name",
            "Info": "Specifies the domain name of the Diameter server, which identifies the domain where the Diameter message generator resides and is contained in every Diameter message sent from the Diameter server.\nThe name is a string of 1 to 127 case-insensitive characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] diameter enable",
            "[~HUAWEI] diameter-peer huawei ip 10.10.10.2 port 3288 host pcrf realm huawei.com"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe diameter-peer command is used to configure information about a Diameter server entity. The information serves as a basis for establishing a connection between a policy server (the Diameter server) and the device(the Diameter client).\nPrerequisites\nThe Diameter protocol has been enabled on the device.\nConfiguration Impact\npeer-name uniquely identifies a server entity. At most eight Diameter server entities can be specified on a Diameter client.\nWhen using the diameter-peer command to create a server entity, configure the values of all parameters. If you want to change the value of host-name or realm-name in later configurations, just configure the concerned parameter(s) in the command.\nFollow-up Procedure\nAfter configuring information about the Diameter client and server, enter the Diameter server group view to establish a Diameter link between the client and the server.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nA server entity that already has a link set up with a client entity cannot be modified or deleted."
}