{
    "PageTitle": "diameter gx ccri retransmit",
    "FuncDef": "The diameter gx ccri retransmit command configures the number of CCR-I message retransmissions, number of retransmission rounds, and retransmission interval between rounds on a Gx interface.\nThe undo diameter gx ccri retransmit command restores the default configuration.\nBy default, the numbers of CCR-I message retransmissions and retransmission rounds are both 1 on a Gx interface.",
    "CLIs": [
        "diameter gx ccri retransmit <retry-times>",
        "diameter gx ccri retransmit round <round-num> round-timeout <timeout-num>",
        "undo diameter gx ccri retransmit [ <retry-times> ]",
        "undo diameter gx ccri retransmit round [ <round-num> round-timeout <timeout-num> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "retransmit retry-times",
            "Info": "Specifies the number of CCR-I message retransmissions on a Gx interface.\nThe value is an integer ranging from 2 to 10."
        },
        {
            "Parameters": "round round-num",
            "Info": "Specifies the number of CCR-I message retransmission rounds on a Gx interface.\nThe value is an integer ranging from 1 to 5."
        },
        {
            "Parameters": "round-timeout timeout-num",
            "Info": "Specifies a retransmission interval between rounds.\nThe value is an integer ranging from 15 to 80, in minutes."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] diameter enable",
            "[~HUAWEI] diameter gx ccri retransmit 2"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] diameter enable",
            "[~HUAWEI] diameter gx ccri retransmit round 2 round-timeout 30"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a device sends a CCR-I message to a Diameter server but does not receive a CCA-I message from the Diameter server within 70s, users fail to obtain a bandwidth policy. If a large number of users do not obtain a bandwidth policy, you can run the diameter gx ccri retransmit command to change the number of CCR-I message retransmissions, number of retransmission rounds, and retransmission interval between rounds, increasing the bandwidth policy obtainment success rate.\nBy default, the device retransmits a CCR-I message once in one round.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nThe interval between two retransmissions in each round does not need to be configured. The default interval is 70s."
}