{
    "PageTitle": "diameter-server group(AAA domain view)",
    "FuncDef": "The diameter-server group command binds a Diameter server group to an AAA domain.\nThe undo diameter-server group command unbinds a Diameter server group from an AAA domain.\nBy default, no Diameter server group is bound to an AAA domain.",
    "CLIs": [
        "diameter-server group <group-name>",
        "undo diameter-server group"
    ],
    "ParentView": [
        "AAA domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "group group-name",
            "Info": "Specifies the name of a Diameter server group.\nThe name is a string of 1 to 32 case-insensitive characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[*HUAWEI-aaa] domain domain1",
            "[*HUAWEI-aaa-domain-domain1] commit",
            "[~HUAWEI-aaa-domain-domain1] diameter-server group huawei"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe device can manage users based on a policy delivered by a policy server. If it is required that the policy be effective to only the users that log in from an AAA domain, you can bind a Diameter server group to the AAA domain. The configurations of the Diameter server group then take effect only on the users that log in from the AAA domain.\nPrerequisites\nA Diameter server group has been configured in the system view.\nImplementation Procedure\nIf the Diameter server group specified in the diameter-server group command does not exist, the command configuration will fail and the system will display a message indicating that the Diameter server group does not exist.\nConfiguration Impact\nAfter a Diameter server group is bound to an AAA domain, logins or logouts of the domain users will be reported to the servers configured in the Diameter server group view. If you need to modify the Diameter server group bound to the AAA domain, delete the Diameter server group first and bind a new Diameter server group to the domain.\nPrecautions\nIf a Diameter server group is bound to an AAA domain, it cannot be deleted unless it is unbound from the AAA domain.\nIn VS mode, this command is supported only by the admin VS."
}