{
    "PageTitle": "display ip userlog",
    "FuncDef": "The display ip userlog access command displays the configurations of the function to generate and send user login and logout logs, as well as the statistics about user login and logout logs.",
    "CLIs": [
        "display ip userlog [ access | call-status ] { config | statistic }"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "access",
            "Info": "Displays information about user login and logout logs.\n-"
        },
        {
            "Parameters": "call-status",
            "Info": "Displays information about user online result logs.\n-"
        },
        {
            "Parameters": "config",
            "Info": "Displays configurations of the function to generate and send user login, logout, and online result logs.\n-"
        },
        {
            "Parameters": "statistic",
            "Info": "Displays statistics about user login, logout, and online result logs.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display ip userlog access config",
            "------------------ Access Log Configuration Information ----------------",
            " Enable access log                                      : Yes",
            " Version of access log packet                           : 1",
            " IP address of export server of access log packet       : 192.168.0.2",
            " UDP port of export server of access log packet         : 514",
            " Enable access syslog format                            : Yes",
            " -----------------------------------------------------------------------",
            " Total print : 5"
        ],
        [
            "<HUAWEI> display ip userlog call-status config",
            " ---------------- Call-status Configuration Information ----------------",
            "  Enable call-status log                                :  Yes",
            "  IP address of export server of call-status log packet : 192.168.100.43",
            "  UDP port of export server of call-status log packet   : 514",
            " -----------------------------------------------------------------------",
            " Total print : 5"
        ],
        [
            "<HUAWEI> display ip userlog config",
            "  ---------------- Access Log Configuration Information ----------------",
            " Enable access log                                      : Yes",
            " Version of access log packet                           : 1",
            " IP address of export server of access log packet       : 192.168.0.2",
            " UDP port of export server of access log packet         : 514",
            " Enable access syslog format                            : Yes",
            " -----------------------------------------------------------------------",
            " Total print : 5",
            " ---------------- Call-status Configuration Information ----------------",
            "  Enable call-status log                                :  Yes",
            "  IP address of export server of call-status log packet : 192.168.100.43",
            "  UDP port of export server of call-status log packet   : 514",
            " -----------------------------------------------------------------------"
        ],
        [
            "<HUAWEI> display ip userlog call-status statistic",
            " ----------------- Call-status Statistic Information -------------------",
            "  Received call-status logs                             : 1068",
            "  Sent call-status logs                                 : 1068",
            "  Received call-status log packets                      : 163",
            "  Sent call-status log packets successfully             : 163",
            "  Lost call-status logs                                 : 0",
            "  Times of sending call-status packets failed           : 0",
            " -----------------------------------------------------------------------",
            " Total print : 6"
        ],
        [
            "<HUAWEI> display ip userlog access statistic",
            "  ------------------ Access Log Statistic Information ------------------",
            " Received access logs                                   : 9",
            " Sent access logs                                       : 9",
            " Received access log packets                            : 1",
            " Sent access log packets successfully                   : 1",
            " Lost access logs                                       : 0",
            " Times of sending access packets failed                 : 0",
            " -----------------------------------------------------------------------",
            " Total print : 6"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nScenario\n\nCommand\n\nInformation\n\n\n\nThe function to generate and send user login and logout logs is enabled on the device.\n\nTo view configurations about the function to generate and send user login and logout logs, run the display ip userlog access config command.\n\nWhether the function to generate and send user login and logout logs is enabledVersion number of the packets used to send user login and logout logsIP address of the log server used to receive user login and logout logsUDP port number of the log server used to receive user login and logout logsWhether user login and logout logs are encapsulated and sent in syslog format\n\n\nThe function to generate and send user online result logs is enabled.\n\nTo view configurations about the function to generate and send user online result logs, run the display ip userlog call-status config command.\n\nWhether the function to generate and send user online result logs is enabledIP address of the log server used to receive user online result logsUDP port number of the log server used to receive user online result logs\n\n\nThe function to generate and send user login, logout, and online result logs is enabled on the device.\n\nTo view configurations of the function to generate and send user login, logout, and online result logs, run the display ip userlog config command.\n\nWhether the function to generate and send user login, logout, and online result logs is enabledVersion number of the packets used to send user login and logout logsIP address of the log server used to receive user login and logout logsUDP port number of the log server used to receive user login, logout, and online result logsWhether user login and logout logs are encapsulated and sent in syslog format\n\n\nThe function to generate and send user login, logout, and online result logs is enabled.\n\nTo view statistics about user login, logout, and online result logs, run the display ip userlog [ access | call-status ] statistic command.\n\nTotal number of received user login, logout, and online result logs.Total number of sent user login, logout, and online result logs.Total number of received packets carrying user login, logout, and online result logs.Total number of sent packets carrying user login, logout, and online result logs.Total number of lost user login, logout, and online result logs.Total number of lost packets carrying user login, logout, and online result logs.\n\n\n\n\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}