{
    "PageTitle": "display radius offline-sub-reason",
    "FuncDef": "The display radius offline-sub-reason command displays offline sub-causes.",
    "CLIs": [
        "display radius offline-sub-reason [ subcode <code-number> ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "subcode code-number",
            "Info": "Specifies the number of an offline sub-cause.\nThe value is an integer. The minimum value is 1. The maximum value increases with the number of offline sub-causes. For details about the parameter value range, see the command help information."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display radius offline-sub-reason subcode 1",
            "------------------------------------------------------------------------------",
            "Subcode     description of offline sub reason",
            "------------------------------------------------------------------------------",
            "1           User request to offline",
            "------------------------------------------------------------------------------"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo query an offline sub-cause with a specified number, run the display radius offline-sub-reason command.\nThe device sends Accounting Stop packets carrying RADIUS attribute 49 to the RADIUS server. The RADIUS attribute 49 (Acct-Terminate-Cause) identifies offline cause. To help the device support offline sub-causes, a Huawei proprietary attribute named huawei-181 (HW-Acct-terminate-subcause) is used to identify the offline sub-cause numbers. The offline sub-causes include all user logout causes displayed in the display aaa offline-record and display aaa online-fail-record commands\nSub-causes are not reported by default. You can run the radius-attribute include HW-Acct-terminate-subcause command in the RADIUS server group view for sub-causes to be reported.\nFor the relationships between standard reasons and sub-reasons, see Description > Feature Description > User Access > Appendix: RADIUS Attributes > Reasons for User Offline.\nPrecautions\nSpecifying an offline sub-cause number is recommended. If no offline sub-cause number is specified, all offline sub-causes will be displayed, difficult for you to locate required information.\nIn VS mode, this command is supported only by the admin VS."
}