{
    "PageTitle": "flow-statistic frequency",
    "FuncDef": "The flow-statistic frequency command specifies the frequency to collect traffic statistics on a specific board.\nBy default, the frequency of collecting online user traffic statistics on the MPUB4 and MPUB5 is slow, and the frequency of collecting online user traffic statistics on non-B4 MPUs and non-B5 MPUs is default.",
    "CLIs": [
        "flow-statistic frequency { fast | normal | slow | default }"
    ],
    "ParentView": [
        "Slot view"
    ],
    "ParaDef": [
        {
            "Parameters": "fast",
            "Info": "Sets the fast traffic statistics collection frequency.\n-"
        },
        {
            "Parameters": "normal",
            "Info": "Sets the normal traffic statistics collection frequency.\n-"
        },
        {
            "Parameters": "slow",
            "Info": "Sets the slow traffic statistics collection frequency.\n-"
        },
        {
            "Parameters": "default",
            "Info": "Sets the default traffic statistics collection frequency.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] slot 1",
            "[*HUAWEI-slot-1] flow-statistic frequency normal"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe flow-statistic frequency normal command is used when the frequency to collect traffic statistics needs to be adjusted.\nConfiguration Impact\nIf the flow-statistic frequency fast command is configured on a board, traffic statistics about a maximum of 320 online users are collected on this board each second.\nIf the flow-statistic frequency normal command is configured on a board, traffic statistics about a maximum of 160 online users are collected on this board each second.\nIf the flow-statistic frequency slow command is configured on a board, traffic statistics about a maximum of 80 online users are collected on this board each second.\nIf the flow-statistic frequency default command is configured on a slot, traffic statistics about a maximum of 320 online users are collected on this slot each second.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nIf the flow-statistic frequency default command is run more than once, the latest configuration overrides the previous one."
}