{
    "PageTitle": "ip-warning-threshold",
    "FuncDef": "The ip-warning-threshold command sets the upper alarm threshold of IP address usage in a domain.\nThe undo ip-warning-threshold command deletes the upper alarm threshold. If a threshold-crossing alarm has been sent to the NMS, a new alarm is sent to clear the alarm information. After that, no threshold-crossing alarm will be sent to the NMS, regardless of the IP address usage in the domain.\nThe ip-warning-threshold lower-limit command sets the lower alarm threshold of IP address usage in a domain.\nThe undo ip-warning-threshold lower-limit command deletes the lower alarm threshold.\nBy default, no alarm threshold is set for IP address usage in a domain.",
    "CLIs": [
        "ip-warning-threshold { <upper-limit-value> | lower-limit <lower-limit-value> }",
        "undo ip-warning-threshold [ lower-limit ]"
    ],
    "ParentView": [
        "AAA domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "upper-limit-value",
            "Info": "Specifies an upper alarm threshold for the IP address usage.\nThe value is an integer that ranges from 1 to 100, in percentage."
        },
        {
            "Parameters": "lower-limit lower-limit-value",
            "Info": "Specifies a lower alarm threshold for the IP address usage.\nThe value is an integer that ranges from 0 to 99, in percentage."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] domain isp1",
            "[*HUAWEI-aaa-domain-isp1] commit",
            "[~HUAWEI-aaa-domain-isp1] ip-warning-threshold 70"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the upper alarm threshold is set to 70, it indicates that when the IP address usage in a domain exceeds 70% and no threshold-crossing alarm is reported to the NMS, a new alarm is reported to the NMS. If the lower alarm threshold is set to 20, it indicates that when the IP address usage in a domain goes below 20%, an alarm is reported to the NMS. After the alarm is sent, no same alarm will be sent in half an hour unless a new upper alarm threshold is set.\nIf you need to set an upper alarm threshold for the usage, you can run the warning-threshold command in the IP address pool view.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}