{
    "PageTitle": "ip userlog",
    "FuncDef": "The ip userlog access command enables the device to generate user login and logout logs and send the logs to a log server.\nThe undo ip userlog access command disables the device from generating or sending user login and logout logs.\nThe ip userlog call-status command enables the logging function that records users' online results.\nThe undo ip userlog call-status command disables the logging function that records users' online results.\nBy default, the device is disabled from generating or sending user login and logout logs and online results .",
    "CLIs": [
        "ip userlog { access | call-status }",
        "undo ip userlog { access | call-status }"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip userlog call-status"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip userlog access export host 10.1.1.2 1200",
            "[~HUAWEI] ip userlog access export version 1",
            "[~HUAWEI] ip userlog access"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo facilitate the management and monitoring of access users, run the ip userlog command to enable the device to generate user login and logout logs or online result logs and send the logs to a log server. Then, you can check user login and logout information or nline result logs stored on the log server to perform device maintenance.\nPrerequisites\nBefore running the ip userlog access command,the IP address and UDP port number of the log server have been specified using the ip userlog access export host command and the version of packets used to send user login and logout logs has been specified using the ip userlog access export version command.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nThis function does not take effect if the memory usage on the main control board exceeds 90%."
}