{
    "PageTitle": "ip userlog export host (System view)",
    "FuncDef": "The ip userlog export host command sets an IP address and UDP port number for a log server that is used to receive user login, logout, and online result logs.\nThe undo ip userlog export host command cancels the settings.\nBy default, no IP address or UDP port number is set for a log server.",
    "CLIs": [
        "ip userlog { access | call-status } export host <ip-address> <udp-port>",
        "undo ip userlog { access | call-status } export host"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "access",
            "Info": "Indicates user login and logout logs.\n-"
        },
        {
            "Parameters": "call-status",
            "Info": "Indicates user online result logs.\n-"
        },
        {
            "Parameters": "ip-address",
            "Info": "Sets an IP address for a log server.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "udp-port",
            "Info": "Sets a UDP port number for a log server.\nThe value is an integer ranging from 1 to 65535."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip userlog access export host 10.1.1.2 1200"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip userlog call-status export host 10.1.1.3 514"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] undo ip userlog access export host"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] undo ip userlog call-status export host"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe device supports the function to generate user login, logout, and online result logs and send the logs to a log server to facilitate information query for maintenance personnel. To set an IP address and UDP port number for a target log server that is used to receive the logs, run the ip userlog access export host command.\nConfiguration Impact\nThe IP address and port number of the log server for receiving user login and logout logs and those of the log server for receiving user online result logs are independent of each other and can be configured concurrently. Both the user login and logout logs and the user online result logs can be received.\nPrecautions\nThe log server used to receive user login and logout logs and that used to receive user online result logs are independent of each other.\nNote the following constraints when you set the IP address and UDP port number for a log server used to receive user login and logout logs:The IP address, UDP port number, and packet version number for the log server must have been set before you enable the function to generate user login and logout logs and send the logs to the log server.The preceding settings can be deleted only after the function to generate user login and logout logs and send the logs to a log server is disabled.The preceding constraints do not take effect when you set the IP address and UDP port number for a log server used to receive user online result logs.Only one log server for receiving user login and logout logs can be configured on the device. If more than one log server is configured, the later configuration overrides the previous one."
}