{
    "PageTitle": "l2tp dslam-connect-speed enable",
    "FuncDef": "The l2tp dslam-connect-speed enable command enables an LAC to encapsulate the DSLAM's upstream and downstream rates respectively into the AVP24 and AVP38 attributes of packets to be sent to an LNS.\nThe undo l2tp dslam-connect-speed enable command disables an LAC from encapsulating the DSLAM's upstream and downstream rates respectively into the AVP24 and AVP38 attributes of packets to be sent to an LNS.\nBy default, an LAC does not send the DSLAM's upstream and downstream rates to an LNS.",
    "CLIs": [
        "l2tp dslam-connect-speed enable",
        "undo l2tp dslam-connect-speed enable"
    ],
    "ParentView": [
        "AAA domain view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] domain huawei",
            "[*HUAWEI-aaa-domain-huawei] commit",
            "[~HUAWEI-aaa-domain-huawei] l2tp dslam-connect-speed enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn L2TP access scenarios where the device serves as an LAC, it cannot send the DSLAM's upstream and downstream rates to an LNS, and therefore the LNS cannot obtain this information. To allow the LAC to send the DSLAM's upstream and downstream rates to the LNS, run the l2tp dslam-connect-speed enable command.\nConfiguration Impact\nAfter you run this command, the device encapsulates the DSLAM's upstream and downstream rates respectively into the AVP24 and AVP38 attributes of RADIUS authentication request packets to the LNS.\nPrecautions\nThe DSLAM's upstream and downstream rates range from 0 to 4294967000, in bps. The values 0 and 4294967000 can be specified, but are invalid. If the DSLAM's transmission rate is 0, 1G (1000000000 bps) is encapsulated into the packets; if the rate is greater than or equal to 4294967000 bps, 4.294966G (4294966000 bps) is encapsulated into the packets.If only the DSLAM's upstream or downstream rate is configured, the configured rate is used as both the upstream and downstream rates to be encapsulated into packets.If neither of the DSLAM's upstream and downstream rates is configured, this command does not take effect."
}