{
    "PageTitle": "local-bill cfcard backup-mode",
    "FuncDef": "The local-bill cfcard backup-mode command configures a mode in which bills in the CF card are transferred to a bill server.\nThe undo local-bill cfcard backup-mode command restores the default configuration.\nBy default, bills in the CF card are transferred to a bill server through SFTP.",
    "CLIs": [
        "local-bill cfcard backup-mode { tftp | sftp }",
        "undo local-bill cfcard backup-mode [ tftp | sftp ]"
    ],
    "ParentView": [
        "Local AAA server view"
    ],
    "ParaDef": [
        {
            "Parameters": "tftp",
            "Info": "Specifies the TFTP mode to transfer bills in the CF card to a bill server.\n-"
        },
        {
            "Parameters": "sftp",
            "Info": "Specifies the SFTP mode to transfer bills in the CF card to a bill server.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] local-aaa-server",
            "[~HUAWEI-local-aaa-server] bill-server 10.10.10.1 filename billfile user-name huawei password cipher Root@123 22",
            "[*HUAWEI-local-aaa-server] local-bill cfcard backup-mode sftp"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nDue to the limited capacity of the CF card, newly generated bills will be discarded if the number of bills exceeds the capacity of the CF card. The Router allows automatic transfer of bills in the CF card to a bill server when a specified bill alarm threshold or bill backup interval is reached.\nTo configure an automatic transfer mode, run the\nlocal-bill cfcard backup-mode command. Both TFPT and SFTP transfer modes are supported.\nTFTP is a simple file transfer protocol. It does not require authentication and has poor security.SFTP is more secure because it encrypts authentication information and data during transmission. Therefore, SFTP is recommended.\n\nPrerequisites\nA bill server has been configured using the bill-server ip-address filename file-name [ user-name user-name password cipher cipher-password port ] command.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}