{
    "PageTitle": "local-bill cache backup-mode",
    "FuncDef": "The local-bill cache backup-mode command configures the transfer mode for bills in the local bill pool.\nThe undo local-bill cache backup-mode command restores the default configuration.\nBy default, bills in the local bill pool are transferred to the CF card.",
    "CLIs": [
        "local-bill cache backup-mode { cfcard | none | tftp | sftp }",
        "undo local-bill cache backup-mode [ cfcard | none | tftp | sftp ]"
    ],
    "ParentView": [
        "Local AAA server view"
    ],
    "ParaDef": [
        {
            "Parameters": "cfcard",
            "Info": "Transfers bills in the local bill pool to the CF card.\n-"
        },
        {
            "Parameters": "none",
            "Info": "Indicates that bills in the local bill pool are not transferred.\n-"
        },
        {
            "Parameters": "tftp",
            "Info": "Transfers bills in the local bill pool to a bill server through TFTP.\n-"
        },
        {
            "Parameters": "sftp",
            "Info": "Transfers bills in the local bill pool to a bill server through SFTP.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] local-aaa-server",
            "[~HUAWEI-local-aaa-server] bill-server 10.10.10.1 filename billfile user-name huawei password cipher Root@123 22",
            "[*HUAWEI-local-aaa-server] local-bill cache backup-mode sftp"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, bills generated by the device are stored in the local bill pool. Due to the limited capacity of the local bill pool, the Router allows the automatic or manual transfer of bills in the local bill pool to the CF card or bill server at a scheduled interval, upon the generation of a bill alarm, or at a desired time. In this manner, the bills can be permanently saved.\nIf transfer to the CF card is configured, local bills can be transferred to the CF card on the master main control board, not on the slave main control board.\nIf transfer to a bill server is configured, local bills can only be transferred through either TFTP or SFTP. SFTP is recommended, because using TFTP is insecure.\nIf you do not need automatic transfer of bills in the local bill pool, specify the none parameter in the command. In this case, bills in the local bill pool will not be automatically transferred to the CF card or bill server. To perform manual backup when the local bill pool usage is high, run the local-bill cache backup command.\nPrerequisites\nA bill server has been configured using the bill-server ip-address filename file-name [ user-name user-name password cipher cipher-password port ] command if transfer to the bill server is required.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}