{
    "PageTitle": "local-bill alarm-threshold",
    "FuncDef": "The local-bill alarm-threshold command sets a bill alarm threshold for the usage of the local bill pool or CF card.\nThe undo local-bill alarm-threshold command restores the default value.\nBy default, the bill alarm threshold for the usage of the local bill pool or CF card is 75%.",
    "CLIs": [
        "local-bill { cache | cfcard } alarm-threshold <threshold>",
        "undo local-bill { cache | cfcard } alarm-threshold"
    ],
    "ParentView": [
        "Local AAA server view"
    ],
    "ParaDef": [
        {
            "Parameters": "cache",
            "Info": "Indicates the local bill pool.\n-"
        },
        {
            "Parameters": "cfcard",
            "Info": "Indicates the CF card.\n-"
        },
        {
            "Parameters": "threshold",
            "Info": "Sets a bill alarm threshold for the usage of the local bill pool or CF card.\nThe value is an integer ranging from 50 to100, in percentage."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] local-aaa-server",
            "[~HUAWEI-local-aaa-server] local-bill-pool enable",
            "[*HUAWEI-local-aaa-server] commit",
            "[~HUAWEI-local-aaa-server] local-bill cache alarm-threshold 50"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nDue to the limited capacity of the local bill pool or CF card, you are advised to set a bill alarm threshold to trigger automatic local bill transfer or remind you to perform manual local bill transfer.\nIf automatic local bill transfer is enabled, the device automatically transfers bills in the local bill pool or CF card to a bill server when the percentage of existing local bills reaches the alarm threshold. If none local bill transfer is enabled, manually transfer local bills to a bill server when or before a bill alarm is generated. If you do not transfer the local bills upon alarm generation, new bills will be discarded when the local bill pool or CF card is fully occupied.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}