{
    "PageTitle": "qos-profile time-range",
    "FuncDef": "The qos-profile time-range command configures the QoS profile (containing a time segment) bound to an access service template.\nThe undo time-range command removes the QoS profile (containing a time segment) bound to an access service template.\nBy default, no QoS profile containing a time segment is bound to an access service template.",
    "CLIs": [
        "qos-profile <profile-name> time-range <time-range-name>",
        "undo time-range [ <time-range-name> ]"
    ],
    "ParentView": [
        "Access service view"
    ],
    "ParaDef": [
        {
            "Parameters": "profile-name",
            "Info": "Specifies the name of a bound QoS profile.\nThe name is a string of 1 to 63 case-insensitive characters."
        },
        {
            "Parameters": "time-range-name",
            "Info": "Specifies the time segment name.\nThe name is a string of 1 to 32 case-sensitive characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] qos-profile q1",
            "[*HUAWEI-qos-profile-q1] commit",
            "[~HUAWEI-qos-profile-q1] quit",
            "[~HUAWEI] time-range t1 11:00 to 12:00 daily",
            "[*HUAWEI] commit",
            "[~HUAWEI] access-service huawei",
            "[*HUAWEI-access-huawei] qos-profile q1 time-range t1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the RADIUS server sends a name of an access service template to implement the QoS function, you can run the qos-profile time-range command to configure the QoS profile (containing a time segment) bound to an access service template.\nPrerequisites\nThe names of the QoS profile to be bound and the time segment have been created.\nConfiguration Impact\nIf this command is configured and the authentication response message sent by the RADIUS server includes the HW-Access-Service attribute, the traffic bandwidth restriction is based on the rule of the QoS profile containing a time segment.\nWhen the QoS profile not containing a time segment and the QoS profile containing a time segment in an access service template exist at the same time, the QoS profile containing a time segment has a higher priority than the QoS profile not containing a time segment.\nPrecautions\nIf an in-use QoS profile in an access service template is modified, the modification takes effect in real time. If all QoS profiles in an access service template are removed, the QoS profile that is previously bound with the user takes effect.\nEach access service template can be bound with up to 16 different time segments.\nThe command cannot be configured while the qos-profile is in time-range mode.\nThe command cannot be configured while the qos-profile is in 8cos-enhance mode.\nIn VS mode, this command is supported only by the admin VS."
}