{
    "PageTitle": "qos-profile(Access service view)",
    "FuncDef": "The qos-profile command configures the default QoS profile bound to an access service template.\nThe undo qos-profile command removes the default QoS profile bound to an access service template.\nBy default, the QoS profile with the index of 0 is bound to an access service template. This indicates that no QoS profile is bound to the access service template.",
    "CLIs": [
        "qos-profile <profile-name>",
        "undo qos-profile"
    ],
    "ParentView": [
        "Access service view"
    ],
    "ParaDef": [
        {
            "Parameters": "profile-name",
            "Info": "Specifies the name of a QoS profile.\nThe value is a string of 1 to 63 characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] qos-profile q1",
            "[*HUAWEI-qos-profile-q1] commit",
            "[~HUAWEI-qos-profile-q1] quit",
            "[~HUAWEI] access-service huawei",
            "[~HUAWEI-access-huawei] qos-profile q1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the RADIUS server sends a name of an access service template to implement the QoS function, you can run the qos-profile (access-service view) command to configure the default QoS profile bound to an access service template.\nPrerequisites\nThe QoS profile to be bound has been created.\nConfiguration Impact\nIf the default QoS profile used by an access service template is configured and the authentication response message sent by the RADIUS server includes the HW-Access-Service attribute, the traffic bandwidth restriction is based on the rule of the QoS profile bound to an access service template.\nPrecautions\nIf an in-use QoS profile in an access service template is modified, the modification takes effect in real time. If all QoS profiles in an access service template are removed, the QoS profile that is previously bound with the user takes effect.\nThe command cannot be configured while the qos-profile is in time-range mode.\nThe command cannot be configured while the qos-profile is in 8cos-enhance mode."
}