{
    "PageTitle": "radius-attribute decode-error-policy",
    "FuncDef": "The radius-attribute decode-error-policy ignore command configures a device to ignore a RADIUS attribute if the device fails to parse this attribute.\nThe undo radius-attribute decode-error-policy ignore command restores the default configuration.\nBy default, if a device fails to parse the HW-Data-Filter attribute in RADIUS packets, user authentication, re-authentication, and CoA operations all fail.",
    "CLIs": [
        "radius-attribute decode-error-policy ignore hw-data-filter",
        "undo radius-attribute decode-error-policy ignore [ hw-data-filter ]"
    ],
    "ParentView": [
        "RADIUS server group view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] radius-server group rd",
            "[*HUAWEI-radius-rd] commit",
            "[~HUAWEI-radius-rd] radius-attribute decode-error-policy ignore hw-data-filter"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe RADIUS server uses the HW-Data-Filter attribute to deliver dynamic ACL rules that specify forwarding behaviors for users. If a device fails to parse the HW-Data-Filter attribute, the device considers that the users' forwarding behaviors are uncontrollable. If this occurs, by default, the user authentication, re-authentication, and CoA operations all fail. As a result, users are logged out.\nIf basic access authorities have been configured on a device, and users' forwarding behaviors are still considered controllable even if the device fails to parse the HW-Data-Filter attribute, you can run the radius-attribute decode-error-policy ignore command to allow the device to ignore the HW-Data-Filter attribute. Therefore, the users can still stay online.\nConfiguration Impact\nThis command takes effect for subsequent login users and for CoA operations of online users.\nBefore this command is run, if the device fails to parse the HW-Data-Filter attribute, user authentication, re-authentication, and CoA operations all fail. After this command is run, even if the device fails to parse the HW-Data-Filter attribute, the device ignores the HW-Data-Filter attribute and processes users' forwarding behaviors as if no HW-Data-Filter attribute had been delivered.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}