{
    "PageTitle": "radius-attribute include accounting-request",
    "FuncDef": "The radius-attribute include accounting-request command configures a device to add the HW-Tunnel-Group-Name, HW-Client-Primary-DNS, or HW-Client-Secondary-DNS attribute to accounting requests sent to RADIUS servers.\nThe undo radius-attribute include accounting-request command restores the default configuration.\nBy default, the device does not add the HW-Tunnel-Group-Name, HW-Client-Primary-DNS, or HW-Client-Secondary-DNS attribute to accounting requests sent to RADIUS servers.",
    "CLIs": [
        "radius-attribute include { hw-tunnel-group-name | hw-client-primary-dns | hw-client-secondary-dns } accounting-request",
        "undo radius-attribute include { hw-tunnel-group-name | hw-client-primary-dns | hw-client-secondary-dns } accounting-request"
    ],
    "ParentView": [
        "RADIUS server group view"
    ],
    "ParaDef": [
        {
            "Parameters": "hw-tunnel-group-name",
            "Info": "Indicates the Huawei-proprietary No. 96 attribute, which identifies an L2TP or GRE group name.\n-"
        },
        {
            "Parameters": "hw-client-primary-dns",
            "Info": "Indicates the Huawei-proprietary No. 135 attribute, which identifies the IP address of a primary DNS server.\n-"
        },
        {
            "Parameters": "hw-client-secondary-dns",
            "Info": "Indicates the Huawei proprietary No. 136 attribute, which identifies the IP address of a secondary DNS server.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system",
            "[~HUAWEI] radius-server group g1",
            "[~HUAWEI-radius-g1] radius-attribute  include hw-tunnel-group-name accounting-request"
        ],
        [
            "<HUAWEI> system",
            "[~HUAWEI] radius-server group g1",
            "[~HUAWEI-radius-g1] radius-attribute  include hw-client-primary-dns accounting-request"
        ],
        [
            "<HUAWEI> system",
            "[~HUAWEI] radius-server group g1",
            "[~HUAWEI-radius-g1] radius-attribute  include hw-client-secondary-dns accounting-request"
        ]
    ],
    "ExtraInfo": "If you want a device to add the HW-Tunnel-Group-Name, HW-Client-Primary-DNS, HW-Client-Secondary-DNS attribute to accounting requests sent to RADIUS servers, run the radius-attribute include { hw-tunnel-group-name | hw-client-primary-dns | hw-client-secondary-dns } accounting-request command.\nIf an L2TP group name in the HW-Tunnel-Group-Name attribute identifies a carrier and the L2TP traffic statistics of the carrier need to be collected by L2TP group name, specify the hw-tunnel-group-name parameter.If accounting statistics need to be collected by DNS server address, specify the hw-client-primary-dns or hw-client-secondary-dns parameter."
}