{
    "PageTitle": "radius-attribute service-type value user-type ipoe",
    "FuncDef": "The radius-attribute service-type value user-type ipoe command configures the Service-Type attribute value as Outbound (5) in common IPoE users' authentication and accounting request packets sent to the RADIUS server.\nThe undo radius-attribute service-type value command restores the default configuration.\nBy default, the Service-Type attribute value is Framed (2) in common IPoE users' authentication and accounting request packets sent to the RADIUS server.",
    "CLIs": [
        "radius-attribute service-type value { value | outbound } user-type ipoe [ value-added-service ]",
        "undo radius-attribute service-type value [ { value | outbound } user-type ipoe ] [ value-added-service ]"
    ],
    "ParentView": [
        "RADIUS server group view"
    ],
    "ParaDef": [
        {
            "Parameters": "value",
            "Info": "Specifies the Service-Type attribute value.\nThe value is 5."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] radius-server group rd1",
            "[*HUAWEI-radius-rd1] commit",
            "[~HUAWEI-radius-rd1] radius-attribute service-type value outbound user-type ipoe"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure the Service-Type attribute value as Outbound (5) in common IPoE users' authentication and accounting request packets sent to the RADIUS server, run the radius-attribute service-type value command.\nTo configure the Service-Type attribute value as Outbound (5) in common IPoE users' authentication and accounting request packets sent to the RADIUS server for value added services, you must add the value-added-service keyword to the command.\nConfiguration Impact\nRunning the radius-attribute service-type value command or its undo form takes effect immediately for online users.\nThe command configuration does not take effect for:\nIPoE users that use EAP relay authenticationIPoE web re-authentication triggered by CoA packetsRADIUS packets sent for value-added services\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}