{
    "PageTitle": "radius-server coa update username",
    "FuncDef": "The radius-server coa update username command enables a BRAS to update user names based on those delivered in CoA messages and switch users to the domains carried in the RADIUS-delivered user names.\nThe undo radius-server coa update username command disables a BRAS from updating user names based on those delivered in CoA messages and switching users to the domains carried in the RADIUS-delivered user names.\nBy default, a BRAS discards CoA messages if user names carried in the CoA messages differ from those saved on the BRAS.",
    "CLIs": [
        "radius-server coa update username",
        "undo radius-server coa update username"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] radius-server coa update username"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn the web authentication scenario where a portal server cannot exchange authentication messages with a BRAS, you can configure the portal server to exchange authentication messages with a RADIUS server. To enable a BRAS to update user names based on those delivered in CoA messages and switch users to the domains carried in the RADIUS-delivered user names, run the radius-server coa update username command.\nAfter this command is run, if the user names carried in CoA messages differ from the existing ones, the BRAS adopts the RADIUS-delivered user names and switches the users to the domains carried in the user names (The user names must be in the format of username<domain). If the user names do not carry a domain name, the BRAS switches users to the post-authentication domain configured on the BAS interface through which users go online.After the radius-server coa update username command is run, the RADIUS server stops accounting in the pre-authentication domain, but starts accounting for the users with RADIUS-delivered user names in the post-authentication domain.\n\nFollow-up Procedure\nAfter a user is switched to the post-authentication domain, only the user name, domain name, and accounting scheme are updated by default. You can run the redirect-domain effect-attribute command to enable specified attributes to take effect in the post-authentication domain. Currently, only qos-profile, user-group, and web-url attributes are supported.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}