{
    "PageTitle": "radius-attribute assign hw-mng-ipv6 pppoe motm",
    "FuncDef": "The radius-attribute assign hw-mng-ipv6 pppoe motm command configures the hw-mng-ipv6 attribute to be encapsulated into a PPP packet's MTOM field.\nThe undo radius-attribute assign command restores the default configuration.\nBy default, the hw-mng-ipv6 is not encapsulated into a ppp packet.",
    "CLIs": [
        "radius-attribute assign hw-mng-ipv6 pppoe motm [ encap-format <format-sting> <delimiter> | exclude local ] *",
        "undo radius-attribute assign hw-mng-ipv6 [ pppoe motm [ encap-format <format-sting> <delimiter> | exclude local ] * ]"
    ],
    "ParentView": [
        "RADIUS server group view"
    ],
    "ParaDef": [
        {
            "Parameters": "encap-format format-sting",
            "Info": "Specifies the encapsulation format and name.\nThe value is a string of 1 to 31 characters."
        },
        {
            "Parameters": "delimiter",
            "Info": "Specifies a delimiter.\nThe length is 1 byte."
        },
        {
            "Parameters": "local",
            "Info": "Indicates that the local configuration is excluded.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] radius-server group huawei",
            "[*HUAWEI-radius-huawei] commit",
            "[~HUAWEI-radius-huawei] radius-attribute assign hw-mng-ipv6 pppoe motm"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe IETF defines that a RADIUS attribute is encapsulated in a certain option, and the device encapsulates a RADIUS attribute in a default option. To configure a specified RADIUS attribute to be encapsulated in a specified option, run the radius-attribute assign command.\nLink Account in the HW-MNG-IPv6 attribute can be encapsulated in specified options in packets to be sent to the clients.\nIf the IETF does not define the code of an option in which a RADIUS attribute is encapsulated, you can run this command to configure the RADIUS attribute to be encapsulated in a user-defined option. If the device encapsulates a RADIUS attribute in an option with a default code and you want to encapsulate the RADIUS attribute in another option, you can run this command.\nConfiguration Impact\nThe radius-attribute assign command takes effect for users who go online after the command is configured.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}