{
    "PageTitle": "radius-server accounting-start-packet send after-ppp",
    "FuncDef": "The radius-server accounting-start-packet send after-ppp command configures the device to send Accounting Start packets to the RADIUS server after NCP goes Up for PPPv6 users that use DHCPv6 to obtain IPv6 addresses.\nThe undo radius-server accounting-start-packet send after-ppp command restores the default configuration.\nBy default, the device sends Accounting Start packets to the RADIUS server after DHCPv6 goes Up for PPPv6 users that use DHCPv6 to obtain IPv6 addresses.",
    "CLIs": [
        "radius-server accounting-start-packet send after-ppp",
        "undo radius-server accounting-start-packet send after-ppp"
    ],
    "ParentView": [
        "RADIUS server group view"
    ],
    "ParaDef": [
        {
            "Parameters": "after-ppp",
            "Info": "Indicates that the device sends Accounting Start packets to the RADIUS server after NCP goes Up for PPPv6 users that use DHCPv6 to obtain IPv6 addresses.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] radius-server group group1",
            "[*HUAWEI-radius-group1] commit",
            "[~HUAWEI-radius-group1] radius-server accounting-start-packet send after-ppp"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf PPPv6 users apply for IPv6 addresses using DHCPv6 and the RADIUS server delivers the IPv6 addresses to the PPPv6 users, but the DHCPv6 protocol is not Up so that Accounting Start packets cannot be sent, the PPPv6 users may go online through addresses not assigned by the DHCPv6 server. To allow the device to send Accounting Start packets to the RADIUS server after NCP goes Up and to send real-time accounting packets after DHCPv6 goes Up, run the radius-server accounting-start-packet command.\nConfiguration Impact\nThe device sends Accounting Start packets to the RADIUS server after NCP goes Up for PPPv6 users that use DHCPv6 to obtain IPv6 addresses.\nThis function takes effect for new access users but does not take effect for users waiting for DHCPv6 to go Up.\nPrecautions\nAfter this command is run, the device sends Accounting Start packets to the RADIUS server after NCP goes Up for PPPv6 users that use DHCPv6 to obtain IPv6 addresses. At this time, the PPPv6 users have not obtained the IPv6 addresses, and therefore the Accounting Start packets do not carry IPv6 addresses. Running the radius-server accounting-start-packet command together with the radius-attribute delegated-ipv6-prefix encapsulation-method version2 command is recommended so that the accounting packets will carry the IPv6 addresses delivered by the RADIUS server.\nIn VS mode, this command is supported only by the admin VS."
}