{
    "PageTitle": "radius-attribute apply user-name",
    "FuncDef": "The radius-attribute apply user-name match user-type command configures the device to replace the user name generated on the device with the user name delivered by the RADIUS server.\nThe undo radius-attribute apply user-name match user-type command restores the default configuration.\nBy default, the device replaces only the EAP or RADIUS proxy user name with the user name delivered by the RADIUS server.",
    "CLIs": [
        "radius-attribute apply user-name match user-type ipoe [ priority-high ]",
        "radius-attribute apply user-name match user-type pppoe",
        "undo radius-attribute apply user-name match user-type ipoe [ priority-high ]",
        "undo radius-attribute apply user-name match user-type pppoe"
    ],
    "ParentView": [
        "RADIUS server group view"
    ],
    "ParaDef": [
        {
            "Parameters": "pppoe",
            "Info": "Replaces the PPPoE user name with the user name delivered by the RADIUS server.\n-"
        },
        {
            "Parameters": "ipoe",
            "Info": "Replaces the IPoE user name with the user name delivered by the RADIUS server.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] radius-server group group1",
            "[*HUAWEI-radius-group1] radius-attribute apply user-name match user-type ipoe"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen the device communicates with the RADIUS server, but the user name generated on the device cannot be accepted by the RADIUS server, you can run the radius-attribute apply user-name command to configure the device to replace the original user name with the user name in the RADIUS attribute No.1 delivered by the RADIUS server.\nIf priority-high is configured, the user name delivered by the RADIUS server is preferentially used after the device is enabled to encapsulate a user name into the Option 60 field using the service-identify dhcp-option60 command.\nConfiguration Impact\nAfter a user is authenticated by the RADIUS server, its user name will be replaced by the one delivered by the RADIUS server for accounting purposes.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nOnly the user name is replaced. The domain name remains unchanged."
}