{
    "PageTitle": "radius-server accounting cache",
    "FuncDef": "The radius-server accounting cache command configures the maximum number of accounting packets that can be cached.\nThe undo radius-server accounting cache command restores the default configuration.\nBy default, a maximum of 4096 users' accounting packets or 8192 accounting packets can be cached.",
    "CLIs": [
        "radius-server accounting cache <max-packet-number>",
        "undo radius-server accounting cache <max-packet-number>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "max-packet-number",
            "Info": "Specifies the maximum number of accounting packets that can be cached.\nThe value is an integer ranging from 8192 to 256000."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] radius-server accounting cache 16000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn RADIUS accounting scenarios, a maximum of 4096 users' accounting packets or 8192 accounting packets can be cached by default. Accounting packets are classified as accounting start, real-time accounting, or accounting stop packets. To configure the maximum number of accounting packets that can be cached, run the radius-server accounting cache command.\nConfiguration Impact\nIf the value specified by max-packet-number is not 8192, the number of users is subject to the device specification.\nIf the number of cached packets on a device reaches the value specified by max-packet-number, the device releases the earliest user's all packets from the cache queue and caches newly generated accounting packets.\nPrecautions\nIf the value specified by is less than the number of cached packets, the command configuration fails. If the value specified by is 8192 or the undo radius-server accounting cache command is run, the system checks the number of users whose packets are cached. If the number of users whose packets are cached is greater than 4096, the command configuration fails.\nIf the maximum number of accounting packets that can be cached is set to a large value, many memory resources are consumed when the number of cached accounting packets increases. Therefore, you must properly set the maximum number of accounting packets that can be cached.\nIn VS mode, this command is supported only by the admin VS."
}