{
    "PageTitle": "radius-attribute",
    "FuncDef": "The radius-attribute command configures the mode of encapsulating user IP addresses.\nundo radius-attribute command restores the default configuration.\nBy default, a user address is encapsulated in version 1 mode. Only an effective address for which a routing entry has been generated can be encapsulated into the attributes of the RADIUS server. Without an effective address, the attributes will not be delivered by the RADIUS server.",
    "CLIs": [
        "radius-attribute { framed-ip-address | delegated-ipv6-prefix } encapsulation-method { version1 | version2 }",
        "undo radius-attribute { framed-ip-address | delegated-ipv6-prefix } encapsulation-method version2"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "framed-ip-address",
            "Info": "Indicates the attributes of a user's IPv4 address.\n-"
        },
        {
            "Parameters": "delegated-ipv6-prefix",
            "Info": "Indicates the attributes of Delegated-IPv6-Prefix.\n-"
        },
        {
            "Parameters": "encapsulation-method",
            "Info": "Indicates the mode of encapsulating the attributes of IP addresses.\n-"
        },
        {
            "Parameters": "version1",
            "Info": "Indicates that a user address is encapsulated in version 1 mode by default, which means only an effective address can be encapsulated into the attributes of the RADIUS server.\n-"
        },
        {
            "Parameters": "version2",
            "Info": "Indicates that encapsulating attributes in version 2 mode requires an effective address for encapsulation. Without an effective address, use the ineffective address delivered by a RADIUS server for encapsulation. Without either address, the attributes will not be delivered by the RADIUS server.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] radius-attribute framed-ip-address encapsulation-method version2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe radius-attribute command configures an encapsulation mode for user IP addresses.\nEncapsulating attributes in version 2 mode requires an effective address for encapsulation. Without an effective address, use the ineffective address delivered by a RADIUS server for encapsulation.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}