{
    "PageTitle": "radius-attribute apply framed-ipv6-pool match pool-type",
    "FuncDef": "The radius-attribute apply framed-ipv6-pool match pool-type command configures an IPv6 address pool to be delivered by a RADIUS server using the Framed-Ipv6-Pool attribute to replace the IPv6 address pools of the same type configured in a domain.\nThe undo radius-attribute apply framed-ipv6-pool match pool-type command restores the default configuration.\nBy default, an IPv6 address pool delivered by a RADIUS server using the Framed-Ipv6-Pool attribute replaces all IPv6 address pools configured in the domain.",
    "CLIs": [
        "radius-attribute apply framed-ipv6-pool match pool-type",
        "undo radius-attribute apply framed-ipv6-pool match pool-type"
    ],
    "ParentView": [
        "RADIUS server group view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] radius-server group g1",
            "[*HUAWEI-radius-g1] commit",
            "[~HUAWEI-radius-g1] radius-attribute apply framed-ipv6-pool match pool-type"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf you want to use an IPv6 address pool delivered by a RADIUS server using the Framed-Ipv6-Pool attribute and IPv6 address pools configured in the domain to assign IPv6 addresses to users, run the radius-attribute apply framed-ipv6-pool match pool-type command. For example, you want to use an IPv6 address pool configured in the domain to assign IPv6 addresses through ND to users and a PD address pool delivered by the RADIUS server using the Framed-Ipv6-Pool attribute. After you configure the radius-attribute apply framed-ipv6-pool match pool-type command, the PD address pool replaces only the PD address pools configured in the domain. If the type of an IPv6 address pool delivered by the RADIUS server is bas local, the delivered IPv6 address pool replaces the IPv6 address pools of the bas local type configured in the domain. If the type of an IPv6 address pool delivered by the RADIUS server is bas delegation pd, the delivered IPv6 address pool replaces the IPv6 address pools of the bas delegation pd type configured in the domain. If the type of an IPv6 address pool delivered by the RADIUS server is bas delegation slaac, the delivered IPv6 address pool replaces the IPv6 address pools of the bas delegation slaac type configured in the domain.\nConfiguration Impact\nThis command takes effect only to the users that go online after the command is configured.\nAfter you configure this command in a RADIUS server group, all domains related to the RADIUS server group use the same IPv6 address pool replacing policy. To enable each domain to use a unique policy, configure multiple RADIUS server groups.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}