{
    "PageTitle": "radius-server type",
    "FuncDef": "The radius-server type command sets the RADIUS version used between the device and a RADIUS server.\nThe undo radius-server type command restores the default configuration.\nBy default, the RADIUS version is standard.",
    "CLIs": [
        "radius-server type { standard | plus10 | plus11 }",
        "undo radius-server type [ plus10 | plus11 ]"
    ],
    "ParentView": [
        "RADIUS server group view"
    ],
    "ParaDef": [
        {
            "Parameters": "standard",
            "Info": "Indicates that RADIUS of the standard version that based on relevant standards is used between the device and the RADIUS server. This version is used to set a standard server.\n-"
        },
        {
            "Parameters": "plus10",
            "Info": "Indicates that RADIUS+1.0 is used between the device and the RADIUS server.\nRADIUS+1.0 is a Huawei private RADIUS protocol, compatible with the early versions in which the standard vendor-ID is not defined. For the RADIUS attributes supported by this version, see \"RADIUS Attributes\" in the Feature Description - User Access.\n-"
        },
        {
            "Parameters": "plus11",
            "Info": "Indicates that RADIUS+1.1 is used between the device and the RADIUS server.\nRADIUS+1.1 is an extension of relevant standards, supporting more Huawei private RADIUS attributes. For the RADIUS attributes supported by this version, see \"RADIUS Attributes\" in the Feature Description - User Access.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] radius-server group huawei",
            "[*HUAWEI-radius-huawei] commit",
            "[~HUAWEI-radius-huawei] radius-server type standard"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the device connects to a RADIUS server, run the radius-server type command to set a RADIUS version. RADIUS attributes vary with versions of the RADIUS protocol.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}