{
    "PageTitle": "radius-attribute vendor",
    "FuncDef": "The radius-attribute vendor continuous command enables the device to carry multiple proprietary attributes in RADIUS attribute 26.\nThe undo radius-attribute vendor continuous command enables the device to carry only one proprietary attribute in RADIUS attribute 26.\nBy default, the device to carry multiple proprietary attributes in RADIUS attribute 26 is enabled.",
    "CLIs": [
        "radius-attribute vendor { { huawei | microsoft | 3gpp2 | redback | dslforum | other } * | { all } } continuous",
        "undo radius-attribute vendor { { huawei | microsoft | 3gpp2 | redback | dslforum | other } * | { all } } continuous"
    ],
    "ParentView": [
        "RADIUS server group view"
    ],
    "ParaDef": [
        {
            "Parameters": "huawei",
            "Info": "Indicates the Huawei proprietary attribute.\n-"
        },
        {
            "Parameters": "microsoft",
            "Info": "Indicates the Microsoft proprietary attribute.\n-"
        },
        {
            "Parameters": "3gpp2",
            "Info": "Indicates the 3GPP2 proprietary attribute.\n-"
        },
        {
            "Parameters": "redback",
            "Info": "Indicates the RedBack proprietary attribute.\n-"
        },
        {
            "Parameters": "dslforum",
            "Info": "Indicates the DSLForum proprietary attribute.\n-"
        },
        {
            "Parameters": "other",
            "Info": "Indicates the other proprietary attributes except the Huawei proprietary attribute, the Microsoft proprietary attribute, the 3GPP2 proprietary attribute, the RedBack proprietary attribute and the DSLForum proprietary attribute.\n-"
        },
        {
            "Parameters": "all",
            "Info": "Indicates all the proprietary attribute.\n-"
        },
        {
            "Parameters": "continuous",
            "Info": "Enables RADIUS attribute 26 to carry multiple proprietary attributes.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] radius-server group huawei",
            "[*HUAWEI-radius-huawei] commit",
            "[~HUAWEI-radius-huawei] radius-attribute vendor huawei continuous"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo allow the device to connect to a non-Huawei RADIUS server that cannot parse consecutive proprietary attributes in packets, run the radius-attribute vendor continuous command to enable the device to carry multiple proprietary attributes in RADIUS attribute 26.\nConfiguration Impact\nAfter the radius-attribute vendor continuous continuous command is used on the , RADIUS attribute 26 carries multiple proprietary attributes in a packet sent to the non-Huawei RADIUS server.\nIf the radius-attribute vendor continuous command is run more than once, the latest configuration does not override previous one.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}