{
    "PageTitle": "radius-server user-name trust-server-request",
    "FuncDef": "The radius-server user-name trust-server-request command configures the device to reply with a CoA/DM response packet that carries the same user name as that in a CoA/DM request packet.\nThe undo radius-server user-name trust-server-request command restores the default configuration.\nBy default, a CoA ACK response packet carries a locally configured user name, irrespective of whether a CoA request packet carries a user name. The locally configured user name is independent of the radius-server username original command configuration. A DM ACK response packet carries a user name only if a DM request packet carries a user name.",
    "CLIs": [
        "radius-server user-name trust-server-request [ no-exist-policy attach-local { coa | dm } * ]",
        "undo radius-server user-name trust-server-request [ no-exist-policy attach-local { coa | dm } * ]"
    ],
    "ParentView": [
        "RADIUS server group view"
    ],
    "ParaDef": [
        {
            "Parameters": "no-exist-policy",
            "Info": "Configures a user name adding policy if a CoA request packet does not carry a user name.\n-"
        },
        {
            "Parameters": "attach-local",
            "Info": "Adds a locally stored user name in a CoA/DM response packet.\n-"
        },
        {
            "Parameters": "coa",
            "Info": "Configures a user name adding policy for CoA response packets.\n-"
        },
        {
            "Parameters": "dm",
            "Info": "Configures a user name adding policy for DM response packets.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] radius-server group group1",
            "[*HUAWEI-radius-group1] radius-server user-name trust-server-request"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the device connects to a RADIUS server and is required to add a user name to a CoA/DM response packet, run the radius-server user-name trust-server-request command on the .\nConfiguration Impact\nAfter the radius-server user-name trust-server-request command is run, a CoA/DM response packet carries the same user name as that in a CoA/DM request packet. If a CoA/DM request packet does not carry a user name, a CoA/DM response packet will not carry a user name.\nAfter the radius-server user-name trust-server-request no-exist-policy attach-local coa command is run, if a CoA request packet does not carry a user name, a CoA response packet will carry a locally stored user name for the corresponding user.\nAfter the radius-server user-name trust-server-request no-exist-policy attach-local dm command is run, if a DM request packet does not carry a user name, a DM response packet will carry a locally stored user name for the corresponding user.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nThe RADIUS server group for which radius-server user-name trust-server-request command is configured must have been specified when you configure a RADIUS authorization server."
}