{
    "PageTitle": "radius-server accounting-interim-packet",
    "FuncDef": "The radius-server accounting-interim-packet command enables RADIUS real-time accounting packet caching and configures the number of real-time accounting packet retransmissions.\nThe undo radius-server accounting-interim-packet command restores the default configuration.\nBy default, RADIUS real-time accounting packet caching is disabled.",
    "CLIs": [
        "radius-server accounting-interim-packet resend [ <resend-number> ]",
        "undo radius-server accounting-interim-packet resend [ <resend-number> ]"
    ],
    "ParentView": [
        "RADIUS server group view"
    ],
    "ParaDef": [
        {
            "Parameters": "resend resend-number",
            "Info": "Specifies the number of real-time accounting packet retransmissions.\nThe value is an integer ranging from 1 to 65535. The default value is 50."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] radius-server group huawei",
            "[*HUAWEI-radius-huawei] commit",
            "[~HUAWEI-radius-huawei] radius-server accounting-interim-packet resend 60"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn RADIUS accounting scenarios, if the link between the RADIUS server and device fails or is busy, the device caches real-time accounting packets that fail to be sent. The device sends the packets to the RADIUS server after the link recovers.\nConfiguration Impact\nIf the device fails to send real-time accounting packets to the RADIUS server after the radius-server accounting-interim-packet command is run, the device caches the packets to a queue and retransmits them at a certain interval. If the number of a real-time accounting packet's retransmissions reaches the value specified by the parameter resend-number and the packet still fails to be sent, the device discards the packet.\nAfter the radius-server accounting-interim-packet command is run, the maximum number of accounting start and stop packets that can be cached is reduced, because real-time accounting packets consume the system caching space.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}