{
    "PageTitle": "radius-attribute hw-domain-name update-username",
    "FuncDef": "The radius-attribute hw-domain-name update-username command configures devices in a RADIUS server group to replace the domain name carried in a user name with the domain name delivered by the RADIUS server.\nThe undo radius-attribute hw-domain-name update-username command restores the default configuration.\nBy default, the domain name carried in a user name is not replaced by the domain name delivered by the RADIUS server.",
    "CLIs": [
        "radius-attribute hw-domain-name update-username",
        "undo radius-attribute hw-domain-name update-username"
    ],
    "ParentView": [
        "RADIUS server group view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] radius-server group huawei",
            "[*HUAWEI-radius-huawei] commit",
            "[~HUAWEI-radius-huawei] radius-attribute hw-domain-name update-username"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen the user-max-session max-session-number command is run in the RADIUS authentication domain view to limit the number of users who go online using the same user name, the number of users will not be limited if user names carry domain names. That is because users who use the same user name to go online through different domains are considered different users. To configure devices in a RADIUS server group to replace the domain name carried in a user name with the domain name delivered by the RADIUS server so that the number of users is limited, run the radius-attribute hw-domain-name update-username command.\nConfiguration Impact\nAfter you run this command, the domain name carried in a user name will be replaced by the domain name delivered by the RADIUS server. When users use the same user name to go online through different domains, their domain names will be replaced by the domain name delivered by the RADIUS server. Therefore, these users will have the same user name+domain name and will be limited by the user-max-session max-session-number command configuration.\nThis command takes effect only for subsequent access users.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}