{
    "PageTitle": "radius-attribute assign hw-pcp-server-name",
    "FuncDef": "The radius-attribute assign hw-pcp-server-name command configures the HW-PCP-Server-Name attribute to be encapsulated into a specified DHCP/DHCPv6 option.\nThe undo radius-attribute assign command restores the default configuration.\nBy default, a RADIUS attribute is encapsulated in a specified DHCP/DHCPv6 option in a default encapsulation mode or ppp packet.",
    "CLIs": [
        "radius-attribute assign hw-pcp-server-name { dhcp <dhcp-option-code> | dhcpv6 <dhcpv6-option-code> }",
        "undo radius-attribute assign hw-pcp-server-name { dhcp | dhcpv6 }"
    ],
    "ParentView": [
        "RADIUS server group view"
    ],
    "ParaDef": [
        {
            "Parameters": "dhcp dhcp-option-code",
            "Info": "Specifies a DHCPv4 option code.\nThe value is an integer ranging from 2 to 254, excluding 3, 6, 15, 44, 46, 50-54, 57-60, and 82."
        },
        {
            "Parameters": "dhcpv6 dhcp-option-code",
            "Info": "Specifies a DHCPv6 option code.\nThe value is an integer ranging from 15 to 65535, excluding 18-20, 23-26, and 37-38."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] radius-server group huawei",
            "[*HUAWEI-radius-huawei] commit",
            "[~HUAWEI-radius-huawei] radius-attribute assign hw-pcp-server-name dhcp 180"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe IETF defines that a RADIUS attribute is encapsulated in a certain option, and the device encapsulates a RADIUS attribute in a default option. To configure a specified RADIUS attribute to be encapsulated in a specified DHCP/DHCPv6 option, run the radius-attribute assign command.\nLink Account in the HW-PCP-Server-Name attribute can be encapsulated in specified options in packets to be sent to the DHCP clients.\nIf the IETF does not define the code of an option in which a RADIUS attribute is encapsulated, you can run this command to configure the RADIUS attribute to be encapsulated in a user-defined option. If the device encapsulates a RADIUS attribute in an option with a default code and you want to encapsulate the RADIUS attribute in another option, you can run this command.\nConfiguration Impact\nThe radius-attribute assign command takes effect for users who go online after the command is configured.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}