{
    "PageTitle": "radius-server accounting cache retransmit",
    "FuncDef": "The radius-server accounting cache retransmit command configures an interval at which cached RADIUS accounting packets are retransmitted and the number of users for each packet retransmission.\nThe undo radius-server accounting cache retransmit command restores the default configuration.\nThe default interval at which cached RADIUS accounting packets are retransmitted and the default number of users for each packet retransmission are 10s and 1, respectively.\nBy default,theinterval at which cached RADIUS accounting packets are retransmitted and the default number of users for each packet retransmission are 10s and 1, respectively.",
    "CLIs": [
        "radius-server accounting cache retransmit <retransmit> timeout <timeout>",
        "undo radius-server accounting cache retransmit [ retransmit timeout <timeout> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "retransmit retransmit",
            "Info": "Specifies the number of users for each packet retransmission.\nThe value is an integer ranging from 1 to 30. The default value is 1."
        },
        {
            "Parameters": "timeout timeout",
            "Info": "Specifies an interval at which cached RADIUS accounting packets are retransmitted.\nThe value is an integer ranging from 1 to 10, in seconds. The default value is 10."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] radius-server accounting cache retransmit 10 timeout 4"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a large value is configured for the maximum number of accounting packets that can be cached in the radius-server accounting cache max-packet-number command, you can run the radius-server accounting cache retransmit command to configure an interval at which cached RADIUS accounting packets are retransmitted and the number of users for each packet retransmission, improving packet transmission performance.\nConfiguration Impact\nAfter the radius-server accounting cache retransmit command is run, cached RADIUS accounting packets of the number of users specified by retransmit are retransmitted at the interval specified by timeout.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}