{
    "PageTitle": "radius-attribute policy-name no-exist-policy",
    "FuncDef": "The radius-attribute policy-name no-exist-policy command configures a policy for access users if the policy name carried in the HUAWEI-95 attribute delivered by the RADIUS server does not exist.\nundo radius-attribute policy-name no-exist-policy command restores the default configuration.\nBy default, access users are forced offline if the policy name carried in the HUAWEI-95 attribute delivered by the RADIUS server does not exist.",
    "CLIs": [
        "radius-attribute policy-name no-exist-policy { online | offline }",
        "undo radius-attribute policy-name no-exist-policy [ online ]"
    ],
    "ParentView": [
        "RADIUS server group view"
    ],
    "ParaDef": [
        {
            "Parameters": "online",
            "Info": "Allows users online if the policy name carried in the HUAWEI-95 attribute delivered by the RADIUS server does not exist.\n-"
        },
        {
            "Parameters": "offline",
            "Info": "Forces users offline if the policy name carried in the HUAWEI-95 attribute delivered by the RADIUS server does not exist.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] radius-server group group1",
            "[*HUAWEI-radius-group1] commit",
            "[~HUAWEI-radius-group1] radius-attribute policy-name no-exist-policy online"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo determine whether access users are allowed online or offline if the policy name carried in the HUAWEI-95 attribute delivered by the RADIUS server does not exist, run the radius-attribute policy-name no-exist-policy command.\nConfiguration Impact\nIf the radius-attribute policy-name no-exist-policy online command is run and the policy name carried in the HUAWEI-95 attribute delivered by the RADIUS server does not exist on the NE40E, users are allowed online, and the policy configured for the domain takes effect.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nAfter the radius-attribute hw-policy-name support-type edsg command is run, the radius-attribute policy-name no-exist-policy offline command configuration does not take effect for EDSG services."
}