{
    "PageTitle": "radius-attribute usermac-as-option61",
    "FuncDef": "The radius-attribute usermac-as-option61 command allows the device to encapsulate the Option61 field into the No.153 proprietary attribute on the RADIUS server, hw-user-mac attribute. If you also configure the client-option82 version1 command on the BAS interface, the client-id information (DHCPv4 Option61/DHCPv6 Option1/PPPoE PADR Tag 0x0103 Host-unique) is encapsulated into the Class attributes in RADIUS accounting packets.\nThe undo radius-attribute usermac-as-option61 command cancels the configuration.\nBy default, the MAC address is directly encapsulated into the hw-user-mac attribute, and the client-id information is not encapsulated into the Class attributes in RADIUS accounting packets.",
    "CLIs": [
        "radius-attribute usermac-as-option61",
        "undo radius-attribute usermac-as-option61"
    ],
    "ParentView": [
        "RADIUS server group view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] radius-server group huawei",
            "[*HUAWEI-radius-huawei] radius-attribute usermac-as-option61"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen the device is connected to a non-Huawei device that supports a different hw-user-mac attribute format, run the radius-attribute usermac-as-option61 command to allow the device to encapsulate the Option61 field into the hw-user-mac attribute.\nConfiguration Impact\nIf an operator's accounting system requires the Class attribute to encapsulate the client-id information (DHCPv4 Option61/DHCPv6 Option1/PPPoE PADR Tag 0x0103 Host-unique), configure the\nradius-attribute usermac-as-option61 command in the RADIUS server group view and configure the\nclient-option82 version1 command on the BAS interface. After the two commands are run, the client-id information is encapsulated into the Class attributes in RADIUS accounting packets.\nThe RADIUS server sends an authentication request packet carrying the Class attribute to the BRAS. The BRAS encapsulates the received Class attribute into an accounting request packet. Currently, the device supports eight Class attributes.\nIf RADIUS authentication is used, the BRAS encapsulates the client-id information into the Class attribute in a RADIUS accounting packet only when the number of Class attributes in the RADIUS authentication request packet is less than or equal to seven and the client has the client-id information. If only accounting is used, the BRAS encapsulates the client-id information into the Class attribute in a RADIUS accounting packet only if the client has the client-id information.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}