{
    "PageTitle": "radius-attribute assign class",
    "FuncDef": "The radius-attribute assign class pppoe motm command configures the class attribute to be encapsulated into a PPP packet's MTOM field.\nThe undo radius-attribute assign command restores the default configuration.\nBy default, a RADIUS attribute is not encapsulated into a ppp packet.",
    "CLIs": [
        "radius-attribute assign class partial-match <string-value> pppoe motm [ encap-format <format-sting> <delimiter> | exclude local ] *",
        "undo radius-attribute assign class partial-match <string-value> pppoe motm [ encap-format <format-sting> <delimiter> | exclude local ] *"
    ],
    "ParentView": [
        "RADIUS server group view"
    ],
    "ParaDef": [
        {
            "Parameters": "encap-format format-sting",
            "Info": "Specify the encapsulating name.\nThe value is a string of 1 to 31 characters."
        },
        {
            "Parameters": "delimiter",
            "Info": "Specifies the encapsulation format and name.\nThe value is a string of 1 to 31 characters."
        },
        {
            "Parameters": "local",
            "Info": "Indicates that the local configuration is excluded.\n-"
        },
        {
            "Parameters": "partial-match string-value",
            "Info": "Specifies the character string for approximate string matching.\nThe value is a string of 1 to 31 characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] radius-server group huawei",
            "[*HUAWEI-radius-huawei] commit",
            "[~HUAWEI-radius-huawei] radius-attribute assign class partial-match opq pppoe motm"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nLink Account in the Class attribute can be encapsulated in specified options in packets to be sent to the clients.\nIf the IETF does not define the code of an option in which a RADIUS attribute is encapsulated, you can run this command to configure the RADIUS attribute to be encapsulated in a user-defined option. If the device encapsulates a RADIUS attribute in an option with a default code and you want to encapsulate the RADIUS attribute in another option, you can run this command.\nConfiguration Impact\nThe radius-attribute assign command takes effect for users who go online after the command is configured.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}