{
    "PageTitle": "radius-attribute hw-policy-name support-type",
    "FuncDef": "The radius-attribute hw-policy-name support-type command configures the HW-Policy-Name attribute to carry the EDSG service policy name.\nThe undo radius-attribute hw-policy-name support-type command restores the default configuration.\nBy default, the HW-Policy-Name attribute cannot send or deliver the EDSG service policy name.",
    "CLIs": [
        "radius-attribute hw-policy-name support-type edsg first",
        "radius-attribute hw-policy-name support-type edsg",
        "undo radius-attribute hw-policy-name support-type edsg first",
        "undo radius-attribute hw-policy-name support-type edsg"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "edsg",
            "Info": "Configures the HW-Policy-Name attribute to carry the EDSG service policy name.\n-"
        },
        {
            "Parameters": "first",
            "Info": "Indicates that only the EDSG service policy name is effective in the case that the DAA service policy name, BOD service policy name, and EDSG service policy name are the same in the HW-Policy-Name attribute.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] radius-attribute hw-policy-name support-type edsg"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] radius-attribute hw-policy-name support-type edsg first"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo allow the HW-Policy-Name attribute to carry the EDSG service policy name, run the radius-attribute hw-policy-name command so that EDSG services can function the same as the existing DAA and BOD services on server interfaces.\nIf the first parameter is set, only the EDSG service policy name is effective in the case that the DAA service policy name, BOD service policy name, and EDSG service policy name are the same in the HW-Policy-Name attribute.\nConfiguration Impact\nAfter the HW-Policy-Name attribute is configured to carry the EDSG service policy name, the following situations become available:\nThe RADIUS authentication response packets or CoA packets use the HW-Policy-Name attribute to deliver the EDSG service policy name to activate services.The DM packets use the HW-Policy-Name attribute to deliver the EDSG service policy name to activate services.The RADIUS packets for requesting EDSG service authentication, prepaid quota, and accounting use the HW-Policy-Name attribute to send the EDSG service policy name.\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}