{
    "PageTitle": "radius-server accounting cache-warning-threshold",
    "FuncDef": "The radius-server accounting cache-warning-threshold command enables the accounting packet cache alarm function and configures an alarm threshold and a clear alarm threshold. If the accounting packet cache usage reaches the configured alarm threshold, an alarm is reported.\nThe undo radius-server accounting cache-warning-threshold command restores the default configuration.\nBy default, the accounting packet cache alarm function is disabled.",
    "CLIs": [
        "radius-server accounting cache-warning-threshold upper-limit <upper-limit> lower-limit <lower-limit>",
        "undo radius-server accounting cache-warning-threshold upper-limit <upper-limit> lower-limit <lower-limit>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "upper-limit upper-limit",
            "Info": "Specifies an alarm threshold.\nThe value is an integer ranging from 1 to 100, in percentage."
        },
        {
            "Parameters": "lower-limit lower-limit",
            "Info": "Specifies a clear alarm threshold.\nThe value is an integer ranging from 0 to 99, in percentage."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] radius-server accounting cache-warning-threshold upper-limit 75 lower-limit 70"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn RADIUS accounting scenarios, if accounting packet caching is enabled and the link between the RADIUS server and device fails or is busy, the device caches accounting packets that fail to be sent. If the ratio of the number of cached packets to the maximum number of packets that can be cached reaches the configured alarm threshold, an alarm is reported.\nConfiguration Impact\nIf the ratio of the number of cached packets to the value specified using the radius-server accounting cache max-packet-number command is greater than or equal to the value specified by upper-limit after the radius-server accounting cache-warning-threshold command is run, an alarm is reported. If the ratio of the number of cached packets to the value specified using the radius-server accounting cache max-packet-number command is less than or equal to the value specified by lower-limit, a clear alarm is reported. If lower-limit is set to 0, a clear alarm is reported only when the number of packets in the cache queue is 0.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}