{
    "PageTitle": "radius-attribute qos-profile no-exist-policy",
    "FuncDef": "The radius-attribute qos-profile no-exist-policy command configures a policy whether to allow users to keep online when the QoS profile delivered by the RADIUS server is not configured on the .\nundo radius-attribute qos-profile no-exist-policy command restores the default configuration.\nBy default, if the QoS profile delivered by the RADIUS server is not configured on the , users are logged out.",
    "CLIs": [
        "radius-attribute qos-profile no-exist-policy { online | offline }",
        "undo radius-attribute qos-profile no-exist-policy [ online ]"
    ],
    "ParentView": [
        "RADIUS server group view"
    ],
    "ParaDef": [
        {
            "Parameters": "online",
            "Info": "Specifies a policy to allow users to keep online when the QoS profile delivered by the RADIUS server is not configured on the .\n-"
        },
        {
            "Parameters": "offline",
            "Info": "Specifies a policy to log out users when the QoS profile delivered by the RADIUS server is not configured on the .\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] radius-server group huawei",
            "[*HUAWEI-radius-huawei] commit",
            "[~HUAWEI-radius-huawei] radius-attribute qos-profile no-exist-policy online"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo change the control policy for users when the QoS profile delivered by the RADIUS server is not configured or not supported on the device, you can run the radius-attribute qos-profile no-exist-policy command.\nConfiguration Impact\nIf the radius-attribute qos-profile no-exist-policy online command is run, users keep online when the QoS profile delivered by the RADIUS server is not configured on the device. The rate of user traffic is restricted based on the QoS profile configured in a domain or on an interface.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}