{
    "PageTitle": "radius-server accounting-stop-packet pending-limit optimize",
    "FuncDef": "The radius-server accounting-stop-packet pending-limit optimize command allows the BRAS not to count this packet retransmission into the number of RADIUS accounting stop packet retransmissions if a BRAS fails to transmit a RADIUS accounting stop packet due to a seed application failure and retransmits the packet.\nThe undo radius-server accounting-stop-packet pending-limit optimize command restores the default configuration.\nBy default, if a BRAS fails to transmit a RADIUS accounting stop packet due to a seed application failure and retransmits the packet, the BRAS counts this packet retransmission into the number of RADIUS accounting stop packet retransmissions.",
    "CLIs": [
        "radius-server accounting-stop-packet pending-limit optimize",
        "undo radius-server accounting-stop-packet pending-limit optimize"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] radius-server accounting-stop-packet pending-limit optimize"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen a large number of users go offline, the BRAS sends many RADIUS accounting stop packets to the AAA server. If the AAA server cannot process so many RADIUS accounting stop packets at the same time, the BRAS retransmits the packets. When a large number of RADIUS accounting stop packets are accumulated on the BRAS, the number of RADIUS accounting stop packet retransmissions exceeds the maximum number because RADIUS seed resources are insufficient. As a result, some RADIUS accounting stop packets cannot be sent to the AAA server. When users' going-online status information is not deleted from the AAA server, the users fail to go online again.\nTo allow the BRAS not to count this packet retransmission into the number of RADIUS accounting stop packet retransmissions if a BRAS fails to transmit a RADIUS accounting stop packet due to a seed application failure and retransmits the packet, run the radius-server accounting-stop-packet pending-limit optimize command. In scenarios where a large number of users go offline, after the command is run, the BRAS successfully sends the users' RADIUS accounting stop packets and the users can go online again.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}