{
    "PageTitle": "radius-attribute include hw-avpair",
    "FuncDef": "The radius-attribute include hw-avpair command allows RADIUS packets to carry the hw-avpair attribute.\nThe undo radius-attribute include hw-avpair command deletes the hw-avpair attribute from RADIUS packets.\nBy default, the hw-avpair attribute cannot be added to a RADIUS packet.",
    "CLIs": [
        "radius-attribute include hw-avpair <hw-avpair-value> <packet-type>",
        "undo radius-attribute include hw-avpair <hw-avpair-value> <packet-type>",
        "undo radius-attribute include hw-avpair accounting-request"
    ],
    "ParentView": [
        "RADIUS server group view"
    ],
    "ParaDef": [
        {
            "Parameters": "hw-avpair hw-avpair-value",
            "Info": "Indicates the value of the hw-avpair attribute.\nThe below values are supported:\nnat:vpn: allows IPv4 user accounting packets to carry the IDs of the VPN instances bound to CGN address pools.nat:extport: allows IPv4 user accounting packets to carry incrementally allocated port numbers.subscriber:fq: allows IPv4 user accounting packets to carry the effective flow-queue parameter value.subscriber:vpnid: allows IPv4 user accounting packets to carry user VPN indexes.subscriber:link-address: allows DHCPv6 authentication packets to carry DHCPv6 addresses."
        },
        {
            "Parameters": "accounting-request",
            "Info": "Configures the attribute in the accounting-request packet.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] radius-server group huawei",
            "[*HUAWEI-radius-huawei] commit",
            "[~HUAWEI-radius-huawei] radius-attribute include hw-avpair nat-vpn accounting-request"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, many attributes are not carried in packets, which prevents unnecessary or unidentifiable attributes from being sent to a RADIUS server. To allow an attribute to be carried in a packet, run the radius-attribute include command.You can run the display radius-attribute command to check whether a RADIUS attribute is carried in a packet.\nConfiguration Impact\nIf an attribute is not carried in a packet by default, run the radius-attribute include command to allow the attribute to be carried in the packet. If you also specify a packet type, the attribute is carried only in this type of packets.\nIf you specify multiple attributes, all the specified attributes are carried in packets."
}