{
    "PageTitle": "radius-server authorization accounting-realtime-packet",
    "FuncDef": "The radius-server authorization accounting-realtime-packet disable command disables the device from automatically responding with a real-time accounting packet upon receipt of a CoA message delivered by the RADIUS server.\nThe radius-server authorization accounting-realtime-packet enable command restores the default configuration.\nThe undo radius-server authorization accounting-realtime-packet disable command enables the device to automatically respond with a real-time accounting packet upon receipt of a CoA message delivered by the RADIUS server.\nBy default, the device automatically responds with a real-time accounting packet upon receipt of a CoA message.",
    "CLIs": [
        "radius-server authorization accounting-realtime-packet { disable | enable }",
        "undo radius-server authorization accounting-realtime-packet disable"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] radius-server authorization accounting-realtime-packet disable"
        ]
    ],
    "ExtraInfo": "Upon receipt of a CoA message delivered by the RADIUS server, the device automatically responds with a real-time accounting packet by default to notify the server of the latest user status, such as bandwidth and service quota. If a large number of accounting packets are updated, the RADIUS server may be overloaded. To disable the device from automatically responding with a real-time accounting packet upon receipt of a CoA message delivered by the RADIUS server, run the radius-server authorization accounting-realtime-packet disable command. However, after this command is run, the RADIUS server cannot learn the latest user status. To resolve this problem, run the accounting interim interval command to enable the device to notify the RADIUS server of the latest user status at a specified interval."
}