{
    "PageTitle": "reauthorize",
    "FuncDef": "The reauthorize command modifies the user group to which an online user belongs.",
    "CLIs": [
        "reauthorize user-name <username> user-group <user-group-name>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "user-group user-group-name",
            "Info": "Specifies a user group name.\nThe value is a string of 1 to 32 characters."
        },
        {
            "Parameters": "user-name username",
            "Info": "Specifies a user name. The value is in the format of \"user name+@+domain name\", so the user name and the domain name cannot contain \"@\".The value cannot contain such characters as: \\ / : ? \" The domain name is a string of 1 to 32 characters.\nThe value is a string of 1 to 253 characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] reauthorize user-name user1@domain1 user-group group2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf you cannot change the user group to which an online user belongs because the dynamic authorization server fails, run the reauthorize command to change the user group and reauthorize the user.\nIn network planning, ACLs are used to control user access authority, and ACL rules are configured based on user groups. Therefore, to change a user's access authority, you can change its user group. For example, ACL rules are configured to allow user group 1 to access only the internal network and user group 2 to access both internal and external networks. When user A in user group 1 goes online, user A can access the internal network only. To allow user A to access both internal and external networks, reauthorize user A by changing its user group to user group 2.\nPrerequisites\nThe reauthorize enable command has been run to enable commandline reauthorization.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nThe user who runs this command must be online, and the user name must be in the format of \"user name+@+domain name\". Otherwise, an error message will be displayed."
}