{
    "PageTitle": "remote-download user-group check interval",
    "FuncDef": "The remote-download user-group check interval command configures an interval at which a device checks whether dynamic user groups created by the RADIUS server are used by online users or dynamic ACLs.\nThe undo remote-download user-group check interval command restores the default interval at which a device checks whether dynamic user groups created by the RADIUS server are used by online users or dynamic ACLs.\nBy default, a device checks whether dynamic user groups created by the RADIUS server are used by online users or dynamic ACLs at an interval of 10 minutes.",
    "CLIs": [
        "remote-download user-group check interval <interval>",
        "undo remote-download user-group check interval [ interval ]"
    ],
    "ParentView": [
        "AAA view"
    ],
    "ParaDef": [
        {
            "Parameters": "interval",
            "Info": "Specifies an interval at which the device checks whether a dynamic user group is in use.\nThe value is an integer ranging from 1 to 65535, in minutes. The default value is 10."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] remote-download user-group check interval 20"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a device has dynamic user groups that are dynamically created by the RADIUS server, the device periodically checks whether these dynamic user groups are in use by online users or dynamic ACLs. The device deletes the dynamic user groups that are not in use to reclaim the idle dynamic user groups.\nTo change the interval at which the device checks whether a dynamic user group is in use, run the remote-download user-group check interval command. This helps accelerate or slow down the reclamation of idle dynamic user groups.\nImplementation Procedure\nAt each interval, the device checks a dynamic user group. If the user group is not in use, the device deletes it. The dynamic user group being checked is automatically assigned by the system and cannot be manually specified.\nIf the remote-download user-group check interval command is run when the remote-download user-group enable is not run, only the remote-download user-group check interval command configuration is saved. If the remote-download user-group check interval command is run after the remote-download user-group enable command is run and the first dynamic user group is created, the device starts checking dynamic user groups at the specified interval.\nPrecautions\nThe device cannot be disabled from checking dynamic user groups. Once a dynamic user group is created, the device is triggered to check dynamic user groups. If all dynamic user groups are deleted, the device stops checking dynamic user groups.\nIn VS mode, this command is supported only by the admin VS.\nIf the check interval is less than 10 minutes, the check is performed frequently, which may increase the system pressure and CPU usage."
}