{
    "PageTitle": "remote-download user-group enable",
    "FuncDef": "The remote-download user-group enable command enables the RADIUS server to create dynamic user groups.\nThe undo remote-download user-group enable command disables the RADIUS server from creating dynamic user groups.\nBy default, the RADIUS server is enabled to create dynamic user groups.",
    "CLIs": [
        "remote-download user-group enable",
        "undo remote-download user-group enable"
    ],
    "ParentView": [
        "AAA view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] remote-download user-group enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a carrier wants the RADIUS server to deliver dynamic user groups, but does not want to run commands on the NE40E to create user groups, run the remote-download user-group enable command.\nImplementation Procedure\nAfter the remote-download user-group enable command is run, if the RADIUS server delivers a user group that does not exist on the device, the user group is dynamically created.\nIf the undo remote-download user-group enable command is run, the dynamic user groups that have been created are not affected, but no subsequent dynamic user groups can be created.\nConfiguration Impact\nThis command takes effect for subsequent login users and for CoA operations of online users. Before this command is run, when the Filter-Id attribute or the sub-attribute (subscriber:user group) of the HW-Avpair attribute delivered by the RADIUS server contains users groups that do not exist on the device, for new user authentication and authorization, logout authentication and authorization, the device ignores the delivered user groups; for user re-authorization triggered by CoA re-authentication, the device processes it as CoA failures.\nAfter this command is run, when the Filter-Id attribute delivered by the RADIUS server contains users groups that do not exist on the device, the user groups are dynamically created. If creating these user groups fails, the processing is the same as that when this command is not run.\nBefore this command is run, if the rules carried in the classifiers delivered by the HW-Data-Filter attribute contain user groups that do not exist on the device, the device cannot parse the HW-Data-Filter attribute.\nAfter this command is run, if the rules carried in the classifiers delivered by the HW-Data-Filter attribute contain user groups that do not exist on the device, the user groups are dynamically created. If creating these user groups fails, the device cannot parse the HW-Data-Filter attribute.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}