{
    "PageTitle": "save aaa abnormal-offline-record",
    "FuncDef": "The save aaa abnormal-offline-record command saves abnormal logout records of users to a local file.\nBy default, no abnormal user logout record is saved to a local file.",
    "CLIs": [
        "save aaa abnormal-offline-record { ip-address <ip-address> | ipv6-address <ipv6-address> } [ count <record-count> ] output file <file-name>",
        "save aaa abnormal-offline-record { domain-name <domain-name> | slot <slot-number> | username <username> | interface { { <interfacename> | <interfacetype> <interfacenumber> } | { <vlaninterfacename> | <vlaninterfacetype> <vlaninterfacenumber> } { pevlan <pevlan> [ cevlan <ce-vlan> ] } } | user-type { bind | admin | none } | mac-address <mac-address> } * [ count <record-count> ] output file <file-name>",
        "save aaa abnormal-offline-record { pevlan <pevlan> [ cevlan <ce-vlan> ] } [ count <record-count> ] output file <file-name>",
        "save aaa abnormal-offline-record [ time <begin-time> <end-time> [ date <begin-date> <end-date> ] ] output file <file-name>",
        "save aaa abnormal-offline-record offline-reason { flow-limit | session-timeout } output file <file-name>"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address ip-address",
            "Info": "Saves abnormal logout records of the user with a specified IPv4 address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "ipv6-address ipv6-address",
            "Info": "Saves abnormal logout records of the user with a specified IPv6 address.\nThe value is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "count record-count",
            "Info": "Saves a specified number of abnormal logout records of users.\nThe value is an integer ranging from 1 to 65536."
        },
        {
            "Parameters": "file file-name",
            "Info": "Specifies a file to store abnormal logout records of users.\nThe value is a character string with the file name extension of .txt. The total length, including the path and file name extension lengths, cannot exceed 64 characters. If no path is specified, abnormal logout records of users are saved to cfcard:/aaa_access/ by default."
        },
        {
            "Parameters": "domain-name domain-name",
            "Info": "Saves abnormal logout records of users in a specified domain.\nThe value is a string of 1 to 64 characters."
        },
        {
            "Parameters": "slot slot-number",
            "Info": "Saves abnormal logout records of users on the board in a specified slot.\nThe value is an integer."
        },
        {
            "Parameters": "username username",
            "Info": "Saves abnormal logout records of the user with a specified name.\nThe value is a string of 1 to 253 characters."
        },
        {
            "Parameters": "interface",
            "Info": "Saves abnormal logout records of users on a specified interface.\n-"
        },
        {
            "Parameters": "vlaninterfacename",
            "Info": "Specifies the name of the interface through which users go online.\nThe value is a string case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "vlaninterfacetype",
            "Info": "Specifies the type of the interface through which users go online.\nThe value is a string case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "vlaninterfacenumber",
            "Info": "Specifies the number of the interface through which users go online.\nThe value is a string case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "pevlan pevlan",
            "Info": "Saves abnormal logout records of users whose packets carry a specified VLAN ID on an interface. This parameter is valid only for Ethernet interfaces.\nThe value is an integer ranging from 0 to 4094."
        },
        {
            "Parameters": "cevlan ce-vlan",
            "Info": "Saves abnormal logout records of users whose packets carry a specified QinQ VLAN ID on an interface. If the value is 0, abnormal logout records of users whose packets carry single VLAN tags are saved to a local file.\nThe value is an integer ranging from 0 to 4094."
        },
        {
            "Parameters": "user-type",
            "Info": "Saves abnormal logout records of users of a specified type.\n-"
        },
        {
            "Parameters": "bind",
            "Info": "Saves abnormal logout records of bind authentication users.\n-"
        },
        {
            "Parameters": "admin",
            "Info": "Saves abnormal logout records of administrators.\n-"
        },
        {
            "Parameters": "none",
            "Info": "Saves abnormal logout records of unauthenticated users.\n-"
        },
        {
            "Parameters": "mac-address mac-address",
            "Info": "Saves abnormal logout records of the user with a specified MAC address.\nThe value is in the H-H-H format, where H is a 4-digit hexadecimal number."
        },
        {
            "Parameters": "time begin-time",
            "Info": "Saves abnormal logout records of users in a specified period of time.\nThe start times are in the format of HH:MM:SS, standing for hour:minute:second."
        },
        {
            "Parameters": "time end-time",
            "Info": "Saves abnormal logout records of users in a specified period of time.\nThe end times are in the format of HH:MM:SS, standing for hour:minute:second."
        },
        {
            "Parameters": "date begin-date",
            "Info": "Saves abnormal logout records of users in a specified period of dates. If no date is specified, the current date is used.\nThe start dates are in the format of YYYY/MM/DD, standing for year/month/day."
        },
        {
            "Parameters": "date end-date",
            "Info": "Saves abnormal logout records of users in a specified period of dates. If no date is specified, the current date is used.\nThe end dates are in the format of YYYY/MM/DD, standing for year/month/day."
        },
        {
            "Parameters": "offline-reason",
            "Info": "Saves abnormal logout records with a specified logout reason.\n-"
        },
        {
            "Parameters": "flow-limit",
            "Info": "Saves abnormal logout records with the logout reason being traffic quota exhaustion.\n-"
        },
        {
            "Parameters": "session-timeout",
            "Info": "Saves abnormal logout records with the logout reason being session timeouts.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> save aaa abnormal-offline-record domain-name huawei output file abnormal-offline-record.txt"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo obtain abnormal logout records of users for further analysis, run the save aaa abnormal-offline-record command to save abnormal logout records of users to a local file. Then use FTP to obtain the file.\nTo save abnormal logout records of users during a specified period of time, run the save aaa abnormal-offline-record [ time  [ date  ] ] output file  command. If no time range is specified, all abnormal logout records of users are saved.To save abnormal user logout records based on a single condition or combinations of conditions of domain name, access interface, MAC address, slot ID, user type, and user name, run the save aaa abnormal-offline-record { domain-name  | slot  | username  | interface { {  |  } | {  |  } { pevlan  [ cevlan  ] } } | user-type { bind | admin | none } | mac-address  } * [ count  ] output file  command. You can also specify the number of records to be saved.To save abnormal user logout records based on an outer VLAN ID, run the save aaa abnormal-offline-record { pevlan  [ cevlan  ] } [ count  ] output file  command. You can also specify the number of records to be saved.To save aaa abnormal-offline-record { ip-address  | ipv6-address  } [ count  ] output file  command. You can also specify the number of records to be saved.To save abnormal user logout records based on a specified logout reason, run the save aaa abnormal-offline-record offline-reason { flow-limit | session-timeout } output file  command.\n\nPrecautions\nOnly files in the .txt format can be saved.If the sub-reason mapping command is run, the abnormal logout sub-reasons saved are mapped to and displayed as the corresponding general sub-reasons.The file specified cannot have the same name as an existing file.To delete a file on the device, run the delete command.\nIn VS mode, this command is supported only by the admin VS."
}