{
    "PageTitle": "select-authentication-domain",
    "FuncDef": "The select-authentication-domain individual command configures a device to use the domain carried in an EAP user name as the authentication domain for an EAP-authentication-based RADIUS proxy user.\nThe undo select-authentication-domain individual command cancels the configuration.\nBy default, the default authentication domain configured for a BAS interface is used as the authentication domain for an EAP-authentication-based RADIUS proxy user.",
    "CLIs": [
        "select-authentication-domain individual",
        "undo select-authentication-domain individual"
    ],
    "ParentView": [
        "BAS interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface GigabitEthernet2/0/1",
            "[~HUAWEI-GigabitEthernet2/0/1] bas",
            "[~HUAWEI-GigabitEthernet2/0/1-bas] select-authentication-domain individual"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn the scenario where EAP-authentication-based and web-authentication-based RADIUS proxy users go online from the same BAS interface, the authentication mode configured for the BAS interface is web authentication, and the default authentication domain is web pre-authentication domain. While web-authentication-based RADIUS proxy users are authenticated in the web pre-authentication domain, EAP-authentication-based RADIUS proxy users cannot be authenticated in the web pre-authentication domain. To allow an EAP-authentication-based RADIUS proxy user to be authenticated not in the web pre-authentication domain but in the domain carried in the EAP user name, run the select-authentication-domain individual command.\nIn the scenario where only EAP-authentication-based RADIUS proxy users exist, to allow an EAP-authentication-based RADIUS proxy user to be authenticated in the domain carried in the EAP user name, run the select-authentication-domain individual command.\nUse the domain carried in an EAP user name preferentially.\nIf the domain in the EAP user name does not exist, use the roaming domain configured on the interface.If no domain is included in the EAP user name, use the default authentication domain.\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}