{
    "PageTitle": "ui-mode",
    "FuncDef": "The ui-mode command enables the command output to be displayed in the user customized format.\nThe undo ui-mode command restores the default configuration.\nBy default, the function that displays command output in the user customized format is disabled.",
    "CLIs": [
        "ui-mode type1",
        "ui-mode type2",
        "undo ui-mode type1",
        "undo ui-mode type2"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "type2",
            "Info": "Displays command output in type 2 format.\n-"
        },
        {
            "Parameters": "type1",
            "Info": "Displays command output in type 1 format.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ui-mode type1"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ui-mode type2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter the command is run, the command output is displayed in the user customized format.\nConfiguration Impact\nAfter you configure the ui-mode type1 command, the output of the following commands is displayed in type 1 mode:\ndisplay ppp user-id. In the output of this command, the authentication phase is also displayed, and invalid fields are displayed as - or are not displayed.display ppp statistics interface. In the output of this command, statistics about sent and received Echo Reply packets are not displayed.display radius-server configuration. In the output of this command, the displayed RADIUS server status is UNKOWN during the detection when the device assumes that the RADIUS server is still Up. If the RADIUS server uses standard RADIUS, the protocol version displayed is radius standard.display traffic policy user-defined. In the output of this command, traffic classifier names and traffic behavior names are not displayed.\nIn addition, the AFTR attribute carried in the packets sent from the device to the clients is no longer obtained from the address pool.\nIf the ui-mode type2 command is run, the real-time user rates displayed in the outputs of the following commands are in kbit/s:\nThe display access-user command.The display access-user ip-address command.The display access-user ipv6-address command.The display access-user mac-address command.The display access-user user-id command.The display access-user verbose count command.The display access-user verbose nop command.\n\nPrecautions\nIf both the ui-mode type1 and ui-mode type2 commands are run, the latest configuration overrides the previous one, and no message is displayed.\nIn VS mode, this command is supported only by the admin VS."
}