{
    "PageTitle": "user no-family user-max-session",
    "FuncDef": "The user no-family user-max-session command determines whether to switch family users to common users in an AAA domain.\nThe undo user no-family user-max-session command restores the default configuration.\nBy default, after the user-max-session command is run in an AAA domain, users with the same user name in the domain are family users.",
    "CLIs": [
        "user no-family user-max-session <session-number>",
        "user no-family user-max-session all",
        "undo user no-family user-max-session [ all ]"
    ],
    "ParentView": [
        "AAA view"
    ],
    "ParaDef": [
        {
            "Parameters": "session-number",
            "Info": "Specifies the maximum number of sessions for common users.\nThe value is 1."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] domain domain1",
            "[~HUAWEI-aaa-domain1] user-max-session 1",
            "[~HUAWEI-aaa-domain1] quit",
            "[~HUAWEI-aaa] user no-family user-max-session 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the user-max-session command has been run in an AAA domain, users with the same user name in the domain are family users. To switch family users to common users, run the user no-family user-max-session 1 command.\nIf the user-max-session command has been run in an AAA domain, you can run the user no-family user-max-session all command to limit the number of users with the same user name in the domain instead of switching users with the same user name to family users.\nConfiguration Impact\nAfter the user no-family user-max-session all command is run, the user-max-session command limits the number of users with the same user name but does not switch users with the same user name to family users.\nPrecautions\nThe user-max-session max-session-number command must be run in the AAA domain and max-session-number must be set to 1 for the user no-family user-max-session 1 command to take effect.\nThe user no-family user-max-session 1 command is associated with the user-max-session max-session-number command. The user-max-session max-session-number command must be run in the AAA domain and max-session-number must be set to 1 for the user no-family user-max-session 1 command to take effect.The user no-family user-max-session all and user no-family user-max-session 1 commands are mutually exclusive.To cancel the current configuration, run the undo user no-family user-max-session all or undo user no-family user-max-session command."
}