{
    "PageTitle": "user-warning-threshold",
    "FuncDef": "The user-warning-threshold command sets the upper and lower alarm thresholds for the number of users on a device.\nThe undo user-warning-threshold command cancels the configuration.\nBy default, no upper or lower alarm threshold is configured for the number of users on the device.",
    "CLIs": [
        "user-warning-threshold { upper-limit <upper-limit-value> | lower-limit <lower-limit-value> }",
        "undo user-warning-threshold { upper-limit | lower-limit }"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "upper-limit upper-limit-value",
            "Info": "Specifies an upper threshold for the number of users.\nThe value is an integer ranging from 1 to 100."
        },
        {
            "Parameters": "lower-limit lower-limit-value",
            "Info": "Specifies a lower threshold for the number of users.\nThe value is an integer ranging from 0 to 99."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] user-warning-threshold upper-limit 80"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe user-warning-threshold command can be used to set the upper and lower alarm thresholds for the number of users attached to a device. The upper alarm threshold helps to identify excessive users on a network, and the lower alarm threshold helps to identify users' logout due to faults.\nConfiguration Impact\nIf the maximum number of users on a device is set to n, the upper alarm threshold for the number of users is set to m, and the lower alarm threshold for the number of users is set to p, an alarm is generated when the number of users reaches n x m or falls below n x p.\nPrecautions\nIf the lower threshold for the number of users is configured, the upper threshold for the number of users must be greater than the lower threshold for the number of users.\nIn VS mode, this command is supported only by the admin VS."
}