{
    "PageTitle": "user-group(user-group-list view)",
    "FuncDef": "The user-group command adds a user group to a user group load balancing group.\nThe undo user-group command deletes a user group from a user group load balancing group.\nBy default, no user groups exist in a user group load balancing group.",
    "CLIs": [
        "user-group <group-name> [ weight <weight> ]",
        "undo user-group <group-name> [ weight <weight> ]"
    ],
    "ParentView": [
        "user-group-list view"
    ],
    "ParaDef": [
        {
            "Parameters": "weight weight",
            "Info": "Specifies a weight value.\nThe value is an integer ranging from 1 to 100. The default value is 1."
        },
        {
            "Parameters": "user-group group-name",
            "Info": "Specifies the name of a user group.\nThe value is a string of 1 to 32 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] user-group test",
            "[*HUAWEI] commit",
            "[~HUAWEI] access user-group-list huawei",
            "[*HUAWEI-user-group-list-huawei] commit",
            "[~HUAWEI-user-group-list-huawei] user-group test weight 2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo distribute the traffic of users that go online through the same domain to different centralized CGN devices based on the user group weight, you need to configure a user group load balancing group, run the user-group command to add user groups (each with a weight) to the user group load balancing group, and run the access user-group-list (AAA domain view) command to bind the user group load balancing group to the domain.\nPrerequisites\nA user group load balancing group has been created and its view has been displayed using the access user-group-list (system view) command.\nPrecautions\nA maximum of eight user groups can be added to a user group load balancing group.A user group that is bound to a NAT instance cannot be added to a user group load balancing group.A user group can be added to different user group load balancing groups."
}