{
    "PageTitle": "vpn-instance(AAA Domain view)",
    "FuncDef": "The vpn-instance command binds a VPN instance to a domain.\nThe undo vpn-instance command unbinds the VPN instance from the domain.\nBy default, a public network VPN instance is bound to a domain.",
    "CLIs": [
        "vpn-instance <instance-name>",
        "undo vpn-instance"
    ],
    "ParentView": [
        "AAA domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "instance-name",
            "Info": "Specifies the VPN instance name.\nThe value is a string of 1 to 31 characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip vpn-instance vrf1",
            "[~HUAWEI-vpn-instance-vrf1] ipv4-family",
            "[*HUAWEI-vpn-instance-vrf1-af-ipv4] route-distinguisher 22:1",
            "[*HUAWEI-vpn-instance-vrf1-af-ipv4] vpn-target 3:3 export-extcommunity",
            "[*HUAWEI-vpn-instance-vrf1-af-ipv4] vpn-target 4:4 import-extcommunity",
            "[*HUAWEI-vpn-instance-vrf1-af-ipv4] commit",
            "[~HUAWEI-vpn-instance-vrf1-af-ipv4] quit",
            "[~HUAWEI] quit",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] domain huawei",
            "[*HUAWEI-aaa-domain-huawei] commit",
            "[~HUAWEI-aaa-domain-huawei] vpn-instance vrf1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo provide wholesale services for multiple ISPs over an MPLS VPN, you need to run the vpn-instance command to bind the VPN instance to a domain.\nIf an IPoE user wants to access a VPN, you need to run the command to bind the VPN instance to the domain.\nPrerequisites\nThe VPN instance to be bound to a domain has been created using the ip vpn-instance command in the system view, and RD has been configured for the VPN instance.\nConfiguration Impact\nIf only an IPv4 address family is enabled for the VPN instance that is bound to a domain, only the VPN users using IPv4 addresses can access the device.If only an IPv6 address family is enabled for the VPN instance that is bound to a domain, only the VPN users using IPv6 addresses can access the device.If both the IPv4 and IPv6 address families are enabled for the VPN instance that is bound to a domain, both the VPN users using the IPv4 addresses and the VPN users using the IPv6 addresses can access the device.\n\nPrecautions\nThe VPN instance bound to a domain must be the same as that bound to the address pool in the domain. Otherwise, users in the domain cannot get online.\nAfter a domain has been bound to a VPN instance, no address family can be added to or deleted from the VPN instance. Before adding an address family to or deleting an address family from a VPN instance, you must unbind the VPN instance from the domain.\nIn VS mode, this command is supported only by the admin VS."
}