{
    "PageTitle": "warning-threshold",
    "FuncDef": "The warning-threshold command sets an alarm threshold for the address usage of an address pool. If the address usage exceeds the threshold, an alarm is generated on the device.\nThe undo warning-threshold command restores the default alarm threshold for the address usage of an address pool.\nBy default, the alarm threshold for the address usage of an address pool is set to 80%.",
    "CLIs": [
        "warning-threshold <threshold>",
        "undo warning-threshold"
    ],
    "ParentView": [
        "Bas IP address pool view",
        "Address pool group view"
    ],
    "ParaDef": [
        {
            "Parameters": "threshold",
            "Info": "The alarm threshold for the address usage of an address pool is a percentage. If the value of threshold-value is set to 80, the device will generate an alarm when the address usage of the address pool reaches 80%. 0 indicates that the alarm is disabled.\nThe value ranges from 0 to 100."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ip pool huawei bas local",
            "[*HUAWEI-ip-pool-huawei] warning-threshold 85"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe warning-threshold command is used to set an alarm threshold for the usage of an address pool. If the address usage exceeds the threshold, an alarm is generated on the , prompting the administrator to reallocate addresses. If all addresses of the address pool are used, subsequent users cannot log in.\nIf the usage of an address pool exceeds the threshold, an alarm is generated. When the address usage falls below 90% of the threshold, the alarm is cleared.\nIf this command is run more than once in the same view, the latest configuration overrides the previous one.\nIf you want the device to generate an alarm when the usage of an address pool or address pool group exceeds the alarm threshold and another alarm when IP addresses in the address pool or address pool group are exhausted, run the warning-threshold and warning-exhaust commands.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}