{
    "PageTitle": "display multicast bandwidth",
    "FuncDef": "The display multicast bandwidth command displays the parameter values related to multicast program bandwidth.",
    "CLIs": [
        "display multicast bandwidth [ name <list-name> | [ vpn-instance <vpn-instance-name> ] [ source <source-address> ] group <group-address> ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "name list-name",
            "Info": "Specifies the name of the multicast program list.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies the VPN instance of which the multicast program bandwidth is displayed. vpn-instance-name specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "source source-address",
            "Info": "Specifies the address of the multicast source, that is, the multicast source of the multicast programs.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "group group-address",
            "Info": "Specifies the address of the multicast group, that is, the multicast group of the multicast programs.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display multicast bandwidth name CCTV",
            "Multicast Bandwidth Table of VPN-Instance: public net ",
            "Total entry 2,Matched 2 entry  ",
            "1.(10.1.1.1, 10.1.1.2), Type: Dynamic    ",
            "   Threshold:5%    ",
            "   Detect-interval:15s    ",
            "   Bandwidth:5176kbps  ",
            "2.(10.1.1.1, 10.1.1.3), Type: Dynamic    ",
            "  Threshold:5%    ",
            "  Detect-interval:15s    ",
            "  Bandwidth:4115kbps"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe description of the display multicast bandwidth command is as follows:\nIf the list-name parameter is specified, the bandwidth of only this multicast program list is displayed.If the source-address parameter is specified, the bandwidth of only the multicast program list of this multicast source is displayed.If the group-address parameter is specified, the bandwidth of only the multicast program list of this multicast group is displayed.If the vpn-instanceor source source-address parameter is specified, the group group-address parameter must be specified.\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}