{
    "PageTitle": "multicast unicast-reservable-bandwidth",
    "FuncDef": "The multicast unicast-reservable-bandwidth command configures the minimum bandwidth reserved for unicast and enable multicast virtual scheduling.\nThe undo multicast unicast-reservable-bandwidth command cancels the minimum bandwidth reserved for unicast and disable multicast virtual scheduling.\nBy default, the minimum bandwidth reserved for unicast is not configured.",
    "CLIs": [
        "multicast unicast-reservable-bandwidth cir <cir-value> [ pir <pir-value> ] [ coexist-with copy-by-session ]",
        "undo multicast unicast-reservable-bandwidth [ coexist-with copy-by-session ]"
    ],
    "ParentView": [
        "AAA domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "pir pir-value",
            "Info": "Specifies the peak rate of traffic. The peak rate refers to the maximum traffic rate that is allowed.\nThe value is an integer ranging from 128 to 1000000, in kbit/s. In addition, pir-value should be no less than the configured cir-value."
        },
        {
            "Parameters": "coexist-with",
            "Info": "Specifies multicast virtual scheduling is enabled when session-based multicast replication function is enabled on the BAS interface.\n-"
        },
        {
            "Parameters": "copy-by-session",
            "Info": "Specifies session-based multicast replication function.\n-"
        },
        {
            "Parameters": "cir cir-value",
            "Info": "Specifies the average rate of traffic.\nThe value is an integer ranging from 128 to 1000000, in kbit/s."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] domain huawei",
            "[*HUAWEI-aaa-domain-huawei] commit",
            "[*HUAWEI-aaa-domain-huawei] multicast unicast-reservable-bandwidth cir 1024"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe multicast virtual scheduling is valid after multicast unicast-reservable-bandwidth is run. Actually, this command is a switch for enabling or disabling the multicast virtual scheduling.\nPrerequisites\nGenerally, the Router replicates only one copy of multicast traffic of a multicast group to each physical interface. Then the Layer 2 device replicates the multicast traffic to each member in the multicast group. If the Layer 2 device does not provide IGMP/MLD snooping for user identification, run the multicast copy by-session command to enable session-based multicast replication on the BAS interface of the Router. After the configuration is complete, the Router directly copies multicast traffic to each user."
}