{
    "PageTitle": "multicast-list (Multicast shaping template view)",
    "FuncDef": "The multicast-list command specifies the multicast shaping parameters of a specified multicast program list.\nThe undo multicast-list command cancels the multicast shaping parameters of a specified multicast program list.\nBy default, multicast shaping parameters are not configured for multicast programs.",
    "CLIs": [
        "multicast-list { name <list-name> | list-index <start-index> [ <end-index> ] } cir <cir-value> [ pir <pir-value> ] [ queue-length <queue-length> ]",
        "undo multicast-list { name <list-name> | list-index <start-index> [ <end-index> ] } shaping"
    ],
    "ParentView": [
        "Multicast shaping template view"
    ],
    "ParaDef": [
        {
            "Parameters": "name list-name",
            "Info": "Specifies the name of the list of multicast programs.\nThe value is a string of 1 to 32 characters."
        },
        {
            "Parameters": "list-index start-index",
            "Info": "Specifies the start index of the list of multicast programs.\nThe value is an integer ranging from 0 to 8191."
        },
        {
            "Parameters": "end-index",
            "Info": "Specifies the end index of the list of multicast programs.\nThe value is an integer ranging from the value of the start index to 8191."
        },
        {
            "Parameters": "cir cir-value",
            "Info": "Specifies the guaranteed bandwidth for multicast shaping.\ncir-value is an integer ranging from 8 to 4294967295, in kbit/s."
        },
        {
            "Parameters": "pir pir-value",
            "Info": "Specifies the peak bandwidth for multicast shaping.\npir-value is an integer ranging from 8 to 4294967295, in kbit/s."
        },
        {
            "Parameters": "queue-length queue-length",
            "Info": "Specifies the length of a multicast shaping packet.\nlength is an integer ranging from 2000 to 128,000, in Kbytes."
        },
        {
            "Parameters": "shaping",
            "Info": "Specifies the traffic shaping mode.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] multicast-list kankan group-address 239.0.0.1",
            "[~HUAWEI-aaa] quit",
            "[~HUAWEI] multicast shaping",
            "[*HUAWEI-qos-mshaping] multicast-list name kankan cir 5000 pir 8000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo set the multicast shaping parameters for a specified multicast program list, run the multicast-list command.\nPrecautions\nOn a board using the LPUI-21-L/LPUI-51-L/LPUF-51/LPUF-51-B/LPUI-51/LPUI-51-B/LPUI-51-S/LPUS-51/LPUF-101/LPUF-101-B/LPUI-101/LPUI-101-B/LPUS-101/LPUF-51-E/LPUI-51-E/LPUI-51-CM/LPUF-120/LPUF-120-B/LPUF-120-E/LPUI-102-E/LPUI-120/LPUI-120-B/LPUI-120-L/LPUI-52-E/LPUI-120-E/LPUI-120-CM/LPUF-240/LPUF-240-B/LPUF-240-E/LPUI-240/LPUI-240-B/LPUI-240-CM/LPUI-240-L type of board, the bandwidth limit of multicast shaping inherits the TM module's bandwidth limit. The maximum bandwidth that can be configured is 600 Gbit/s (600 x 1000 x 1000 kbit/s). When the limit is exceeded, the HQoS module reports a PIR cross-threshold alarm, indicating that the bandwidth configuration does not take effect. The previous bandwidth configuration takes effect.\nA multicast program list has been created.pir pir-value must be greater than or equal to cir cir-value.The device cannot configure the Cu-Agent feature.This command is supported only on the admin VS."
}