{
    "PageTitle": "display msdp brief",
    "FuncDef": "The display msdp brief command displays brief information about Multicast Source Discovery Protocol (MSDP) peers.",
    "CLIs": [
        "display msdp { vpn-instance <vpn-instance-name> | all-instance } brief [ state { connect | down | listen | shutdown | up } ]",
        "display msdp brief [ state { connect | down | listen | shutdown | up } ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Displays brief information about MSDP peers in a specified VPN instance.\nvpn-instance-name specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. The VPN instance name \"_public_\" cannot be used. The string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "all-instance",
            "Info": "Displays brief information about MSDP peers in all instances.\n-"
        },
        {
            "Parameters": "state",
            "Info": "State.\n-"
        },
        {
            "Parameters": "connect",
            "Info": "Displays brief information about MSDP peers that act as servers of the local device and have not set up connections with the local device.\n-"
        },
        {
            "Parameters": "down",
            "Info": "Displays brief information about MSDP peers that fail to set up connections with the local device.\n-"
        },
        {
            "Parameters": "listen",
            "Info": "Displays brief information about MSDP peers that act as clients of the local device and have set up connections with the local device.\n-"
        },
        {
            "Parameters": "shutdown",
            "Info": "Displays brief information about MSDP peers that have been shut down.\n-"
        },
        {
            "Parameters": "up",
            "Info": "Displays brief information about MSDP peers that have set up connections and sessions with the local device.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display msdp brief",
            "MSDP Peer Brief Information of VPN-Instance: public net",
            "  Configured   Up           Listen       Connect      Shutdown     Down",
            "  2            2            0            0            0            0",
            "  Peer's Address     State     Up/Down time    AS     SA Count   Reset Count",
            "  192.168.3.2        Up        01:07:08        ?      8          0",
            "  192.168.5.1        Up        00:16:39        ?      13         0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn an MSDP peer relationship, the peer with the higher IP address acts as the server, and the peer with the lower IP address acts as the client. The server listens the client using the port 639, and the client is responsible for initiating connection requests. If a connection fails, the client initiates a connection request again after a specified period.\nAfter MSDP peers establish TCP connections, you can run the display msdp brief command to display brief information about the remote MSDP peers, such as the peer address, autonomous system (AS) number, number of (S, G) entries, and TCP connection status.\nPrerequisites\nMSDP peer relationships have been set up.\nPrecautions\nIf neither vpn-instance nor all-instance is specified, the command displays brief information about MSDP peers in the public network instance."
}