{
    "PageTitle": "display msdp rpf-peer",
    "FuncDef": "The display msdp rpf-peer command displays information about all reverse path forwarding (RPF) peers of a specific source's rendezvous point (RP) address, including RPF peer selection rules and RPF route types.",
    "CLIs": [
        "display msdp { vpn-instance <vpn-instance-name> | all-instance } rpf-peer original-rp <original-rp-address>",
        "display msdp rpf-peer original-rp <original-rp-address>"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Displays information about all RPF peers of a specific source's RP address in a specified VPN instance.\nvpn-instance-name specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "all-instance",
            "Info": "Displays information about all RPF peers of a specific source's RP address in all instances.\n-"
        },
        {
            "Parameters": "original-rp original-rp-address",
            "Info": "original-rp-address specifies a source's RP address.\nThe value is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display msdp rpf-peer original-rp 1.2.3.4",
            " MSDP RPF peer information of VPN-Instance: public net",
            " MSDP RPF peer information for Original RP: 1.2.3.4",
            " 01. RPF peer: 6.6.6.6",
            "  RPF selection rule: Peer is IGP next hop of best route",
            "  RPF used topology: default",
            "  RPF route type: multicast(static)"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo check whether the forwarding path of source active (SA) messages works properly, run the display msdp rpf-peer command. Based on the RPF peer information in the command output, you can check each hop in the forwarding path. If the forwarding path works improperly, this command helps you locate faulty nodes.\nPrerequisites\nMulticast Source Discovery Protocol (MSDP) peers have been configured, because only MSDP peers in Up TCP connections can become RPF peers.\nA device does not perform RPF peer checks on SA messages received from any types of the following MSDP peers:\nThe MSDP peer address is the source's RP address.The MSDP peer is a static RPF peer of the local device.The MSDP peer is a unique MSDP peer of the local device.The MSDP peer has joined a full-mesh group."
}