{
    "PageTitle": "display msdp sa-count",
    "FuncDef": "The display msdp sa-count command displays statistics about (S, G) entries in the source active (SA) cache.",
    "CLIs": [
        "display msdp { vpn-instance <vpn-instance-name> | all-instance } sa-count [ <as-number> | <as-number_string> ]",
        "display msdp sa-count [ <as-number> | <as-number_string> ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Displays statistics about cached (S, G) entries in a specified VPN instance.\nvpn-instance-name specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. The VPN instance name \"_public_\" cannot be used. The string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "all-instance",
            "Info": "Displays statistics about cached (S, G) entries in all instances.\n-"
        },
        {
            "Parameters": "as-number",
            "Info": "Displays information about cached (S, G) entries that contain an integral autonomous system (AS) number.\n-"
        },
        {
            "Parameters": "as-number_string",
            "Info": "Displays information about cached (S, G) entries that contain a dotted notation AS number.\nas-number_string specifies a dotted notation AS number.\nThe value is in the format of x.y, where x and y are integers that range from 1 to 65535 and from 0 to 65535, respectively."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display msdp sa-count",
            "MSDP Source-Active Count Information of VPN-Instance: public net",
            "Number of cached Source-Active entries, counted by Peer",
            "  Peer's Address     Number of SA",
            "  10.10.10.10        5",
            "Number of source and group, counted by AS",
            "  AS     Number of source    Number of group",
            "  ?      3                      3",
            "  Total 5 Source-Active entry matched"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter the SA cache function is enabled, you can run the display msdp sa-count command to display statistics about the (S, G) entries in the SA cache.\nPrerequisites\nThe SA cache function has been enabled. By default, the SA cache function is enabled.\nPrecautions\nIf neither vpn-instance vpn-instance-name nor all-instance is specified, the command displays cached (S, G) entries in the public network instance."
}