{
    "PageTitle": "display msdp sa-cache",
    "FuncDef": "The display msdp sa-cache command displays information about (S, G) entries in the source active (SA) cache.",
    "CLIs": [
        "display msdp { vpn-instance <vpn-instance-name> | all-instance } sa-cache [ <group-address> | <source-address> | { <as-number> | <as-number_string> } ] *",
        "display msdp sa-cache [ <group-address> | <source-address> | { <as-number> | <as-number_string> } ] *"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Displays information about cached (S, G) entries in a specified VPN instance.\nvpn-instance-name specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. The VPN instance name \"_public_\" cannot be used. The string can contain spaces if it is enclosed with double quotation marks (\")."
        },
        {
            "Parameters": "all-instance",
            "Info": "Displays information about cached (S, G) entries in all instances.\n-"
        },
        {
            "Parameters": "group-address",
            "Info": "Displays information about cached (S, G) entries of a specified group address.\ngroup-address specifies a group address.\nThe value ranges from 224.0.0.0 to 239.255.255.255, in dotted decimal notation."
        },
        {
            "Parameters": "source-address",
            "Info": "Displays information about cached (S, G) entries of a specified source address.\nsource-address specifies a source address.\nThe address is in dotted decimal notation."
        },
        {
            "Parameters": "as-number",
            "Info": "Displays information about cached (S, G) entries that contain an integral autonomous system (AS) number.\nThe value is an integer ranging from 1 to 4294967295."
        },
        {
            "Parameters": "as-number_string",
            "Info": "Displays information about cached (S, G) entries that contain a dotted notation AS number.\nas-number_string specifies a dotted notation AS number.\nThe value is in the format of x.y, where x and y are integers that range from 1 to 65535 and from 0 to 65535, respectively."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display msdp sa-cache",
            " MSDP Source-Active Cache Information of VPN-Instance: public net",
            " MSDP Total Source-Active Cache - 2 entries",
            " MSDP matched 2 entries",
            "(10.0.5.120, 225.0.0.1)",
            " Origin RP: 3.3.3.3",
            " Pro: ?, AS: ?",
            " Uptime: 00:01:01, Expires: 00:05:59",
            "(10.0.5.120, 225.0.0.2)",
            " Origin RP: 3.3.3.3",
            " Pro: ?, AS: ?",
            " Uptime: 00:00:01, Expires: 00:05:59"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter the SA cache function is enabled, you can run the display msdp sa-cache command to display cached (S, G) entries learned from other Multicast Source Discovery Protocol (MSDP) peers, including the source address, group address, address of the source's rendezvous point (RP), routing protocol, AS number, and timeout period of entries.\nPrerequisites\nThe SA cache function has been enabled. By default, the SA cache function is enabled.\nPrecautions\nIf neither vpn-instance vpn-instance-name nor all-instance is specified, the command displays cached (S, G) entries in the public network instance."
}