{
    "PageTitle": "peer minimum-ttl",
    "FuncDef": "The peer minimum-ttl command sets a TTL threshold for multicast data packets that can be encapsulated in source active (SA) messages and forwarded to a specified Multicast Source Discovery Protocol (MSDP) peer.\nThe undo peer minimum-ttl command restores the default value.\nBy default, the TTL threshold is 0 for multicast data packets that can be encapsulated in SA messages and forwarded to an MSDP peer.",
    "CLIs": [
        "peer <peer-address> minimum-ttl <ttl>",
        "undo peer <peer-address> minimum-ttl"
    ],
    "ParentView": [
        "VPN instance MSDP view",
        "MSDP view of a public network instance"
    ],
    "ParaDef": [
        {
            "Parameters": "peer-address",
            "Info": "Specifies the address of an MSDP peer.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "ttl",
            "Info": "Specifies a TTL threshold.\nThe value is an integer ranging from 0 to 255."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface loopback1",
            "[*HUAWEI-LoopBack1] quit",
            "[*HUAWEI] multicast routing-enable",
            "[*HUAWEI] msdp",
            "[*HUAWEI-msdp] peer 10.10.10.1 connect-interface LoopBack 1",
            "[*HUAWEI-msdp] peer 10.10.10.1 minimum-ttl 10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nMSDP peers exchange SA messages over TCP connections. To limit multicast data packets that can be encapsulated in SA messages, run the peer minimum-ttl command to set a TTL threshold for multicast data packets.\nAfter a TTL threshold is set for a specified MSDP peer, the Router checks the TTL of a multicast data packet before encapsulating the multicast data packet in an SA message. Only the multicast data packet with the TTL being greater than the threshold is encapsulated in an SA message and sent to the peer of the Router.\nPrerequisites\nThe multicast routing function has been enabled using the multicast routing-enable command in the public network instance view or VPN instance view.\nMSDP peers have been configured."
}