{
    "PageTitle": "peer password(VPN instance MSDP view/MSDP view of a public network instance)",
    "FuncDef": "The peer password command configures message-digest algorithm 5 (MD5) authentication for establishing a TCP connection between Multicast Source Discovery Protocol (MSDP) peers and transmitting MSDP messages.\nThe undo peer password command cancels MD5 authentication for an MSDP peer.\nBy default, MD5 authentication is not configured for an MSDP peer.",
    "CLIs": [
        "peer <peer-address> password simple <simple-password>",
        "peer <peer-address> password cipher <cipher-password>",
        "undo peer <peer-address> password"
    ],
    "ParentView": [
        "VPN instance MSDP view",
        "MSDP view of a public network instance"
    ],
    "ParaDef": [
        {
            "Parameters": "peer-address",
            "Info": "Specifies the address of an MSDP peer.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "simple simple-password",
            "Info": "Specifies a password in simple mode.\nThe new password is at least eight characters long and contains at least two of the following types: upper-case letters, lower-case letters, digits, and special characters.For security purposes, you are advised to configure a password in ciphertext mode. To further improve device security, periodically change the password.\nThe value is a string of 1 to 255 case-sensitive characters, without spaces.\nExcept the question mark (?) and space. However, when quotation marks (\") are used around the password, spaces are allowed in the password."
        },
        {
            "Parameters": "cipher cipher-password",
            "Info": "Specifies a password in ciphertext mode.\nIn the case of a plain text, the value is a string of 1 to 255 case-sensitive characters, without spaces. In the case of a cipher text password, the value is a string of 20 to 432 case-sensitive characters, without spaces.\nExcept the question mark (?) and space. However, when quotation marks (\") are used around the password, spaces are allowed in the password."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface loopback1",
            "[*HUAWEI-LoopBack1] quit",
            "[*HUAWEI] multicast routing-enable",
            "[*HUAWEI] msdp",
            "[*HUAWEI-msdp] peer 1.1.1.1 connect-interface LoopBack 1",
            "[*HUAWEI-msdp] peer 1.1.1.1 password cipher Huawei-123"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo enhance the security of TCP connections between MSDP peers, run the peer password command to configure MD5 authentication.\nThe MD5 encryption algorithm has low security and has security risks. You are advised to use the MSDP Keychain encryption algorithm.\nPrerequisites\nThe multicast routing function has been enabled using the multicast routing-enable command in the public network instance view or VPN instance view.MSDP peers have been configured.\nConfiguration Impact\nIf the peer password command is run more than once, the latest configuration overrides the previous one.\nPrecautions\nYou must configure the same authentication password on MSDP peers.otherwise, a TCP connection cannot be set up and MSDP messages cannot be transmitted between the peers.\nThe authentication password configuration modes can be different. That is, you can configure a password in ciphertext mode on one end and the same password in simple mode on the other end.\nIn MSDP, MD5 authentication is mutually exclusive with keychain authentication."
}