{
    "PageTitle": "peer keepalive-interval",
    "FuncDef": "The peer keepalive-interval command sets a keepalive timer value for a Multicast Source Discovery Protocol (MSDP) peer.\nThe undo peer keepalive-interval command restores the default setting.\nBy default, the keepalive timer value for an MSDP peer is 60s.",
    "CLIs": [
        "peer <peer-address> keepalive-interval <keepalive-time-value>",
        "undo peer <peer-address> keepalive-interval"
    ],
    "ParentView": [
        "VPN instance MSDP view",
        "MSDP view of a public network instance"
    ],
    "ParaDef": [
        {
            "Parameters": "peer-address",
            "Info": "Specifies the IP address of an MSDP peer.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "keepalive-time-value",
            "Info": "Sets a keepalive timer value.\nThe value is an integer ranging from 1 to 60, in seconds. The default value is 60"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] msdp",
            "[*HUAWEI-msdp] peer 10.10.10.10 connect-interface GigabitEthernet 1/0/1",
            "[*HUAWEI-msdp] peer 10.10.10.10 keepalive-interval 30"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter an MSDP peer relationship is established, both ends send keepalive messages, and a keepalive timer is started for the MSDP peer. The keepalive timer is reset each time the local end sends a keepalive message upon timer expiration and deleted when the relationship is torn down.\nTo set a keepalive timer value, that is, the interval at which a keepalive message is sent, run the peer keepalive-interval command.\nPrerequisites\nThe peer connect-interface(MSDP) command is run to set up MSDP peer relationships.\nPrecautions\nThe keepalive timer value set on the local end must be less than the holdtime timer value set by the peer hold-time-interval command on the peer end for the corresponding MSDP peer relationship entry."
}