{
    "PageTitle": "shutdown (VPN instance MSDP view/MSDP view of a public network instance)",
    "FuncDef": "The shutdown command terminates a specified Multicast Source Discovery Protocol (MSDP) peer.\nThe undo shutdown command restores the default configuration.\nBy default, the MSDP peers are not closed after the peer relationship is established.",
    "CLIs": [
        "shutdown <peer-address>",
        "undo shutdown <peer-address>"
    ],
    "ParentView": [
        "VPN instance MSDP view",
        "MSDP view of a public network instance"
    ],
    "ParaDef": [
        {
            "Parameters": "peer-address",
            "Info": "Specifies the IP address of an MSDP peer.\nThe address is in dotted decimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] interface LoopBack 0",
            "[*HUAWEI-LoopBack0] quit",
            "[*HUAWEI] msdp",
            "[*HUAWEI-msdp] peer 192.168.1.1 connect-interface LoopBack 0",
            "[*HUAWEI-msdp] shutdown 192.168.1.1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe shutdown command can be used to close the TCP connection between two MSDP peers whereas keep the MSDP peer relationship.\nPrerequisites\nThe multicast routing-enable command is run in the public network instance view or VPN instance view.\nThe device of the IP address of an MSDP peer specified in the shutdown command must have set up an MSDP peer relationship with the router.\nConfiguration Impact\nAfter the shutdown command is run on MSDP peers,the MSDP peers do not transmit source active(SA)messages or attempt to establish a connection.\nWhen the display msdp brief command or the display msdp peer-status command is used to check the status of MSDP peers,State in the command output is displayed as Shutdown.\nPrecautions\nYou only need to run the undo shutdown command to restore the configuration.Running the peer connect-interface command to reconfigure the MSDP peer is not required."
}