{
    "PageTitle": "peer (VPN instance MSDP view/MSDP view of a public network instance)",
    "FuncDef": "The peer connect-interface command specifies a source interface from which BGP packets are sent, and a source address used for initiating a connection.\nThe undo peer connect-interface command restores the default setting.\nBy default, the outbound interface of a BGP packet serves as the source interface of a BGP packet.",
    "CLIs": [
        "peer <peer-address> connect-interface { <interface-type> <interface-number> | <port-name> }",
        "undo peer <peer-address>"
    ],
    "ParentView": [
        "VPN instance MSDP view",
        "MSDP view of a public network instance"
    ],
    "ParaDef": [
        {
            "Parameters": "peer-address",
            "Info": "Specifies the address of a remote MSDP peer.\nThe address is in dotted decimal notation."
        },
        {
            "Parameters": "interface-type interface-number",
            "Info": "Specifies the type and number of an interface. The local router uses the primary address of the interface as the source IP address to set up a TCP connection with the remote MSDP peer.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] msdp",
            "[*HUAWEI-msdp] peer 10.10.7.6 connect-interface GigabitEthernet 1/0/0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo set up an MSDP peer relationship and a TCP connection between peers, run the peer connect-interface command.\nRunning the peer connect-interface command is the prerequisites for you to run other peer commands.\nPrerequisites\nThe multicast routing function has been enabled using the multicast routing-enable command in the public network instance view or VPN instance view.\nConfiguration Impact\nYou can run the peer peer-address connect-interface port-type port-number command repeatedly to configure multiple MSDP peers for the local router.\nYou can specify the same interface for different parameter peer-address. That is, you can specify the same local interface for different remote peers.\nPrecautions\nWhen configuring a static reverse path forwarding (RPF) peer, you must first run the peer connect-interface command to set the remote end as an MSDP peer and then the static-rpf-peer command to set the MSDP peer as a static RPF peer.\nRunning the undo peer peer-address command deletes all the configurations related to a specified peer."
}