{
    "PageTitle": "peer hold-time-interval",
    "FuncDef": "The peer hold-time-interval command sets a holdtime timer value for the entry of a MSDP peer relationship.\nThe undo peer hold-time-interval command restores the default setting.\nBy default, the holdtime timer value for the entry of an MSDP peer relationship is 90s.",
    "CLIs": [
        "peer <peer-address> hold-time-interval <holdtime-value>",
        "undo peer <peer-address> hold-time-interval"
    ],
    "ParentView": [
        "VPN instance MSDP view",
        "MSDP view of a public network instance"
    ],
    "ParaDef": [
        {
            "Parameters": "peer-address",
            "Info": "Specifies the IP address of an MSDP peer.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "holdtime-value",
            "Info": "Specifies a holdtime timer value for the entry of an MSDP peer relationship.\nThe value is an integer ranging from 3 to 150, in seconds. The default value is 90."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] msdp",
            "[*HUAWEI-msdp] peer 10.10.10.10 connect-interface GigabitEthernet 1/0/1",
            "[*HUAWEI-msdp] peer 10.10.10.10 hold-time-interval 100"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter an MSDP peer relationship is established, an MSDP peer entry is created, and a holdtime timer is started for the entry. The holdtime timer is reset each time a message is received from the MSDP peer and deleted when the relationship is torn down. The entry is deleted if no message is received from the peer before the holdtime timer expires.\nTo set the holdtime for an MSDP peer entry, run the peer hold-time-interval command.\nPrerequisites\nThe peer connect-interface (MSDP) command is run to set up MSDP peer relationships.\nPrecautions\nThe holdtime timer value set on the local end must be greater than the keepalive timer value set by the peer keepalive-interval command on the peer end for the corresponding MSDP peer relationship entry."
}