{
    "PageTitle": "cache-sa-enable",
    "FuncDef": "The cache-sa-enable command enables the source active (SA) cache function on a router, allowing the router to cache (S, G) information carried in received SA messages.\nThe undo cache-sa-enable command disables the SA cache function.\nBy default, the SA cache function is enabled on a Router.",
    "CLIs": [
        "cache-sa-enable",
        "undo cache-sa-enable"
    ],
    "ParentView": [
        "VPN instance MSDP view",
        "MSDP view of a public network instance"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] msdp",
            "[*HUAWEI-msdp] undo cache-sa-enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo enable a Router to save (S, G) information carried in received SA messages locally, run the cache-sa-enable command to enable the SA cache function, so that the Router can obtain (S, G) information from the SA cache after receiving a multicast data service request.\nIf the SA cache function is disabled using the undo cache-sa-enable command, the Router must wait for an SA message sent by the Multicast Source Discovery Protocol (MSDP) peer in the next sending period after the router receives a multicast data service request. This may result in a delay in multicast data receiving.\nPrerequisites\nThe multicast routing function has been enabled using the multicast routing-enable command in the public network instance view or VPN instance view.\nConfiguration Impact\nWhen a rendezvous point (RP) receives a new (*, G) Join message,\nIf the SA cache function is enabled, the RP searches the SA cache for matching (S, G) information.If the SA cache contains the (S, G) information, the RP directly joins the shortest path tree (SPT) with the multicast source at the root.If the SA cache does not contain the (S, G) information, the RP does not process the Join message.If the SA cache function is disabled, the RP waits for the SA message sent by the MSDP peer in the next sending period."
}