{
    "PageTitle": "display pim ipv6 bfd session",
    "FuncDef": "The display pim ipv6 bfd session command displays information about PIM IPv6 BFD sessions.",
    "CLIs": [
        "display pim ipv6 bfd session [ neighbor <ipv6-link-local-address> | interface { <interface-name> | <interface-type> <interface-number> } ] *"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "neighbor ipv6-link-local-address",
            "Info": "Displays information about PIM IPv6 BFD sessions on a specified neighbor.\nThe value ranges from FE80:: to FE80:FFFF:FFFF:FFFF:FFFF:FFFF:FFFF:FFFF, in hexadecimal notation."
        },
        {
            "Parameters": "interface interface-type interface-number",
            "Info": "Displays information about PIM IPv6 BFD sessions on a specified interface.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display pim ipv6 bfd session",
            " VPN-Instance: public net",
            " Total 1 BFD session Created",
            "",
            " GigabitEthernet1/0/0 (FE80::7): Total 1 BFD session Created",
            "",
            " Neighbor        ActTx(ms) ActRx(ms) ActMulti Local/Remote State",
            " FE80::6         200       300       4         8211/8214   Up"
        ],
        [
            "<HUAWEI> display pim ipv6 bfd session interface gigabitethernet1/0/0",
            " VPN-Instance: public net",
            "",
            " GigabitEthernet1/0/0 (FE80::7): Total 1 BFD session Created",
            "",
            " Neighbor        ActTx(ms) ActRx(ms) ActMulti Local/Remote State",
            " FE80::6         100       100       4         8211/8214   Up"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter BFD for IPv6 PIM is configured to detect the status of PIM neighbors, a PIM IPv6 BFD session needs to be established. The display pim ipv6 bfd session command can be used to view statistics about and configurations of PIM IPv6 BFD sessions.\nThe following commands are commonly used to view statistics and configurations of PIM IPv6 BFD sessions:\nThe display pim ipv6 bfd session statistics command is used to display statistics about PIM IPv6 BFD sessions in the public network instance.The display pim ipv6 bfd session command is used to view information about PIM IPv6 BFD sessions on all interfaces of a device.The display pim ipv6 bfd session interface  interface-type interface-number neighbor neighbor-address command is used to view information about the PIM IPv6 BFD session on a specified interface or a specified neighbor.\nOn an IPv6 network, information about PIM-SM/SSM IPv6 BFD sessions on the public network instance can be viewed."
}