{
    "PageTitle": "c-bsr",
    "FuncDef": "The c-bsr command configures a Candidate-BootStrap Router (C-BSR).\nThe undo c-bsr command deletes a configured C-BSR.\nBy default, no C-BSR is configured.",
    "CLIs": [
        "c-bsr <ipv6-address> [ <hash-length> [ <priority-value> ] ]",
        "undo c-bsr"
    ],
    "ParentView": [
        "IPv6 PIM view",
        "VPN instance IPv6 PIM view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv6-address",
            "Info": "Specifies the IPv6 global unicast address of a C-BSR. IPv6 PIM-SM must be enabled on the interface assigned an IPv6 address before other multicast configurations are performed on it.\nTo avoid frequent protocol changes caused by interface flapping, use the loopback interface address as the global IPv6 unicast address of the C-BSR.\nThe address is in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "hash-length",
            "Info": "Specifies the hash mask length of a C-BSR. The hash mask length is used by the hash function to calculate an RP.\nThe value is an integer ranging from 0 to 128."
        },
        {
            "Parameters": "priority-value",
            "Info": "Specifies the priority value of a C-BSR.\nThe value is an integer ranging from 0 to 255."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast ipv6 routing-enable",
            "[*HUAWEI] pim-ipv6",
            "[*HUAWEI-pim6] c-bsr 2001:db8:2::2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn a PIM-SM network, the BSR mechanism is used to dynamically elect a Rendezvous Point (RP). The BSR collects Candidate-Rendezvous Point (C-RP) information to form an RP-set, and then advertises the RP-set to the entire network. Based on the RP-set, all Routers in the network can calculate out the RP to which a specific multicast group corresponds. The BSR and other devices in the PIM-SM domain need to exchange a great deal of information and thus lots of bandwidth should be reserved between the C-BSR and other devices in the PIM-SM domain.\nOne Router can function as both a C-RP and a C-BSR. One Router can be configured with multiple instances. Each instance can be configured with a maximum of one C-BSR. If the c-bsr command is run repeatedly in an instance, only the latest configuration takes effect.\nOne or more C-BSRs need to be configured in a PIM-SM domain. The C-BSRs automatically elect a BSR that is responsible for collecting and advertising RP information. C-BSRs must be Routers on the backbone network. When the Router is configured as a C-BSR, an interface enabled with PIM-SM needs to be specified.\nThe process of electing a BSR from C-BSRs is as follows:\nAt first, each C-BSR considers itself as the BSR of the PIM-SM domain, and uses the interface IP address specified by using the c-bsr command as the BSR address to send Bootstrap messages.When a C-BSR receives a Bootstrap message from another Router, it compares the BSR information in the received Bootstrap message with the acknowledged BSR information in terms of priorities and IP addresses. In this process, the BSR with the higher priority is preferred. In the case of the same priority, the BSR with the higher IP address is preferred. If the BSR carried in a received the Bootstrap message is better than the current BSR, the C-BSR replaces its BSR address with the address of the BSR carried in the received Bootstrap message. Otherwise, the C-BSR keeps its BSR address and continues to consider itself as the BSR.\n\nPrerequisites\nThe multicast ipv6 routing-enable command is run in the public network instance view.\nPrecautions\nThe interface that functions as a C-BSR must be enabled with IPv6 PIM-SM."
}