{
    "PageTitle": "pim ipv6 bsr-boundary",
    "FuncDef": "The pim ipv6 bsr-boundary command configures a BootStrap router (BSR) boundary on an interface.\nThe undo pim ipv6 bsr-boundary command restores the default configuration.\nBy default, no BSR boundary is configured on an interface.",
    "CLIs": [
        "pim ipv6 bsr-boundary",
        "undo pim ipv6 bsr-boundary"
    ],
    "ParentView": [
        "PW-VE sub-interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "GE electrical interface view",
        "Port extension interface view",
        "Loopback interface view",
        "Serial interface view",
        "Eth-Trunk sub-interface view",
        "50GE sub-interface view",
        "MP-group interface view",
        "400GE interface view",
        "10GE interface view",
        "GE sub-interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "GE interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "100ge sub-interface view",
        "25GE interface view",
        "40GE sub-interface view",
        "Eth-Trunk interface view",
        "10GE sub-interface view",
        "POS interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast ipv6 routing-enable",
            "[*HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] ipv6 enable",
            "[*HUAWEI-GigabitEthernet1/0/0] pim ipv6 bsr-boundary"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA BSR is a core of a PIM-SM network responsible for collecting Rendezvous Point (RP)-Set information on the network, encapsulating the RP-Set information in a Bootstrap message, and advertising the message to every PIM neighbor.\nPrior to configuring PIM-SM inter-domain multicast, you need to configure BSR boundaries on interfaces of edge Router to divide PIM-SM domains.\nConfiguring BSR boundaries for a PIM-SM network and the Internet also helps isolate the PIM-SM network from the Internet.\nPrerequisites\nThe multicast ipv6 routing-enable command is run in the public network instance view.\nConfiguration Impact\nThe interface configured with a BSR boundary of a PIM-SM domain can neither send nor receive BSR messages. BSR messages cannot pass the BSR boundary but other multicast packets can pass the BSR boundary. BSR boundaries divide a large-scale PIM-SM network into several PIM-SM domains and each BSR serves only the local PIM-SM domain and Routers in another PIM-SM domain cannot participate in packet forwarding in the local domain.\nPrecautions\nIf two PIM-SM domains are in different autonomous systems (ASs), you also need to configure BSR boundaries on edge Routers."
}