{
    "PageTitle": "peer(IPv6 anycast-RP view)",
    "FuncDef": "The peer command configures Anycast Rendezvous Point (RP) peers.\nThe undo peer command removes the configurations of Anycast RPs.\nBy default, no Anycast RP peer is configured.",
    "CLIs": [
        "peer <RpPeerAddress>",
        "undo peer <RpPeerAddress>"
    ],
    "ParentView": [
        "IPv6 anycast-RP view",
        "VPN instance IPv6 anycast-RP view"
    ],
    "ParaDef": [
        {
            "Parameters": "RpPeerAddress",
            "Info": "Specifies the address of an Anycast RP peer.\nThe value is in hexadecimal notation."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast ipv6 routing-enable",
            "[*HUAWEI] pim-ipv6",
            "[*HUAWEI-pim6] anycast-rp 2001:DB8::1",
            "[*HUAWEI-pim6-anycast-rp-2001:DB8::1] peer 2001:DB8::2"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf PIM Anycast RP is configured, after an RP receives a Register message, it checks the source address in the Register message. If the Register message is sent by the source's designated router (DR), the RP forwards the Register message to Anycast RP peers. If the Register message is sent by an Anycast RP peer, it does not forward the Register message.\nWhen forwarding a PIM Register message to other Anycast RP peers, the local RP needs to use its own IP address (called the local address) as the source address of the Register message and use the addresses of Anycast RP peers as the destination addresses of the Register message. In such a manner, Anycast RP peers can learn source/group information from each other. This command is used to configure an address for an Anycast RP peer. This address is used as the destination address of the Register message to be sent by the local RP.\nPrecautions\nYou can specify a maximum of 16 Anycast RP peers for each Anycast RP.\nIn a PIM-SM domain, all the devices deployed with Anycast RP must be fully connected logically. Anycast RP peer relationships need to be configured between every two devices deployed with the Anycast RP."
}