{
    "PageTitle": "register-suppression-timeout(IPv6)",
    "FuncDef": "The register-suppression-timeout command sets a timeout period during which the device remains in the Register suppression state.\nThe undo register-suppression-timeout command restores the default value.\nBy default, the timeout period during which the device remains in the Register suppression state is 60 seconds.",
    "CLIs": [
        "register-suppression-timeout <interval>",
        "undo register-suppression-timeout"
    ],
    "ParentView": [
        "IPv6 PIM view",
        "VPN instance IPv6 PIM view"
    ],
    "ParaDef": [
        {
            "Parameters": "interval",
            "Info": "Specifies a timeout period during which the device remains in the Register suppression state.\nThe value is an integer ranging from 11 to 3600, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast ipv6 routing-enable",
            "[*HUAWEI] pim-ipv6",
            "[*HUAWEI-pim6] register-suppression-timeout 70"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter receiving a Register-Stop message from the rendezvous point (RP), a device immediately stops sending Register messages and enters the register suppression state. To set a timeout period during which the device remains in the register suppression state, run the register-suppression-timeout command.\nIf the configured timeout period is too short, the RP frequently receives burst multicast data. If the configured timeout period is too long, the delay for a new receiver to join a multicast group is long when an (S, G) entry times out on the RP.\nPrerequisites\nThe multicast ipv6 routing-enable command is run in the public network instance view.\nConfiguration Impact\nIf the register-suppression-timeout command is run more than once, the latest configuration overrides the previous one.\nPrecautions\nYou can run the probe-interval command to enable the router to send null Register messages before the timeout. In this manner, burst register is reduced and the delay in which a new receiver of a group is shortened, which shortens the timeout period during which the router remains in the Register suppression state."
}