{
    "PageTitle": "pim ipv6 hello-option override-interval",
    "FuncDef": "The pim ipv6 hello-option override-interval command sets the interval carried in a Hello message sent by a PIM interface to override a prune action.\nThe undo pim ipv6 hello-option override-interval command restores the default value.\nBy default, the interval carried in a Hello message sent by a PIM interface to override a prune action is 2500 milliseconds.",
    "CLIs": [
        "pim ipv6 hello-option override-interval <interval>",
        "undo pim ipv6 hello-option override-interval"
    ],
    "ParentView": [
        "Virtual template view",
        "PW-VE sub-interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "GE electrical interface view",
        "Port extension interface view",
        "Loopback interface view",
        "Serial interface view",
        "Eth-Trunk sub-interface view",
        "50GE sub-interface view",
        "MP-group interface view",
        "400GE interface view",
        "10GE interface view",
        "GE sub-interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "GE interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "100ge sub-interface view",
        "25GE interface view",
        "40GE sub-interface view",
        "Eth-Trunk interface view",
        "10GE sub-interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "interval",
            "Info": "Specifies the interval carried in a Hello message sent by a PIM interface to override a prune action.\nThe value is an integer ranging from 1 to 65535, in milliseconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast ipv6 routing-enable",
            "[*HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] ipv6 enable",
            "[*HUAWEI-GigabitEthernet1/0/0] pim ipv6 hello-option override-interval 2000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nHello messages sent by the Router carry lan-delay and override-interval parameters. lan-delay indicates the delay in sending Prune messages in a LAN. When the values of lan-delay on all Routers on the same link are different, the maximum value among these values is used after negotiation.\nIf one Router receives a Prune message from an upstream interface, it indicates that other downstream Routers still exist in the LAN. If the Router still needs to receive multicast data, it must send a Join message to the upstream interface to override the prune action within the set override-interval.\nWhen receiving a Prune message from a downstream interface, the Router does not perform the prune action immediately until the PPT times out. The PPT equals the value of the lan-delay plus the override-interval. If the Router receives a Join message from its downstream device before the PPT expires, the Router cancels the prune action.\nPrerequisites\nThe multicast ipv6 routing-enable command is run in the public network instance view.\nConfiguration Impact\nIf the pim ipv6 hello-option override-interval command or pim ipv6 silent command is run several times, the latest configuration overrides the previous one."
}