{
    "PageTitle": "pim ipv6 hello-option dr-priority",
    "FuncDef": "The pim hello-option dr-priority command configures a designated router (DR) election priority for an IPv6 PIM interface.\nThe undo pim hello-option dr-priority command restores the default priority.\nBy default, the DR election priority of an IPv6 PIM interface is 1.",
    "CLIs": [
        "pim ipv6 hello-option dr-priority <priority>",
        "pim ipv6 sm",
        "undo pim ipv6 sm",
        "undo pim ipv6 hello-option dr-priority"
    ],
    "ParentView": [
        "Virtual template view",
        "PW-VE sub-interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "Port extension interface view",
        "GE electrical interface view",
        "Loopback interface view",
        "Serial interface view",
        "Eth-Trunk sub-interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "10GE interface view",
        "MP-group interface view",
        "GE sub-interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "GE interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "100ge sub-interface view",
        "25GE interface view",
        "40GE sub-interface view",
        "Eth-Trunk interface view",
        "10GE sub-interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "priority",
            "Info": "Specifies a DR election priority. A larger value indicates a higher priority.\nThe value is an integer ranging from 0 to 4294967295."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast ipv6 routing-enable",
            "[*HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] ipv6 enable",
            "[*HUAWEI-GigabitEthernet1/0/0] pim ipv6 hello-option dr-priority 3"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn an IPv6 PIM-SM shared network segment, a DR is dynamically elected among candidate Router interfaces. DR election is based on priorities and IP addresses of interfaces on Routers. In a DR election process, Routers exchange Hello messages carrying DR election priorities.\nIf all Routers support Hello messages that carry DR election priorities, the interface with the highest DR election priority wins. If all interfaces have the same DR election priority, the interface with the largest IP address wins.If one or more Routers do not support Hello messages that carry DR priorities, the interface with the largest IP address wins.\nTo change the DR election priority of an IPv6 PIM interface, run the pim hello-option dr-priority command.\n\nPrerequisites\nThe multicast routing function has been enabled using the multicast ipv6 routing-enable command in the public network instance view.\nConfiguration Impact\nIf the pim hello-option dr-priority command is run more than once, the latest configuration overrides the previous one.\nRunning the undo pim ipv6 sm command clears information about PIM neighbor relationships on an interface. If the interface is running IPv6 multicast services, the IPv6 multicast services will be interrupted. Therefore, exercise caution when using the undo pim ipv6 sm command."
}