{
    "PageTitle": "pim ipv6 timer dr-switch-delay",
    "FuncDef": "The pim ipv6 timer dr-switch-delay command enables the IPv6 PIM designated router (DR) switching delay function and configures a switching delay on an interface.\nThe undo pim ipv6 timer dr-switch-delay command disables IPv6 PIM DR switching delay on an interface.\nBy default, an IPv6 PIM interface sends Hello messages at an interval of 30 seconds, IPv6 PIM DR switching delay is disabled on an interface.",
    "CLIs": [
        "pim ipv6 timer dr-switch-delay <interval>",
        "undo pim ipv6 timer dr-switch-delay"
    ],
    "ParentView": [
        "Virtual template view",
        "PW-VE sub-interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "GE electrical interface view",
        "Port extension interface view",
        "Loopback interface view",
        "Serial interface view",
        "Eth-Trunk sub-interface view",
        "50GE sub-interface view",
        "MP-group interface view",
        "400GE interface view",
        "10GE interface view",
        "GE sub-interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "GE interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "100ge sub-interface view",
        "25GE interface view",
        "40GE sub-interface view",
        "Eth-Trunk interface view",
        "10GE sub-interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "interval",
            "Info": "Specifies the IPv6 PIM DR switching delay.\nThe value is an integer ranging from 10 to 3600, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast ipv6 routing-enable",
            "[*HUAWEI] interface GigabitEthernet 1/0/1",
            "[*HUAWEI-GigabitEthernet1/0/1] ipv6 enable",
            "[*HUAWEI-GigabitEthernet1/0/1] pim ipv6 timer dr-switch-delay 20"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWithout the IPv6 PIM DR switching delay function, when the system triggers a IPv6 PIM DR switchover, the switchover takes effect immediately, and therefore data forwarding will be interrupted during the switchover period. If the network is unstable, frequent switchovers occur, affecting the multicast forwarding performance. To address this issue, run the pim ipv6 timer dr-switch-delay command to configure a DR switching delay to implement non-stop service forwarding during the switchover.\nPrerequisites\nThe multicast routing function has been enabled using the multicast ipv6 routing-enable command in the public network instance view.\nConfiguration Impact\nAfter an outbound interface changes from a DR to a non-DR, the IPv6 PIM DR switching delay function enables the interface to continue to forward data before the delay expires.\nPrecautions\nThe configuration of deleting or changing a DR switching delay takes effect only after the current switching delay expires.\nThe pim ipv6 timer dr-switch-delay command is mutually exclusive with the pim ipv6 silent command."
}