{
    "PageTitle": "pim ipv6 single-tag forward enable",
    "FuncDef": "The pim ipv6 single-tag forward enable command enables a QinQ/dot1q VLAN tag termination sub-interface to forward IPv6 single-tagged PIM messages.\nThe undo pim ipv6 single-tag forward enable command restores the default configuration.\n\nBy default, a QinQ/dot1q VLAN tag termination sub-interface is not enabled to forward single-tagged IPv6 PIM messages.",
    "CLIs": [
        "pim ipv6 single-tag forward enable",
        "undo pim ipv6 single-tag forward enable"
    ],
    "ParentView": [
        "GE sub-interface view",
        "Global VE sub-interface view",
        "Eth-Trunk sub-interface view",
        "400GE sub-interface view",
        "50GE sub-interface view",
        "VE sub-interface view",
        "100ge sub-interface view",
        "25GE sub-interface view",
        "40GE sub-interface view",
        "10GE sub-interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast ipv6 routing-enable",
            "[*HUAWEI] interface GigabitEthernet 1/0/1.1",
            "[*HUAWEI-GigabitEthernet1/0/1.1] encapsulation dot1q-termination",
            "[*HUAWEI-GigabitEthernet1/0/1.1] dot1q termination vid 10",
            "[*HUAWEI-GigabitEthernet1/0/1.1] ipv6 enable",
            "[*HUAWEI-GigabitEthernet1/0/1.1] pim ipv6 single-tag forward enable"
        ]
    ],
    "ExtraInfo": "Usage Scenario\n\nIf a QinQ/dot1q VLAN tag termination sub-interface on the Router is connected to a downstream Router, run the pim ipv6 single-tag forward enable command to enable the sub-interface to forward single-tagged IPv6 PIM messages received from the downstream device.\n\nPrerequisites\n\nMulticast routing has been enabled using the multicast ipv6 routing-enable command in the system view, and IPv6 PIM-SM has been enabled on the sub-interface using the pim ipv6 sm command.\n\nPrecautions\n\nThe pim ipv6 single-tag forward enable command is mutually exclusive with the mld enable and mld static-group commands.\nThis command applies only to QinQ/dot1q VLAN tag termination sub-interfaces that are configured to terminate single-tagged IPv6 PIM messages or are not configured to terminate any tagged IPv6 PIM messages.\nAfter the undo pim ipv6 single-tag forward enable command is run on a QinQ/dot1q VLAN tag termination sub-interface, QinQ/dot1q outbound interface entries of the sub-interface fail to be delivered to the sub-interface, causing multicast traffic forwarding failures."
}