{
    "PageTitle": "pim ipv6 hello-option holdtime",
    "FuncDef": "The pim ipv6 hello-option holdtime command sets the neighbor timeout period carried in PIM Hello packets to be sent by a PIM interface.\nThe undo pim ipv6 hello-option holdtime command restores the default value.\nBy default, the neighbor timeout period carried in PIM Hello packets to be sent by a PIM interface is 105 seconds.",
    "CLIs": [
        "pim ipv6 hello-option holdtime <interval>",
        "undo pim ipv6 hello-option holdtime"
    ],
    "ParentView": [
        "Virtual template view",
        "PW-VE sub-interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "GE electrical interface view",
        "Port extension interface view",
        "Loopback interface view",
        "Serial interface view",
        "Eth-Trunk sub-interface view",
        "50GE sub-interface view",
        "MP-group interface view",
        "400GE interface view",
        "10GE interface view",
        "GE sub-interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "GE interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "100ge sub-interface view",
        "25GE interface view",
        "40GE sub-interface view",
        "Eth-Trunk interface view",
        "10GE sub-interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "interval",
            "Info": "Specifies the neighbor timeout period carried in PIM Hello messages to be sent.\nThe value is an integer ranging from 1 to 65535, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast ipv6 routing-enable",
            "[*HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] ipv6 enable",
            "[*HUAWEI-GigabitEthernet1/0/0] pim ipv6 hello-option holdtime 120"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nYou can run this command to set the neighbor timeout period carried in PIM Hello packets to be sent by a router. If the receive end does not receive any Hello packet from the local device within the timeout period, the receive end considers that the local neighbor is aged. If routers need to quickly detect PIM neighbor changes, set this parameter to a smaller value, but the value must be greater than the configured interval for sending Hello messages. The timer hello and pim ipv6 timer hello commands can be used to set the interval at which a PIM neighbor sends Hello messages.\nSet a proper value for the interval parameter in the pim hello-option holdtime command based on the configuration of the timer hello or pim ipv6 timer hello command run on PIM neighbors.\nPrerequisites\nThe multicast routing function has been enabled using the multicast ipv6 routing-enable command in the public network instance view.\nConfiguration Impact\nIf the pim ipv6 hello-option holdtime command is run more than once, the latest configuration overrides the previous one."
}