{
    "PageTitle": "hello-option lan-delay(IPv6)",
    "FuncDef": "The hello-option lan-delay command sets the delay in transmitting Prune messages on a shared network segment.\nThe undo hello-option lan-delay command restores the default value.\nBy default, the delay in transmitting Prune messages on a shared network segment is 500 ms.",
    "CLIs": [
        "hello-option lan-delay <lanDelayValue>",
        "undo hello-option lan-delay"
    ],
    "ParentView": [
        "IPv6 PIM view",
        "VPN instance IPv6 PIM view"
    ],
    "ParaDef": [
        {
            "Parameters": "lanDelayValue",
            "Info": "Specifies the period from the time when the router receives a Prune message from a downstream device to the time when the router performs the prune action.\nThe value is an integer ranging from 1 to 32767, in milliseconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast ipv6 routing-enable",
            "[*HUAWEI] pim-ipv6",
            "[*HUAWEI-pim6] hello-option lan-delay 200"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nHello messages sent by the router carry lan-delay and override-interval. lan-delay indicates the delay in transmitting Prune messages in a LAN. When the lan-delay values on all routers on the same link are different, the maximum value of these values is used.\nIf one router receives a Prune message from an upstream interface, other downstream routers still exist in the LAN. If the router still needs to receive multicast data, it must send a Join message to the upstream interface to override the prune action within the set override-interval value.\nThe PPT means the period from the time when the router receives a Prune message from a downstream device to the time when the router performs the prune action. The value of the PPT equals the lan-delay value plus the override-interval value. If a device receives a Join message from its downstream device before the PPT expires, it cancels the prune action.\nPrerequisites\nThe multicast ipv6 routing-enable command is run in the public network instance view.\nConfiguration Impact\nIf the hello-option lan-delay command is run more than once, the latest configuration overrides the previous one.\nPrecautions\nIf the delay in transmitting Prune message is too short, the upstream router will stop forwarding multicast packets before it determines whether to override the Prune action or not. Exercise caution when running this command."
}