{
    "PageTitle": "pim ipv6 holdtime assert",
    "FuncDef": "The pim ipv6 holdtime assert command sets the timeout period during which a PIM interface waits to receive Assert messages from the forwarder.\nThe undo pim ipv6 holdtime assert command restores the default timeout period.\nBy default, the timeout period of an interface is 180 seconds.",
    "CLIs": [
        "pim ipv6 holdtime assert <interval>",
        "undo pim ipv6 holdtime assert"
    ],
    "ParentView": [
        "Virtual template view",
        "PW-VE sub-interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "GE electrical interface view",
        "Port extension interface view",
        "Loopback interface view",
        "Serial interface view",
        "Eth-Trunk sub-interface view",
        "50GE sub-interface view",
        "MP-group interface view",
        "400GE interface view",
        "10GE interface view",
        "GE sub-interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "GE interface view",
        "100GE interface view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "100ge sub-interface view",
        "25GE interface view",
        "40GE sub-interface view",
        "Eth-Trunk interface view",
        "10GE sub-interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "interval",
            "Info": "Specifies a timeout period during which a PIM interface waits to receive Assert messages from the forwarder.\nThe value is an integer ranging from 7 to 65535, in seconds."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast ipv6 routing-enable",
            "[*HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] ipv6 enable",
            "[*HUAWEI-GigabitEthernet1/0/0] pim ipv6 holdtime assert 100"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo prevent redundant traffic, a shared network segment should have only one forwarder. Therefore, each router sends an Assert message immediately after its forwarding interface receives the same multicast packet on a shared network segment, which indicates that more than one forwarder exists. Then, the routers elect a unique forwarder, called the assert winner. The assert winner periodically sends Assert messages to maintain its winner state. The router that fails in the election disable its downstream interfaces from forwarding multicast data within a specified timeout period, but restore the pruned interfaces to forward packets if they do not receive any Assert messages from the assert winner after the timeout period expires. To set such a timeout period, run the undo pim ipv6 holdtime assert command.\nPrerequisites\nThe multicast ipv6 routing-enable command is run in the public network instance view.\nConfiguration Impact\nIf the pim ipv6 holdtime assert command is run more than once, the latest configuration overrides the previous one."
}