{
    "PageTitle": "ipsec sa (IPv6)",
    "FuncDef": "The ipsec sa command globally specifies a security association (SA) using which interfaces authenticate sent and received IPv6 PIM messages to implement IPv6 PIM IP Security (IPsec) authentication.\nThe undo ipsec sa command restores the default configuration.\nBy default, no SA is specified globally, so that interfaces do not authenticate sent or received IPv6 PIM messages.",
    "CLIs": [
        "ipsec sa <sa-name>",
        "undo ipsec sa"
    ],
    "ParentView": [
        "IPv6 PIM view",
        "VPN instance IPv6 PIM view"
    ],
    "ParaDef": [
        {
            "Parameters": "sa-name",
            "Info": "Specifies the name of an SA.\nIt is a string of 1 to 15 case-sensitive characters, spaces not supported. The characters can be letters or numbers, hyphens (-) not supported. When double quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast ipv6 routing-enable",
            "[*HUAWEI] ipsec sa sa1",
            "[*HUAWEI-ipsec-sa-sa1] quit",
            "[*HUAWEI] pim-ipv6",
            "[*HUAWEI-pim6] ipsec sa sa1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nOn a multicast network, forged IPv6 PIM messages may be used to attack devices, causing devices unable to forward multicast traffic. To protect a device against attacks launched using forged IPv6 PIM messages, run the ipsec sa command to configure the device to authenticate the sent and received IPv6 PIM messages based on a specified SA.\nPrerequisites\nMulticast has been enabled using the multicast ipv6 routing-enable command.Basic IPsec functions have been configured.\n\nPrecautions\nIf the ipsec sa command is run more than once, the latest configuration overrides the previous one. If the ipsec sa and hello ipsec sa commands are both configured, the command configured later overrides the command configured earlier."
}