{
    "PageTitle": "reset pim ipv6 routing-table",
    "FuncDef": "The reset pim ipv6 routing-table command clears PIM status of the specified downstream interface of the specified IPv6 PIM entry.",
    "CLIs": [
        "reset pim ipv6 routing-table group <groupAddr> mask <group-mask-length> source <sourceAddr> interface { <oif-port-type> <oif-port-num> | <oif-port-name> }",
        "reset pim ipv6 vpn-instance <vpn-instance-name> routing-table group <groupAddr> mask <group-mask-length> source <sourceAddr> interface { <oif-port-type> <oif-port-num> | <oif-port-name> }"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "mask group-mask-length",
            "Info": "Specifies the mask length of an IPv6 multicast group address.\nThe value is an integer that ranges from 0 to 128."
        },
        {
            "Parameters": "sourceAddr",
            "Info": "Specifies the source address of an IPv6 PIM entry.\nIf the specified PIM entry is a (*, G) entry, the source address is 0::0."
        },
        {
            "Parameters": "interface oif-port-type oif-port-num",
            "Info": "Specifies the type and number of an interface.\n-"
        },
        {
            "Parameters": "oif-port-name",
            "Info": "Specifies the name of an interface.\n-"
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "group groupAddr",
            "Info": "Specifies the group address of an IPv6 PIM entry.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> reset pim ipv6 routing-table group ff25::1 mask 128 source 4::4 interface GigabitEthernet 1/0/0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nClearing PIM status of the downstream interfaces may trigger the sending of corresponding Join/Prune messages, which affects multicast services.\nUsing this command can clear join information about illegal users and stop data forwarding on the specified downstream interfaces of the specified PIM entry.\nUsing this command only can clear the PIM status of the specified interface in a specified PIM entry. The command cannot be used to clear the MLD and static group join status on a specified interface."
}