{
    "PageTitle": "clock daylight-saving-time",
    "FuncDef": "The clock daylight-saving-time command sets the start time and end time of the daylight saving time.\nThe undo clock daylight-saving-time command deletes the daylight saving time setting.\nBy default, the daylight saving time is disabled.",
    "CLIs": [
        "clock daylight-saving-time <dstname> one-year <start-time> <start-date> <end-time> <end-date> <offset>",
        "clock daylight-saving-time <dstname> repeating <start-time> <repeat-start-date> <end-time> <repeat-end-date> <offset> [ <startyear> [ <endyear> ] ]",
        "clock daylight-saving-time <dstname> repeating <start-time> { { first | second | third | fourth | last } <startweekday> <startmonth> <end-time> { first | second | third | fourth | last } <endweekday> <endmonth> } <offset> [ <startyear> [ <endyear> ] ]",
        "undo clock daylight-saving-time"
    ],
    "ParentView": [
        "User view"
    ],
    "ParaDef": [
        {
            "Parameters": "dstname",
            "Info": "specifies the name of summer time zone. It is a string data type. The string length range is from 1 to 32 characters.\nThe value is a string of 1 to 32 characters, spaces not supported. When quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "one-year start-time",
            "Info": "Specifies the start time of the summer time to a certain year. It is in the format of HH:MM. The value of HH ranges from 0 to 23; the values of MM range from 0 to 59.\nHH specifies the hour, which is an integer ranging from 0 to 23. MM specifies the minute, which is an integer ranging from 0 to 59."
        },
        {
            "Parameters": "start-date",
            "Info": "specifies the start date, when configures summer time to a certain year. It is in the format of YYYY-MM-DD. The value of YYYY ranges from 2000 to 2037; the value of MM ranges from 1 to 12; the value of DD ranges from 1 to 31.\nYYYY specifies the year, which is an integer ranging from 2000 to 2037. MM specifies the month, which is an integer ranging from 1 to 12. DD specifies the day, which is an integer ranging from 1 to 31."
        },
        {
            "Parameters": "end-time",
            "Info": "specifies the end time. It is in the format of HH:MM. The value of HH ranges from 0 to 23; the values of MM range from 0 to 59.\nHH specifies the hour, which is an integer ranging from 0 to 23. MM specifies the minute, which is an integer ranging from 0 to 59."
        },
        {
            "Parameters": "end-date",
            "Info": "specifies the end date, when configures summer time to a certain year. It is in the format of YYYY-MM-DD. The value of YYYY ranges from 2000 to 2037; the value of MM ranges from 1 to 12, the value of DD ranges from 1 to 31.\nYYYY specifies the year, which is an integer ranging from 2000 to 2037. MM specifies the month, which is an integer ranging from 1 to 12. DD specifies the day, which is an integer ranging from 1 to 31."
        },
        {
            "Parameters": "offset",
            "Info": "Specify the time added to the summer time. It is in the format of HH:MM. The value should be less than 02:00 (two hours).\nThe value is in the format of HH:MM, where HH indicates the hour and MM indicates the minute. The value ranges from 00:01 to 02:00."
        },
        {
            "Parameters": "repeating start-time",
            "Info": "Specifies the start time of the summer time to the years from a certain year. It is in the format of HH:MM. The value of HH ranges from 0 to 23; the values of MM range from 0 to 59.\nHH specifies the hour, which is an integer ranging from 0 to 23. MM specifies the minute, which is an integer ranging from 0 to 59."
        },
        {
            "Parameters": "repeat-start-date",
            "Info": "Specifies the start date, when configures summer time to the years from a certain year.\nIt is in the format of MM-DD. The value of MM ranges from 1 to 12; the value of DD ranges from 1 to 31."
        },
        {
            "Parameters": "repeat-end-date",
            "Info": "Specifies the start date, when configures summer time to the years from a certain year.\nIt is in the format of MM-DD. The value of MM ranges from 1 to 12; the value of DD ranges from 1 to 31."
        },
        {
            "Parameters": "startyear",
            "Info": "Specifies the start year, when configures summer time to the years from a certain year.\nIt is in the format of YYYY. The value of YYYY ranges from 2000 to 2037."
        },
        {
            "Parameters": "endyear",
            "Info": "Specifies the end year, when configures summer time to the years from a certain year.\nIt is in the format of YYYY. The value of YYYY ranges from 2000 to 2037."
        },
        {
            "Parameters": "first",
            "Info": "Indicates the first working day in a specified month.\n-"
        },
        {
            "Parameters": "second",
            "Info": "Indicates the second working day in a specified month.\n-"
        },
        {
            "Parameters": "third",
            "Info": "Indicates the third working day in a specified month.\n-"
        },
        {
            "Parameters": "fourth",
            "Info": "Indicates the fourth working day in a specified month.\n-"
        },
        {
            "Parameters": "last",
            "Info": "Indicates the last working day in a specified month.\n-"
        },
        {
            "Parameters": "startweekday",
            "Info": "Specifies the start weekday.\nThe value range is Mon, Tue, Wed, Thu, Fri, Sat, Sun."
        },
        {
            "Parameters": "startmonth",
            "Info": "Specifies the start month.\nThe value range is Jan, Feb, Mar, Apr, May, Jun, Jul, Aug, Sep, Oct, Nov and Dec."
        },
        {
            "Parameters": "endweekday",
            "Info": "Specifies the end weekday.\nThe value range is Mon, Tue, Wed, Thu, Fri, Sat, Sun."
        },
        {
            "Parameters": "endmonth",
            "Info": "Specifies the end month.\nThe value range is Jan, Feb, Mar, Apr, May, Jun, Jul, Aug, Sep, Oct, Nov and Dec."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> clock daylight-saving-time z2 one-year 11:22 2020-02-01 22:11 2020-08-11 01:04"
        ],
        [
            "<HUAWEI> clock daylight-saving-time z3 repeating 08:00 02-01 22:11 08-08 01:04 2012 2020"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo configure rules for the daylight saving time based on the user's time zone, run the clock daylight-saving-time command. The configuration is invalid during 2000 to 2037. After the rules are configured, a device automatically uses the configured daylight saving time based on the rules.\nIn VS mode, this command is supported only by the admin VS.\nConfiguration Impact\nNote the following issues:\nThe time in messages such as logs and debugging information is the local time adjusted according to the time zone and the configured daylight saving time.The time in the output of the display commands is the local time adjusted based on the time zone and the configured daylight saving time.\nBefore you remove the configuration of the daylight saving time, note the following points:\nIf the configured daylight saving time has taken effect, after you remove the configuration of the daylight saving time, the device minus the offset of the daylight saving time.If the configured daylight saving time does not take effect, removing the configuration of the daylight saving time does not affect on the system time.\n\nFollow-up Procedure\nRun the display clock command to view detailed information about the system time after the configured daylight saving time takes effect."
}