{
    "PageTitle": "clock timezone (System view)",
    "FuncDef": "The clock timezone command configures the local time zone.\nThe undo clock timezone command restores default Universal Time Coordinated (UTC).\nIf you do not specify the time zone name, the system uses the name of DefaultZoneName.\nThe default local time zone is Universal Time Coordinated (UTC).",
    "CLIs": [
        "clock timezone <time-zone-name> { add | minus } <offset>",
        "undo clock timezone"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "time-zone-name",
            "Info": "Specifies the name of a time zone.\nThe value is a string of 1 to 32 characters.\nWhen quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "add",
            "Info": "Indicates that the offset is added to the value of the specified time zone, and the result is equal to the Universal Time Coordinated (UTC) time. Conversely, the default UTC time minus offset is equal to the time of time-zone-name.\nThe value ranges from 0 to 18."
        },
        {
            "Parameters": "minus",
            "Info": "Indicates that the UTC time is equal to the time zone minus the offset. Conversely, the sum of the default UTC time, and offset is equal to the time of time-zone-name.\nThe value ranges from 0 to 18."
        },
        {
            "Parameters": "offset",
            "Info": "Specifies the offset between the time of the specified time zone and the UTC time. It is in the format of HH:MM:SS. HH specifies hours. MM and SS indicate minutes and seconds, respectively.\nHH ranges from 0 to 18. MM and SS range from 0 to 59."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] clock timezone BJ add 08:00:00"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf you do not specify the time zone, a device uses the name of the default time zone.\nThe time must be specified in the 24-hour format.\nIn VS mode, this command is supported only by the admin VS.\nPrecautions\nThe specified time must be in 24-hour format."
}