{
    "PageTitle": "mbs-contribution",
    "FuncDef": "Thembs-contributioncommand is used to configure the policy-based burst tolerance for a parent policer instance created when the policy is applied to a SAP, or a subscriber context for the 7450 ESS and 7750 SR, or a 7950 XRS multiservice site. The system uses the parent policer smin-thresh-separationvalue, the priority level smbs-contributionvalue, and the number of child policers currently attached to the priority level to derive the priority level s shared-portion and fair-portion of burst tolerance within the local priority level. The shared-portion and fair-portions for each priority level are then used by the system to calculate each priority level s discard-unfair threshold and discard-all threshold. The mbs-contribution is the minimum separation between two adjacent active discard-all thresholds.",
    "CLIs": [
        "mbs-contribution <size> [ bytes | kilobytes ] [ fixed ]",
        "no mbs-contribution"
    ],
    "ParentView": [
        "config>qos>plcr-ctrl-plcy>root>priority-mbs-thresholds>priority"
    ],
    "ParaDef": [
        {
            "Parameters": "size [bytes | kilobytes]",
            "Info": "The size parameter is required when executing the mbs-contribution command. It is expressed as an integer and specifies the priority s specific portion amount of accumulative MBS for the priority level in bytes or kilobytes that is selected by the trailing bytes or kilobytes keywords. If both bytes and kilobytes are missing, kilobytes is assumed. Setting this value has no effect on parent policer instances where the priority level s mbs-contribution value has been overridden. Values-0 to 4194304 or default (applies to the 7450 ESS). ParamDefault: Default- 8 kilobytes"
        },
        {
            "Parameters": "bytes | kilobytes:",
            "Info": "The bytes keyword is optional and is mutually exclusive with the kilobytes keyword. When specified, size is interpreted as specifying the size of min-thresh-separation in bytes. ParamDefault: Default- kilobytes"
        },
        {
            "Parameters": "fixed",
            "Info": "The optional fixed keyword is used to force the inclusion of the defined mbs-contribution value in the parent policer s discard threshold calculations. If the mbs-contribution command is executed without the fixed keyword, the fixed calculation behavior for the priority level is removed."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: no mbs-contribution"
}