{
    "PageTitle": "parent",
    "FuncDef": "This command is used to define from where the tiered arbiter receives bandwidth. Both tier 1 and tier 2 arbiters default to parenting to the root arbiter. Tier 2 arbiters may be modified to parent to a tier 1 arbiter. The tier 1 arbiter parent cannot be changed.",
    "CLIs": [
        "parent { root | <arbiter-name> } [ level <priority-level> ] [ weight <weight-within-level> ]",
        "no parent"
    ],
    "ParentView": [
        "config>qos>plcr-ctrl-plcy>tier>arbiter"
    ],
    "ParaDef": [
        {
            "Parameters": "root",
            "Info": "The root keyword is mutually exclusive with the arbiter-name parameter. In tier 1, arbiter-name is not allowed and only root is accepted. When root is specified, the arbiter will receive all bandwidth directly from the root arbiter. This is the default parent for tiered arbiters."
        },
        {
            "Parameters": "arbiter-name",
            "Info": "The arbiter-name parameter is mutually exclusive with the root keyword. In tier 1, arbiter-name is not allowed and only root is accepted. The specified arbiter-name must exist within the policer-control-policy at tier 1 or the parent command will fail. When a tiered arbiter is acting as a parent for another tiered arbiter, the parent arbiter cannot be removed from the policy. The child arbiter will receive all bandwidth directly from its parent arbiter (that receives bandwidth from the root arbiter)."
        },
        {
            "Parameters": "level priority-level",
            "Info": "The level priority-level keyword and parameter are optional when executing the parent command. When level is not specified, a default level of 1 is used in the parent arbiter. When level is specified, the priority-level parameter must be specified as an integer value from 1 through 8."
        },
        {
            "Parameters": "weight weight-within-level",
            "Info": "The weight weight-within-level keyword and parameter are optional when executing the parent command. When weight is not specified, a default level of 1 is used in the parent arbiters priority level. When weight is specified, the weight-within-level parameter must be specified as an integer value from 1 through 100."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: parent \"root\" level 1 weight 1"
}