{
    "PageTitle": "bgp-peers",
    "FuncDef": "This command configures auto-generation of IPv4 or IPv6 address prefixes (as required by the context that the command is executed within) based on the base router BGP instance configuration.",
    "CLIs": [
        "bgp-peers <criterion-index> group <reg-exp> neighbor <reg-exp>",
        "bgp-peers <criterion-index> router <router-instance> group <reg-exp> neighbor <reg-exp>",
        "bgp-peers <criterion-index> router service-name <service-name> group <reg-exp> neighbor <reg-exp>",
        "no bgp-peers <criterion-index>"
    ],
    "ParentView": [
        "config>filter>match-list>ip-prefix-list>apply-path",
        "config>filter>match-list>ipv6-prefix-list>apply-path"
    ],
    "ParaDef": [
        {
            "Parameters": "service-name",
            "Info": "Specifies the service name, up to 64 characters in length."
        },
        {
            "Parameters": "group",
            "Info": "Configures a match against the base router BGP instance group configuration."
        },
        {
            "Parameters": "neighbor",
            "Info": "Configures a match against the base router BGP instance neighbor configuration."
        },
        {
            "Parameters": "criterion-index",
            "Info": "Specifies an integer from 1 to 255 enumerating BGP peers auto-generation configuration within this list."
        },
        {
            "Parameters": "router-instance",
            "Info": "Specifies the router name or service ID. Values-router-instance: router-name or vprn-svc-id."
        },
        {
            "Parameters": "router",
            "Info": "Configures a match against the base router BGP instance configuration."
        },
        {
            "Parameters": "reg-exp",
            "Info": "Specifies a regular expression that defines a match string, up to 255 characters in length, to be used to auto-generate address prefixes. Matching is performed from the least-significant digit. For example, a string 10.0 matches all neighbors with addresses starting with 10, such as 10.0.x.x or 10.0xx.x.x."
        }
    ],
    "Examples": null,
    "ExtraInfo": "Default: No embedded filter policies are included in a filter policy."
}