{
    "PageTitle": "drop",
    "FuncDef": "This command configures the drop action for the traffic that matches this filter entry.",
    "CLIs": [
        "drop",
        "drop packet-length { lt | gt | eq } <packet-length-value>",
        "drop packet-length range <packet-length-value> <packet-length-value>",
        "drop pattern expression <expression> mask <mask> offset-type <offset-type> offset-value <offset-value>",
        "drop ttl { lt | gt | eq } <ttl-value>",
        "drop ttl range <ttl-value> <ttl-value>"
    ],
    "ParentView": [
        "config>filter>ip-filter>entry>action"
    ],
    "ParaDef": [
        {
            "Parameters": "packet-length",
            "Info": "Specifies drop packets matching both the filter entry match criteria and the packet-length value defined in the drop action statement. Packets matching the filter entry match criteria and not matching the packet-length value, as defined in the drop action statement, are implicitly forwarded with no further match in the following filter entries. Values-lt - Specifies \"less than\". The lt parameter cannot be used with the lowest possible numerical value for the parameter.."
        },
        {
            "Parameters": "packet-length-value",
            "Info": "Specifies the packet length value for the rate limit action. Values-0 to 65535."
        },
        {
            "Parameters": "range",
            "Info": "Specifies an inclusive range. When range is used, the start of the range (the first value entered) must be smaller than the end of the range (the second value entered)."
        },
        {
            "Parameters": "ttl-value",
            "Info": "Specifies drop packets matching both the filter entry match criteria and the TTL value defined in the drop action statement. Packets matching the filter entry match criteria and not matching the TTL value, as defined in the drop action statement, are implicitly forwarded with no further match in the following filter entries. Values-0 to 255."
        },
        {
            "Parameters": "expression",
            "Info": "Specifies the hexadecimal pattern to match; up to eight bytes. Values-0x0000000000000001 to 0xffffffffffffffff."
        },
        {
            "Parameters": "mask",
            "Info": "Specifies the mask for the pattern expression, up to eight bytes. Values-0x0000000000000001 to 0xffffffffffffffff."
        },
        {
            "Parameters": "offset-type",
            "Info": "Specifies the starting point reference for the offset-value of this pattern. Values-layer-3, layer-4, data, dns-qtype."
        },
        {
            "Parameters": "offset-value",
            "Info": "Specifies the offset value for the pattern expression. Dns-qtype supports offset value of 0. Values-0 to 255."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}