{
    "PageTitle": "embed-filter",
    "FuncDef": "This command embeds a previously defined IPv4, IPv6, or MAC embedded filter policy or Hybrid OpenFlow switch instance into this exclusive, template, or system filter policy at the specified offset value. Rules derived from the BGP flowspec can also be embedded into template filter policies only.",
    "CLIs": [
        "embed-filter <ip-filter-id> [ offset <offset> ] [ { active | inactive } ]",
        "no embed-filter <ip-filter-id>",
        "embed-filter <ipv6-filter-id> [ offset <offset> ] [ { active | inactive } ]",
        "no embed-filter <ipv6-filter-id>",
        "embed-filter flowspec [ group <group-id> ] [ router { <router-instance> | service-name <vprn-service-name> } ] [ offset <offset> ] [ { active | inactive } ]",
        "no embed-filter flowspec [ group <group-id> ]",
        "embed-filter open-flow <ofs-name> [ { system | service { <service-id> | service-name } | sap <sap-id> } ] [ offset <offset> ] [ { active | inactive } ]",
        "no embed-filter open-flow <ofs-name> [ { system | service { <service-id> | service-name } | sap <sap-id> } ]",
        "embed-filter vsd <vsd-filter-id> [ offset <offset> ] [ { active | inactive } ]",
        "no embed-filter vsd <vsd-filter-id>"
    ],
    "ParentView": [
        "config>filter>ip-filter",
        "config>filter>ipv6-filter",
        "config>filter>mac-filter"
    ],
    "ParaDef": [
        {
            "Parameters": "IPv4: ip-filter-id",
            "Info": "Specifies a previously defined IPv4 policy for embedding in this filter."
        },
        {
            "Parameters": "IPv6: ipv6-filter-id",
            "Info": "Specifies a previously defined IPv6 policy for embedding in this filter."
        },
        {
            "Parameters": "offset",
            "Info": "Specifies that an embedded filter entry X will have an entry X + offset in the embedding filter. Values-0 to 2097151. ParamDefault: Default- 0"
        },
        {
            "Parameters": "active",
            "Info": "Specifies that embedded filter entries are to be included in this embedding filter policy and activated on applicable line cards-default if no keyword is specified and omitted from info command output (but not info detail), or when saving the configuration."
        },
        {
            "Parameters": "inactive",
            "Info": "Specifies that no embedded filter policy entries are to be included in this embedding filter policy. The embedding is configured but will not do anything."
        },
        {
            "Parameters": "flowspec",
            "Info": "This keyword indicates that rules derived from BGP flowspec routes should be embedded into (or removed from, in case of the no form) the filter."
        },
        {
            "Parameters": "group-id",
            "Info": "Specifies that only flowspec routes with an interface-set extended community with this value of group-id should be selected for embedding. Values-0 to 16383."
        },
        {
            "Parameters": "router-instance",
            "Info": "Specifies a router instance."
        },
        {
            "Parameters": "vprn-service-name",
            "Info": "Specifies the VPRN service name used for embedding Flowspec rules."
        },
        {
            "Parameters": "open-flow",
            "Info": "Indicates that rules derived from OpenFlow should be embedded into (or removed from, in case of the no form) the filter."
        },
        {
            "Parameters": "ofs-name",
            "Info": "Specifies the name of the currently configured Hybrid OpenFlow Switch (OFS) instance."
        },
        {
            "Parameters": "system",
            "Info": "Used for OF control of system filters. Allows embedding of OF rules into system filters from OFS with switch-defined-cookie enabled. Only the rules with cookie value encoding \"system-cookie\" are embedded."
        },
        {
            "Parameters": "{service-id | service-name}",
            "Info": "Used for OF control of VPRN or VPLS services. Allows embedding of OF rules into a VPRN or VPLS access or network filters. Only the rules with cookie value encoding the specified service ID are embedded into the filter. The embedding filter can only be deployed in the context of the specified service."
        },
        {
            "Parameters": "sap-id",
            "Info": "Used for OF control of VPLS services when a PortID and VLAN ID match is required. Allows embedding of OF rules with a PortID and VLAN ID match into exclusive VPLS SAP filters. Only the rules with cookie value encoding the VPLS service, and flow table match encoding the specified SAP, are embedded into the filter. The embedding filter can only be deployed in the context of the specified SAP."
        },
        {
            "Parameters": "vsd-filter-id",
            "Info": "Creates an embedded filter (filter ID: _tmnx_vsd_filter-id) for population by Nuage VSD."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}