{
    "PageTitle": "mac-filter",
    "FuncDef": "This command copies existing filter list entries for a specific filter ID to another filter ID. Thecopycommand is a configuration level maintenance tool used to create new filters using existing filters. It also allows bulk modifications to an existing policy with the use of theoverwritekeyword.\nIfoverwriteis not specified, an error will occur if the destination policy ID exists.",
    "CLIs": [
        "mac-filter <src-filter-id> [ src-entry <src-entry-id> ] to <dst-filter-id> [ dst-entry <dst-entry-id> ] [ overwrite ]"
    ],
    "ParentView": [
        "config>filter"
    ],
    "ParaDef": [
        {
            "Parameters": "mac-filter",
            "Info": "Indicates that the src-filter-id and the dst-filter-id are MAC filter IDs."
        },
        {
            "Parameters": "src-filter-id",
            "Info": "Identifies the source filter policy from which the copy command will attempt to copy. The filter policy must exist within the context of the preceding keyword (ip-filter, ipv6-filter or mac-filter)."
        },
        {
            "Parameters": "dst-filter-id",
            "Info": "Identifies the destination filter policy to which the copy command will attempt to copy. If the overwrite keyword does not follow, the filter policy ID cannot already exist within the system for the filter type the copy command is issued for. If the overwrite keyword is present, the destination policy ID may or may not exist."
        },
        {
            "Parameters": "overwrite",
            "Info": "Specifies that the destination filter ID may exist. If it does, everything in the existing destination filter ID will be completely overwritten with the contents of the source filter ID. If the destination filter ID exists, either overwrite must be specified or an error message will be returned. If overwrite is specified, the function of copying from source to destination occurs in a \"break before make\" manner and therefore should be handled with care."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}