{
    "PageTitle": "rate-limit",
    "FuncDef": "This command sets the rate limit value for traffic matching this filter entry.",
    "CLIs": [
        "rate-limit <value>",
        "rate-limit <value> hop-limit { lt | gt | eq } <hop-limit-value>",
        "rate-limit <value> hop-limit range <hop-limit-value> <hop-limit-value>",
        "rate-limit <value> pattern expression <expression> mask <mask> offset-type <offset-type> offset-value <offset-value>",
        "rate-limit <value> payload-length { lt | gt | eq } <payload-length-value>",
        "rate-limit <value> payload-length range <payload-length-value> <payload-length-value>"
    ],
    "ParentView": [
        "config>filter>ipv6-filter>entry>action"
    ],
    "ParaDef": [
        {
            "Parameters": "value",
            "Info": "Specifies the rate-limit value in kb/s. A rate of 0 results in all traffic being dropped. A rate of max results in all traffic being forwarded. Values-0 to 2000000000 kb/s | max."
        },
        {
            "Parameters": "hop-limit",
            "Info": "Specifies the hop limit value for the rate limit action. Values-lt - Specifies \"less than\". The lt parameter cannot be used with the lowest possible numerical value for the parameter.."
        },
        {
            "Parameters": "hop-limit-value",
            "Info": "Specifies the hop limit value for the rate limit action. Values-0 to 255."
        },
        {
            "Parameters": "payload-length-value",
            "Info": "Specifies the payload length value for the rate limit action. Values-0 to 65535."
        },
        {
            "Parameters": "payload-length",
            "Info": "Specifies rate-limit packets matching both the filter entry match criteria and the payload-length-value defined in the rate-limit action statement. Packets matching the filter entry match criteria and not matching the payload-length-value, as defined in the rate-limit action statement, are implicitly forwarded with no further match in the following filter entries. Values-lt - Specifies \"less than\". The lt parameter cannot be used with the lowest possible numerical value for the parameter.."
        },
        {
            "Parameters": "range",
            "Info": "Specifies an inclusive range. When the range parameter is used, the start of the range (the first value entered) must be smaller than the end of the range (the second value entered)."
        },
        {
            "Parameters": "expression",
            "Info": "Specifies the hexadecimal pattern to match; up to eight bytes. Values-0x0000000000000001 to 0xffffffffffffffff."
        },
        {
            "Parameters": "mask",
            "Info": "Specifies the mask for the pattern expression, up to eight bytes. Values-0x0000000000000001 to 0xffffffffffffffff."
        },
        {
            "Parameters": "offset-type",
            "Info": "Specifies the starting point reference for the offset-value of this pattern. Values-layer-3, layer-4, data, dns-qtype."
        },
        {
            "Parameters": "offset-value",
            "Info": "Specifies the offset value for the pattern expression. Dns-qtype supports offset value of 0. Values-0 to 255."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}