{
    "PageTitle": "source (IPv4 over IPv6 Tunnel)",
    "FuncDef": "The source command configures a source IPv6 address or source interface for an IPv4 over IPv6 tunnel interface.\nThe undo source command deletes a source IPv6 address or source interface for an IPv4 over IPv6 tunnel interface.\nBy default, no source IPv6 address or source interface is configured for an IPv4 over IPv6 tunnel interface.",
    "CLIs": [
        "source <ipv6-address>",
        "source { <interface-name> | <interface-type> <interface-number> }",
        "undo source"
    ],
    "ParentView": [
        "Tunnel interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipv6-address",
            "Info": "Specifies the source IPv6 address for an IPv4 over IPv6 tunnel interface.\nThe address is a 32-digit hexadecimal number, in the format of X:X:X:X:X:X:X:X."
        },
        {
            "Parameters": "interface-name",
            "Info": "Specifies the source interface name for an IPv4 over IPv6 tunnel.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "interface-type",
            "Info": "Specifies the source interface type for an IPv4 over IPv6 tunnel.\nThe value is an enumerated type, case-insensitive and can only be loopback."
        },
        {
            "Parameters": "interface-number",
            "Info": "Specifies the source interface number for an IPv4 over IPv6 tunnel. The interface-type and interface-number parameters can be separated by spaces or configured without a space in between.\nThe value is a string of 1 to 63 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Tunnel 1",
            "[*HUAWEI-Tunnel1] tunnel-protocol ipv4-ipv6",
            "[*HUAWEI-Tunnel1] source 2001:db8:200::1",
            "Info: The source address must be the address of the loopback interface."
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface LoopBack 1",
            "[*HUAWEI-LoopBack1] quit",
            "[*HUAWEI] interface Tunnel 1",
            "[*HUAWEI-Tunnel1] tunnel-protocol ipv4-ipv6",
            "[*HUAWEI-Tunnel1] source LoopBack 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen configuring an IPv4 over IPv6 tunnel, you need to create a tunnel interface and run the source command to configure a source IPv6 address or source interface for the tunnel interface.\nPrerequisites\nThe tunnel encapsulation mode has been set to IPv4 over IPv6 using the tunnel-protocol ipv4-ipv6 command.\nPrecautions\nThe same source and destination addresses cannot be configured for two or more tunnel interfaces that use the same encapsulation protocol.\nThe source IPv6 address specified for the tunnel interface at one end of an IPv4 over IPv6 tunnel must be the same as the destination IPv6 address specified for the tunnel interface on the other end of the tunnel. In addition, you must ensure that the route to the interface that receives packets on the other end of the tunnel is reachable."
}