{
    "PageTitle": "tunnel ipv4-ipv6(Tunnel interface view)",
    "FuncDef": "The tunnel ipv4-ipv6 flow-label command sets a flow label value.\nThe tunnel ipv4-ipv6 encapsulation-limit command configures the maximum number of IPv6 encapsulations that can be performed on embedded tunnel nodes.\nThe tunnel ipv4-ipv6 traffic-class command sets a traffic class value for an IPv4 over IPv6 tunnel.\nThe tunnel ipv4-ipv6 hop-limit command sets a hop limit for IPv6 packets.\nThe undo tunnel ipv4-ipv6 flow-label command restores the default value.\nThe undo tunnel ipv4-ipv6 encapsulation-limit command deletes the maximum number of IPv6 encapsulations that can be performed on embedded tunnel nodes.\nThe undo tunnel ipv4-ipv6 traffic-class command restores the default setting.\nThe undo tunnel ipv4-ipv6 hop-limit command restores the default setting.\nBy default, a maximum of four IPv6 encapsulations can be performed on embedded tunnel nodes, the flow label value is set to 0, the hop limit is set to 64, the traffic class value of an IPv4 over IPv6 tunnel is set to 0.",
    "CLIs": [
        "tunnel ipv4-ipv6 encapsulation-limit <encapsulation-limit>",
        "tunnel ipv4-ipv6 flow-label <label-value>",
        "tunnel ipv4-ipv6 hop-limit <hop-limit>",
        "tunnel ipv4-ipv6 traffic-class { original | <class-value> }",
        "undo tunnel ipv4-ipv6 encapsulation-limit",
        "undo tunnel ipv4-ipv6 flow-label",
        "undo tunnel ipv4-ipv6 hop-limit",
        "undo tunnel ipv4-ipv6 traffic-class"
    ],
    "ParentView": [
        "Tunnel interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "encapsulation-limit encapsulation-limit",
            "Info": "Specifies the maximum number of IPv6 encapsulations that can be performed on embedded tunnel nodes.\nThe value is an integer ranging from 0 to 255."
        },
        {
            "Parameters": "flow-label label-value",
            "Info": "Specifies a flow label value.\nThe value is an integer ranging from 0 to 1048575."
        },
        {
            "Parameters": "hop-limit hop-limit",
            "Info": "Specifies a hop limit for IPv6 packets.\nThe value is an integer ranging from 1 to 255."
        },
        {
            "Parameters": "traffic-class class-value",
            "Info": "Specifies the traffic class value of an IPv4 over IPv6 tunnel.\nThe value is an integer ranging from 0 to 255."
        },
        {
            "Parameters": "original",
            "Info": "Indicates that the traffic class value of an IPv4 over IPv6 tunnel is set to that carried in the Traffic Class field of the original packet.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface tunnel1",
            "[*HUAWEI-Tunnel1] tunnel-protocol ipv4-ipv6",
            "[*HUAWEI-Tunnel1] tunnel ipv4-ipv6 encapsulation-limit 3"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface tunnel1",
            "[*HUAWEI-Tunnel1] tunnel-protocol ipv4-ipv6",
            "[*HUAWEI-Tunnel1] tunnel ipv4-ipv6 flow-label 10"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface tunnel1",
            "[*HUAWEI-Tunnel1] tunnel-protocol ipv4-ipv6",
            "[*HUAWEI-Tunnel1] tunnel ipv4-ipv6 hop-limit 100"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface tunnel1",
            "[*HUAWEI-Tunnel1] tunnel-protocol ipv4-ipv6",
            "[*HUAWEI-Tunnel1] tunnel ipv4-ipv6 traffic-class 10"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAn IPv6 tunnel packet can be encapsulated and carried as payload within an IPv6 packet of another tunnel, which is called IPv6 nested encapsulation. Nested encapsulation occurs when an intermediate node of an IPv6 tunnel is an ingress node of another IPv6 tunnel. If an IPv6 packet undergoes excessive nested encapsulations, the packet will be oversized and discarded. Therefore, when a Huawei device interworks with devices of other vendors, run the tunnel ipv4-ipv6 encapsulation-limit command to configure the maximum number of IPv6 encapsulations that can be performed on embedded tunnel nodes. You are advised to set the encapsulation-limit parameter to a value that is not larger than 4.\nTo allow a device to recognize and provide special processing for packets in a flow, run the tunnel ipv4-ipv6 flow-label command to mark the packets of a specific service flow.\nTo rapidly terminate packet transmission when routing loops occur on an IPv4 over IPv6 tunnel, run the tunnel ipv4-ipv6 hop-limit command to set a hop limit for IPv6 packets. To allow IPv6 tunnel packets to reach the egress of the tunnel, you need to set the hop limit based on the actual network topology.\nThe traffic class value of IPv4 over IPv6 tunnel packets refers to the value that a tunnel ingress node sets in the Traffic Class field of a tunnel header to identify the service types of IPv6 packets. The Traffic Class field functions in the same way as the ToS field in IPv4 packets. To set the traffic class value for an IPv4 over IPv6 tunnel, run the tunnel ipv4-ipv6 traffic-class command.\nPrerequisites\nThe tunnel encapsulation mode has been set to IPv4 over IPv6 using the tunnel-protocol ipv4-ipv6 command.\nPrecautions\nAn IPv6 tunnel packet can be encapsulated and carried as payload within an IPv6 packet of another tunnel, which is called IPv6 nested encapsulation. Nested encapsulation occurs when an intermediate node of an IPv6 tunnel is an ingress node of another IPv6 tunnel.\nIf an IPv6 packet undergoes excessive nested encapsulations, the packet will be oversized and discarded.\nTherefore, when a Huawei device interworks with devices of other vendors, run the tunnel ipv4-ipv6 encapsulation-limit command to configure the maximum number of IPv6 encapsulations that can be performed on embedded tunnel nodes. You are advised to set the encapsulation-limit parameter to a value that is not larger than 4."
}