{
    "PageTitle": "ssl-verify (GRPC IPv6 server view)",
    "FuncDef": "The ssl-policy command configures an SSL policy for the gRPC IPv6 service during Telemetry dynamic subscription.\nThe undo ssl-policy command deletes an SSL policy of the gRPC IPv6 service during Telemetry dynamic subscription.\nThe ssl-verify peer command enables a server to perform SSL verification on a client during Telemetry dynamic subscription.\nThe undo ssl-verify peer command disables a server from performing SSL verification on a client during Telemetry dynamic.\nBy default, no SSL policy is configured for the gRPC IPv6 service, and a server does not perform SSL verification on a client during Telemetry dynamic subscription.",
    "CLIs": [
        "ssl-policy <policy-name>",
        "ssl-verify peer",
        "undo ssl-policy [ <policy-name> ]",
        "undo ssl-verify peer"
    ],
    "ParentView": [
        "GRPC IPv6 server view"
    ],
    "ParaDef": [
        {
            "Parameters": "policy-name",
            "Info": "Specifies the name of an SSL policy.\nThe value is a string of 1 to 23 case-sensitive characters, spaces not supported.\nThe value must be the name of an existing SSL policy."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ssl policy policy1",
            "[*HUAWEI-ssl-policy-policy1] quit",
            "[*HUAWEI] grpc",
            "[*HUAWEI-grpc] grpc server ipv6",
            "[*HUAWEI-grpc-server-ipv6] ssl-policy policy1",
            "[*HUAWEI-grpc-server-ipv6] ssl-verify peer"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf a collector functioning as a client initiates a connection to a device functioning as a server, the data sampled is dynamically subscribed to. In this case, you can configure an SSL policy for the gRPC IPv6 service. This ensures that a secure SSL connection can be established between the server and client.\nThe server perform SSL verification on a client based on the specified SSL policy. If the client does not have a certificate or the certificate is incorrect, the server disconnects from the client.\nPrerequisites\nThe SSL policy has been created."
}