{
    "PageTitle": "reset dhcpv6 chasten-user",
    "FuncDef": "The reset dhcpv6 chasten-user command clears information about limited DHCPv6 user connections.",
    "CLIs": [
        "reset dhcpv6 chasten-user slot <slot-id> [ mac-address <mac-address> [ interface { <interface-type> <interface-num> | <interface-name> } [ pe-vlan <pe-vlan> [ ce-vlan <ce-vlan> ] ] ] ] [ statistics ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "mac-address mac-address",
            "Info": "Clears information about limited DHCPv6 user connections with a specified MAC address.\nThe value is in H-H-H format, where H can be one to four hexadecimal digits. It cannot be a broadcast or multicast MAC address."
        },
        {
            "Parameters": "interface interface-type interface-num",
            "Info": "Clears information about limited DHCPv6 user connections with a specified interface.\n-"
        },
        {
            "Parameters": "interface interface-name",
            "Info": "Clears information about limited DHCPv6 user connections with a specified interface.\n-"
        },
        {
            "Parameters": "pe-vlan pe-vlan",
            "Info": "Clears information about limited DHCPv6 user connections with a specified outer VLAN ID.\nThe value is an integer ranging from 1 to 4094."
        },
        {
            "Parameters": "ce-vlan ce-vlan",
            "Info": "Clears information about limited DHCPv6 user connections with a specified inner VLAN ID.\nThe value is an integer ranging from 1 to 4094."
        },
        {
            "Parameters": "statistics",
            "Info": "Clears statistics about limited DHCPv6 user connections.If statistics is not specified in the reset dhcpv6 chasten-user command, the command clears a user's suppression entries on a specified board. After the command is run, the system stops suppressing the user. If statistics is specified in the reset dhcpv6 chasten-user command, the command clears statistics about limited DHCPv6 user connections.\n-"
        },
        {
            "Parameters": "slot slot-id",
            "Info": "Clears information about limited DHCPv6 user connections on a specified board.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] reset dhcpv6 chasten-user slot 1"
        ]
    ],
    "ExtraInfo": "In scenarios of restricted DHCPv6 user access, run the reset dhcpv6 chasten-user command to clear information about restricted DHCPv6 user connections.\nIn VS mode, this command is supported only by the admin VS."
}