{
    "PageTitle": "reset dhcp chasten-user",
    "FuncDef": "The reset dhcp chasten-user command clears information about limited DHCP user connections.",
    "CLIs": [
        "reset dhcp chasten-user slot <slotid> [ mac-address <mac-address> [ interface { <interface-type> <interface-num> | <interface-name> } [ pe-vlan <pe-vlan> [ ce-vlan <ce-vlan> ] ] ] ] [ statistics ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "mac-address mac-address",
            "Info": "Clears information about limited DHCP user connections with a specified MAC address.\nThe value is in H-H-H format, where H can be one to four hexadecimal digits. It cannot be a broadcast or multicast MAC address."
        },
        {
            "Parameters": "interface interface-name",
            "Info": "Clears information about limited DHCP user connections with a specified interface.\n-"
        },
        {
            "Parameters": "interface interface-type interface-num",
            "Info": "Clears information about limited DHCP user connections with a specified interface.\n-"
        },
        {
            "Parameters": "pe-vlan pe-vlan",
            "Info": "Clears information about limited DHCP user connections with a specified outer VLAN ID.\nThe value is an integer ranging from 1 to 4094."
        },
        {
            "Parameters": "ce-vlan ce-vlan",
            "Info": "Clears information about limited DHCP user connections with a specified inner VLAN ID.\nThe value is an integer ranging from 1 to 4094."
        },
        {
            "Parameters": "statistics",
            "Info": "Clears statistics about limited DHCP user connections.\n-"
        },
        {
            "Parameters": "slot slotid",
            "Info": "Clears information about limited DHCP user connections on a specified board.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] reset dhcp chasten-user slot 1"
        ]
    ],
    "ExtraInfo": "If statistics is not specified in the reset dhcp chasten-user command, the command clears a user's suppression entries on a specified board. After the command is run, the system stops suppressing the user. If statistics is specified in the reset dhcp chasten-user command, the command clears statistics about limited DHCP user connections. After the command is run, statistics are cleared but the system does not stop suppressing the user.\nIn VS mode, this command is supported only by the admin VS."
}