{
    "PageTitle": "vp bfd",
    "FuncDef": "The vp bfd command sets parameters of a BFD session for Virtual Path.\nThe undo vp bfd command restores the default BFD parameters.\nBy default, the minimum interval at which BFD packets are sent is 10 ms, the default minimum interval at which BFD packets are received is 10 ms, and the default local detection multiplier is 3.",
    "CLIs": [
        "vp bfd { detect-multiplier <multiplier> | min-tx-interval <tx-interval> | min-rx-interval <rx-interval> } *",
        "undo vp bfd { detect-multiplier | min-tx-interval | min-rx-interval } *"
    ],
    "ParentView": [
        "Virtual cluster access view"
    ],
    "ParaDef": [
        {
            "Parameters": "detect-multiplier multiplier",
            "Info": "Specifies the detection multiplier for a BFD session.\nThe value is an integer ranging from 3 to 50. The default value is 3."
        },
        {
            "Parameters": "min-tx-interval tx-interval",
            "Info": "Specifies the minimum interval at which BFD packets are sent.\nThe value is an integer ranging from 3 to 1000, in milliseconds. The default value is 10."
        },
        {
            "Parameters": "min-rx-interval rx-interval",
            "Info": "Specifies the minimum interval at which BFD packets are received.\nThe value is an integer ranging from 3 to 1000, in milliseconds. The default value is 10."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] virtual-cluster-access",
            "[*HUAWEI-virtual-cluster-access] vp bfd min-tx-interval 200"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe parameters include the minimum interval at which BFD packets are sent, the minimum interval at which BFD packets are received, and BFD detection multiplier.\nEffective local interval at which BFD packets are sent = MAX { Locally configured interval at which BFD packets are sent, Remotely configured interval at which BFD packets are received }Effective local interval at which BFD packets are received = MAX { Remotely configured interval at which BFD packets are sent, Locally configured interval at which BFD packets are received }Local BFD detection period = Effective local interval at which BFD packets are received x Remotely configured BFD detection multiplier\nThe detection multiplier is the maximum number of BFD packets dropped before a BFD peer is declared Down.\n\nPrerequisites\nVirtual cluster access has been configured using the virtual-cluster-access command."
}