{
    "PageTitle": "admin (Virtual cluster access view)",
    "FuncDef": "The admin command configures a management IP address for a virtual cluster access.\nThe undo admin command deletes the management IP address configured for a virtual cluster access.\nBy default, a node automatically attempts to configure an existing loopback interface address as a management IP address. If the attempt fails, you must manually configure a management IP address.",
    "CLIs": [
        "admin <ip-address> [ vpn-instance <vpn-instance-name> ]",
        "undo admin"
    ],
    "ParentView": [
        "Virtual cluster access view"
    ],
    "ParaDef": [
        {
            "Parameters": "ip-address",
            "Info": "Specifies a management IP address for a virtual cluster access. The management IP address is usually a loopback interface address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies the name of the VPN-instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface LoopBack 0",
            "[*HUAWEI-LoopBack0] ip address 10.1.1.1 32",
            "[*HUAWEI-LoopBack0] quit",
            "[*HUAWEI] virtual-cluster-access",
            "[*HUAWEI-virtual-cluster-access] admin 10.1.1.1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nA virtual cluster access uses a management IP address to establish an MSCP channel. After you configure management IP addresses for the primary and secondary masters, an AP uses the configured management IP address to establish MSCP channels to the masters. After the MSCP channels are established, the AP registers with the masters and advertises the management IP addresses to the corresponding masters. The masters use the MSCP channels to send labels and forwarding entries to the AP for VC and VP establishments.\nPrerequisites\nA virtual cluster access has been created using the virtual-cluster-access command."
}