{
    "PageTitle": "virtual-cluster-access enable (interface view)",
    "FuncDef": "The virtual-cluster-access enable command enables virtual cluster access on an interface.\nThe undo virtual-cluster-access enable command disables virtual cluster access on an interface.\nBy default, virtual cluster access is disabled on an interface.",
    "CLIs": [
        "virtual-cluster-access enable",
        "undo virtual-cluster-access enable"
    ],
    "ParentView": [
        "100GE interface view",
        "10GE interface view",
        "40GE interface view",
        "Eth-Trunk interface view",
        "GE optical interface view",
        "GE electrical interface view",
        "IP-Trunk interface view",
        "POS interface view",
        "XGE interface view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] virtual-cluster-access",
            "[*HUAWEI-virtual-cluster-access] role master",
            "[*HUAWEI-virtual-cluster-access] commit",
            "[~HUAWEI] quit",
            "[~HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] virtual-cluster-access enable",
            "[*HUAWEI-GigabitEthernet1/0/0] mpls"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter you run the virtual-cluster-access command to enable virtual cluster access. To enable or disable virtual cluster access on an interface, run the virtual-cluster-access enable or undo virtual-cluster-access enable command in the interface view.\nPrerequisites\nVirtual cluster access has been configured using the virtual-cluster-access command.\nA node has been configured as a master using the role master command.\nConfiguration Impact\nAfter you enable virtual cluster access on an interface, the interface automatically establishes a virtual cluster access IS-IS process. If an IS-IS process has been established on an interface before virtual cluster access is enabled, you must manually configure the process as a virtual cluster access IS-IS process.\nFollow-up Procedure\nRun the mpls command in the interface view to enable MPLS on the interface."
}