{
    "PageTitle": "bind ap",
    "FuncDef": "The bind ap command binds a master's Remote-AP interface to an AP's AC interface.\nThe undo bind ap command unbinds a master's Remote-AP interface from an AP's AC interface.\nBy default, no Remote-AP interface is bound to an AP's AC interface.",
    "CLIs": [
        "bind ap name <ap-name-value> interface <interface-name-value>",
        "bind ap ip <ap-ip-value> interface <interface-name-value>",
        "undo bind ap"
    ],
    "ParentView": [
        "Remote-AP interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "interface interface-name-value",
            "Info": "Specifies the type and number of an AP's AC interface.\nThe specified type and number must be the same as those of the AC interface connected to the master."
        },
        {
            "Parameters": "ip ap-ip-value",
            "Info": "Specifies the management IP address of an AP. A loopback interface address is used as the AP's management IP address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "name ap-name-value",
            "Info": "Specifies the name of an AP, which has been configured using the ap name command.\nThe value is a string of 1 to 63 characters, spaces not supported. The first character cannot be a digit or an underscore (_).\nWhen quotation marks are used around the string, spaces are allowed in the string."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface Remote-Ap 1",
            "[*HUAWEI-Remote-Ap1] bind ap ip 2.2.2.9 interface GigabitEthernet1/0/0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter you create a Remote-AP interface on a master, run the bind ap interface command to bind the Remote-AP interface to an AP's AC interface to ensure that a VC can be established between the master and AP.\nPrerequisites\nA Remote-AP interface has been created using the interface remote-ap command."
}