{
    "PageTitle": "vp bit-error-detection",
    "FuncDef": "The vp bit-error-detection command enables VP bit error detection for virtual cluster access.\nThe undo vp bit-error-detection command disables VP bit error detection for virtual cluster access.\nBy default, VP bit error detection is not enabled for virtual cluster access.",
    "CLIs": [
        "vp bit-error-detection [ threshold switch <switch-coe> <switch-pow> resume <resume-coe> <resume-pow> ]",
        "undo vp bit-error-detection"
    ],
    "ParentView": [
        "Virtual cluster access view"
    ],
    "ParaDef": [
        {
            "Parameters": "threshold",
            "Info": "Specifies a BER threshold for triggering VP protection switching.\n-"
        },
        {
            "Parameters": "switch",
            "Info": "Specifies a BER threshold for triggering VP protection switching. Protection switching threshold = (switch-coe)*10-switch-pow.\n-"
        },
        {
            "Parameters": "switch-coe",
            "Info": "Specifies the coefficient of a BER threshold for triggering VP protection switching.\nThe value is an integer ranging from 1 to 9."
        },
        {
            "Parameters": "switch-pow",
            "Info": "Specifies the power of a BER threshold for triggering VP protection switching.\nThe value is an integer ranging from 1 to 7."
        },
        {
            "Parameters": "resume",
            "Info": "Specifies a BER threshold for VP revertive switching. Revertive switching threshold = (resume-coe)*10-resume-pow.\nThe revertive switching threshold must be lower than or equal to the protection switching threshold.\n-"
        },
        {
            "Parameters": "resume-coe",
            "Info": "Specifies the coefficient of a BER threshold for VP revertive switching.\nThe value is an integer ranging from 1 to 9."
        },
        {
            "Parameters": "resume-pow",
            "Info": "Specifies the power of a BER threshold for VP revertive switching.\nThe value is an integer ranging from 1 to 7."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] virtual-cluster-access",
            "[*HUAWEI-virtual-cluster-access] vp bit-error-detection threshold switch 5 3 resume 5 7"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn virtual cluster access scenarios, when VPs are established to transmit services with high quality requirements, bit errors on VPs may cause service interruptions. To address this problem, run the vp bit-error-detection command to enable VP bit error detection. The master then calculates forward and backward VP BERs to determine whether to perform VP switching.\nTo precisely control bit-error-triggered VP switching based on the sensitivity of services to bit errors, configure the thresholds for bit-error-triggered protection switching and revertive switching.\nThen, the ingress of a VP determines the bit error status of the VP based on the following rules:\nIf the BER of the VP reaches or exceeds the threshold for bit-error-triggered VP protection switching, the VP is in the excessive BER state.After the BER of the VP falls below the threshold for bit-error-triggered VP revertive switching, the VP changes to the normalized BER state.\nBit error refers to the deviation between a bit that is sent and the bit that is received. BER is the number of bit errors divided by the total number of transferred bits during a specified period. The BER of a VP is calculated based on the BER of each section on a VP.\n\nPrerequisites\nThe virtual cluster access view has been displayed using the virtual-cluster-access command."
}