{
    "PageTitle": "display multicast boundary",
    "FuncDef": "The display multicast boundary command displays information about the multicast boundary configured on an interface.",
    "CLIs": [
        "display multicast { vpn-instance <vpn-instance-name> | all-instance } boundary [ <group-address> [ <mask> | <mask-length> ] ] [ interface { <interface-type> <interface-number> | <interface-name> } ]",
        "display multicast boundary [ <group-address> [ <mask> | <mask-length> ] ] [ interface { <interface-type> <interface-number> | <interface-name> } ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies the name of a VPN instance.\nThe value is a string of case-sensitive characters."
        },
        {
            "Parameters": "all-instance",
            "Info": "Specifies all instances.\n-"
        },
        {
            "Parameters": "group-address",
            "Info": "Specifies a multicast group address. If this parameter is specified, information about the multicast boundary configured for the group is displayed.\nThe value ranges from 224.0.0.0 to 239.255.255.255, in dotted decimal notation."
        },
        {
            "Parameters": "mask",
            "Info": "Specifies the mask of a multicast group address. If this parameter is specified, information about the multicast boundary configured for the groups in the specified range is displayed.\nThe address is in dotted decimal notation."
        },
        {
            "Parameters": "mask-length",
            "Info": "Specifies the mask length of a multicast group address. If this parameter is specified, information about the multicast boundary configured for the groups in the specified range is displayed.\nThe value is an integer ranging from 4 to 32."
        },
        {
            "Parameters": "interface interface-name",
            "Info": "Specifies the name of an interface.\n-"
        },
        {
            "Parameters": "interface-type",
            "Info": "Specifies the type of an interface. If this parameter is specified, information about the multicast boundary configured on the interface is displayed.\n-"
        },
        {
            "Parameters": "interface-number",
            "Info": "Specifies the number of an interface. If this parameter is specified, information about the multicast boundary configured on the interface is displayed.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display multicast boundary",
            "Multicast boundary information of VPN-Instance: public net",
            "Total 1 Multicast IPv4 boundary",
            " Interface           Boundary",
            " GE1/0/1             225.0.0.0/24"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAfter a multicast boundary has been configured by using the multicast boundary command, run the display multicast boundary command to view configurations.\nPrecautions\nIf neither vpn-instance nor all-instance is specified, information about multicast boundaries configured on the interfaces in the public network instance is displayed."
}