{
    "PageTitle": "display multicast vpn-instance routing-table",
    "FuncDef": "The display multicast vpn-instance routing-table command displays information about multicast routing tables.",
    "CLIs": [
        "display multicast vpn-instance <vpn-instance-name> routing-table [ <group-address> [ mask { <group-mask-length> | <group-mask-addr> } ] | <source-address> [ mask { <source-mask-length> | <source-mask-addr> } ] | incoming-interface { { <iif-port-type> <iif-port-num> | <iif-port-name> } | register | pseudo | mcast-extranet } | outgoing-interface { include | exclude | match } { { <oif-port-type> <oif-port-num> | <oif-port-name> } [ bas ] | register | none | pseudo } | extranet { source-vpn-instance { all | vpn-instance <svpn-instance-name> | public } | receive-vpn-instance { all | vpn-instance <rvpn-instance-name> } } ] * [ outgoing-interface-number [ <number> ] ]",
        "display multicast routing-table outgoing-interface-number [ <number> ]"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "group-address",
            "Info": "Displays information about a multicast routing table that contains a specified multicast group address.\nThe address is in dotted decimal notation. The value ranges from 224.0.1.0 to 239.255.255.255."
        },
        {
            "Parameters": "mask",
            "Info": "Displays information about a multicast routing table that contains a specified multicast group or source address mask.\n-"
        },
        {
            "Parameters": "group-mask-length",
            "Info": "Displays information about a multicast routing table in which the multicast group address mask has the specified length.\nThe value is a decimal integer ranging from 4 to 32."
        },
        {
            "Parameters": "group-mask-addr",
            "Info": "Displays information about a multicast routing table that contains a specified multicast group address mask.\nThe address mask is in dotted decimal notation."
        },
        {
            "Parameters": "source-address",
            "Info": "Displays information about a multicast routing table that contains a specified multicast source address.\nThe address is in dotted decimal notation."
        },
        {
            "Parameters": "source-mask-length",
            "Info": "Displays information about a multicast routing table that contains the mask length of a specified source address.\nThe value is a decimal integer that ranges from 0 to 32."
        },
        {
            "Parameters": "source-mask-addr",
            "Info": "Displays information about a multicast routing table that contains a specified source mask.\nThe address mask is in dotted decimal notation."
        },
        {
            "Parameters": "incoming-interface",
            "Info": "Displays information about a multicast routing table that contains a specified inbound interface.\n-"
        },
        {
            "Parameters": "iif-port-type",
            "Info": "Specifies the type of an inbound interface.\n-"
        },
        {
            "Parameters": "iif-port-num",
            "Info": "Specifies the number of an inbound interface.\n-"
        },
        {
            "Parameters": "iif-port-name",
            "Info": "Specifies the name of an inbound interface.\n-"
        },
        {
            "Parameters": "register",
            "Info": "Displays information about a multicast routing table that contains a specified PIM-SM register interface.\n-"
        },
        {
            "Parameters": "pseudo",
            "Info": "Displays information about a multicast routing table that contains pseudo upstream MVPN interfaces.\n-"
        },
        {
            "Parameters": "mcast-extranet",
            "Info": "Displays information about a multicast routing table in which upstream interfaces are extranet interfaces.\n-"
        },
        {
            "Parameters": "outgoing-interface",
            "Info": "Displays information about a multicast routing table that contains a specified outbound interface.\n-"
        },
        {
            "Parameters": "include",
            "Info": "Displays the (S, G) entries whose downstream interface list contains specified downstream interfaces.\n-"
        },
        {
            "Parameters": "exclude",
            "Info": "Displays the (S, G) entries whose downstream interface list does not contain specified downstream interfaces.\n-"
        },
        {
            "Parameters": "match",
            "Info": "Displays (S, G) entries whose the downstream interface list contains only one interface that is the same as a specified downstream interface.\n-"
        },
        {
            "Parameters": "oif-port-type",
            "Info": "Specifies the type of an outbound interface.\n-"
        },
        {
            "Parameters": "oif-port-num",
            "Info": "Specifies the number of an outbound interface.\n-"
        },
        {
            "Parameters": "oif-port-name",
            "Info": "Specifies the name of an outbound interface.\n-"
        },
        {
            "Parameters": "bas",
            "Info": "Displays information about multicast routing entries in which the outbound interface is a BAS interface.\n-"
        },
        {
            "Parameters": "none",
            "Info": "Displays information about a multicast routing table that contains a null outbound interface list.\n-"
        },
        {
            "Parameters": "extranet",
            "Info": "Displays information about a multicast routing table of MVPN extranet.\n-"
        },
        {
            "Parameters": "source-vpn-instance svpn-instance-name",
            "Info": "Displays information about a multicast routing table of the current instance with upstream interfaces belonging to a specific VPN instance.\nThe value is a string of 1 to 31 characters."
        },
        {
            "Parameters": "all",
            "Info": "Displays information about a multicast routing table of the current instance with sources belonging to instances.\n-"
        },
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Displays information about the multicast routing table in a specified VPN instance.\nThe value is a string of 1 to 31 case-sensitive characters, spaces not supported. In addition, the VPN instance name must not be _public_. When double quotation marks are used around the string, spaces are allowed in the string."
        },
        {
            "Parameters": "public",
            "Info": "Displays information about a multicast routing table of the current instance with upstream interfaces belonging to the public instance.\n-"
        },
        {
            "Parameters": "receive-vpn-instance",
            "Info": "Displays information about a multicast routing table of the current instance with receivers belonging to VPN instances.\n-"
        },
        {
            "Parameters": "receive-vpn-instance rvpn-instance-name",
            "Info": "Displays information about a multicast routing table of the current instance with receivers belonging to a specific VPN instance.\nThe value is a string of 1 to 31 characters."
        },
        {
            "Parameters": "outgoing-interface-number",
            "Info": "Displays information about a multicast routing table that contains a specified number of outbound interfaces.\n-"
        },
        {
            "Parameters": "number",
            "Info": "Specifies the number of outbound interfaces.\nThe value is an integer that ranges from 0 to 2048."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display multicast vpn-instance VPNA routing-table",
            "Multicast routing table of VPN-Instance: VPNA",
            " Total 2 entries",
            " 00001. (192.168.0.2, 227.0.0.1)",
            "       Uptime: 00:05:52",
            "       Upstream Interface: GigabitEthernet1/0/0",
            "       List of 1 downstream interface",
            "           1: pseudo",
            " 00002. (1.1.1.1, 225.1.1.1)",
            "       Uptime: 00:05:50",
            "       Upstream Interface: GigabitEthernet1/0/0",
            "       List of 1 downstream interface",
            "           1: pseudo"
        ],
        [
            "<HUAWEI> display multicast vpn-instance VPNA routing-table",
            "Multicast routing table of VPN-Instance: VPNA",
            " Total 1 entry",
            " 00001. (1.1.1.1, 224.1.1.1)",
            "       Uptime: 00:12:21",
            "       Upstream Interface: pseudo",
            "       List of 1 downstream interface",
            "           1: GigabitEthernet1/0/0"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe display multicast vpn-instance routing-table command is used to display the information of a multicast routing table.\nPrecautions\nWhen the display multicast routing-table command is used, the following situations occur:\nIf vpn-instance or all-instance is not specified, information about the multicast routing table of the public network instance is displayed.If group-address is specified, information about the multicast routing table to which a specified multicast group corresponds is displayed.If group-address mask is specified, information about the multicast routing table to which a multicast group address within a specified address range corresponds is displayed.If source-address is specified, information about the multicast routing table to which a specified multicast source address corresponds is displayed.If source-address mask is specified, information about the multicast routing table to which a multicast source address within a specified address range corresponds is displayed.If outgoing-interface-number is specified, the number of downstream interfaces of multicast routing entries is displayed.If number is specified, information about the multicast groups corresponding to the number of downstream interfaces is displayed."
}