{
    "PageTitle": "display debugging(All views)",
    "FuncDef": "The display debugging command displays the debugging status.",
    "CLIs": [
        "display debugging { pim | pim6 | igmp | mld | msdp | md | snpg | mvpn | mvpn6 }"
    ],
    "ParentView": [
        "All views"
    ],
    "ParaDef": [
        {
            "Parameters": "pim",
            "Info": "PIM protocol.\n-"
        },
        {
            "Parameters": "pim6",
            "Info": "PIM6 protocol.\n-"
        },
        {
            "Parameters": "igmp",
            "Info": "IGMP protocol.\n-"
        },
        {
            "Parameters": "mld",
            "Info": "MLD protocol.\n-"
        },
        {
            "Parameters": "msdp",
            "Info": "MSDP protocol.\n-"
        },
        {
            "Parameters": "md",
            "Info": "MD protocol.\n-"
        },
        {
            "Parameters": "snpg",
            "Info": "IGMP snooping module.\n-"
        },
        {
            "Parameters": "mvpn",
            "Info": "Specify MVPN (Multicast Virtual Private Network) configuration.\n-"
        },
        {
            "Parameters": "mvpn6",
            "Info": "Specify MVPN (Multicast Virtual Private Network) IPv6 configuration.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> display debugging pim",
            "PIM(_public_) nsr message [ Filter:(source=*, group=*) ] debugging switch is on",
            "PIM(_public_) nsr event [ Filter:(source=*, group=*) ] debugging switch is on",
            "PIM(_public_) bfd event debugging switch is on",
            "PIM(_public_) bfd delete debugging switch is on",
            "PIM(_public_) bfd create debugging switch is on",
            "PIM(_public_) rp receive debugging switch is on",
            "PIM(_public_) rp send debugging switch is on",
            "PIM(_public_) routing-table [ Filter:(source=*, group=*) ] debugging switch is on",
            "PIM(_public_) register [ Filter:(source=*, group=*) ] debugging switch is on",
            "PIM(_public_) neighbor receive [ Filter:(source=*) ] debugging switch is on",
            "PIM(_public_) neighbor send [ Filter:(source=*) ] debugging switch is on",
            "PIM(_public_) msdp [ Filter:(source=*, group=*) ] debugging switch is on",
            "PIM(_public_) join-prune receive [ Filter:(source=*, group=*) ] debugging switch is on",
            "PIM(_public_) join-prune send [ Filter:(source=*, group=*) ] debugging switch is on",
            "PIM(_public_) event [ Filter:(source=*, group=*) ] debugging switch is on",
            "PIM(_public_) assert receive [ Filter:(source=*, group=*) ] debugging switch is on",
            "PIM(_public_) assert send [ Filter:(source=*, group=*) ] debugging switch is on"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWhen a large amount of information is output, the display debugging mld command can be used to view information about the enabled MLD debugging functions. Based on the command output, you can disable some unnecessary debugging functions to minimize the debugging information output.\nWhen a large amount of information is output, the display debugging igmp command can be used to view information about the enabled igmp debugging functions. Based on the command output, you can disable some unnecessary debugging functions to minimize the debugging information output.\nWhen a large amount of information is output, the display debugging mvpnv6 command can be used to view information about the enabled ipv6 ng mvpn debugging functions. Based on the command output, you can disable some unnecessary debugging functions to minimize the debugging information output.\nWhen a large amount of information is output, the display debugging pim command can be used to view information about the enabled PIM debugging functions. Based on the command output, you can disable some unnecessary debugging functions to minimize the debugging information output.\nWhen a large amount of information is output, the display debugging md command can be used to view information about the enabled MD debugging functions. Based on the command output, you can disable some unnecessary debugging functions to minimize the debugging information output.\nWhen a large amount of information is output, the display debugging msdp command can be used to view information about the enabled MSDP debugging functions. Based on the command output, you can disable some unnecessary debugging functions to minimize the debugging information output.\nWhen a large amount of information is output, the display debugging pim6 command can be used to view information about the enabled PIM IPv6 debugging functions. Based on the command output, you can disable some unnecessary debugging functions to minimize the debugging information output.\nWhen a large amount of information is output, the display debugging igmp command can be used to view information about the enabled IGMP debugging functions. Based on the command output, you can disable some unnecessary debugging functions to minimize the debugging information output.\nWhen a large amount of information is output, run the display debugging mvpn command to check the NG MVPN debugging functions that have been enabled. Then you can disable some unnecessary debugging functions to minimize the debugging information output."
}