{
    "PageTitle": "multicast minimum-ttl",
    "FuncDef": "The multicast minimum-ttl command sets the minimum TTL value of multicast packets that an interface is allowed to send.\nThe undo multicast minimum-ttl command restores the default value.\nBy default, the minimum TTL value of multicast packets is 1.",
    "CLIs": [
        "multicast minimum-ttl <ttl-value>",
        "undo multicast minimum-ttl"
    ],
    "ParentView": [
        "PW-VE sub-interface view",
        "Tunnel interface view",
        "40GE interface view",
        "IP-Trunk interface view",
        "Port extension interface view",
        "GE electrical interface view",
        "Loopback interface view",
        "MTI interface view",
        "Serial interface view",
        "Eth-Trunk sub-interface view",
        "50GE sub-interface view",
        "400GE interface view",
        "MP-group interface view",
        "10GE interface view",
        "POS sub-interface view",
        "GE sub-interface view",
        "VBDIF interface view",
        "VE sub-interface view",
        "25GE sub-interface view",
        "GE interface view",
        "100GE interface view",
        "Mtunnel view",
        "VLANIF interface view",
        "Global VE sub-interface view",
        "50GE interface view",
        "400GE sub-interface view",
        "GE optical interface view",
        "100ge sub-interface view",
        "25GE interface view",
        "40GE sub-interface view",
        "Eth-Trunk interface view",
        "10GE sub-interface view",
        "POS interface view"
    ],
    "ParaDef": [
        {
            "Parameters": "ttl-value",
            "Info": "Minimum TTL value of multicast packets on an interface.\nThe value is an integer that ranges from 1 to 255."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] interface GigabitEthernet 1/0/0",
            "[*HUAWEI-GigabitEthernet1/0/0] multicast minimum-ttl 8"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy setting the minimum TTL value of multicast packets on an interface, you can limit the transmission distance of multicast packets. If you do not want an interface to forward multicast packets, you can change the minimum TTL value set on the interface to a larger value.\nWhen forwarding a packet (including the packet sent by the local Router) through an interface, the Router checks the TTL value of the packet:\nIf the TTL value (which is reduced by 1 by the local Router) is greater or equal to the minimum TTL value set on the interface, the packet is forwarded.If the TTL value is smaller than the minimum TTL value set on the interface, the packet is discarded.\n\nPrerequisites\nThe multicast routing-enable command is run in the public network instance view or VPN instance view.\nConfiguration Impact\nIf the multicast minimum-ttl command is run more than once, the latest configuration overrides the previous one.\nPrecautions\nIf the minimum TTL value is set to 255 on an interface, the interface does not forward any multicast packets.\nThis command applies only to the view of a tunnel interface with an encapsulation mode of GRE or TE."
}