{
    "PageTitle": "multicast global limit",
    "FuncDef": "The multicast global limit command sets a limit on the number of global IPv4 PIM entries.\nThe undo multicast global limit command restores the default setting.\nBy default, no limit is set on the number of global IPv4 PIM entries.",
    "CLIs": [
        "multicast global limit pim { sm | dm } { star-group-number | source-group-number } <limit-count> [ threshold-alarm upper-limit <upper-limit-value> lower-limit <lower-limit-value> ]",
        "undo multicast global limit pim { sm | dm } { star-group-number | source-group-number }"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "sm",
            "Info": "Specifies PIM-SM/SSM mode.\n-"
        },
        {
            "Parameters": "dm",
            "Info": "Specifies PIM-DM mode.\n-"
        },
        {
            "Parameters": "star-group-number",
            "Info": "Configures the specified limit to take effect for (*, G) multicast entries.\n-"
        },
        {
            "Parameters": "source-group-number",
            "Info": "Configures the specified limit to take effect for (S, G) multicast entries.\n-"
        },
        {
            "Parameters": "limit-count",
            "Info": "Sets a limit on the number of PIM entries.\nThe value is an integer ranging from 1 to 16384 when using pim sm.\nThe value is an integer ranging from 1 to 8000 when using pim dm."
        },
        {
            "Parameters": "threshold-alarm",
            "Info": "Sets an alarm trigger threshold.\n-"
        },
        {
            "Parameters": "upper-limit upper-limit-value",
            "Info": "Sets an alarm trigger threshold, in percentage. An alarm is generated when the percentage ratio of created PIM entries to limit-count reaches upper-limit-value. Setting upper-limit-value to a value greater than 95% is not recommended.\nThe value is an integer ranging from 1 to 100. The default value is 80."
        },
        {
            "Parameters": "lower-limit lower-limit-value",
            "Info": "Sets an alarm clear threshold, in percentage. An alarm is cleared when the percentage ratio of created PIM entries to limit-count falls below lower-limit-value.\nlower-limit-value must be less than upper-limit-value.To prevent alarms from being frequently generated and cleared due to route flapping, setting lower-limit-value to a value at least 10 less than upper-limit-value is recommended.\nThe value is an integer ranging from 1 to 100. The default value is 70."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast global limit pim sm source-group-number 1000"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast global limit pim sm star-group-number 2000 threshold-alarm upper-limit 80 lower-limit 70"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo set a limit on the number of PIM entries on the device, run the multicast global limit pim sm command.\nConfiguration Impact\nAfter the specified limit is reached, new entries are not created, and the PIM_1.3.6.1.4.1.2011.5.25.149.4.0.23 routeExceed alarm is generated.\nAfter the specified limit is reached, new (*, G) and (S, G) entries can be manually added, and ASM share-group entries for Rosen MVPN can be created.\nIf threshold-alarm upper-limit-value is set, the PIM_1.3.6.1.4.1.2011.5.25.149.4.0.21 routeThresholdExceed alarm is generated when the percentage ratio of created PIM entries to the specified limit reaches upper-limit-value."
}