{
    "PageTitle": "multicast extranet traffic-forward type",
    "FuncDef": "The multicast extranet traffic-forward type command configures the extranet to forward multicast traffic through the specified interfaces.\nThe undo multicast extranet traffic-forward type command disables the extranet from forwarding multicast traffic through a specified interface.\nBy default, the extranet is disabled from forwarding multicast traffic through a specified interface.",
    "CLIs": [
        "multicast extranet traffic-forward type { vlanif | qinq | bas igmp | vbdif }",
        "undo multicast extranet traffic-forward type { vlanif | qinq | bas igmp | vbdif }"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "vlanif",
            "Info": "Indicates multicast traffic forwarding through a VLANIF interface.\n-"
        },
        {
            "Parameters": "qinq",
            "Info": "Indicates multicast traffic forwarding through a QinQ/dot1q VLAN tag termination sub-interface.\n-"
        },
        {
            "Parameters": "bas",
            "Info": "Indicates multicast traffic forwarding through a BAS interface accessed.\nIn VS mode, this parameter is supported only by the admin VS.\n-"
        },
        {
            "Parameters": "igmp",
            "Info": "Indicates IGMP users.\nIn VS mode, this parameter is supported only by the admin VS.\n-"
        },
        {
            "Parameters": "vbdif",
            "Info": "Indicates multicast traffic forwarding through a VBDIF interface.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast extranet traffic-forward type vlanif"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast extranet traffic-forward type qinq"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast extranet traffic-forward type vbdif"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn an MVPN extranet scenario, if users join a multicast group on a VLANIF interface, QinQ/dot1q VLAN tag termination sub-interface or BAS interface or VBDIF interface, the multicast device does not deliver entries to the forwarding table. As a result, the users cannot receive multicast traffic. To resolve this problem, run the multicast extranet traffic-forward type command to configure the extranet to forward multicast traffic through a VLANIF interface,QinQ/dot1q VLAN tag termination sub-interface or BAS interface or VBDIF interface,After that, the multicast device delivers entries to the forwarding table, and the users can receive multicast traffic."
}