{
    "PageTitle": "multicast rpf multi-topology",
    "FuncDef": "The multicast rpf multi-topology command enables multicast services to run in a specified multicast topology instance.\nThe undo multicast rpf multi-topology command disables multicast services from running in a multicast topology instance.\nBy default, multicast services do not run in a specified multicast topology instance.",
    "CLIs": [
        "multicast rpf multi-topology",
        "undo multicast rpf multi-topology"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] ip topology multicast",
            "[*HUAWEI] multicast rpf multi-topology"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWith multicast multi-topologies, multicast services can run in a specified topology, which isolates multicast services from unicast services and eliminates the configuration conflict when both multicast services and unidirectional Traffic Engineering (TE) tunnel services are deployed.\nMulticast services are isolated from unicast services.\nOn the current network, multicast services highly depend on unicast routes. During multicast routing, a router searches a unicast routing table for an optimal route. If the unicast optimal route, shared by both multicast services and unicast services, is faulty, the multicast services and unicast services will be interrupted and users fail to receive the multicast data.\nWith multicast multi-topologies, multicast services can run in a specified topology, which isolates multicast services from unicast services.\nMulticast services are isolated from unidirectional TE tunnel services.\nWith both multicast services and unidirectional TE tunnel services deployed, if a unidirectional TE tunnel interface is chosen during multicast routing, the multicast data fails to pass the reverse path forwarding (RPF) check. A local multicast-topology (MT) feature can address this problem. However, in this situation, a separate Multicast Interior Gateway Protocol (MIGP) routing table has to be maintained, which consumes network resources.\nWith multicast multi-topologies, the system searches routes only in the unicast routing table, the static multicast routing table, and the Multicast Border Gateway Protocol (MBGP) routing table specified by the multicast topology. These routing tables contain no unidirectional TE tunnel interface, avoiding the problem that multicast data fails to pass the RPF check when a unidirectional TE tunnel interface is chosen. In addition, no separate MIGP routing table has to be maintained, so network resources can be properly planned.\n\nPrerequisites\nGlobal IPv4 multicast topology instance has been enabled.\nPrecautions\nMulticast services can run in multicast multi-topologies in the public network instance.\nMulticast topology instances support direct routes, static routes, IS-IS routes, and MBGP routes."
}