{
    "PageTitle": "multicast egress replication",
    "FuncDef": "The multicast egress replication command configures downstream multicast traffic to be replicated on the traffic manager (TM).\nThe undo multicast egress replication command restores the default configuration.\nBy default, downstream multicast traffic is replicated on the network processor (NP).",
    "CLIs": [
        "multicast egress replication from forwarding-engine to traffic-manager [ slot <slot-id> ]",
        "undo multicast egress replication from forwarding-engine to traffic-manager [ slot <slot-id> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "slot slot-id",
            "Info": "Specifies a slot ID.\nThe value is a string of 1 to 15 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "from",
            "Info": "Indicates that the original replication mode is not used for downstream multicast traffic.\n-"
        },
        {
            "Parameters": "forwarding-engine",
            "Info": "Indicates the original replication mode in which downstream multicast traffic is replicated on the NP.\n-"
        },
        {
            "Parameters": "to",
            "Info": "Indicates that a specified replication mode is used for downstream multicast traffic.\n-"
        },
        {
            "Parameters": "traffic-manager",
            "Info": "Indicates the target replication mode in which downstream multicast traffic is replicated on the TM.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast egress replication from forwarding-engine to traffic-manager"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf loopback channel bandwidth resources are insufficient, run the multicast egress replication command to configure downstream multicast traffic to be replicated on the TM to save the bandwidth resources. Note that this configuration increases resource consumption on the TM and may cause packet loss when the TM buffer resources are insufficient.\nPrecautions\nThis command takes effect after the board resets or the device restarts.\nThe command applies only to LPUI-1T/LPUI-1T-B/LPUI-1T-L boards and the device forwarding mode is enhance."
}