{
    "PageTitle": "multicast egress statistics",
    "FuncDef": "The multicast egress statistics command enables a device to collect statistics about downstream Layer 3 IPv4 multicast packets based on a multicast source and group.\nThe undo multicast egress statistics command disables a device from collecting statistics about downstream Layer 3 IPv4 multicast packets based on a multicast source and group.\nBy default, a device is disabled from collecting statistics about downstream Layer 3 IPv4 multicast packets based on a multicast source and group.",
    "CLIs": [
        "multicast egress statistics [ vpn-instance <vpn-instance-name> ] <source-address> <group-address> slot <slot-id>",
        "undo multicast egress statistics [ vpn-instance <vpn-instance-name> ] <source-address> <group-address> slot <slot-id>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "vpn-instance vpn-instance-name",
            "Info": "Specifies a VPN instance name.\nThe value is a string of 1 to 31 characters."
        },
        {
            "Parameters": "source-address",
            "Info": "Specifies a multicast source address.\nThe value is in dotted decimal notation."
        },
        {
            "Parameters": "group-address",
            "Info": "Specifies a multicast group address.\nThe value ranges from 224.0.1.0 to 239.255.255.255, in dotted decimal notation."
        },
        {
            "Parameters": "slot slot-id",
            "Info": "Specifies a slot ID. The value range varies with the hardware of the router.\nThe value is a string of 1 to 15 characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system",
            "[~HUAWEI] multicast egress statistics vpn-instance vpn1 10.10.10.10 225.0.0.1 slot 1"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo enable a device to collect statistics about downstream Layer 3 IPv4 multicast packets based on a multicast source and group, run the display multicast egress statistics vpn-instance source-address group-address slot or display multicast egress statistics slot command to check statistics about downstream Layer 3 IPv4 multicast packets. The multicast egress statistics enable slot command takes precedence over the multicast egress statistics command. That is, if the multicast egress statistics enable slot command has been run on a device, the device is enabled to collect statistics about downstream Layer 3 IPv4 multicast packets regardless of whether the multicast egress statistics command is run. The multicast egress statistics command takes effect only if the multicast egress statistics enable slot command is not run.\nFollow-up Procedure\nRun the display multicast egress statistics vpn-instance source-address group-address slot or display multicast egress statistics slot command to check statistics about downstream Layer 3 IPv4 multicast packets.\nPrecautions\nThe multicast egress statistics command is not supported on the following boards: LPUF-50/LPUF-50-L/LPUI-21-L/LPUI-51-L/LPUF-51/LPUF-51-B/LPUI-51/LPUI-51-B/LPUS-51/LPUF-101/LPUF-101-B/LPUI-101/LPUI-101-B/LPUS-101,LPUF-51-E/LPUI-51-E/LPUI-51-S/LPUI-51-CM/LPUF-120/LPUF-120-B/LPUF-120-E/LPUI-102-E/LPUI-120/LPUI-120-B/LPUI-120-L/LPUI-52-E/LPUI-120-E/LPUI-120-CM/LPUF-240/LPUF-240-B/LPUF-240-E/LPUI-240/LPUI-240-B/LPUI-240-CM/LPUI-240-L/LPUF-480/LPUF-480-B/LPUI-480/LPUI-480-B/LPUI-480-L/LPUF-480-E/LPUI-480-CM/LPUF-400-E."
}