{
    "PageTitle": "trunk multicast load-balance hash-mode multicast-member",
    "FuncDef": "The trunk multicast load-balance hash-mode multicast-member command configures multicast group- and trunk sub-interface-based multicast load balancing using the hash algorithm.\nThe undo trunk multicast load-balance hash-mode multicast-member command restores the default configuration.\nBy default, the device implements group-based multicast load balancing using the hash algorithm.",
    "CLIs": [
        "trunk multicast load-balance hash-mode multicast-member",
        "undo trunk multicast load-balance hash-mode multicast-member"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] trunk multicast load-balance  hash-mode multicast-member"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf multicast traffic is transmitted over trunk outbound interfaces, by default the device implements group-based multicast load balancing on trunk member interfaces using the hash algorithm. Therefore, if two or more multicast flows belong to the same multicast group but have different outbound sub-interfaces of a trunk interface, the device will select the same trunk member interface for traffic forwarding. This may overburden some trunk member interfaces. To resolve this issue, run the trunk multicast load-balance hash-mode multicast-member command to implement group- and trunk sub-interface-based multicast load balancing using the hash algorithm. Then, if two or more multicast flows belong to the same multicast group but have different outbound sub-interfaces of a trunk interface, the device will select different trunk member interfaces for traffic forwarding.\nPrecautions\nAfter the trunk multicast load-balance hash-mode multicast-member command is run, a few packets are dropped, or a few packets are re-sent.\nAfter the trunk multicast load-balance hash-mode multicast-member command is run, if trunk member interfaces change, there will be a longer time for packet loss or excess packets. Therefore, you are advised to use this command only when the trunk links are stable and a high requirement is posed on the hash result.\nIn VS mode, this command is supported only by the admin VS."
}