{
    "PageTitle": "apply topology",
    "FuncDef": "The apply topology command enables multicast services to run in a unicast topology instance.\nThe undo apply topology command disables multicast services from running in a unicast topology instance.\nBy default, multicast services do not run in a specified unicast topology instance.",
    "CLIs": [
        "apply topology <topology-name>",
        "undo apply topology <topology-name>"
    ],
    "ParentView": [
        "IPv6 multicast multi-topology view",
        "Multicast multi-topology view of a public network instance"
    ],
    "ParaDef": [
        {
            "Parameters": "topology-name",
            "Info": "Specifies the name of a unicast topology instance.\nThe value is a string of case-insensitive characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast ipv6 routing-enable",
            "[*HUAWEI] ipv6 topology multicast",
            "[*HUAWEI] ipv6 topology red",
            "[*HUAWEI] multicast ipv6 rpf multi-topology",
            "[*HUAWEI-multicast-rpf-topology] apply topology red"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] multicast routing-enable",
            "[*HUAWEI] ip topology multicast",
            "[*HUAWEI] ip topology red",
            "[*HUAWEI] multicast rpf multi-topology",
            "[*HUAWEI-multicast-rpf-topology] apply topology red"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nWith multicast multi-topologies, multicast services can run in a specified topology, which isolates multicast services from unicast services. In addition, when searching for routes, the system searches routes only in the unicast routing table, the static multicast routing table, and the Multicast Border Gateway Protocol (MBGP) routing table specified by the multicast topology. This eliminates the conflict between multicast services and unidirectional Traffic Engineering (TE) tunnel services.\nAfter multicast multi-topology is configured, multicast services can run in a multicast topology instance, unicast topology instance.\nCurrently, multicast multi-topologies are applicable to only the public network instance. Using a multicast topology for multicast services is applicable to intra-domain and inter-domain scenarios whereas using a topology instance for multicast services is applicable to only the intra-domain scenario.\nPrerequisites\nAn topology instance has been created.\nA multicast topology instance has been created and multicast multi-topologies have been enabled.\nPrecautions\nYou can deploy only one unicast topology instance for multicast services on a network.Once a unicast topology instance is configured for multicast services on a network, you can no longer deploy a multicast topology instance for multicast services.Unicast topology instances support direct routes, unicast static routes, and IS-IS routes."
}