{
    "PageTitle": "scheduling-class",
    "FuncDef": "This command configures the behavior of a specific scheduling class on all HSMDA schedulers associated with the policy. Thescheduling-classcommand performs one of two operations: configure a maximum rate for the scheduling class or place the scheduling class into one of the two available weighted scheduling groups. The two operations are mutually exclusive.",
    "CLIs": [
        "scheduling-class <class> group <group-id> [ weight <weight-in-group> ]",
        "scheduling-class <class> rate <rate> [ burst-limit <size> ] [ bytes | kilobytes ]",
        "no scheduling-class <class>"
    ],
    "ParentView": [
        "config>qos>hsmda-scheduler-policy"
    ],
    "ParaDef": [
        {
            "Parameters": "class",
            "Info": "specifies the weight the QMDA port scheduler policy should apply to this policy level within the group it belongs to. Values-1 to 8."
        },
        {
            "Parameters": "group-id",
            "Info": "If the scheduling-class command is executed with the group keyword specified, a group-id must be specified. Two weighted scheduling groups are allowed, numbered 1 and 2. With the group, the weight keyword specifies the weight the scheduling class within the group. If weight is not specified, the default weight is 1. Similar to the rate action of the command, the group version will fail if the scheduling class ID is not consecutive with the class members currently members of the weighted scheduling group. The command will have no effect on the current scheduling class settings and a non-contiguous grouping error will be returned, specifying the weighted scheduling group and the current group members. Values-1, 2."
        },
        {
            "Parameters": "weight-in-group",
            "Info": "Specifies the relative weight of class-id to the other scheduling classes within the group. If group is specified without the weight keyword, a default weight is 1. Values-1 to 100."
        },
        {
            "Parameters": "rate",
            "Info": "If the scheduling-class command is executed with the rate keyword specified, either max or a specified megabits-per-second rate must follow. If class-id was previously mapped into one of the two weighted scheduling groups, the class will be removed. However, if removing the class from the group will cause the group to no longer have contiguous class members, the command will fail with no effect on the specified class. A non-contiguous grouping error will be returned, specifying the weighted group. The lowest or highest members within a weighted group must be removed prior to removing the middle member. For example, if scheduling classes 3, 4 and 5 were members of weighted group 1, class 4 cannot be removed first. Values-1 to 40000000, max."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}