{
    "PageTitle": "option-s46",
    "FuncDef": "The option-s46 br-ipv6-address command binds a BR device name to an IPv6 delegation address pool. The NE40E adds OPTION_S46_BR (option 90) to an IPv6 prefix in a DCHPv6 Response message to be sent to a MAP-E user.\nThe option-s46 dmr-prefix command binds a DMR prefix name to an IPv6 delegation address pool. The NE40E adds OPTION_S46_DMR (option 91) to an IPv6 prefix in a DCHPv6 Response message to be sent to a MAP-T user.\nThe option-s46 fmr-flag disable command sets the F-flag bit to 0 in DHCPv6 OPTION_S46_RULE (option 89).\nThe undo option-s46 br-ipv6-address command deletes the binding between the BR device name and the IPv6 delegation address pool.\nThe undo option-s46 dmr-prefix command deletes the binding between the DMR prefix name and the IPv6 delegation address pool.\nThe undo option-s46 fmr-flag disable command sets the F-flag bit to 1 in DHCPv6 OPTION_S46_RULE (option 89).\nBy default, no binding is configured. The default F-flag bit is 1 in DHCPv6 OPTION_S46_RULE.",
    "CLIs": [
        "option-s46 br-ipv6-address <br-address-name>",
        "option-s46 dmr-prefix <dmr-prefix-name>",
        "option-s46 fmr-flag disable",
        "undo option-s46 br-ipv6-address <br-address-name>",
        "undo option-s46 fmr-flag disable",
        "undo option-s46 dmr-prefix <dmr-prefix-name>"
    ],
    "ParentView": [
        "IPv6 address pool view"
    ],
    "ParaDef": [
        {
            "Parameters": "dmr-prefix dmr-prefix-name",
            "Info": "Specifies a DMR IPv6 prefix name.\nThe value is a string of 1 to 31 characters."
        },
        {
            "Parameters": "br-ipv6-address br-address-name",
            "Info": "Specifies the name of a BR.\nThe value is a string of 1 to 31 characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] ipv6 pool huawei bas delegation",
            "[~HUAWEI-ipv6-pool-huawei] option-s46 fmr-flag disable"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] br-ipv6-address br_name ipv6-address 2001:db8::1 prefix-length 96",
            "[~HUAWEI] ipv6 pool huawei bas delegation",
            "[~HUAWEI-ipv6-pool-huawei] option-s46 dmr-prefix br_name"
        ],
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] br-ipv6-address br_name ipv6-address 2001:db8::1 prefix-length 96",
            "[~HUAWEI] ipv6 pool huawei bas delegation",
            "[~HUAWEI-ipv6-pool-huawei] option-s46 br-ipv6-address br_name"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn the MAP-E or MAP-T scenario, a device uses IA-PD to assign MAP prefixes to MAP users. To bind a DMR prefix name to an IPv6 delegation address pool, run the option-s46 command. Upon receipt of the MAP prefix information, a MAP CE can compute routes for packets to be sent. For a MAP-E user, the BR device name must be bound to an IPv6 delegation address pool.For a MAP-T user, the DMR prefix name must be bound to an IPv6 delegation address pool.\nPrerequisites\nA local IPv6 address of a BR device has been configured using the br-ipv6-address command in the system view.\nA DMR prefix has been configured using the dmr-prefix command in the system view.\nPrecautions\nThe option-s46 br-ipv6-address command is mutually exclusive with the option-s46 dmr-prefix command in the same IPv6 address pool.\nThe option-s46 br-ipv6-address command takes effect only for an IPv6 delegation address pool.\nThe option-s46 dmr-prefix command is mutually exclusive with the option-s46 br-ipv6-address command in the same IPv6 address pool.\nThe option-s46 br-ipv6-address command takes effect only for an IPv6 delegation address pool.\nThe option-s46 fmr-flag disable command takes effect only for an IPv6 delegation address pool."
}