{
    "PageTitle": "hop",
    "FuncDef": "This command specifies the IP address of the hops that the LSP should traverse on its way to the egress router. The IP address can be the interface IP address or the system IP address. If the system IP address is specified then the LSP can choose the best available interface.",
    "CLIs": [
        "hop <hop-index> <ip-address> { strict | loose }",
        "no hop <hop-index>"
    ],
    "ParentView": [
        "config>router>mpls>path"
    ],
    "ParaDef": [
        {
            "Parameters": "hop-index",
            "Info": "The hop index is used to order the hops specified. The LSP always traverses from the lowest hop index to the highest. The hop index does not need to be sequential. Values-1 to 1024."
        },
        {
            "Parameters": "ip-address",
            "Info": "The system or network interface IP address of the transit router. The IP address can be the interface IP address or the system IP address. If the system IP address is specified then the LSP can choose the best available interface. A hop list can also include the ingress interface IP address, the system IP address, and the egress IP address of any of the specified hops."
        },
        {
            "Parameters": "loose",
            "Info": "This keyword specifies that the route taken by the LSP from the previous hop to this hop can traverse through other routers. Multiple hop entries with the same IP address are flagged as errors. Either the loose or strict keyword must be specified."
        },
        {
            "Parameters": "strict",
            "Info": "This keyword specifies that the LSP must take a direct path from the previous hop router to this router. No transit routers between the previous router and this router are allowed. If the IP address specified is the interface address, then that is the interface the LSP must use. If there are direct parallel links between the previous router and this router and if system IP address is specified, then any one of the available interfaces can be used by the LSP. The user must ensure that the previous router and this router have a direct link. Multiple hop entries with the same IP address are flagged as errors. Either the loose or strict keyword must be specified."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}