{
    "PageTitle": "lsp",
    "FuncDef": "This command creates an LSP that is either signaled dynamically by the router, or a statically provisioned MPLS-TP LSP.",
    "CLIs": [
        "lsp <lsp-name> [ bypass-only | p2mp-lsp | mpls-tp <src-tunnel-num> | sr-te ]",
        "no lsp <lsp-name> [ bypass-only | p2mp-lsp | mpls-tp <src-tunnel-num> | sr-te ]"
    ],
    "ParentView": [
        "config>router>mpls"
    ],
    "ParaDef": [
        {
            "Parameters": "lsp-name",
            "Info": "Specifies the name that identifies the LSP. The LSP name can be up to 64 characters long and must be unique."
        },
        {
            "Parameters": "bypass-only",
            "Info": "Defines an LSP as a manual bypass LSP exclusively. When a path message for a new LSP requests bypass protection, the PLR first checks if a manual bypass tunnel satisfying the path constraints exists. If one if found, the router selects it. If no manual bypass tunnel is found, the router dynamically signals a bypass LSP in the default behavior. The CLI for this feature includes a knob that provides the user with the option to disable dynamic bypass creation on a per node basis."
        },
        {
            "Parameters": "p2mp-lsp",
            "Info": "Defines an LSP as a point-to-multipoint LSP. The following parameters can be used with a P2MP LSP: adaptive, adspec, cspf, exclude, fast-reroute, from, hop-limit, include, metric, retry-limit, retry-timer, resignal-timer. The following parameters cannot be used with a P2MP LSP: primary, secondary, to, dest-global-id, dest-tunnel-number, working-tp-path, protect-tp-path."
        },
        {
            "Parameters": "mpls-tp src-tunnel-num",
            "Info": "Defines an LSP as an MPLS-TP LSP. The src-tunnel-num is a mandatory create time parameter for mpls-tp LSPs, and has to be assigned by the user based on the configured range of tunnel IDs. The following parameters can only be used with an MPLS-TP LSP: to, dest-global-id, dest-tunnel-number, working-tp-path, protect-tp-path. Other parameters defined for the above LSP types cannot be used."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}