{
    "PageTitle": "default-domain authentication ppp-user",
    "FuncDef": "The default-domain authentication ppp-user command specifies the default authentication domain for PPP users.\nThe undo default-domain authentication ppp-user command restores the original default authentication domain for PPP users.\nBy default, the authentication domain for PPP users is default1.",
    "CLIs": [
        "default-domain authentication ppp-user [ force ] <domain-name>",
        "undo default-domain authentication ppp-user [ force ] <domain-name>"
    ],
    "ParentView": [
        "BAS interface view (GE)",
        "BAS interface view (VE)",
        "BAS interface view",
        "BAS interface view (trunk)"
    ],
    "ParaDef": [
        {
            "Parameters": "force",
            "Info": "Indicates that the default domain is forcibly used as the authentication domain.\n-"
        },
        {
            "Parameters": "domain-name",
            "Info": "Specifies the name of the default authentication domain for PPP users.\nThe value is a string of 1 to 64 characters."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] domain huawei",
            "[~HUAWEI-aaa-domain-huawei] commit",
            "[~HUAWEI-aaa-domain-huawei] quit",
            "[~HUAWEI-aaa] quit",
            "[~HUAWEI] interface GigabitEthernet1/0/1",
            "[*HUAWEI-GigabitEthernet1/0/1] bas",
            "[*HUAWEI-GigabitEthernet1/0/1-bas] commit",
            "[*HUAWEI-GigabitEthernet1/0/1-bas] default-domain authentication ppp-user huawei"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThis command specifies the default authentication domain for PPP users. If you do not specify the domain name in Web authentication, the default domain configured on the BAS interface is used as the authentication domain for users. Authentication, authorization, and accounting are performed on users based the policies configured for the default domain.\nPrerequisites\nThe domain specified in this command must exist on the device. If the domain does not exist, create it on the device first.\nConfiguration Impact\nIf the default-domain authentication ppp-user command is configured, the authentication domain specified in this command is used as the default authentication domain for PPP users.If the default-domain authentication ppp-user command is not configured but the default-domain authentication { force | replace } command is configured, the authentication domain specified in the default-domain authentication { force | replace } command is used as the default authentication domain for PPP users.If neither of the commands is configured, the default authentication domain for PPP users is default1.\n\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}