{
    "PageTitle": "ipv6 nd autoconfig managed-address-flag",
    "FuncDef": "The ipv6 nd autoconfig managed-address-flag command sets the IP address allocation mode to DHCPv6 for PPPoX users, and specifies the interface ID negotiated using IPv6CP as the interface ID of the IPv6 address allocated by means of DHCPv6.\nThe undo ipv6 nd autoconfig managed-address-flag command restores the default IP address allocation mode for PPPoX users.\nBy default, NDRA is used as an IP address allocation mode for PPPoX users.",
    "CLIs": [
        "ipv6 nd autoconfig managed-address-flag [ interface-id ipv6cp ]",
        "undo ipv6 nd autoconfig managed-address-flag"
    ],
    "ParentView": [
        "AAA domain view"
    ],
    "ParaDef": [
        {
            "Parameters": "interface-id ipv6cp",
            "Info": "Indicates that the interface ID negotiated using IPv6CP is specified as the interface ID of the IPv6 address allocated by means of DHCPv6.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[~HUAWEI-aaa] domain d1",
            "[*HUAWEI-domain-d1] commit",
            "[~HUAWEI-domain-d1] ipv6 nd autoconfig managed-address-flag interface-id ipv6cp"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nThe ipv6 nd autoconfig managed-address-flag command is used in the AAA domain view to set the IP address allocation mode to DHCPv6 for PPPoX users.\nConfiguration Impact\nIf interface-id ipv6cp is specified in the command, the interface ID negotiated using IPv6CP is specified as the interface ID of the IPv6 address allocated by means of DHCPv6, and the device only allocates a 64-bit IPv6 prefix. If interface-id ipv6cp is not specified, the device allocates a 128-bit IPv6 address.\nPrecautions\nThis command takes effect only for PPPoX users. For IPoX users, the configuration of the ipv6 nd autoconfig managed-address-flag command is configured or not on an interface determines whether NDRA or DHCPv6 is used as an IP address allocation mode."
}