{
    "PageTitle": "ppp-gateway unnumbered loopback",
    "FuncDef": "The ppp-gateway unnumbered loopback command configures a loopback address as the preferentially used gateway address for PPP users who receive IP addresses from the RADIUS server.\nThe undo ppp-gateway unnumbered loopback command restores the default configuration for users to choose the gateway.\nBy default, a loopback address as the preferentially used gateway address for PPP users who receive IP addresses from the RADIUS server is not configured.",
    "CLIs": [
        "ppp-gateway unnumbered loopback",
        "undo ppp-gateway unnumbered loopback"
    ],
    "ParentView": [
        "AAA view"
    ],
    "ParaDef": null,
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] aaa",
            "[*HUAWEI-aaa] ppp-gateway unnumbered loopback"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBy default, if a RADIUS server assigns an IP address for a subscriber, the precedence sequence for a PPP user to choose a gateway address is as follows:The VT interface address if the user is bound with the VT and this VT has an IP address >  The gateway address of the IP pool which this user IP address belongs to >  The gateway of the local address pool with the smallest IP address > Physical interface or sub-interface address which has the smallest IP address\nIf a RADIUS server identifies an IP Pool for a subscriber, the precedence sequence for a PPP user to choose a gateway address is as follows: The VT interface address if the user is bound with the VT and this VT has an IP address > The gateway address of the IP pool which this user IP address belongs to\nThe ppp-gateway unnumbered loopback command is used when a PPP user who receives a Framed-Ip-Address from the RADIUS server needs to choose a loopback interface address as the gateway address.When multiple IP addresses are configured on the loopback interface, the PPP user gateway uses the main address instead of the sub address.\nConfiguration Impact\nAfter the ppp-gateway unnumbered loopback is configured, a PPP user who receives a Framed-Ip-Address from the RADIUS server needs to choose a loopback interface address as the gateway address. The loopback interface address must be valid with the smallest interface number and have the same VPN as that of the user.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nThis function applies only to the scenario where an IPv4 gateway is chosen.After the ppp-gateway unnumbered loopback command is run, if a user has chosen a loopback interface address as the gateway address, the loopback interface address and the loopback interface can still be deleted. The user cannot ping the gateway after the deletion, but packet forwarding is not affected.In an RUI scenario, you must run the ppp-gateway unnumbered loopback command on both the master and backup devices to specify the same loopback interface address as the gateway address for PPP users."
}