{
    "PageTitle": "ppp authentication-mode (Virtual template view)",
    "FuncDef": "The ppp authentication-mode command configures a PPP authentication mode.\nThe undo ppp authentication-mode command restores the default PPP authentication mode.\nBy default, the PPP authentication mode is auto.",
    "CLIs": [
        "ppp authentication-mode { auto | { pap | chap | mschapv1 | mschapv2 } * }",
        "undo ppp authentication-mode"
    ],
    "ParentView": [
        "Virtual template view"
    ],
    "ParaDef": [
        {
            "Parameters": "auto",
            "Info": "Indicates the autonegotiation mode.\n-"
        },
        {
            "Parameters": "pap",
            "Info": "Indicates PAP authentication.\n-"
        },
        {
            "Parameters": "chap",
            "Info": "Indicates CHAP authentication.\n-"
        },
        {
            "Parameters": "mschapv1",
            "Info": "Indicates MSCHAPv1 authentication, in which the user name and password are sent in ciphertext. MSCHAPv1 is the Microsoft version of CHAP.\n-"
        },
        {
            "Parameters": "mschapv2",
            "Info": "Indicates MSCHAPv2 authentication, in which the user name and password are sent in ciphertext. MSCHAPv2 is the Microsoft version of CHAP.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface virtual-template 10",
            "[*HUAWEI-Virtual-Template10] ppp authentication-mode chap"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nDuring PPP link establishment, the devices on both ends of a PPP link must be authenticated before entering NCP negotiation. There are two major PPP authentication modes: PAP and CHAP.\nPAP uses a 2-way handshake to verify the identity of the peer on a P2P link. It transmits the user name and password in plain text.CHAP uses a 3-way handshake to verify the identity of the peer. It transmits user names but not passwords.\nIf the ppp authentication-mode chap pap command is run, CHAP negotiation is preferentially used in LCP negotiation. If the peer end does not support CHAP negotiation, PAP negotiation is used. If neither mode is supported by the authenticated, the negotiation fails. The two modes cannot be both used during PPP negotiation.\n\nConfiguration Impact\nIf the ppp authentication-mode command is run more than once in the same view, the latest configuration overrides the previous one.\nPrecautions\nThis command is supported only on the admin VS.\nThe PPP authentication mode configured using this command and the AAA authentication mode are both used to authenticate PPP users.Specifically, the PPP authentication mode verifies the PPP link, whereas AAA determines whether PPP users are successfully authenticated.PAP is not a secure protocol, and it is recommended to use CHAP."
}