{
    "PageTitle": "ppp delay-lcp-negotiation",
    "FuncDef": "The ppp delay-lcp-negotiation command delays the negotiation in the LCP phase.\nThe undo ppp delay-lcp-negotiation command cancels the delay for the negotiation in the LCP phase.\nBy default, the negotiation in the LCP phase is not delayed.",
    "CLIs": [
        "ppp delay-lcp-negotiation [ force ]",
        "undo ppp delay-lcp-negotiation"
    ],
    "ParentView": [
        "Virtual template view"
    ],
    "ParaDef": [
        {
            "Parameters": "force",
            "Info": "Sets the LCP delay negotiation type to force.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface virtual-template 10",
            "[*HUAWEI-Virtual-Template10] ppp delay-lcp-negotiation"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the Layer 2 network of the user is a ring network, packets transmitted across the network may be out of order, making users unable to go online normally. To ensure that the LCP negotiation packets sent by the arrive at the user later than the PPPoE packets, you need to delay the negotiation in the LCP phase. In this manner, packets exchanged between the and user are in correct order.\nAfter you configure the ppp delay-lcp-negotiation command, the sends the first LCP Request packet after the specified delay.If the force parameter is not specified, when the device receives an LCP Request packet from the user, the device will stop delay and instantly performs LCP negotiation. If the force parameter is specified, the device still delays LCP negotiation upon receipt of an LCP Request packet from the user.If the does not receive the LCP Request packet from the peer within the specified time (2 seconds by default), the sends the first LCP Request packet after a delay of the specified time.If the receives the LCP Request packet from the peer within the specified time (2 seconds by default), the responds to the request in real time and continues subsequent negotiation (in this situation, the ppp delay-lcp-negotiation command configuration is regarded as invalid).\n\nPrecautions\nThis command is supported only on the admin VS.\nIf the DSLAM sends the VBAS Response packet at a low speed, the required VBAS information cannot be encapsulated into the Request packet sent by the to the RADIUS server for authentication. To solve the problem, you can set the LCP delay negotiation type to force."
}