{
    "PageTitle": "ppp keepalive adjustment",
    "FuncDef": "The ppp keepalive adjustment command configures adjustment of the number of PPP detection times.\nThe undo ppp keepalive adjustment command disables adjustment of the number of PPP detection times.\nBy default, adjustment of the number of detection times is disabled.",
    "CLIs": [
        "ppp keepalive adjustment system-state",
        "ppp keepalive adjustment retransmit",
        "undo ppp keepalive adjustment system-state",
        "undo ppp keepalive adjustment retransmit"
    ],
    "ParentView": [
        "Virtual template view"
    ],
    "ParaDef": [
        {
            "Parameters": "retransmit",
            "Info": "Indicates that the number of user detection failures is cleared after the board on which an Eth-Trunk member interface resides becomes a master processing board.\n-"
        },
        {
            "Parameters": "system-state",
            "Info": "Indicates that the number of PPP detection times is adjusted based on the system status.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface virtual-template 10",
            "[*HUAWEI-Virtual-Template10] ppp keepalive adjustment system-state"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIf the system is busy, for example, the CPU usage exceeds 80%, and the configured PPP detection interval is less than 40s, run the ppp keepalive adjustment system-state command so that the PPP detection interval is adjusted to a value twice the configured interval.\nWhen inter-board Eth-Trunk member interfaces alternate between Up and Down, the device may not have a master processing board for a moment, causing user logouts. To clear the number of user detection failures after the board on which a trunk member interface resides becomes a master processing board so that users will stay online, run the ppp keepalive adjustment retransmit command. This function helps adjust the number of PPP detection times.\nConfiguration Impact\nAfter the ppp keepalive adjustment retransmit command is run, if inter-board trunk member interfaces alternate between Up and Down, the number of user detection failures may be slightly greater than the configured ppp keepalive.\nIf the ppp keepalive adjustment command is run more than once in the same view, the latest configuration overrides the previous one.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}