{
    "PageTitle": "pppoe-server max-sessions",
    "FuncDef": "The pppoe-server max-sessions command configures the maximum number of users that are allowed to access a network through the interface board.\nThe undo pppoe-server max-sessions command restores the default maximum number of users that are allowed to access a network through the interface board.\nBy default, the maximum number of users allowed to access an LPU50/LPU120, an LPU240/LPU480, and any other board is 65534, 131072, and 65534, respectively.",
    "CLIs": [
        "pppoe-server <slot-number> max-sessions <session-number>",
        "undo pppoe-server <slot-number> max-sessions"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "slot-number",
            "Info": "Specifies the number of the slot where the interface board resides.\nThe value is a string of 1 to 49 case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "session-number",
            "Info": "Specifies the maximum number of uses, each of which uses a session.\nThe value is an integer that ranges from 0 to 131072 for LPU240/LPU480 board, from 0 to 65534 for other boards."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] pppoe-server 1 max-sessions 5000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn intra-board Eth-Trunk scenarios, to limit the number of users allowed to go online through a board, run the pppoe-server max-sessions command.When a board is used for BRAS user information backup,the maximum number of users allowed to go online through the board is counted as follows:- The maximum allowable number of users specified by max-sessions covers the number of users going online through the board and the number of users backed up from other devices.- If the number of users going online through a board has reached the value specified by max-sessions , subsequent users cannot go online through this board. However, user information can still be backed up to this board.\nConfiguration Impact\nIf the configured maximum allowable number of users is less than the number of online users on the board, the online users are not affected, but no subsequent users can go online through this board. If an online user goes offline and the number of online users is still greater than the configured maximum allowable number of users, the user cannot go online again.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nThe pppoe-server slotid max-sessions maxsessnum command does not take effect in inter-board Eth-Trunk scenarios."
}