{
    "PageTitle": "pppoe-server send",
    "FuncDef": "The pppoe-server send command specifies when PADM or PADN packets are sent.\nThe undo pppoe-server send command restores the default configuration.\nBy default, PADM and PADN packets are not sent to PPPoE IPv6 terminals; PADM and PADN packets are sent to PPPoE dual-stack terminals only after IPCP negotiation is complete.",
    "CLIs": [
        "pppoe-server send padm [ ipcp | ip6cp | { first | last | all } ncp ]",
        "pppoe-server send padn [ ipcp | ip6cp | { first | last | all } ncp ]",
        "undo pppoe-server send padm [ ipcp | ip6cp | { first | last | all } ncp ]",
        "undo pppoe-server send padn [ ipcp | ip6cp | { first | last | all } ncp ]"
    ],
    "ParentView": [
        "Virtual template view"
    ],
    "ParaDef": [
        {
            "Parameters": "ipcp",
            "Info": "Indicates that PADM or PADN packets are sent after IPCP negotiation is complete.\n-"
        },
        {
            "Parameters": "ip6cp",
            "Info": "Indicates that PADM or PADN packets are sent after IPv6CP negotiation is complete.\n-"
        },
        {
            "Parameters": "first",
            "Info": "Indicates that PADM or PADN packets are sent after the first NCP negotiation is complete.\n-"
        },
        {
            "Parameters": "last",
            "Info": "Indicates that PADM or PADN packets are sent after the last NCP negotiation is complete.\n-"
        },
        {
            "Parameters": "all",
            "Info": "Indicates that PADM or PADN packets are sent after all NCP negotiations are complete.\n-"
        },
        {
            "Parameters": "ncp",
            "Info": "Indicates that PADM or PADN packets are sent after the NCP negotiation is complete.\n-"
        },
        {
            "Parameters": "padn",
            "Info": "PADN packet.\n-"
        },
        {
            "Parameters": "padm",
            "Info": "PADM packet.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] interface virtual-template 10",
            "[*HUAWEI-Virtual-Template10] pppoe-server send padm all ncp"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nAs the PPPoE protocol does not specify when PADM or PADN packets are received, if PADM or PADN packets are sent at a time different from that when PADM or PADN packets are received on a terminal, the terminal will discard the packets. To allow the device to send PADM or PADN packets at the same time when a terminal of a different vendor receives PADM or PADN packets, run the pppoe-server send command.\nConfiguration Impact\nIf PADM or PADN packets are sent at a time different from that when PADM or PADN packets are received on a terminal, the terminal will discard the packets.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}