{
    "PageTitle": "pppoe-server max-sessions remote-mac",
    "FuncDef": "The pppoe-server max-sessions remote-mac command configures the maximum number of users that are allowed to access a network from a MAC address.\nThe undo pppoe-server max-sessions remote-mac command restores the maximum number of users that are allowed to access a network from a MAC address to 1.\nBy default, the maximum number of users that are allowed to access a network from a MAC address is 1.",
    "CLIs": [
        "pppoe-server max-sessions remote-mac <session-number> with-check-location",
        "pppoe-server max-sessions remote-mac <session-number>",
        "undo pppoe-server max-sessions remote-mac [ with-check-location ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "session-number",
            "Info": "Specifies the number of sessions.\nThe value is an integer that ranges from 1 to 16384."
        },
        {
            "Parameters": "with-check-location",
            "Info": "After the with-check-location is configured, users with the same location information are not allowed to go online.When a new user goes online at the same location, the old user is forced to go offline.\n-"
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] pppoe-server max-sessions remote-mac 100"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nIn the case that multiple users need to use the same MAC address to access a network. you can use the pppoe-server max-sessions remote-mac command to configure the maximum number of users that are allowed to access a network from a MAC address.\nAfter the maximum number of access users is set to more than 1 using the pppoe-server max-sessions remote-mac command and option105 is not specified in the ppp connection chasten command, restriction on the number of connection requests from a PPP user based on MAC addresses does not take effect. To allow it to take effect, configure multi-sessions-permac. If option105 is specified in the ppp connection chasten command, restriction on the number of connection requests from a PPP user based on the Option 105 information takes effect.\nAfter the keyword with-check-location is configured, multiple users with the same location information cannot go online concurrently. Users who go online later will log out the users who have gone online already. If multiple users have the same interface and VLAN information, they have the same location information.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nThe pppoe-server max-sessions remote-mac command, ipv6-pool address-assign-mode eui-64 command, and dhcpv6-server destination command cannot be configured at the same time.\nThe session-number parameter in this command applies to all boards. That is, this parameter specifies the number of users that can go online with the same MAC address on each board."
}