{
    "PageTitle": "pppoe-server rui remote-mac session-id",
    "FuncDef": "The pppoe-server rui remote-mac session-id command configures a range of session IDs that can be assigned to a single MAC address for login in RUI scenarios where one MAC address maps to multiple sessions.\nThe undo pppoe-server rui remote-mac session-id command cancels the configuration.\nBy default, the range of session IDs that can be assigned to a single MAC address for login in RUI scenarios where one MAC address maps to multiple sessions is 1 to 65534.",
    "CLIs": [
        "pppoe-server rui remote-mac session-id start-session-id <start-session-id> end-session-id <end-session-id>",
        "undo pppoe-server rui remote-mac session-id [ start-session-id <start-session-id> end-session-id <end-session-id> ]"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "start-session-id start-session-id",
            "Info": "Specifies the start session ID.\nThe value is an integer ranging from 1 to 65534. You are advised to set this parameter to 1 for the master device and 32768 for the backup device."
        },
        {
            "Parameters": "end-session-id end-session-id",
            "Info": "Specifies the end session ID.\nThe value is an integer ranging from 1 to 65534. You are advised to set this parameter to 32767 for the master device and 65534 for the backup device."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] pppoe-server rui remote-mac session-id start-session-id 1000 end-session-id 20000"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nTo prevent session ID conflicts during user entry backup on the master and backup devices, run the pppoe-server rui remote-mac command to configure a range of session IDs that can be assigned to a single MAC address for login in RUI scenarios where one MAC address maps to multiple sessions.\nPrecautions\nIn VS mode, this command is supported only by the admin VS.\nThe pppoe-server rui remote-mac command applies only to RUI scenarios where one MAC address maps to multiple sessions to prevent user entry conflicts on the master and backup devices. This command does not need to be configured in non-RUI scenarios.In scenarios where one MAC address maps to one session, configuring the pppoe-server rui remote-mac will not affect the maximum number of users allowed to go online from a board.In scenarios where one MAC address maps to multiple sessions, the maximum number of sessions that can be assigned to a MAC address is determined by either configured using the pppoe-server max-sessions remote-mac command or the number of session IDs configured using the pppoe-server rui remote-mac command, whichever is smaller.Session ranges configured on the master and backup devices cannot overlap. Properly configure session ranges on the master and backup devices in accordance with the maximum number of sessions supported."
}