{
    "PageTitle": "reset ppp chasten-user",
    "FuncDef": "The reset ppp chasten-user command clears statistics on frozen users.",
    "CLIs": [
        "reset ppp [ slot <slot-number> ] chasten-user [ mac-address <mac-address> ]",
        "reset ppp [ slot <slot-number> ] chasten-user option105 circuit-id <circuit-id> [ remote-id <remote-id> ]",
        "reset ppp [ slot <slot-number> ] chasten-user option105 remote-id <remote-id>"
    ],
    "ParentView": [
        "System view"
    ],
    "ParaDef": [
        {
            "Parameters": "slot slot-number",
            "Info": "Clears statistics on frozen users on the board in a specified slot.\n-"
        },
        {
            "Parameters": "mac-address mac-address",
            "Info": "Clears statistics on frozen users with a specified MAC address.\nThe value is in the format of H-H-H. Each H is a 4-digit hexadecimal number, such as 00e0 or fc01. If an H contains less than four digits, 0s are added ahead. For example, e0 is equal to 00e0."
        },
        {
            "Parameters": "option105",
            "Info": "Clears statistics on frozen users with a specified Option 105 field.\n-"
        },
        {
            "Parameters": "circuit-id circuit-id",
            "Info": "Clears  information about the users with a specified circuit-id information in option105 fields. The method of matching the circuit-id information is fuzzy match and case sensitive.\nThe value is a string of 1 to 200  case-sensitive characters, spaces not supported."
        },
        {
            "Parameters": "remote-id remote-id",
            "Info": "Clears  information about the users with a specified remote-id information in option105 fields. The method of matching the circuit-id information is fuzzy match and case sensitive.\nThe value is a string of 1 to 200  case-sensitive characters, spaces not supported."
        }
    ],
    "Examples": [
        [
            "<HUAWEI> system-view",
            "[~HUAWEI] reset ppp chasten-user"
        ]
    ],
    "ExtraInfo": "Usage Scenario\nBefore collecting statistics on frozen users over a specified period, run the reset ppp chasten-user command to clear the existing statistics. Then the display ppp chasten-user command can display accurate statistics on frozen users.\nPrecautions\nIn VS mode, this command is supported only by the admin VS."
}