{
    "PageTitle": "epipe",
    "FuncDef": "This command configures an Epipe service instance. This command is used to configure a point-to-point epipe service. An Epipe connects two endpoints defined as Service Access Points (SAPs). Both SAPs may be defined in one or they may be defined in separate devices connected over the service provider network. When the endpoint SAPs are separated by the service provider network, the far end SAP is generalized into a Service Distribution Point (SDP). This SDP describes a destination and the encapsulation method used to reach it. In addition to the SDPs, endpoint SAPs can also be connected by EVPN destinations.",
    "CLIs": [
        "epipe <service-id> customer <customer-id> [ vpn <vpn-id> ] [ vc-switching ] [ create ]",
        "epipe <service-id> [ test ] [ create ]",
        "no epipe <service-id>"
    ],
    "ParentView": [
        "config>service"
    ],
    "ParaDef": [
        {
            "Parameters": "service-id",
            "Info": "The unique service identification number or string identifying the service in the service domain. This ID must be unique to this service and may not be used for any other service of any type. The service-id must be the same number used for every node on which this service is defined. Values-service-id: 1 to 2147483648."
        },
        {
            "Parameters": "customer customer-id",
            "Info": "Specifies the customer ID number to be associated with the service. This parameter is required on service creation and optional for service editing or deleting. Values-1 to 2147483647."
        },
        {
            "Parameters": "vpn vpn-id",
            "Info": "Specifies the VPN ID number which allows you to identify virtual private networks (VPNs) by a VPN ID. If this parameter is not specified, the VPN ID uses the same service ID number. Values-1 to 2147483647. ParamDefault: Default- null (0)"
        },
        {
            "Parameters": "vc-switching",
            "Info": "Specifies if the pseudowire switching signaling is used for the spoke-SDPs configured in this service. When an Epipe is configured with vc-switching, no bgp-evpn is allowed."
        },
        {
            "Parameters": "test",
            "Info": "Specifies a unique test service type for the service context which will contain only a SAP configuration. The test service can be used to test the throughput and performance of a path for MPLS-TP PWs. This parameter applies to the 7450 ESS and 7750 SR only."
        },
        {
            "Parameters": "create",
            "Info": "Keyword used to create the service instance. The create keyword requirement can be enabled/disabled in the environment>create context."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}