{
    "PageTitle": "fdb",
    "FuncDef": "This command clears the FDB entries for the service.",
    "CLIs": [
        "fdb { all | mac <ieee-address> | sap <sap-id> | mesh-sdp <sdp-id> [ <:vc-id> ] | spoke-sdp <sdp-id> [ <:vc-id> ] | <vxlan-instance> <1> <...> <2> [ vtep <ip-address> ] }"
    ],
    "ParentView": [
        "clear>service>id"
    ],
    "ParaDef": [
        {
            "Parameters": "all",
            "Info": "Clears all FDB entries."
        },
        {
            "Parameters": "ieee-address",
            "Info": "Clears only FDB entries in the FDB table with the specified 48-bitaddress. The MAC address can be expressed in the form aa:bb:cc:dd:ee:ff or aa-bbcc-dd-ee-ff where aa, bb, cc, dd, ee and ff are hexadecimal numbers."
        },
        {
            "Parameters": "sap-id",
            "Info": "Clears the physical port identifier portion of the SAP definition."
        },
        {
            "Parameters": "mesh-sdp",
            "Info": "Clears only the service FDB entries associated with the specified mesh SDP ID. For a mesh SDP, the VC ID is optional."
        },
        {
            "Parameters": "spoke-sdp",
            "Info": "Clears only the service FDB entries associated with the specified spoke-SDP ID. For a spoke-SDP, the VC ID must be specified."
        },
        {
            "Parameters": "sap-id",
            "Info": "Specifies the SDP ID for which the associated FDB entries will be cleared."
        },
        {
            "Parameters": "vc-id",
            "Info": "Specifies the virtual circuit ID on the SDP ID for which the associated FDBentries will be cleared. Values-sdp-id[:vc-id] sdp-id: 1 to 17407."
        },
        {
            "Parameters": "vxlan-instance",
            "Info": "Clears only the service FDB entries associated with the specified static VXLAN instance. The instance ID, 1 or 2 must be specified."
        },
        {
            "Parameters": "vtep ip-address",
            "Info": "Specifies, optionally and along with the VXLAN instance, a specific configured static egress VTEP to clear the FDB entries associated only with the VTEP."
        }
    ],
    "Examples": null,
    "ExtraInfo": ""
}